{
  "ticker": "000660.KS",
  "last_updated": "2026-02-04T15:55:59.304Z",
  "total_transcripts": 4,
  "transcripts": [
    {
      "ticker": "000660.KS",
      "title": "SK hynix (000660.KS) Q4 FY2025 earnings call transcript",
      "published_date": "Jan 29, 2026, 9:00 AM GMT+9",
      "fiscal_year": "2025",
      "quarter": "Q4",
      "url": "https://finance.yahoo.com/quote/000660.KS/earnings/000660.KS-Q4-2025-earnings_call-397711.html",
      "content": "**Speaker 3** (Translator)\nGood morning, afternoon, and evening. This is Park Seong-hwan, Head of IR at SK hynix. Welcome to the SK hynix 2025 Q4 earnings release conference call. Today, we are joined by President of Corporate Center, Song Hyun-jong, Chief Financial Officer, Kim Woo-hyun, Head of DRAM Marketing, Park Jun-deok, Head of NAND Marketing, Song Chang-seok, and Head of HBM Sales and Marketing, Kim Ki-tae. Let me issue a disclaimer that all forward-looking statements presented by the company are subject to change, depending on the macroeconomic and market circumstances. With that, we will now begin SK hynix earnings release conference call for fourth quarter of 2025. Song Hyun-jong, President of Corporate Center, will first present the earnings, followed by the company's future plans and market outlook, and a Q&A session with the attending executives.\n\n**Speaker 3** (Translator)\nGood morning, everyone. This is Song Hyun-jong, President of Corporate Center.\n\n**Speaker 3** (Translator)\nAllow me to first introduce the company's performance for the fourth quarter of 2025. During the fourth quarter, strong demand for memory products continued, driven by intensifying global investment in AI infrastructure. Demand increased significantly, not only for HBM, but also for conventional server memory. The pace of industry supply growth could not keep up with demand, leading to broad-based price increases and the formation of a highly favorable market environment. As prices for both DRAM and NAND rose sharply and NAND bit shipments increased, fourth quarter revenue reached KRW 32.8 trillion, up 34% QOQ and 66% YOY, thereby achieving the highest quarterly revenue. DRAM shipments grew by low single-digit %, driven by increased sales of HBM3E 12-Hi products and DDR5 for servers.\n\n**Speaker 3** (Translator)\nShipments of high-density DDR5 modules increased by approximately 50% quarter-over-quarter, leading demand growth centered on AI and HPC. ASP rose 20% quarter-over-quarter, reflecting a significant increase in conventional DRAM prices. For NAND, with the base effect from lower shipments in the previous quarter, demand growth in mobile products and eSSD led to approximately 10% increase in shipments quarter-over-quarter, exceeding guidance. ASP also increased below 30% quarter-over-quarter as price increases accelerated. Driven by substantial price increases, profitability improved for both DRAM and NAND. As a result, fourth quarter operating profit reached KRW 19.2 trillion, up 68% quarter-over-quarter and 137% year-over-year, marking a record high quarterly operating profit with the operating margin of 58%. Depreciation and amortization for Q4 was KRW 3.6 trillion.\n\n**Speaker 3** (Translator)\nEBITDA amounted to KRW 22.7 trillion, with an EBITDA margin of 69%. Net non-operating loss reached KRW 1.5 trillion, including KRW 6.6 trillion in valuation gains on investment assets and KRW 8.4 trillion in loss on derivatives related to exchange rights on exchangeable bonds. Pre-tax income amounted to KRW 17.7 trillion. Net profit totaled KRW 15.2 trillion, and net profit margin was 46%. Now, moving on to the annual performance for 2025. The year 2025 marked a fundamental shift in the structure of memory demand, driven by the broad adoption of AI. The memory market has moved beyond increasing content, with growing demand for a multidimensional performance that simultaneously meets requirements for speed, efficiency, and reliability. The bar for product competitiveness has been raised significantly.\n\n**Speaker 3** (Translator)\nThe company proactively strengthened its technological competitiveness with a focus on AI memory, while expanding the share of high-value added products in the portfolio, successfully securing both profitability and growth. As a result, full year 2025 revenue reached KRW 97.1 trillion, and operating profit totaled KRW 47.2 trillion, representing YOY growth of 47% and 101%, respectively. These achievements are not merely the result of short-term favorable market conditions, but rather the outcome of our strategic execution aligned with an increasingly AI-focused demand environment. The year 2025 is also a milestone year in which the company once again demonstrated its world-class technological leadership.\n\n**Speaker 3** (Translator)\nIn DRAM, following world's first sample shipments of HBM4 to major customers in March last year, we were also the first in the world to secure mass production readiness in September, further solidifying our technology leadership in the AI memory market. HBM revenue more than doubled year-over-year, driven by a significant increase in HBM3E 12-Hi sales and contributed to record high annual DRAM revenue and operating profit. In conventional DRAM, we commenced full-scale mass production of 1c-nanometer DDR5, which delivers industry-leading performance and cost competitiveness. Through the development of the industry's highest density, 256-gigabyte DDR5 RDIMM, based on 1b-nanometer 32-gigabit die, we have further demonstrated our leadership in server modules. In NAND, despite a challenging demand environment, we continued to strengthen our technology leadership, including the successful development of 321-layer QLC products in the first half of last year.\n\n**Speaker 3** (Translator)\nIn particular, by responding proactively to the recovery in enterprise SSD demand in the second half, we achieved record high annual NAND revenue. Cash and cash equivalents amounted to KRW 34.9 trillion at the end of 2025, an increase of KRW 20.8 trillion from the end of 2024, while borrowings decreased by KRW 0.4 trillion to reach KRW 22.2 trillion. The debt ratio declined significantly to 18%, and the company transitioned to a net cash position, resulting in a substantial improvement in our financial structure. Now let me share our market outlook. AI models are rapidly transitioning to an inference-centric base, in which large volumes of user requests are processed in real-world service environments. Computing workloads are shifting from architectures with a focus on high-performance servers toward more distributed architectures.\n\n**Speaker 3** (Translator)\nThe core of system design is no longer limited to compute performance alone, but thinking increasingly focuses on end-to-end system efficiency, including data movement and storage. Accordingly, demand is expected to continue expanding not only for high-performance memory, but also across server DRAM and NAND. In particular, server SSD shipments are expected to grow by high teens % range in 2026, with solid growth anticipated over the mid- to long-term. A key driver of this growth is not only AI servers, but also the specification upgrades of general purpose servers. To support AI workloads, requirements for memory density and bandwidth in general purpose servers are rapidly increasing. As a result, demand for server DRAM and enterprise SSDs is expected to grow structurally at a pace well above the overall market growth.\n\n**Speaker 3** (Translator)\nPCs and mobile devices are expected to see short-term shipment adjustments due to rising component costs and weakened consumer sentiment. Memory content per device is expected to grow at a slower pace due to price increases and supply constraints. Memory demand for PCs and mobile applications is expected to grow at a slower pace than the overall market. Reflecting such market conditions, despite the explosive increase in memory demand driven by the server market, demand growth for DRAM and NAND in 2026 is expected to remain at over 20% and high teens %, respectively. Next, I will discuss the company's plans. Despite first quarter generally being a weak season, customer demand remains strong.\n\n**Speaker 3** (Translator)\nHowever, given constrained supply conditions, we plan to maintain DRAM shipments at similar level to that of last quarter, while NAND shipments are expected to decline somewhat due to the base effect of the previous quarter. As demand continues to surge, both AI and conventional memory, the industry is accelerated capacity additions and tech migrations to advanced process nodes. However, considering physical limitations in production space and the ongoing tech migration, we expect tight supply-demand conditions to persist for the time being. We are capable of supplying both HBM3E and HBM4 in a reliable manner, and through our technological leadership, proven quality, and mass production capabilities, we have earned strong customer trust.\n\n**Speaker 3** (Translator)\nAs a result, we have consistently collaborated with our customers to introduce new products in a timely manner, and HBM4 is progressing under the same collaborative framework in line with the schedule agreed with our customers. After securing mass production readiness in September last year, we are currently in mass production of the volume requested by customers. Looking beyond HBM4, competition is expected to evolve beyond simple stacking toward custom HBM. We are actively engaging in custom HBM technology discussions with key customers, and through one team collaboration with our partner companies, we are progressing seamlessly to ensure optimal product supply. For conventional DRAM, we plan to increase the production of high-value-added products while accelerating tech migration to the 1c nanometer process. We plan to expand our AI memory product portfolio, including CXL 2.0 and GDDR7.\n\n**Speaker 3** (Translator)\nFor NAND, we will maximize product competitiveness through the transition to 321-layer technology. In particular, through the development of next-generation 245-terabyte products, we aim to secure a leadership position in the ultra-high-density storage market, driven by the expansion of AI inference workloads. We plan to maximize production within feasible limits to meet customer demand. This year, we will ramp up M15X capacity earlier than planned, while accelerating tech migration to 1c-nanometer DRAM and 321-layer NAND. Over the mid- to long-term, we aim to rapidly expand our production base in Yongin Phase 1 Fab, while also proceeding without delay in the preparation of Cheongju M17 and the advanced packaging facility in Indiana. We will strengthen our globally integrated manufacturing capabilities, enabling flexible responses to changes in customer demand.\n\n**Speaker 3** (Translator)\nIn 2026, CapEx is expected to increase considerably from that of last year, reflecting the expansion of production capacity and infrastructure. We will continue to adhere to our CapEx discipline based on a comprehensive assessment of demand visibility and investment efficiency. Ultimately, we aim to go beyond being a simple product supplier and further strengthen our role as a full-stack AI memory creator that enables customers' AI performance requirements from a system-level perspective. By integrating our capabilities in the high-performance memory with process technology, packaging, and solutions capabilities, we will maximize customers' computing efficiency and generate sustainable earnings growth. Finally, let me explain shareholder returns for 2025. The company introduced a new shareholder return policy applicable from 2025, under which securing financial soundness was identified as our top priority.\n\n**Speaker 3** (Translator)\nOur objective was to transition to a net cash position and to maintain an appropriate level of cash reserves. We also stated that should meaningful free cash flow be generated, we would consider shareholder returns even before the expiration of the policy period. Based on the financial flexibility secured in 2025, the BOD has resolved an additional shareholder return package in response to our shareholders' continued trust and support. First, in addition to the fixed dividend, we will pay an additional cash dividend of KRW 1,500 per share. Accordingly, the year-end dividend per share will be KRW 1,875. As a result, the total cash dividend per share for fiscal year 2025 will amount to KRW 3,000, and the total dividend payout will be approximately KRW 2.1 trillion.\n\n**Speaker 3** (Translator)\nSecond, excluding the portion of treasury shares reserved for employee compensation, the company plans to retire all remaining 50 million treasury shares, equivalent to 2.1% of total shares outstanding. Based on the closing share price of the day prior to the board meeting, this treasury share retirement represents a value of approximately KRW 12.2 trillion. This action is intended to enhance per share value and demonstrate the company's long-term commitment to shareholder value creation. The company remains committed to a disciplined capital allocation framework that seeks to maintain an optimal balance among future growth investments, financial stability, and shareholder returns. We will continue to make efforts to enhance shareholder value. Going forward, we will close-\n\n**Speaker 2** (Company Representative)\nNow Q&A session will begin. Please press star one, that is star and one, if you have any questions. Questions will be taken according to the order you have pressed the number star one. For cancellation, please press star two, that is star and two on your phone. The first question will be provided by Peter Lee from Citigroup. Please go ahead with your question.\n\n**Speaker 1** (Analyst)\nThank you very much. First of all, congratulations on the record high performance for the company. Now, my questions are pertaining to the HBM4. So recently, especially last month, there has been some noise about SK hynix's progress on HBM4. So, can the company share your current status of the HBM4 development and the expected timing for mass production? And also, what are the plans to maintain HBM performance and mass production competitiveness?\n\n**Speaker 3** (Translator)\nThank you very much for your questions. Now, SK hynix has been a leading pioneer in the HBM market since HBM2E, working together as one team with customers and infrastructure partners. It is not only about superior technology. Our mass production experience and customer trust in our quality, built up over time, are not something that can be overtaken in a short period of time. Likewise, for HBM4, customers and infrastructure partners show strong preference and expectations for our products, prioritizing our products over others. We aim to extend this to HBM4 to take up overwhelming market share, just as we did with HBM3 and HBM3E. As mentioned in the presentation, preparations for HBM4 are underway as planned, according to the timeline agreed with customers, and we are currently mass producing volumes requested by customers. SK hynix's HBM4 in-\n\n**Speaker 2** (Company Representative)\nSK hynix's HBM4 represents a major technical achievement that will enable customers' requirements based on existing 1b nanometer process. Using our proprietary packaging technology, advanced MR-MUF, we plan to secure yield comparable to the 12-high HBM3E products. Even as we maximize production, we cannot meet HBM demand 100%, so some competition is expected to enter the market. Such developments notwithstanding, our market leadership and leading supplier position will continue based on performance, producibility, and quality.\n\n**Operator**\nThank you. Next question, please. The following question will be presented by Hyung Kyun Ryu from Daishin Securities. Please go ahead with your question.\n\n**Speaker 1** (Analyst)\n[Foreign Language]\n\n**Speaker 3** (Translator)\nThank you. Congratulations on the performance, and also thank you very much for taking my question, which is about the LTA. So now, with the growth, continued growth of the market, there are talks of LTAs being reached. So can the company share an update about the LTAs that are underway for the year 2026? And how are the LTAs different from past LTAs? Thank you. Please understand that I cannot divulge details about LTAs currently under discussion with our customers. But to your question on how the long-term supply agreements or LTAs are different today, now, as you know, LTAs already existed, but they were generally loose contracts on volumes and tended to be quite fluid, depending on market conditions.\n\n**Speaker 3** (Translator)\nThe LTAs being discussed today are expected to reflect strong mutual commitments between customers and suppliers, not simply indicating the intent to buy, because memory production today requires cutting-edge technology and far bigger investment, compelling suppliers to seek high visibility into demand. This is also why customers now prefer multi-year contracts, but capacity constraints make it difficult to accommodate all customer requests. Bearing this in mind, SK hynix will keep exploring ways to enhance both our customers and our own long-term operational stability.\n\n**Operator**\nThank you. We will take the next question. The following question will be presented by Dong Hee Han from SK Securities. Please go ahead with your question.\n\n**Speaker 3** (Translator)\nThank you for taking my question. Now, regarding the unprecedented surge in memory demand, some suggest that it could be driven by pull-in demand to secure inventory, but most see this as growth in real demand due to tight customer inventory.... So what is the customer's inventory level in key applications as seen by the company, and what is the company's own inventory status? Thank you. Now, as you would know, memory market today is experiencing explosive demand growth, along with continued expansion in AI infrastructure investment. But supply cannot keep pace with demand, resulting in a severe supply-demand imbalance. Most customers are struggling to secure memory volumes and are persistently demanding increased supply. So it appears that customer inventory levels are, have decreased overall. Server customers, in particular, as soon as they secure volume, move on to building sets, which apparently keeps driving down inventory.\n\n**Speaker 3** (Translator)\nCustomers can hardly secure enough volume to build up inventory, and set builds use up memory fast. With memory being seen as the bottleneck in data center infrastructure expansion, server customers are expected to keep trying to increase purchase to secure their volume. At the same time, PC and mobile customers are also experiencing supply constraints, as well as the direct and indirect impact from the strong server-side demand, and their inventories also continue to decline. For the company, even as we strive to increase production, DRAM inventory decreased in Q4 QOQ. The tight inventory trend, particularly for server DRAM, is expected to continue throughout the year. With memory selling out as soon as it is produced, our inventory is projected to decline even further in the second half of the year. And now about NAND. NAND inventory is also observed to be falling rapidly among server customers.\n\n**Speaker 3** (Translator)\nThis trend of falling inventory is expected to continue, particularly for enterprise SSD products. The company's inventory level is also declining rapidly, with NAND inventory weeks at the end of last year, nearly matching that of DRAM.\n\n**Speaker 3** (Translator)\nNext question, please.\n\n**Operator**\nThe following question will be presented by Simon Woo from Bank of America. Please go ahead with your question.\n\n**Speaker 3** (Translator)\nThank you for taking my question, and also congratulations on the record high performance. Now, my question is pertaining to the company's plan on managing the tight capacity by customer or product. This is because while the sharp rise in memory prices coming from tightening supply-demand positively affects the company's performance, SK hynix's customers may be struggling to secure enough volume to sustain their operations. The question is, how the company plans to manage its both existing and newly acquired capacity? It is true that the AI industry's explosive growth has brought unprecedented changes to the memory market as well. In particular, it has deepened the supply-demand imbalance, because while demand for AI memory has surged, ramping up supply takes time.\n\n**Speaker 3** (Translator)\nAt a time like this, we believe it is important to prioritize meeting customer needs and building trust in the market, not focusing solely on short-term results. And that is why, although the space is limited, we are working to maximize production to accommodate the rapidly increasing demand. To meet the HBM demand, we are adding new capacity for 1b nanometer at M15X, which was completed last year, while enhancing productivity through yield improvement. Not only that, to address demand for conventional DRAM and NAND, we are accelerating tech migration to 1c nanometer and 321-layer. As a memory leader, SK hynix remains committed to creating a sustainable semiconductor ecosystem where we grow together with our customers. Thank you, and next question, please.\n\n**Operator**\nThe following question will be presented by Sunwoo Kim from Meritz Securities. Please go ahead with your question.\n\n**Speaker 3** (Translator)\nThe company's performance is also expected to improve significantly this year as well. So then my questions are twofold. Are there any plans to continue with the extra dividends and share cancellations going forward? And the second question is, the company also recently canceled the treasury shares. Then, in order to further enhance the shareholder value, are there plans to issue ADRs? And if yes, then through what approach? Thank you for the question. Now, as explained last quarter, the company's goal in trying to achieve financial soundness is maintaining an adequate level of cash reserve that enables stable business operations, even during industry fluctuations, and that also allows necessary CapEx to sustain competitiveness. Market conditions today point to continuing increase in the CapEx required to meet demand.\n\n**Speaker 3** (Translator)\nGiven the memory market's growth potential and high investment returns, our belief remains unchanged, that reinvesting available funds into our business to enhance corporate value will be the best use of cash.\n\n**Speaker 2** (Company Representative)\n[Foreign Language]\n\n**Speaker 3** (Translator)\nHaving said that, our financial soundness improved faster than expected at the time when we announced the current shareholder return policy following last year's record performance. As the questioner rightly mentioned, performance improvement is likely to continue this year.\n\n**Speaker 2** (Company Representative)\n[Foreign Language]\n\n**Speaker 3** (Translator)\nSo leveraging the financial room secured last year, we are implementing additional shareholder return to show our appreciation for their support and to enhance shareholder value. And we plan to continue reviewing additional shareholder return measures and timing based on performance and cash flow at the time.\n\n**Speaker 2** (Company Representative)\n[Foreign Language] Each method of shareholder return, be it dividend payout or share buyback, has different characteristics. While we maintain the current shareholder return policy, we will ensure flexibility in its administration to seek the best option at the given time that can meet market expectations.\n\n**Speaker 2** (Company Representative)\n[Foreign Language] Meanwhile, as mentioned in yesterday's inquired disclosure, we are looking into various options to enhance corporate value. Nothing has been finalized to this date, and we plan to make careful decisions, comprehensively considering internal and external conditions.\n\n**Speaker 2** (Company Representative)\n[Foreign Language] Thank you, and we will take the next question.\n\n**Operator**\nwill ask a question is SK Kim from Daiwa Securities.\n\n**Operator**\nThe following question will be presented by SK Kim from Daiwa Securities. Please go ahead with your question.\n\n**Speaker 1** (Analyst)\n[Foreign Language]\n\n**Speaker 3** (Translator)\nThank you for taking my question, and my question is pertaining to the NAND Flash. So we see that the AI storage market continues to grow. So what is the company's outlook on the AI storage market down the road? And also, in the same context, what is the company's plan for response to this demand in the NAND storage?\n\n**Speaker 2** (Company Representative)\n[Foreign Language] Thank you for your question. NAND today is changing completely, not only a data store, but becoming a storage solution that directly supports AI computation workflows.\n\n**Speaker 2** (Company Representative)\n[Foreign Language] As AI inference keeps advancing, GPU and CPU memory alone cannot satisfy all requirements, so the key-value cache offloading has become essential to ensure smooth inference services.\n\n**Speaker 2** (Company Representative)\n[Foreign Language] As AI's data utilization becomes more precise and fast, it is driving a structural surge in demand for high performance, high capacity enterprise SSDs that can support high-speed data and IO. What we are particularly interested in are the fundamental changes at the AI server architecture itself as a result of this.\n\n**Speaker 2** (Company Representative)\n[Foreign Language]\n\n**Speaker 3** (Translator)\nSo as I briefly explained earlier, whereas the SSD was a peripheral under the CPU centric architecture, in the recent context, memory environment and GPU centric IO server architecture, it is increasingly, becoming a central part in the compute pipeline.\n\n**Speaker 2** (Company Representative)\n[Foreign Language]\n\n**Speaker 3** (Translator)\nTo address these changes, we are developing next generation storage products alongside our conventional storage lineup, based on which we intend to strengthen our competitiveness in the enterprise business.\n\n**Speaker 2** (Company Representative)\n[Foreig Language]\n\n**Speaker 3** (Translator)\nWhat we are preparing first is to develop the ultra performance enterprise SSD. Demand is rising for storage with very fast I/O and ultra low latency for real-time inference and GPU based servers. We plan to secure technological leadership in the growing market by preparing for future technology with high ops, high IOPS, SSD.\n\n**Speaker 2** (Company Representative)\n[Foreign Language]\n\n**Speaker 3** (Translator)\nWe will keep responding to the ever-evolving AI server market. We will further develop the HBM4 technology, which is an extension of HBM, and expand our lineup of ultra-high capacity enterprise SSD that enables key value cache and diverse data offloading to meet customer requirements and overcome data center power and space limits.\n\n**Speaker 2** (Company Representative)\n[Foreign Langauge] Thank you. Next question.\n\n**Operator**\nquestion is Kim Rok-ho of Hana Securities.\n\n**Operator**\nThe following question will be presented by Kim Rok-ho from Hana Securities. Please go ahead with your question.\n\n**Speaker 2** (Company Representative)\n[Foreign Language]\n\n**Speaker 3** (Translator)\nThank you for taking my question. Now, with the recent strong, very strong demand for DRAM, especially coming from the server side, there is literally a skyrocketing prices, which is likely to heighten the burden on the customers. So, if the prices continue to rise, then the cost burden on the PC and mobile customers could also grow. So, I... My question is then, are there any requests or demands to adjust the set shipment or the, or to downgrade the content?\n\n**Speaker 2** (Company Representative)\n[Foreign Language] Thank you for the questions. Following the recent sharp rise in memory prices, some volume adjustments have appeared mainly among PC and mobile customers. This appears to be due to the set manufacturers raising the price on finished products to defend their margin, which has temporarily dampened consumers' purchasing power. Some customers are becoming more conservative, revising their shipment plans or reviewing spec adjustments for price-sensitive, lower-tier products.\n\n**Speaker 2** (Company Representative)\n[Foreign Language]\n\n**Speaker 3** (Translator)\nDespite this, expectations for on-device AI are driving replacement demand, especially towards high-end products. As a result of this, it is not likely that the impact from the adjustments in PC or mobile shipment will spill over into a broader demand contraction.\n\n**Speaker 2** (Company Representative)\n[Foreign Language]\n\n**Speaker 3** (Translator)\nNot only that, over the longer term, as AI features keep improving, they will become part of the default spec, not just an option, which means there will be structural increase in memory content per device, and this should partly offset the price-driven content adjustment.\n\n**Speaker 2** (Company Representative)\n[Foreign Language]\n\n**Speaker 3** (Translator)\nIn this market environment, SK hynix will strive to ensure stable supply as much as possible within the limited resources by reflecting customers' product strategies and changes in demand.\n\n**Speaker 2** (Company Representative)\n[Foreign Language]\n\n**Operator**\nThank you. Next question.\n\n**Operator**\nChae Min-sook from Korea Investment & Securities.\n\n**Speaker 3** (Translator)\nThe following question will be presented by Chae Min-sook from Korea Investment & Securities. Please go ahead with your question.\n\n**Speaker 1** (Analyst)\n[Foreign Language]\n\n**Speaker 3** (Translator)\nThank you for taking my question. My question is with regards to the AI Company that has been already disclosed. Now, the head office's CapEx size is also significantly increasing, and at this time, the company is also planning on a large-scale external investment. So what are the benefits or the synergies that the company is looking for in establishing the AI Company?\n\n**Speaker 2** (Company Representative)\n[Foreign Language]\n\n**Speaker 3** (Translator)\nThank you for your questions. As AI technology continues to advance, memory emerged as key in AI competition. It's no longer about improving individual chips performance, but there is a full-fledged race to optimize the system efficiency.\n\n**Speaker 2** (Company Representative)\nand leap forward as a partner in the AI data center ecosystem. To this end, we have decided to establish AI Co. for the purpose of proactively responding to the AI business environment and systematically securing future growth momentum.\n\n**Speaker 3** (Translator)\nAs the market continues to change, SK hynix plans to become not only a component provider, but a partner in the AI data center ecosystem. That is part of the reason why we decided to set up an AI Co. as a way to proactively address the AI business environment and secure future growth engines.\n\n**Speaker 2** (Company Representative)\n[Foreign Langauge]\n\n**Speaker 3** (Translator)\nThe AI Co. will be established in the U.S., the center of AI technology and market changes, and it will explore companies with key AI capabilities and discover and follow up on opportunities for commercializing AI solutions.\n\n**Speaker 2** (Company Representative)\n[Foreign Language]\n\n**Speaker 3** (Translator)\nFor your information, the investment commitment in AI Co. is not large relative to our financial performance or cash generation capacity, and the investment will be dispersed sequentially once the investment decision is finalized.\n\n**Speaker 2** (Company Representative)\nmemory creator by strengthening technological competitiveness and business capabilities while actively responding to changes in the global AI market by utilizing the AI Co. based on AI memory competitiveness. Thank you.\n\n**Speaker 3** (Translator)\nBased on our AI memory competitiveness and leveraging the AI Company, SK hynix will actively respond to global AI market changes, strengthen technological and business capabilities, and grow into a full stack AI memory creator.\n\n**Speaker 2** (Company Representative)\n[Foreign Language] Thank you. We'll take the next question.\n\n**Operator**\nRyu Young-ho from NH Investment & Securities.\n\n**Speaker 2** (Company Representative)\nThe following question will be presented by Youngho Ryu from NH Investment & Securities. Please go ahead with your question.\n\n**Speaker 1** (Analyst)\n[Foreign Language]\n\n**Speaker 3** (Translator)\nI would also like to congratulate the company on good performance, and thank you for taking my question, which is on CapEx. So it was mentioned that the 2026 CapEx will increase significantly year-on-year. So by how much exactly? And also, can the company maintain CapEx to revenue around the mid-30% level this year? Thank you.\n\n**Speaker 2** (Company Representative)\n[Foreign Language]\n\n**Speaker 3** (Translator)\nNow, as explained, the CapEx in 2026 is expected to increase significantly over year-over-year due to capacity expansion, accelerated tech migration, and investments in future infrastructure.\n\n**Speaker 2** (Company Representative)\n[Foreign Language]\n\n**Speaker 3** (Translator)\nBut at the same time, we will maintain CapEx discipline by monitoring market conditions and balancing demand visibility with investment efficiency.\n\n**Speaker 2** (Company Representative)\nCapEx, sales are also expected to increase significantly, so it seems there will be no problem in complying with the mid-30% CapEx discipline that our company has presented.\n\n**Speaker 2** (Company Representative)\nThere will be increase in CapEx, but we also expect revenue to grow substantially as well. We do not anticipate any difficulties in maintaining CapEx discipline at the mid-30% range.\n\n**Speaker 2** (Company Representative)\n[Foreign Language] Incidentally, the investment in the AI Company discussed just now is not included in CapEx and therefore does not affect FCF calculation.\n\n**Operator**\n[Foreign Language]\n\n**Speaker 2** (Company Representative)\nThank you. We will take one last question.\n\n**Operator**\n[Foreign Language]\n\n**Speaker 2** (Company Representative)\nThe last question will be presented by Su-rim Lee from DS Investment & Securities. Please go ahead with your question.\n\n**Speaker 1** (Analyst)\n[Foreign Language]\n\n**Speaker 3** (Translator)\nThank you very much for taking my question, which is on tariffs. The U.S. government recently talked of a 100% tariff on semiconductors if the fabs are not built in the U.S. So what is the company's position and plan? And will there be a need for a plan to build additional fabs in the U.S.?\n\n**Speaker 2** (Company Representative)\n[Foreign Language]\n\n**Speaker 3** (Translator)\nThank you for your question. Now, building fabs overseas involves numerous factors to be considered, both factors both inside and outside of the company. So for now, we will monitor the discussions between the governments and communicate the company's direction at a later date.\n\n**Operator**\n[Foreign Language]\n\n**Speaker 3** (Translator)\nThank you very much. With that, we conclude the SK hynix 2025 fourth quarter earnings release conference.",
      "fetched_at": "2026-02-04T15:55:37.287Z"
    },
    {
      "ticker": "000660.KS",
      "title": "SK hynix (000660.KS) Q3 FY2025 earnings call transcript",
      "published_date": "Oct 29, 2025, 10:00 AM GMT+9",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/000660.KS/earnings/000660.KS-Q3-2025-earnings_call-366315.html",
      "content": "**Speaker 0** (Translator 1)\nGood morning, afternoon, and evening. Thank you for joining SK hynix 2025 Q3 earnings release conference call. Following SK hynix presentation, there will be a Q&A session. If you have a question, please press star and one on your phone. Please note that presentations will be interpreted simultaneously and Q&A session consecutively. With that, we are now ready to begin.\n\n**Speaker 0** (Translator 1)\nGood morning, afternoon, and evening. This is Park Seong-Hwan, Head of IR at SK hynix. Welcome to the SK hynix 2025 third quarter earnings release conference call. Allow me to introduce the executives present here with me today. We're joined by Chief Financial Officer Kim Woo-Hyun, Head of DRAM Marketing Kim Kyu-Hyun, Head of NAND Marketing Kim Seok, and Head of HBM Sales and Marketing Kim Ki-tae. Let me issue a disclaimer that all outlooks presented by the company are subject to change depending on the macroeconomic and market circumstances.\n\n**Speaker 0** (Translator 1)\nWith that, we will now begin SK hynix earnings release conference call for third quarter of 2025. CSO Mr. Kim Woo-Hyun will first present the earnings, followed by the company's future plans and market outlook, and a Q&A session with the attending executives. Good morning, everyone. Allow me to first introduce the company's performance for the third quarter of 2025. Earlier in the year, we expected more moderate demand conditions in Q3 due to external uncertainties and impact of some preemptive purchases in the first half. However, we ended up witnessing a highly favorable market environment with a spike in demand for memory products for servers, including HBM, driven by surging AI infrastructure investments by big tech companies. First quarter revenue again recorded record quarterly revenue of KRW 24.4 trillion, up 10% QOQ and 39% YOY.\n\n**Speaker 0** (Translator 1)\nThis was driven by stronger DRAM and NAND pricing, as well as increase in DRAM shipments from rising demand. DRAM's bit shipments exceeded guidance by increasing high single digits sequentially, driven by growing sales of HBM3E 12-high products and server DDR5 to support AI demand, as well as seasonal demand recovery for LPDDR5 products. In particular, shipments of high density DDR5 modules of over 128 gigabytes doubled QoQ for two quarters in a row, clearly demonstrating robust growth in HPC-related DRAM demand. ASP rose by mid single digit QoQ, with strong ASP growth for conventional DRAM products. For NAND, bit shipments decreased by mid single digit QoQ, given high base from the previous quarter, but enterprise SSD shipments grew by double digits amid rising demand from AI servers.\n\n**Speaker 0** (Translator 1)\nASP increased by low 10% compared to previous quarter, supported by NAND price recovery and higher mix of enterprise SSDs with pricing premium. Operating profit reached KRW 11.4 trillion, up 24% QOQ and 62% YOY, also marking an all-time high. Operating margin improved by 5 percentage points QOQ and 7 percentage points YOY to 47%, driven by strong sales of leading-edge products such as HBM, high performance DRAM, and enterprise SSD. This marks the first time in the company's history that quarterly operating profit has exceeded KRW 10 trillion. Depreciation and amortization expenses in Q3 were KRW 3.6 trillion, resulting in EBITDA of KRW 14.9 trillion and an EBITDA margin of 61%.\n\n**Speaker 0** (Translator 1)\nNon-operating income net of expenses was KRW 3.4 trillion, including KRW 0.21 trillion of foreign currency related net gain due to stronger U.S. dollar at the end of the quarter, and KRW 3.3 trillion of valuation gains on investment assets. Pre-tax income was KRW 14.8 trillion, net income was KRW 12.6 trillion, and net profit margin stood at 52%, again reaching record-high level. At the end of Q3, cash and cash equivalents stood at KRW 27.9 trillion, up KRW 10.9 trillion from that of last quarter. Interest-bearing debt that increased by KRW 2.2 trillion to KRW 24.1 trillion, resulting in a net cash position of KRW 3.8 trillion. Accordingly, debt-to-equity ratio improved by 1 percentage point QOQ to 24%. Now, let me share our market outlook.\n\n**Speaker 0** (Translator 1)\nIn 2025, despite ongoing geopolitical and macroeconomic uncertainties such as tariffs, the memory market saw mixed expectations, optimism regarding explosive AI growth alongside concerns about monetization. Recently, however, global investments in AI infrastructure have become the top priority for AI market expansion, driving significant demand growth not only for HBM but for broader memory demand such as DRAM for general purpose servers and enterprise SSDs. The AI market is now shifting rapidly from the training phase of large models to the inference phase where users actively utilize AI services. As AI models evolve into multimodal forms and inference based AI services spread across industries, the number of concurrent users and the need for faster, more accurate responses are rising dramatically, causing an exponential increase in the number of tokens processed.\n\n**Speaker 0** (Translator 1)\nWhile the training stage primarily involved computation on large scale AI servers, the evolution toward inference requires handling vast numbers of tokens with no latency. This is driving efforts to distribute computing workloads across not only AI servers but a variety of infrastructures such as general purpose servers and edge devices. KV cache, or key value cache, which is intermediate computation results generated during inference, grows proportionally with context length. When HBM alone cannot store all of this data, it is offloaded sequentially to conventional DRAM and SSDs. With AI systems processing multiple user requests in parallel, the combination of growing output tokens and longer context windows is exponentially increasing memory usage during inference. As a result, expansion of the AI inference market is driving demand not only for HBM and high performance DDR5, but also for enterprise SSDs, signaling a structural shift in both DRAM and NAND demand.\n\n**Speaker 0** (Translator 1)\nLeading AI companies are now accelerating investments backed by monetization and forming strategic partnerships to support this growth. This trend will lead to further expansion of AI data centers, creating robust demand across a wide range of memory products, from HBM to conventional DRAM and NAND. Meanwhile, the smartphone and PC markets are expected to show moderate growth, reflecting ongoing inflationary and macroeconomic uncertainty. However, as users increasingly experience on-device AI, AI functionality is spreading even to low- and mid-end smartphones, while AI PCs are expected to account for over half of total PC market. Therefore, we expect content growth will continue to drive memory demand for consumer applications. Reflecting such demand environment, DRAM demand growth is expected to rise from high 10% this year to over 20% next year, while NAND device growth is projected to improve from mid 10% this year to high 10% in 2026.\n\n**Speaker 0** (Translator 1)\nNext, I will discuss the company's plans. In the fourth quarter, we plan to continue to expand sales of HBM, server DRAM, and enterprise SSD. However, considering our normalized levels of inventories, we expect DRAM and NAND bit shipments to increase by low-single-digit QoQ for both products. For HBM, we have completed discussions with key customers for next year's HBM supply. Our HBM4, which we have completed development and mass-production preparation in September, not only fully meets customer performance requirements but also supports highest speed in the industry. We will start HBM4 shipments in Q4 this year with further expansion planned for 2026, reinforcing our leadership position in the HBM market. For conventional DRAM, we plan to meet increasing customer demand by securing a full lineup of the most advanced 1C-nanometer-based products across server, mobile, and graphic segments.\n\n**Speaker 0** (Translator 1)\nMass production of 1C-nanometer is already ongoing smoothly, and we plan to accelerate migration in 2026 to maintain our technology and cost leadership. For NAND, where demand recovery has been slower, we are deploying world's highest 321-layer technology on various solution products to be ready when market conditions improve. We will also focus on supporting the growing enterprise SSD demand, all the while continuing to operate with a profitability-focused approach. Furthermore, in line with growing demand opportunities in AI servers, we are investing in tech migration to expand supply of both TLC and QLC products based on the 321-layer platform next year. Meanwhile, we have secured customer demand across all DRAM and NAND products, including HBM, through next year.\n\n**Speaker 0** (Translator 1)\nWhile we are currently doing our utmost to meet customer demand, AI memory demand is significantly exceeding expectations, and this trend is expected to continue for the foreseeable future. To respond swiftly, we have recently opened the cleanroom ahead of schedule at M15X and begun equipment installation to rapidly secure new capacity. For conventional DRAM and NAND, we will accelerate the transition of existing capacity to advanced nodes to ensure robust responsiveness to rising demand. As a result, our Capex in 2026 is expected to increase from this year's level. While continuing to maintain Capex discipline, we will plan our investments in an optimal manner to support market demand. AI technological innovation is heralding fundamental changes across industries and society as a whole.\n\n**Speaker 0** (Translator 1)\nThe memory market is transitioning into a new paradigm with the emergence of HBM, and AI driven demand is now beginning to expand across all product lines. We have led the market from the inflection point of this AI driven industrial transformation, leveraging our HBM competitiveness to deliver differentiated performance. Moving forward, we will further strengthen our technology and product competitiveness and solidify our leadership in the AI memory market by delivering products with the highest quality and performance. With that, we are now ready to take your questions.\n\n**Operator**\n지금부터 질의응답을 시작하겠습니다. 질문을 하실 분은 전화기 버튼의 별표와 1번을 누르시기 바랍니다. 질문을 취소하시려면 별표와 2번을 누르시면 됩니다. Now Q&A session will begin. Please press star one, that is star and one if you have any questions. Questions will be taken according to the order you have pressed the number star one.\n\n**Operator**\nFor cancellation, please press star two, that is star and two on your phone. 처음으로 질문해 주실 분은 메리츠 증권의 김선우 님입니다. The first question will be provided by Seon-woo Kim from Meritz Securities. Please go ahead with your question.\n\n**Operator**\n예, 안녕하세요. 메리츠의 김선우입니다. 질문 기회 주셔서 감사합니다. 2026년도 HBM 공급 협의가 완료됐다라고 이렇게 말씀하셨는데요. 해당 계약과 관련해서 좀 더 구체적인 사항들, 혹시 공유 가능하신 부분 있으시면 부탁 좀 드리겠습니다. 감사합니다. Thank you very much for taking my question. This is Kim Seon-woo. It was mentioned that the HBM supply negotiations for 2026 have been completed. Could you share more details about the contract? Thank you. 질문 주셔서 감사드리고요. 그동안 내년 HBM 공급 계약 관련해서 많은 분들이 관심을 가지고 지켜봐 주신 점 잘 알고 있습니다. 올해는 특히 여러 대외 변수가 많아서 공급 물량뿐 아니라 제품 믹스를 확정 짓는 데 어려움이 많았습니다.\n\n**Operator**\n또한 HBM 제품의 요구 성능도 변화되면서 기존 예상보다 공급 계약을 체결하는 데 많은 시간이 소요되었습니다. Thank you very much for the question. We understand that there has been broad and deep interest in the HBM contract for next year. This year in particular has been challenging in fixing not only the supply volume but also the product mix due to various external factors. Not only that, there have been changes in the performance requirements for HBM products, which necessitated longer time in discussing the supply contract than expected. 다만 이제는 그동안 고객들과 중점적으로 논의했던 부분에 대해서 협의가 완료되었으면서 주요 고객사들과 내년도 HBM 공급 계획에 대해서 최종 확정을 하였습니다. That said, our discussions over major issues with our clients have been completed, and the HBM supply plan for next year for major customers has been finalized.\n\n**Operator**\nAI 인프라 구축을 위한 폭발적인 수요 증가와 당사의 제품 경쟁력 우위로 인해 당사 HBM 제품은 23년 이후 계속해서 솔드아웃 상태가 이어지고 있으며, 많은 분들의 관심이 높으실 가격 역시 현재 수익성이 유지 가능한 수준에서 형성되었습니다. Given the explosive growth in demand for HBM to keep building AI infrastructure and the company's product competitiveness, the company's HBM has been selling out since 2023, and the pricing, which I'm sure is the point of interest for many, has also been formed at a level that can sustain the current profitability. 당사는 HBM 수요가 AI 시장의 중장기적 성장세를 바탕으로 급격히 확대되고 있는 만큼 공급이 단시일 내 수요를 따라잡기 힘들다고 판단하고 있습니다. And as the HBM demand continues to accelerate, driven by longer-term growth trends in the AI market, the company believes that it will be unlikely for supply to catch up with demand in a short period of time.\n\n**Operator**\n따라서 HBM의 성장 수준은 공급 가능 여력에 따라 결정될 것으로 예상하고 있으며, 당사의 HBM은 일반 DRAM보다는 상당히 높은 성장률을 예상하고 있습니다. Which means that the pace of HBM's growth will be determined by supply capacity, and the company's HBM is positioned for a much higher growth than conventional DRAM products. 당사 HBM 제품의 수요 대비 공급은 27년도에도 타이트하게 유지될 것으로 전망되지만, 당사는 고객의 니즈에 부합하는 제품을 적시 안정적으로 공급할 수 있도록 최선을 다하겠습니다. The company's HBM supply will remain tight compared to demand into 2027, but we will continue to do our best to supply products that meet customers' needs in a timely and secure manner. 네, 답변 감사합니다. 다음 질문해 주십시오.\n\n**Operator**\n다음으로 질문해 주실 분은 삼성증권의 이종욱 님입니다. The following question will be presented by Jong-wook Lee from Samsung Securities. Please go ahead with your question.\n\n**Operator**\n네, 안녕하세요. 삼성증권의 이종욱입니다. 실적 축하드립니다. 저는 HBM에 대한 질문 하나 드리겠습니다. HBM4에서 요구 성능 변화를 말씀해 주셨는데, JEDEC 스펙 대비 고객의 스펙 상향 요구가 있었던 것으로 알고 있습니다. 이를 대처하는 데 어려움이 없었는지 궁금합니다. 그리고 HBM4 이후도 HBM4와 비슷하게 기존 JEDEC 스펙 대비 더 높은 성능을 요구하는 조건으로 예상하고 계신지 궁금합니다. 이상입니다. Thank you very much for taking my question, and congratulations on the performance. This is Kim Gwi-taek from Samsung Securities. My question is on HBM. So it was mentioned that there have been higher performance requirements for HBM4, and my understanding is that it was to be higher than the JEDEC specifications. So have there been any difficulties for the company in meeting such higher performance requirements? And also for the HBM4E, does the company expect the performance requirements to be similarly high, to be higher than the JEDEC specifications? 네, 질문 주셔서 감사드립니다.\n\n**Operator**\n답변을 드리면 AI 추론 시장이 확대되면서 메모리 대역폭이 AI 성능 향상을 위한 핵심 요인으로 주목받고 있습니다. HBM4는 I/O의 개수가 HBM3 대비 2배 늘어난 2048개로 이미 정해졌기 때문에 HBM의 대역폭을 키우기 위해서는 스피드 성능을 높이는 방향으로 고객들의 요구 수준도 변화하게 되었습니다. Thank you very much for the question. Now, with the AI inference market growing, the memory bandwidth is increasingly seen as the key factor that can upgrade AI performance. As for HBM4, the number of I/Os is already fixed at 2048, double the number of HBM3E. So the customers are now looking at higher speed as a way to increase the HBM bandwidth. 당사는 HBM 업계 1위 기술력을 통해 고객이 요구하는 최상위 스펙을 이미 충족하며 대응하고 있습니다. 또한 업계에서 가장 빠르게 고객의 상향 요구에 맞춘 제품을 샘플링하였으며, 대량 공급을 위한 생산도 시작하였습니다.\n\n**Operator**\nBased on our number one technological competitiveness in HBM, the company is already fulfilling top-level specifications required by our customers. Moreover, we have already sampled products that meet customers' upgraded requirements faster than anyone in the industry and already started production for mass supply. 앞서 말씀드린 것처럼 AI 칩 성능 경쟁이 심화됨에 따라 메모리 성능이 기술 발전의 병목이 되는 메모리 월 현상이 부각되고 있으며, 앞으로 HBM을 포함한 차세대 메모리 제품에 대한 성능 요구도 지속적으로 상향될 것으로 예상하고 있습니다. And as explained earlier, with intensifying competition for AI chip performance, the memory wall phenomenon becomes more pronounced, where the memory performance becomes the bottleneck for technological development. As such, performance requirements for next-generation memory products, including HBM, will continue to be upgraded. 당사는 업계 최고 수준의 설계 능력과 프라이머리 공급사로서의 노하우를 활용하여 차세대 HBM 제품에서도 고객의 요구 조건에 맞는 제품을 적극 대응하여 넘버원 공급업체 지위를 이어나갈 것입니다.\n\n**Operator**\nWith the industry-leading design capability and know-how as the primary supplier, the company will respond to customers' requirements in a timely manner for our next-generation product line as well and maintain our number one supplier position. Thank you. 네, 다음 질문해 주십시오.\n\n**Operator**\n다음으로 질문해 주실 분은 뱅크오브아메리카의 사이먼 우님입니다. The following question will be presented by Simon Wu from Bank of America. Please go ahead with your question.\n\n**Operator**\n예, 뱅크오브아메리카의 우동재입니다. 먼저 연간이 아닌 한 분기에 10조 원 이상의 영업이익 달성 축하드립니다. 사실 이와 관련해서 제 질문은 현재 메모리 반도체 사이클이 과거 호황기 때와 어떤 점에서 다른가입니다. 과거에는 호황이 오면 곧 침체기가 오곤 했었잖아요. 그래서 특히 일반 메모리 업황도 왜 좋아지고 있고 업계의 재고 부담도 과거 클라우드 붐 때 대비 어떤 상황인지 또 부연 설명해 주시면 감사드리겠습니다. Thank you very much.\n\n**Operator**\nThis is Woo Dong-jae from Bank of America, and congratulations on the recent performance, KRW 10 trillion in operating profit in a quarter. Now, my question is about the memory cycle. So what we have seen in the past is that usually if there is a boom in the memory cycle, then it will be followed by a downturn. And so I wonder whether the company sees any similarities with the recent memory boom with the historic cycles in the past. It appears as if recently the memory boom is also driving up demand for conventional memory. And also in terms of the inventory level, so there was also a cloud-driven boom some time ago, and at that time. So how does the company see the inventory level from then and today? 네, 질문 감사드립니다. 올해 메모리 시장은 당초 예상과는 다르게 전 제품군에서 수요가 급격히 증가하면서 초호황기에 진입한 것으로 판단됩니다.\n\n**Operator**\n이러한 시장의 변화는 얼마 전부터 나타난 것이긴 하지만 당사는 이번 사이클이 지난 17년과 18년에 있었던 슈퍼 사이클과는 양상이 좀 다르다고 생각합니다. Thank you very much for the question. Now, it is true that the memory market this year has entered into what can be called a super boom cycle with surge in demand across all products, unlike earlier expectations. Such changes have only recently appeared, but the company sees this cycle to be a bit different from the super cycles that we witnessed in 2017 and 2018. 가장 큰 차이점은 현재의 수요가 AI 패러다임으로의 전환에 힘입어 훨씬 더 폭넓은 응용처에 기반하고 있다는 사실입니다. The biggest difference is that the current demand is driven by a much broader range of applications coming from the shift to the AI paradigm.\n\n**Operator**\nAI는 기존 응용처에 AI가 더해지는 방식으로 수요의 업사이드를 창출하는 한편, 중장기적으로는 자율주행이나 로보틱스 AI와 같이 이전에는 없었던 응용처를 발굴한다는 점에서 메모리 수요의 근본적인 변화를 야기하고 있습니다. AI creates upside to the overall demand as it is being added on top of existing applications. At the same time, for the longer term, it is also creating new applications like autonomous driving and robotics AI. So what we are seeing is a fundamental shift in the demand for memory driven by AI. 특히 최근에는 AI 컴퓨팅이 추론으로 확장되면서 AI 서버뿐 아니라 일반 서버의 수요 증가를 유도하고 있습니다. 이에 당사는 내년 전체 서버 세트 출하량이 약 10% 후반 증가할 것으로 예상하고 있고, 서버형 DRAM이 일반 DRAM 수요를 계속 이끌 것으로 기대하고 있습니다. In particular, computing recently has expanded to inference, promoting demand for not just AI servers but general-purpose servers as well.\n\n**Operator**\nThe company believes that our total server set shipment, total server set shipment next year will grow at a high 10% level, and the server DRAM to meet the overall demand for conventional DRAM. 또한 공급 측면에서는 HBM의 생산 비중이 확대되면서 더 많은 클린룸 공간과 캐파를 투입하더라도 전체 생산량의 증가는 자연적일 수밖에 없습니다. At the same time, looking at the supply side, production can only grow so much even if we use more cleanroom space and capacity because of the growing share of HBM. 이러한 특징들이 DRAM 산업의 공급 증가를 구조적으로 제약함으로써 이번 메모리 슈퍼 사이클의 장기화를 뒷받침하는 요인으로 작용할 것으로 전망하고 있습니다. These circumstances create a structural constraint against supply increase in the DRAM industry and are likely to serve as the driver for long-drawn-out memory super cycle. 네, 답변 감사합니다. 다음 질문해 주십시오.\n\n**Operator**\n다음으로 질문해 주실 분은 NH Investment & Securities의 Young Ho Ryu 님입니다. The following question will be presented by Young Ho Ryu from NH Investment & Securities. Please go ahead with your question.\n\n**Operator**\n네, 안녕하세요. NH투자증권의 류영호입니다. 최근 실적 축하드리고요, 질문해 주셔서 감사합니다. 저는 낸드 쪽 질문드리고 싶은데요. 최근에 엔터프라이즈 SSD 수요 강세가 AI 시대 진입에 따라서 구조적으로 변화한다고 말씀을 하셨는데, 이렇게 생각하시는 근거나 배경 이런 것들 좀 자세히 설명 부탁드려도 되겠습니까? First of all, congratulations on the performance, and thank you for taking my question. Now, my question is on NAND. The recently strong demand for enterprise SSD was said to be a structural change following the advent of the AI era. So could you elaborate more on the rationale behind such assessment? 네, 최근 낸드 수요 증가의 배경에 대해서 좀 더 자세히 설명을 드리자면, 먼저 서버 고객들의 AI 투자 확대에 따라 AI 서버와 일반 서버의 빌드 수요가 증가하면서 TLC 제품의 수요가 늘어나고 있습니다.\n\n**Operator**\nAllow me to explain more in detail the background to the higher NAND demand that we are seeing recently. First, there is a stronger build demand for both AI servers and general-purpose servers, with our server customers expanding their investment in AI, which in turn is driving demand for TLC products. 또한 이미지나 비디오 등 AI 생성 데이터 규모가 급증하면서 저장 수요가 빠르게 늘어나는 상황에서 HDD 공급 부족이 발생했습니다. 그래서 HDD 의존도가 높은 하이퍼 스케일러 고객 중심으로 고용량 QLC 기반의 eSSD로 전환 수요가 유입되고 있습니다. At the same time, demand for storage is also accelerating as a result of growth in AI-generated data like images and videos, leading to HDD supply shortage. So for hyperscaler customers with high dependence on HDD, the recent developments have prompted them to turn instead to eSSD based on high-capacity TLC.\n\n**Operator**\n그러나 당사는 현재의 수요 변화가 이러한 단기적 수급 이슈를 넘어서 eSSD 수요를 구조적으로 성장시킬 변화로 간주하고 있습니다. Having said that, the company sees the recent change in demand as something that goes beyond the current short-term supply and demand issues, and we see this actually as one that can potentially change the demand. In other words, it is one that can potentially structurally increase the eSSD demand. 우선 AI 추론이 고도화되면서 기존의 LLM 방식의 한계를 극복하기 위해 RAG, 그러니까 Retrieval Augmented Generation 중요성이 확대되고 있습니다. First, with the ever-advancing AI inference, the importance of RAG, or the Retrieval Augmented Generation structure, is becoming even greater as a way to overcome the limitations of the existing LLM.\n\n**Operator**\nRAG는 학습된 데이터에 국한하여 답변을 생성하는 기존의 LLM 방식에서 나아가 답변을 하기 전에 외부 데이터베이스에서 질문과 관련된 문서를 검색한 후 이를 바탕으로 최종 답변을 생성하는 방식으로 최신 데이터 및 사용자 특화 데이터를 반영하여 보다 정확도가 높은 답변을 제공합니다. RAG moves beyond the current LLM approach, which basically generates responses based solely on the data that it was trained on. It will search related documents in external databases and generate the final response based on such search, which allows it to refer to the latest data as well as user-specific data, resulting in responses with much greater accuracy. LLM에 RAG를 적용하기 위해서는 데이터를 100% 표현하여 저장하는 외부 데이터베이스, 즉 벡터 데이터베이스를 추가적으로 구축해야 되는데, 이때 데이터의 빠른 검색을 위해 eSSD 적용이 필수적입니다. To apply RAG on LLM, we need to additionally build outside databases that express and store data as vectors. In other words, we need vector databases.\n\n**Operator**\nAnd this is where eSSD becomes a must to enable speedy search of data. RAG의 성능 제고와 벡터 데이터베이스 규모 확장을 위해서 고성능 TLC, 고용량 QLC, eSSD를 기반으로 한 스토리지 수요 증가가 일어날 것으로 예상합니다. To support the scaling up of vector database and performance upgrade in RAG, demand for storage based on high-performance TLC and high-density QLC eSSD is expected to rise. 또한 추론 과정에서 필요한 데이터 처리량이 급증하면서 GPU에서 처리하던 키 밸류 캐시 일부를 파일 계층 메모리로 전가, 그러니까 오프로딩하려는 니즈가 발생하고 있습니다. 추론 과정에서 데이터 처리량과 전력 소모량이 급증하는데, 이 때문에 AI 시스템의 효율적 운영 필요가 생겼기 때문입니다. In addition, there has been a spike in data in the processing that is needed for the inference process, which led to the need to offload part of the key-value cache that was generated at the GPU level to the lower layer memory.\n\n**Operator**\nThis is because data processing and power consumption surge during the inference process, which calls for more efficient operation of the AI system. 기존 GPU에서 처리하던 키 밸류 캐시를 데이터 활용 빈도에 따라 SSD까지 오프로딩함으로써 다수의 유저를 대상으로 추론을 제공할 때 단위 전력당 처리량을 높이고 사용자별 응답 시간을 줄일 수 있으며, 이로 인해 고성능 TLC eSSD 활용이 확대될 것으로 전망하고 있습니다. By offloading key value cache that was processed at the GPU all the way to the SSD, depending on the frequency of the data usage, they can increase the throughput per unit of power when providing inference to many users and reduce the response time per user. And this is one of the reasons why use of high-performance TLC eSSD is expected to grow.\n\n**Operator**\n결론적으로 이와 같이 AI 활용이 확산됨에 따라 ESSD의 역할이 확대되고 채용량이 증가하며 AI 인프라 구축에 따른 수혜가 DRAM에 이어 이제는 낸드에서도 시작되고 있는 것으로 보고 있습니다. As AI utilization keeps spreading, so will the role of the ESSD, resulting in its higher content growth. So essentially, what we are seeing now is the benefits of AI infrastructure spreading from DRAM to NAND as well. 네, 답변 감사합니다. 다음 질문해 주십시오.\n\n**Operator**\n다음으로 질문해 주실 분은 한국투자증권의 최민숙 님입니다. The following question will be presented by Choi Min-sook Chae from Korea Investment & Securities. Please go ahead with your question.\n\n**Operator**\n네, 안녕하세요. 한국투자증권 최민숙입니다. 질문해 주셔서 감사합니다. 최근에 AI로 인해서 메모리 시장이 선주문 후판매 특성의 스페셜티 시장으로 변해가고 있다고 판단이 되는데요. 실제 현장에 계신 입장에서 고객들과 논의하실 때 과거와 다른 점이 어떤 것들이 있는지 공유해 주시면 감사하겠습니다. Thank you for taking my question.\n\n**Operator**\nThe memory market appears to be changing into a specialty market with order first, sell later approach thanks to AI. On the field, then, does the company see any differences from the past in your discussions or interactions with customers? 네, 메모리 시장은 막대한 투자 비용과 긴 리드 타임을 특징으로 하는 HBM의 등장으로 일부 사업 형태가 고객의 선주문 후 생산하는 방식으로 전환되었습니다. Yes, it is true that in the memory market, some businesses have shifted to order first, produce later approach with the emergence of HBM marked by massive investment and long lead time. 또한 저희 HBM에 대한 고객들의 강한 수요로 인해 HBM의 초기 계약 시점부터 당사는 연간 단위의 장기 계약을 통해 고객 수요의 가시성을 확보함과 동시에 안정적으로 고객 수요에 대응해 왔습니다.\n\n**Operator**\nIn addition, with strong HBM demand coming from our customers, the company was able to secure visibility into the customer's demand from the contracting stage with long-term agreements and respond with consistency. 이에 메모리 산업과 당사의 사업은 높은 변동성을 보여온 과거와 달리 시장 예측 가능성이 확대되고 사업 안정성이 크게 개선되고 있습니다. For both the memory industry and the company, this has led to greater market predictability and business stability than in the past when it was much more volatile. 그리고 HBM4E부터 점진적으로 확대될 커스텀 HBM은 기존의 표준화된 HBM과 달리 고객의 GPU나 ASIC 제품 설계 초기 단계부터 고객과의 긴밀한 협력을 통해 제품이 개발됩니다. 이는 특정 고객과 소수 공급업체 간의 장기적이고 전략적인 거래 확대로 이어져 메모리 공급업체들의 사업 안정성과 수익성 개선에 더욱 기여할 것으로 판단되고 있습니다. And the custom HBM will gradually increase from HBM4E.\n\n**Operator**\nSo the products will be developed in close collaboration with customers from the early stage of design of the customer's GPU or ASIC products, unlike in the existing standardized HBM. This will lead to much longer-term and strategic transactions between customers and a small number of suppliers, contributing even more to business stability and profitability improvement on the part of the memory suppliers. 부연 설명드리면, 메모리 업체들이 HBM 공급을 늘리기 위해 캐파를 HBM에 우선 할당하면서 일반 메모리 생산에 제약이 발생하고 있고, 결과적으로 수요가 늘어나고 있는 일반 메모리의 공급 부족을 초래하고 있습니다. If I may add, memory companies are allocating capacity to ramp up HBM supply, and this has led to supply constraints in conventional memory, resulting in supply shortage of conventional memory for which demand is actually growing.\n\n**Operator**\n이에 따라서 일반 메모리 제품에 대해서도 장기 공급 계약을 체결하고 싶어 하는 고객들이 증가하고 있고, 일부 고객들은 26년에 대한 선구매 필요까지 발행하면서 현재 공급 부족 상황에 적극 대응하고자 하고 있습니다. And as a result, we are seeing an increase in customers who want to sign long-term agreements for conventional memory products as well. Some customers are very much actively responding to the current supply shortage by issuing pre-purchase POs for 2026. 고객의 수요 강도와 당사의 캐파를 감안하면 내년도에는 HBM뿐만 아니라 DRAM과 낸드 캐파 모두 사실상 솔드 아웃되었다고 말씀드려도 과언이 아닌 상황에 이르렀습니다. Now, given the customer's demand and the company's capacity, for next year, not only HBM but DRAM and NAND capacity has essentially been sold out. 당사는 최적의 생산과 판매 전략으로 고객 수요에 최대한 대응하도록 노력하겠습니다. 또한 앞서 말씀드린 것처럼 HBM의 등장으로 촉발된 변화가 일반 메모리 시장에 미칠 영향을 고객들과 지속 논의할 계획입니다.\n\n**Operator**\nThe company will try to respond to customer's demand with optimum production and sales strategy. And as mentioned earlier, we will keep discussing the implications of the HBM-driven changes with our customers. 네, 다음 질문해 주십시오.\n\n**Operator**\n다음으로 질문해 주실 분은 HSBC의 Ricky Seo 님입니다. The following question will be presented by Ricky Seo from HSBC. Please go ahead with your question.\n\n**Operator**\n네, HSBC Seo Ji-week입니다. 좋은 시작 축하드리고, 저는 Capex 관련해서 질문드리겠습니다. 최근에 글로벌 AI 업계의 투자 규모를 보면 앞으로 메모리 수요를 충족시키려면 수년간 아주 높은 투자 규모의 투자가 필요해 보이는데요. 아까 26년도에 Capex를 올해 대비 증가시킨다고 하셨는데, 어느 정도 수준에서 늘어나는지 좀 디테일하게 설명해 주시면 감사드리겠고, 이게 중장기적으로 우리 용인 캠퍼스나 이런 신규 캠퍼스에 투자하는 규모가 한 1년 전 생각하신 것 대비 어느 정도 늘어나고 있는지 설명해 주시면 감사하겠습니다. Congratulations on the performance, and my question is on Capex.\n\n**Operator**\nNow, recently, the investments by global AI companies point to a very high investment level needed for the next few years to fulfill the demand for memory. It was mentioned that the company's Capex in 2026 will increase over this year. Then what will be the extent of the increase is the first question. And then also for the longer term, it appears as if the investment or the Capex into the new campuses like Yongin and others will also have to be far higher than one year ago. 네, 답변드리겠습니다. AI 시장의 어떤 성장과 수익화에 대한 확신을 가지고 글로벌 AI 업체들이 투자 규모를 경쟁적으로 지금 확대하면서 HBM, DDR5, 그리고 엔터프라이즈 SSD 등 다양한 메모리 제품에 대한 수요가 빠르게 증가하고 있습니다.\n\n**Operator**\nNow, as global AI companies competitively expand investment with conviction in the growth and monetization of the AI market, there has been accelerated growth in demand for a wide range of memory products, including HBM, DDR5, and enterprise SSD. 급증하는 어떤 수요를 고려하고 수요에 어떤 대응하기 위해서는 메모리 업계의 Capex 증가는 불가피하고, 당사의 내년도 Capex도 올해에 비해서는 상당한 규모로 증가할 것으로 전망됩니다. So, to respond to such surging demand, Capex growth across the memory industry appears to be inevitable. And for the company, Capex next year will far outpace the level of this year. M15X는 장비 반입이 본격적으로 시작되면서 HBM의 공급 확대를 위해 활용될 것이고, 일반 DRAM과 낸드는 기존 캐파의 상단 공정 전환을 가속화해서 수요에 대응할 계획입니다. For M15X, equipment installation has begun in earnest to be used to ramp up supply of HBM.\n\n**Operator**\nFor conventional DRAM and NAND, we will accelerate tech migration in the existing capacity as a way of responding to the demand. 이와 함께 용인 1기 팬에 대한 건설, 그리고 인디애나 어드밴스드 패키지 공장 건설 준비 등을 감안하면 인프라 투자 규모는 내년에 지속 증가할 것으로 계획하고 있습니다. At the same time, considering the Fab 1 construction in Yongin and preparation for construction of an advanced package plant in Indiana, US, investment in infrastructure is set to keep growing next year. 당사는 투자 규모가 증가하더라도 지속적으로 Capex discipline 준수하며 안정적인 재무 구조를 계속해서 유지해 나가도록 하겠습니다. But even with growing Capex, the company will stick to its Capex discipline and maintain a stable financial structure. 네, 답변 감사합니다. 다음 질문해 주십시오.\n\n**Operator**\n다음으로 질문해 주실 분은 교보증권의 최보영 님입니다. The following question will be presented by Bo-young Choi from Kyobo Securities. Please go ahead with your question.\n\n**Operator**\n네, 안녕하세요. 교보증권 최보영입니다. 질문 기회 주셔서 감사합니다. 저는 제품이랑 테크 부분에서 질문드리겠습니다. 내년에는 전 제품 라인업을 갖춘 1C 나노미터 공정 전환, 그리고 321단 낸드 공급 확대를 한다고 언급을 주셨는데요. 이 제품들의 본격적인 램프업 일정은 어떻게 되는지 궁금합니다. 또 추가적으로 내년 말 예상하시는 비중은 어떻게 되는지 궁금합니다. 감사합니다. Thank you for taking my question. My questions are on the product and technology. Now, first, it was mentioned that there will be conversion to 1C nanometer next year, for which there is a lineup for all products, and then also increase in the portion of the 321-layer NAND products. Then what is going to be the timeline for the ramp-up for each product? And then also another question is, what is the expected portion of the respective products by the end of next year? 네, 질문 감사합니다.\n\n**Operator**\n당사는 수요 가시성이 높고 수익성이 확보된 제품 수요를 우선적으로 대응한다는 원칙에 따라서 내년 신규 캐파는 이미 공급 계약이 완료된 HBM 중심으로 활용할 예정입니다. 일반 DRAM과 낸드는 기존 캐파의 상단 테크 전환으로 수요 증가에 대응할 방침입니다. Thank you for the questions. Now, under the principle that we respond with priority to demand with high visibility and profitability, our new capacity next year will center on HBM, for which supply contract has already been completed. For DRAM and NAND, we plan to respond to demand through tech migration in the existing capacity. DRAM 원시 나노미터의 경우 지난해 개발 완료 후에 올해 양산을 시작했고, 내년 본격적으로 램프업을 진행해서 내년 말에는 국내 일반 DRAM 캐파의 절반 이상을 원시 나노 제품으로 제품 생산을 위해서 활용할 계획에 있습니다. For DRAM 1C Nanometer, development was completed next year, with mass production beginning this year.\n\n**Operator**\nRamp-up will begin in full swing next year, and 1C nanometer is planned to take up over half of the conventional DRAM capacity inside Korea by the end of next year. 최고의 성능과 원가 경쟁력을 확보한 원시 나노미터 공정 기반의 DDR5, LPDDR5, 그리고 그래픽 DRAM 등 전 제품의 라인업을 구축하고 고객 수요에 맞춰 적시에 공급해서 수익성을 확보해 나갈 예정입니다. Based on the 1C nanometer process, with the best performance and cost competitiveness, we will build up the lineups for all products, including DDR5, LPDDR5, and Graphic DRAM products, to respond to customer's demand in time and ensure profitability. 낸드의 경우에는 계속해서 수익성 개선에 집중하는 가운데 캐파 확장보다는 상단 공정으로의 전환을 통해서 생산성을 개선해 나갈 계획입니다. And in the case of NAND, our focus remains on improving profitability, and the plan is to keep improving profitability through tech migration rather than ramping up capacity.\n\n**Operator**\n올해도 176단에서 238단, 그리고 321단으로 점진적인 테크 전환을 추진하였으며, 내년에는 TLC뿐 아니라 QLC 제품으로 공급을 확대하면서 보다 본격적으로 321단을 램핑업할 겁니다. 그러면 내년 말 본사 NAND 생산 비트의 절반 이상을 321단 제품으로 전환할 수 있도록 준비 중입니다. That has been the case this year with tech migration from 176 layer to 238, then to 321. Next year, we will grow our supply not only in TLC but also in QLC, which will require ramp-up of 321-layer products. This means that we are making the preparation for 321-layer products to take up more than half of our NAND bit production by the end of next year. 네, 다음 질문해 주십시오.\n\n**Operator**\n다음으로 질문해 주실 분은 SK증권의 한동희 님입니다. The following question will be presented by Dong-hee Han from SK Securities. Please go ahead with your question. 네, 안녕하세요. SK증권 한동희입니다. 질문 기회 감사드립니다. 저는 재고에 대한 질문 한 가지를 여쭙고 싶은데요.\n\n**Operator**\n저희가 이미 2분기에 재고를 꽤 많이 소진했고, 3분기에 수요 강세를 감안하면 보유하고 있던 재고는 더욱더 많이 하락했을 것 같습니다. 지금 시점에서 저희의 재고 수준과, 그리고 이제 고객사들의 재고 상황에 대해서도 고민 부탁드립니다. 감사합니다. Thank you for taking my question, and my question is on the inventory level. There has been considerable inventory sell-down in the second quarter, and again, inventory appears to be much lower in the third quarter as well due to the very strong demand. So what is the company's inventory level now, and also among the customers? 네, 질문 감사드립니다. 지난 분기에는 고객의 구매 수요가 예상을 웃돌면서 메모리 공급망 내 과잉 재고 축적, 그리고 구매 수요 둔화에 대한 우려가 있었습니다. 하지만 그 세트 빌드 가속화로 고객사의 재고가 전반적으로 감소하는 가운데, 특히 AI 인프라 투자 확대로 인해 서버 고객들의 메모리 재고가 눈에 띄게 줄어드는 추세입니다.\n\n**Operator**\nWith customers' demand outpacing expectations in the previous quarter, there have been concerns over excessive inventory buildup in the memory supply chain, as well as demand slowdown consequently, but customers' inventory level has become lower overall with accelerated set build, and added to that, investment in AI infrastructure has continued to grow, resulting in noticeably lower memory inventory among server customers. 저희 재고 역시 최근 메모리 수요 강세로 인해서 DRAM과 낸드 모두 전 분기 대비 감소했습니다. 특히 DRAM은 재고가 극히 낮은 수준으로, DDR5의 경우 고객 수요에 대응하기 위해서는 생산된 제품이 고객에 즉시 출하되어야 하는 상황입니다, and for the company, the inventory level has also fallen QOQ in both DRAM and NAND as a result of the recent strength in memory demand.\n\n**Operator**\nThis is particularly true for DRAM inventory, which remains extremely low, so much so that in the case of DDR5, the products must be shipped to customers straight out of production to ensure timely response. 당사는 앞으로도 DRAM과 낸드 모두 건전한 재고 수준을 유지하면서 고객 수요에 차질 없이 대응할 수 있도록 노력하겠습니다. The company will continue to try to maintain a healthy inventory level for both DRAM and NAND to seamlessly respond to customers' demand. 네, 다음 질문해 주십시오.\n\n**Operator**\n다음으로 질문해 주실 분은 UBS의 니콜라스 고두화 님입니다. The following question will be presented by Nicolas Gaudois from UBS. Please go ahead with your question.\n\n**Nicolas Gaudois** (Managing Director and Head of Research in ASEAN and APAC Technology)\nGood morning. Thanks for taking my questions. Regarding M15X that you mentioned you're opening earlier, are you able to address the faster ramp-up, pulling in your equipment delivery schedule for the first of all?\n\n**Nicolas Gaudois** (Managing Director and Head of Research in ASEAN and APAC Technology)\nAnd in that regard, could you more or less complete full equipment installation for the total vertical capacity for M15X by the end of 2026? And then, is it possible for you to pull in the schedule as well for Yongin Fab 1 Cleanroom readiness, which I think initially you had pinned down for May 2027? Thank you. 네, 질문 기회 주셔서 감사드립니다. 제가 질문드릴 내용은 이제 M15X, 그리고 또 용인 세부에 대한 내용인데요. 앞서서도 말씀하시면서 M15X에서의 설비 반입이 시작이 되었다라고 하셨는데, 그러면 이 설비 반입이 더 빨리 이루어져서 그 램프업을 더 빨리 하기 위해서 설비 반입을 더 조기에 완료할 수 있는 가능성이 있는지를 여쭤보고자 하고요. 그리고 또 두 번째로는 용인 FAB1의 클린룸에 대한 준비가 지금 현재로서는 2027년 5월로 예정이 되어 있는 것으로 알고 있는데, 혹시 또 이 용인 FAB1기의 클린룸에 대한 준비도 더 조기에 완료가 될 가능성은 있는지요? 네, 답변 드리겠습니다. 네, 저희 회사의 신규 팹 준비 계획에 대해서 말씀드리겠습니다.\n\n**Nicolas Gaudois** (Managing Director and Head of Research in ASEAN and APAC Technology)\nThank you very much for the questions and allow me to respond. Now, let me respond to the question about the company's plan for the Fab. 저희 회사는 웨이퍼 캐파 요구량이 상대적으로 큰 HBM의 수요가 빠르게 늘어나는 것에 선제적으로 대응하려고 23년 말에 M15X에 대한 신규 투자를 결정한 바 있습니다. The company had decided at the end of 2023 to make new investment in M15X to preempt the fast rising demand for HBM, which requires relatively bigger wafer capacity. 2년 동안의 공사 끝에 M15X는 얼마 전에 FAB을 조기 오픈하고 첫 장비 반입을 시작하였고, 내년부터 본격적으로 HBM 생산 증가에 기여할 수 있도록 준비하고 있습니다. After around two years of construction, the Fab finally opened early in M15X a while ago, with equipment installation starting. We are now making the preparation for M15X to contribute to HBM production ramp-up starting next year.\n\n**Nicolas Gaudois** (Managing Director and Head of Research in ASEAN and APAC Technology)\n메모리 수요가 기존 예상보다 가파르게 증가하고 있는 만큼 이에 대응하기 위해서 M15X의 capa 램프업 일정도 최대한 지금 빠르게 진행하고 있습니다. and as the memory demand growth continues to accelerate much faster than expectation, we are also speedily moving ahead with the capacity ramp-up at M15X. 올해부터 건설이 본격화된 용인 1기 팹 역시 향후 메모리 수요 증가 속도와 M15X의 어떤 빨라진 램프업 속도를 고려해서 향후 일정을 앞당길 수 있도록 추진하고 있습니다. As for the Fab 1 in Yongin that just started construction this year, we are working to pull up the schedule in light of the pace of demand growth and the earlier ramp-up at M15X. 저희 회사는 M15X와 용인 팹으로 이어지는 어떤 최첨단 생산 인프라 구축을 통해서 팹 스페이스와 capa를 선제적으로 확보하고 향후 증가하는 AI 메모리 수요의 성장에 유연하게 대응할 수 있도록 할 것입니다.\n\n**Nicolas Gaudois** (Managing Director and Head of Research in ASEAN and APAC Technology)\nThe company will keep trying to preempt capacity and fab space by building state-of-the-art production infrastructure from M15X to Yongin fab to enable flexible response to the ever-growing AI memory demand. 네, 다음 질문해 주십시오.\n\n**Operator**\n다음으로 질문해 주실 분은 다이와증권의 SK팀 님입니다. The following question will be presented by SK Kim from Daiwa Securities. Please go ahead with your question.\n\n**Operator**\n예, 안녕하세요. 질문 기회 주셔서 감사합니다. 다이와증권 김성주입니다. 저는 수요 관련 질문이 한 가지 있는데요. 최근의 상황을 보면 빅테크 기업들과 AI 기업들의 어떤 GPU, 그리고 ASIC 공급 협력 발표들이 좀 잇따라 발표되면서 AI 시장 성장에 대한 기대감도 굉장히 커지고 있습니다. 이에 따라서 앞으로 회사가 보시기에 HBM 수요의 성장, 그리고 이제 고객군이 확대되는 것에 따른 영향을 어떻게 보시는지 이거에 대한 의견 부탁드리겠습니다. 감사합니다. Thank you very much for taking my question. It is on demand.\n\n**Operator**\nNow, there have been a series of announcements of GPU and ASIC supply cooperation between big techs and AI companies, fueling expectations of further AI market growth. Then, against this backdrop, what is the company's outlook on HBM demand growth, as well as a broadening of the customer base? 네, 질문 주셔서 감사합니다. 답변을 드리면 주요 빅테크 기업들의 큐팩스 상향과 AI 기업들의 투자 확대로 HBM 시장은 보수적으로 보더라도 향후 5년 평균 30% 이상의 높은 성장률을 지속할 것으로 예상하고 있습니다. Thank you for the question. Now, with upward adjustment in big tech's Capex and increased investment by AI companies, the HBM market, even by a conservative estimate, will keep growing at an average of over 30% for the next five years.\n\n**Operator**\n최근 당사가 오픈AI사와 대규모 DRAM 공급을 위한 LOI를 체결한 것도 앞으로 AI에 대한 시장 수요가 매우 강하며, 무엇보다 AI 기술 전개에 있어 HBM을 중심으로 하는 AI 메모리의 확보가 중요하다는 것을 입증하는 중요한 사례라고 그렇게 생각하고 있습니다. I will point to our recent LOI with OpenAI for large-scale DRAM supply as an example of the very strong market demand for AI, as well as the need to secure AI memory based on HBM more than anything else when developing AI technology. 그리고 당사는 주요 GPU 고객뿐만 아니라 여러 ASIC 고객들의 프라이머리 공급사로서 차별화된 제품 경쟁력과 그다음에 양사 간의 신뢰를 바탕으로 차세대 제품 개발에 있어서 고객들과 협력하며 AI 산업 발전에 기여하고 있습니다.\n\n**Operator**\nAs the primary supplier of not only GPU but ASIC for many customers, we are working with customers in the development of next-generation products and contributing to the development of the AI industry based on our differentiated product competitiveness and mutual trust. 따라서 다양한 고객들로부터 새롭게 발생하고 있는 HBM 수요에 있어서 높은 점유율을 유지하며 공급을 확대해 나갈 수 있을 것으로 기대하고 있습니다. Thus, we are positioned to maintain a high share in the newly arising HBM demand among a broad range of customers and keep increasing our supply. 네, 다음 질문해 주십시오.\n\n**Operator**\n다음으로 질문해 주실 분은 J.P. Morgan의 제이 권진입니다. The following question will be presented by Jay Kwon from J.P. Morgan. Please go ahead with your question.\n\n**Operator**\n네, 질문 기회 감사합니다. J.P. 권진현입니다. 저는 DRAM 관련 질문 하나 드리려고 합니다. 최근 연일 DRAM 스팟 가격이 많이 상승하고 있고, DDR4의 DDR5 대비 가격 프리미엄이 많이 클 정도로 공급이 부족한 상황인데요.\n\n**Operator**\n물론 고객들과 스팟 대비 컨트랙트 가격 간의 차이가 좀 있겠지만, 이 추세로 DRAM 가격이 계속 상승하면 조만간 저희 HBM 수준의 이익률 달성 가능성도 좀 있어 보입니다. 그래서 회사 측에서 보시는 현재 일반 DRAM의 수익성은 어느 정도 수준까지 상승할 수 있다고 전망하시는지, 또 일시적으로나마 HBM보다 더 수익성이 좀 좋아질 경우에 HBM에서 컨벤셔널 DRAM으로 캐파 운용의 믹스도 좀 조정할 가능성이 있으신지 말씀 부탁드립니다. 감사합니다. Now, my question is on DRAM. The DRAM spot price is rising almost daily, and with the DDR4 and DDR5, almost in supply shortage as seen through the price premium. Of course, I'm sure that the company's contract price with the customers would be different from the spot price, but if the DRAM price maintains the current trend, it appears likely to reach the kind of profit margin similar to HBM. So what is the company's view on the DRAM profitability?\n\n**Operator**\nEven if temporarily it surpasses HBM's profitability, is it also foreseeable to shift the capacity mix, perhaps a bit away from the HBM to the conventional DRAM? 네, 답변 드리겠습니다. 말씀 주신 대로 최근에 일반 DRAM의 빠른 가격 상승세로 인해서 HBM과 일반 DRAM 간의 수익성 격차가 좁혀지고는 있지만, 당사의 경우 HBM의 이익률이 여전히 높게 유지되고 있습니다. Now, it is true that the recent hike in DRAM price has narrowed the profitability gap between HBM and DRAM, but for the company, HBM's profitability remains high. 내년에도 수급이 타이트하게 유지가 된다면 일반 DRAM의 이익률이 HBM과 비슷해질 가능성도 있지만, 당사는 일시적인 어떤 수익성의 변화만으로는 캐파 믹스를 즉시 조정하지는 않을 것입니다. If supply remains tight next year, DRAM's margin could rise closer to HBM, but the company does not plan to immediately adjust the capacity mix based on what can be a short-lived change in profitability.\n\n**Operator**\nHBM 제품 특성상 선제적으로 고객과 장기 물량 협의를 완료하고 이를 차질 없이 공급하는 것이 상당히 중요합니다. Given the nature of HBM products, it is important to agree on the long-term volume with customers to make sure that there is seamless supply. 고객 관계, 그리고 장기적 성장성, 그리고 수익성 측면을 종합적으로 고려해서 고객과의 장기 물량 협의 시에 이를 반영하고 있습니다. and when we discuss long-term volume with customers, we also consider various factors like customer relations, long-term growth potential, as well as profitability. 최근 일반 메모리 제품 공급에도 고객들의 선 PO 발행, 그리고 다년간의 LTA 체결 요구 등 과거에 비해 강한 구속력을 가진 계약들이 논의되고 있고, 최적의 생산성을 확보할 수 있는 방향으로 캐파 믹스를 결정하고 있습니다.\n\n**Operator**\nHaving said that, there have also been discussions over stronger binding contracts for conventional memory products as well, with customers issuing pre-purchase POs or asking for multi-year LTAs, and our decisions on capacity mix will be made in a way that can ensure optimum productivity. 이러한 현상이 앞으로 메모리 사업의 특성을 변화시키는 계기가 될 것으로 기대하고 있습니다. The company also sees the current trend to potentially prompt changes in the nature of memory business for the future. 당사는 AI 메모리의 선두주자로서 HBM의 높고 안정적인 수익성을 바탕으로 메모리 사업의 체질을 개선하고 차별화된 실적을 달성해 왔습니다. 앞으로도 장기적인 관점에서 안정적으로 고객 수요에 대응하고 AI 시장과 함께 지속적으로 성장해 나가겠습니다. As the leading supplier of AI memory, the company was able to improve our fundamentals in memory business based on the high and stable profitability from HBM and have achieved differentiated performance.\n\n**Operator**\nLooking ahead, we will keep responding to customers' demand with a long-term view and achieve sustained growth along with the AI market. 네, 이제 마지막 질문 받겠습니다.\n\n**Operator**\n마지막으로 질문해 주실 분은 시티그룹의 이세철 님입니다. The last question will be presented by Peter Lee from Citigroup. Please go ahead with your question.\n\n**Operator**\n네, 안녕하세요. 시티그룹 이세철입니다. 말씀하신 것처럼 최근에 메모리 업황이 매우 좋아지고 있고 AI 수요도 좋아지고 있어서 사실 관련해서 실적도 좋아지고 있는데요. 그래서 이번 분기도 보니까 현금 순현금으로 전환하고 계신 것 같은데요. 앞으로 계속 좋은 실적이 예상됨에 따라서 Free Cash Flow도 많이 좋아질 것으로 예상됩니다. 그래서 관련해서 아직 이르긴 하지만 연초에 발표하신 주주 환원 정책에 대해서 변화가 있으실지 답변 부탁드리겠습니다. 감사합니다.\n\n**Operator**\nNow, as was explained several times, because of the good performance in the market as well as the growth in the AI market, good performance for the company has also been achieved and is expected to continue for some time. So, as a result, the company has turned around to Net Cash position this quarter, and also its FCF is expected to continue to improve on the back of much stronger performance. So, I realize perhaps this is a bit early, but then can we expect any changes to the shareholder return policy that was announced in the early part of this year? 네, 답변 드리겠습니다. 말씀 주신 것처럼 25년 실적이 예상보다 크게 좋아지면서 당사의 재무 건전성이 빠르게 개선되고 있습니다. 특히 3분기에는 2분기 매출 증가에 따라서 채권 회사액이 증가함에 따라서 순현금을 달성하였습니다.\n\n**Operator**\nYes, it is true that the company's financial soundness is fast improving thanks to the stronger-than-expected performance in 2025. And yes, we have achieved net cash position in Q3 following the higher recovery of receivables with sales growth in Q2. 현 주주 환원 정책에서도 말씀을 드렸지만 당사의 재무 건전성 목표는 향후 업황 변동 시에도 안정적으로 사업을 운영하고 경쟁력을 유지하는 데 필요한 캐패스를 집행할 수 있도록 적정 수준의 현금을 지속적으로 보유하는 것입니다. It was explained as part of the current shareholder return policy that the company's aim in financial soundness is to maintain an appropriate level of cash that would allow us to keep stable business management through the differing industry cycles and to execute CapEx that is necessary to maintain our competitiveness. 최근 메모리 시황 호전으로 수요가 급증하며 이에 대응하기 위해서 필요한 당사의 캐패스 규모도 증가하고 있는 상황이라서 적정 현금의 수준도 이를 반영해야 할 것으로 보입니다.\n\n**Operator**\nNow, the recent upturn in the memory market has fueled demand growth, which in turn is driving up Capex necessary to fulfill the demand. So, this means that what we see as appropriate level of cash also has to reflect this change. 아울러 AI 메모리 시장의 커다란 성장 잠재력과 당사의 높은 투자 수익을 감안하면 지금의 캐패스 디스플레인을 준수하면서 창출되는 재원을 사업에 효과적으로 재투자하는 것이 주주분들께도 가장 좋은 현금 활용 방안이라고 판단됩니다. Furthermore, considering the huge growth potential in the AI memory market and the company's high return on investment, I believe that the shareholders will also agree that for now, the best use of cash is to reinvest it into our business while maintaining Capex discipline. 이에 3년 주기로 발표한 새로운 주주 환원 정책 시행 1년 차인 현재 시점에서는 추가 주주 환원에 대한 검토는 하지 않고 있습니다. 향후 시장 전망과 투자 수...\n\n**Operator**\n잠시 안내 말씀드립니다. 통신 오류로 잠시 조치 중입니다. 조금만 기다려 주시면 감사하겠습니다. We apologize, but we are experiencing a brief technical issue. Please stand by.\n\n**Operator**\n지금 다시 연결하고 있습니다. 고객님, 네, 네, 지금 바로 연결하겠습니다. 지금 얘기해도 될까요? 네. 이에 3년 주기로 발표한 새로운 주주 환원 정책 시행 1년 차인 현재의 시점에서는 추가 주주 환원에 대한 검토는 하지 않고 있으나 향후 시장 전망과 투자 소요 등 대내외 상황 변화를 종합적으로 반영하여 주주 가치를 극대화할 수 있는 방안에 대해서는 계속 검토하도록 하겠습니다. As such, being in the first year of the new shareholder return policy that is announced at a three-year interval, we are not looking into additional shareholder return at this time. But we will keep looking into how we can maximize shareholder return by taking a comprehensive look into the changes in the environment, both inside and outside, such as market outlook and investment needs.\n\n**Operator**\n네, 그럼 이상으로 SK hynix 2025년 3분기 경영 실적 컨퍼런스 콜을 모두 마치겠습니다. 감사합니다. Thank you very much, and that concludes the SK hynix 2025 third quarter earnings release conference.",
      "fetched_at": "2026-02-04T15:55:41.226Z"
    },
    {
      "ticker": "000660.KS",
      "title": "SK hynix (000660.KS) Q2 FY2025 earnings call transcript",
      "published_date": "Jul 24, 2025, 9:00 AM GMT+9",
      "fiscal_year": "2025",
      "quarter": "Q2",
      "url": "https://finance.yahoo.com/quote/000660.KS/earnings/000660.KS-Q2-2025-earnings_call-337962.html",
      "content": "**Moderator**\nPlease note that presentations will be interpreted simultaneously and Q and A session consecutively. With that, we're now ready to begin.\n\n**Moderator**\nGood morning, afternoon and evening. This is Park Sung Hwan, Head of IR at SK Hynix. Welcome to the SK Hynix twenty twenty five Second Quarter Earnings Release Conference Call. Allow me to introduce the executives present here with me today. We are joined by President of Corporate Center, Song Hyun Joong Chief Financial Officer, Kim Woo Hyun Head of DRAM Marketing, Kim Kyu Hyun Head of NAND Marketing, Kim Seok and Head of HBM Sales and Marketing, Kim Ki Tae.\n\n**Moderator**\nLet me issue a disclaimer that all outlooks presented by the company are subject to change depending on the macroeconomic and market circumstances. With that, we will now begin SK Hynix earnings release conference call for second quarter of twenty twenty five. Song Hyang Jong, President of Corporate Center, will first present the earnings followed by the company's future plans and market outlook and a Q and A session with the attending executives. Good morning, everyone. This is Song Hyun Jong, Head of Corporate Center.\n\n**Moderator**\nAllow me to first introduce the company's performance for the second quarter of twenty twenty five. The past quarter began with concerns about a slowdown in demand due to trade tensions and overall economic uncertainty. However, demand for AI memory continued to grow driven by aggressive AI investments from big tech companies. This was further supported by customers' preemptive purchasing to prepare for external risks resulting in a more favorable environment than initially expected. Both DRAM and NAND shipments exceeded our original guidance and pricing conditions also improved.\n\n**Moderator**\nAs a result, second quarter revenue increased by 26% Q o Q and 35% Y o Y, reaching an all time high of KRW22.2 trillion. For DRAM, sales of our 12 high HPM3E product was expanded in full scale as planned, while server and PC segments saw strong demand, driving sequential Q2 shipment growth above guidance at mid-twenty percent growth. Meanwhile, ASP rose by low single digit percent due to a considerable increase in sales of relatively lower priced conventional DRAM products. Coming from a low base of the previous quarter, NAND shipments significantly exceeded guidance by increasing over 70% sequentially as demand rose across all applications. ASP declined by high single digit percent Q o Q due to continued pricing weakness in solution products despite price rise in the spot market.\n\n**Moderator**\nOperating profit rose by 24% Q o Q and 68% Y o Y, reaching KRW 9,200,000,000,000.0, also setting a new quarterly record. The operating profit margin stood at 41%. Depreciation and amortization expenses for Q2 were KRW3.4 trillion, marking a slight increase from the previous quarter. EBITDA came in at KRW12.6 trillion with an EBITDA margin of 57%. Non operating loss net of gain reached KRW0.49 trillion.\n\n**Moderator**\nNotable items include foreign currency related net loss of KRW0.61 trillion due to depreciation of U. S. Dollar against Korean won and KRW0.12 trillion of other non operating income, including valuation gains on investment assets. Pretax income was KRW8.7 trillion, while net income was KRW7 trillion, resulting in a net profit margin of 31%. As of the end of the second quarter, cash and cash equivalents stood at KRW17 trillion, up KRW2.7 trillion from the previous quarter.\n\n**Moderator**\nInterest bearing debt decreased KRW1.5 trillion to KRW21.8 trillion, resulting in a reduction of net debt by KRW4.1 trillion to KRW4.9 trillion. Accordingly, our debt to equity and net debt to equity ratios reached 256%, respectively, which is an improvement by four percentage points and five percentage points, respectively. Now let me share our market outlook. While the memory market was initially expected to recover towards the second half of the year, we saw strong demand growth and favorable pricing conditions in the first half. Despite increased procurement demand during Q2, system build demand also rose, helping customers to maintain inventories at stable levels.\n\n**Moderator**\nGiven demand is expected to grow from new product launches in the second half, we believe the likelihood of sharp demand corrections due to customers' inventory adjustments would be low. Looking at demand by application, we expect healthy demand growth in the server market driven by increasing investments from big tech companies despite macro uncertainty. Alongside strong AI demand, general purpose server demand is also projected to rise due to replacement cycles and adoption of new CPUs. In the AI market, big tech companies have begun full fledged competition by unveiling AI agents with enhanced reasoning models. These models perform iterative thought processes to solve problems autonomously, requiring systems capable of processing significantly more data than conventional AI models.\n\n**Moderator**\nThis evolution is expected to further drive demand for high performance, high density memory. Additionally, ongoing investments by governments and corporations for sovereign AI are likely to become a new long term driver of AI memory demand. In the PC and smartphone market, the proliferation of AI applications is expected to drive replacement demand this year. Memory contents per device are also expected to grow with wider adoption of high performance memory required to support the AI functions. Unlike DRAM market, NAND market is yet to see meaningful AI driven demand growth.\n\n**Moderator**\nHowever, as power consumption considerations are becoming increasingly important in AI servers, we expect adoption of power efficient SSD solutions to widen in the near future. Next, I will discuss the company's plans. In the third quarter, given the significant shipment growth in the second quarter, we expect a moderation in shipment growth with DRAM growing by approximately low to mid single digit percent and NAND shipment increase being rather limited. Our plan to double HBM sales Y o Y remains unchanged backed by our strong product competitiveness and mass production capability. We expect to continue delivering stable performance, leveraging the HBM business despite external uncertainties.\n\n**Moderator**\nOur HBM3D products are receiving high marks from all customers for their performance and supply reliability, and we plan to maintain industry leading competitiveness as we transition into HBM4. In March, we supplied industry's first samples of HBM4 to customers. We are currently working closely with partners to optimize system level performance and are preparing to deliver products on time for our customers' needs. Beyond HBM, we plan to expand sales of conventional DRAM products where DRAM is increasing. These include high speed DDR5 products over 8,000 megabits per second that support new CPUs, high density server modules over 128 gigabytes and LPDDR5X for flagship smartphones as well as LPDDR4X products favored in the Chinese market.\n\n**Moderator**\nWe also plan to begin supplying LPDDR based server modules that enhance data processing speed and power efficiency within this year. Additionally, for GPUs, we are preparing not only the 16 gigabit GDDR7 products currently in supply, but also 24 gigabit based products to strengthen our leadership in the AI memory market with a diversified product portfolio. For NAND, we will maintain a prudent investment strategy and a profitability focused approach in line with downstream demand conditions. However, we are continuing product development efforts to respond quickly once market conditions improved. In the second quarter, we began actively expanding sales of ultra high density enterprise SSDs exceeding 120 terabytes based in QLC technology.\n\n**Moderator**\nIn May, we developed a three twenty one layer NAND based U. S. S. 4.1 product with random read and write speeds improved by 1540%, respectively, compared to the previous generation. By the end of the year, we also plan to develop both client and enterprise SSDs based on three twenty one layer technology, thereby building a competitive NAND product portfolio.\n\n**Moderator**\nLooking ahead, our M15 fab M15X fab is scheduled to open in Q4 of this year to produce DRAM products, including HBM from 2026. Construction of our YonginFat Phase one is on track for completion in Q2 twenty twenty seven. And through these facilities, we aim to secure the manufacturing infrastructure necessary to meet future demand. Our total investment for this year is expected to increase compared to the previous plan in accordance with our principle of continuing our investment focus for products with high demand visibility and secured profitability as well as maximizing investment efficiency. Although we are yet unable to provide details regarding HBM supply for 2026, as we now have secured visibility on next year's demand figure based on discussions with customers, we assessed that some proactive investment this year is necessary to ensure timely support of our HBM products.\n\n**Moderator**\nIn the AI market, memory is increasingly becoming a critical infrastructure as it plays an essential role in defining overall AI system performance. As a leading AI memory provider, we aim to drive both customer satisfaction and market growth by launching innovative products with top tier quality and performance that meets the needs of the AI system. With that, we are now ready to take your questions.\n\n**Moderator**\nNow q and a session will begin. Please press 1. That is 1 if you have any questions. Questions will be taken according to the order you have pressed the number 1. For cancellation, please press 2.\n\n**Moderator**\nThat is 2 on your phone. The first question will be provided by Dong Hee Han from SK Securities.\n\n**Moderator**\nYes, good morning. I am Han Dong Yi from SK Securities. Congratulations on your great performance. My question is about forecast for HBM market. Driven by strong demand for AI, HBM is expected for continuous and rapid growth.\n\n**Moderator**\nHow do you forecast to meet to long term demand for HBM beyond 2025? And what will be important momentum to drive HBM demand? As you can see from continuous CapEx expansion by big tech company, increases in token throughput and high growth rate of AI startups, the AI market is growing at a rapid pace. In particular, AI demand is expanding from training to inferencing and inferencing has further divided and advanced into areas like reasoning and agents, which has led to a sharp increase in AI workloads and intensifying bandwidth bottlenecks. In this rapidly growing AI market, HBM is now positioned as a key product that quickly affects performance enhancement.\n\n**Moderator**\nTaking its importance into consideration, we believe there is no doubt about growth potential of ATBM demand. As the AI market continue to expand into areas like AI agent and physical AI, computational volume will grow explosively, which will in turn drive demand growth in the HVM market. In the future, the ATBM market may not sustain the only state explosive growth rate, but AI technology will rapidly advance and spread, expanding the customer base and driving the continuous launch of new products and services. Therefore, we expect HBM will continue to enjoy strong growth. Next question?\n\n**Moderator**\nThe following question will be presented by SK Kim from Daiwa Securities. Please go ahead with your question. So thank you for giving me this opportunity to ask questions and my congratulation on your great performance. My question is also about HBM because market attention is really centered around this product. So my question is about the next year forecast. So how are negotiation progressing for the 2026 HBM supply with major customers? So thank you for the question.\n\n**Moderator**\nWe cannot provide customer details, but negotiations are proceeding as planned. As customer projects become increasingly diverse, we are engaged in close negotiation for product mix and pricing. As a close partner of our major customers in the AI semiconductor field, we are conducting negotiations and offering optimal supply conditions for a long term partnership. Furthermore, by delivering the highest quality products that customers require in a reliable and timely manner, we plan expansion to meet customer demand and grow together with our customers. Next question?\n\n**Moderator**\nThe following question will be presented by Yungho Ryu from NH Investment and Securities.\n\n**Moderator**\nI am Lee Young Woo from NH Security. My question is about demand. And so to what extent the uncertainties affect pull in demand in Q2? And how do you assess the resulting increase in customer inventory and its impact on demand for second half? Our Q2 shipment volume significantly exceeded the initial guidance and this was indeed driven by purchasing demand, which was stronger than expected.\n\n**Moderator**\nInitially customers intended to conservatively maintain inventory levels during the first half of the year, but with growing uncertainty around tariff policies, they shifted strategies towards securing appropriate level of inventory. This led to a great increase in purchasing demand, especially from major customers with previously low stock levels. In addition, with end of life plans released for certain legacy products, competition for securing supply intensified among small to midsized customers, including module makers and therefore further tightening market supply condition. Although shipment volumes in the first half exceeded our original plan, which raises concerns over potential demand slowdown in the second half, we believe the likelihood of short fluctuation in supply and demand remains low. System build activity also increased in Q2, so customer inventory levels did not rise to significant level.\n\n**Moderator**\nMoreover, memory suppliers have already reduced their inventories greatly, which means going forward growth will be only driven by product supply growth will be only driven by production growth. Depending on how future tariff policies evolve in the future, purchasing demand can be affected. In response, we will do our best to ensure stable business operation, especially focusing on product with secured demand visibility.\n\n**Moderator**\nThe following question will be presented by Hyun Kyun Ryu from Daishin Securities. Please go ahead with your question.\n\n**Moderator**\nSo once again, congratulation for your great performance. With the U. S. Government tightening export controls on China, SK Hynix may face growing restrictions on its fab operations in China. So what are your plans for managing your operations in China going forward?\n\n**Moderator**\nThank you very much for the question. As we all worry about geopolitical situations today, however, there has been no change to our validated end user or VEU status that we obtained in October 2023. We are committed to putting our customers' needs first and we'll work hard to provide uninterrupted supply within the boundaries of regulation and we'll continue operating our China fabs according to our existing plan. In fact, a recent supply conditions for legacy DRAM can be beneficial for our China fab operation. For example, with increasing DRAM capacity being allocated to expanding ACBM production, supply shortages of DDR4 and LPDDR4 legacy products have emerged during the transition to DDR5 and LPDDR5.\n\n**Moderator**\nSo in Q2, we responded to this demand growth with our for the legacy products with our existing inventory, but we believe that the demand for legacy DRAM will continue to persist for a while. And therefore, we will also focus on providing legacy products for the long term customer support and we are going to utilize our China fabs to ensure stable supply for the legacy product. Our China fabs are not only critical to our operations, but also play a key role in the global memory semiconductor supply chain. As such, we will continue to closely monitor U. S.\n\n**Moderator**\nRegulatory developments and maintain close communication with governments around the world.\n\n**Moderator**\nThe following question will be presented by Jae Kwon from JPMorgan. Please go ahead with your question.\n\n**Moderator**\nThank you for this chance to ask question. My question is about NAND product. It seems your NAND shipment growth in this quarter significantly outperformed prior guidance. Can you please elaborate on which customer segment drove this growth? In the previous earnings call, we guided for over 20% NAND shipment growth in Q2.\n\n**Moderator**\nAt that time, we observed the signs of rising spot prices and declining customer inventories, but demand visibility for certain products remain fairly limited. However, in Q2, demand for enterprise SSDs increased as hyperscale customers expanded their AI investments, while pulling demand for individual components also rose due to tariff related uncertainty. Additionally, mobile set build demand in the China region grew due to promotional event leading to shipments that significantly exceeded our expectations. With the Q2 sales increased, our inventory levels have now normalized. Moving forward, we'll continue to manage production and inventory flexibly in accordance with market demand.\n\n**Moderator**\nThe following question will be presented by Seung Woo Kim from Merit Securities.\n\n**Moderator**\nThank you for the opportunity. I would like to ask about HBM4. As HBM4 entails a greater cost increase compared to previous HBM product, there are some concerns about potential profitability decline. What is SK Hynix perspective on this? As you may know, HBM4 exhibits major technological changes including increased IO count for higher bandwidth, new designs for improved power efficiency and the adoption of logic processes in the base Accordingly, we are striving to reflect this cost increase in our pricing strategy for HBM4 and we aim to stimulate the AI market by establishing optimal pricing with customers while maintaining current profitability levels.\n\n**Moderator**\nThe following question will be presented by Jongwook Lee from Samsung Securities.\n\n**Moderator**\nAgain, thank you for the chance. My question is about DRAM. So DDR4 supply appears to be quite tight recently. What is your outlook on future DDR4 demand? And what is DDR4's current revenue share at SK Hynix?\n\n**Moderator**\nAnd what are your plans regarding its end of life timing and future operation? The recent spike in DDR4 prices has been primarily driven by short term supply concerns following announcements from some suppliers to discontinue DDR4 production. However, as we are currently in a transition phase from DDR4 to DDR5, we view this as a temporary demand concentration rather than a structural shift in underlying demand for DDR4. Speaking of the DDR4 share in SK Hynix revenue, since 2023, DDR4 has seen a steady decline in our share in our revenue share triggered by growing demand for DDR5 and HBM. In fact, its contribution has dropped from a double digit percentage last year to a single digit level this year. Going forward, we plan to phase out DDR4 for the mass market. However, for selected customers who require long term support, we'll continue our supply based on mutually agreed volume. Next question.\n\n**Moderator**\nThe following question will be presented by Peter Li from Citigroup. Please go ahead with your question.\n\n**Moderator**\nSo my question is about CapEx investment. You mentioned that this year's investment will exceed initial plans. So to what extent will it increase? And will most of the additional investment be allocated to equipment or infrastructure? We are pursuing investment for future growth in tandem with efforts to maintain financial soundness.\n\n**Moderator**\nThis year, our investment focus is on ensuring similar support for the supply volumes agreed upon with customers. At the same time, infrastructure investments such as M15X and the new fab in Yongin are underway to lay the foundation for long term growth. As mentioned earlier, we now have visibility into next year's HBM supply, which calls for proactive investment to ensure timely response. Accordingly, our total investment for this year will increase from the original plan, with the majority of the additional spending allocated to HBM related equipment. The final investment scale, however, will be confirmed once negotiations with major customers are concluded.\n\n**Moderator**\nSo we'll continue to comply with CapEx discipline while improving investment efficiency going forward. Next question. The following question will be presented by Ricky Seo from HSBC. Please go ahead with your question.\n\n**Moderator**\nSo a recent article suggests that M16 is already operating at full capacity with no additional capacity for production expansion. In that case, to what extent do you expect the new M15 fab to be utilized by the end of next year given the current investment level? And my second question is that as for the 1C nano DRAM ramp up, when will we be able to see the significant level of the expansion at least by 15% to 20%? So let me first answer the first part of your question regarding the new fab. As the ATVM market expands and demand increase, we have reallocated a significant portion of our capacity from general DRAM to HBM.\n\n**Moderator**\nIn this process, due to HBM's nature of requiring more capacity compared to general DRAM, the clean room space needed to produce the same output volume has increased substantially. So our existing fabs are currently being utilized for product mix optimization, technology migration and TSV line operations. At the same time to secure mid to long term production infrastructure, we are simultaneously developing the M15X, Yongin fab and advanced packaging fab in Indiana, The U. S. Among these, the M15X is scheduled to open in Q4 of this year and will begin full scale mass production next year.\n\n**Moderator**\nWe will primarily focus on next generation HBM products to meet rising customer demand. We plan to gradually ramp up capacity in line with the visibility that we gain on customer volume requirements throughout the next year. And also for your question that how much space can actually be utilized or space increase can be realized through the M15 Act at the end of next year. I understand your intention for the question, but I believe there will be no occasions where we will not be able to supply product because of restrictions. And also for the conversion into the MCA nano, I believe this conversion will begin from the second half of this year, but the full scale conversion will take place only in next year.\n\n**Moderator**\nRight now, we are in the process of establishing management plan for this. So we will share the details later. Next question?\n\n**Moderator**\nThe following question will be presented by Loho Kim from Hana Securities. Please go ahead with your question.\n\n**Moderator**\nSo the long term growth potential of the NAND market has slowed down compared to the past. Despite suppliers maintaining a conservative production stance, profitability has not shown significant improvement. How long do you expect this market condition to persist? So the slowdown in the NAND market today is mainly due to stagnant demand for consumer set devices as well as the fact that consumers transitioning to AI servers have yet to extend their investment into storage devices. However, we believe that the need for storage equipment investment will begin to surface in the not too distant future.\n\n**Moderator**\nAs HCM Director mentioned at the beginning of Q and A session, this is because AI users and the resulting volume of token generation is expected to grow at an astronomical pace far beyond what we can imagine today. And traditional data processing methods will not be able to handle this explosive surge in demand. That's why there is a growing attempt to offload AI inference data caching to ESSD and edge stats, we expect initial demand to materialize within the next two to three years. If this trend becomes a reality, ESSD will no longer remain as a mere storage device, but rather it will evolve into part of the compute cache and their roles and positions within the AI system will be changed. And we expect this will mark the beginning of significant demand growth in the NAND market. Next question.\n\n**Moderator**\nThe following question will be presented by Simon Wu from Bank of America.\n\n**Moderator**\nSo my question is about technologies for the next generation DRAM production. So when will they be introduced and what will be the timing for mass production and how they can contribute to improving efficiency for ACBM DRAM production? So while memory suppliers have thus far pursued the transition to finer process nodes, their efforts are now approaching the limits in terms of performance and capacity enhancement. And so in response, we are exploring the application of vertical gauge platforms and three d DRAM technologies based on breakthrough changes in architecture, materials and components as sub-ten meter 10 nanometer nodes. Breezy platform is a next generation memory technology that minimizes DRAM cell area and vertically structure the gate that function as a transistor switch, thereby dramatically enhancing area efficiency and power characteristics compared to existing architecture.\n\n**Moderator**\nAnd three d DRAM is another next generation memory technology that enables high density by vertically stacking DRAM cells without miniaturization. And in order for the second law school innovation to overcome current limitations and become the new industry standard, we are focusing on securing technological stability. However, as it will take time for such innovative approaches to become technologically stable and ready for mass production, so we'll continue to advance conventional miniaturization efforts such as 1D and M development to maintain our technological leadership. As you know, our competitive edge in ACBM comes from our strong foundational technology for DRAM. And therefore, if we could, so as we step by step develop the next generation memory technology, I believe this will also be the source of our future HVM production. Next question?\n\n**Moderator**\nThe following question will be presented by Young Min Ko from Dail Investment and Securities. Please go ahead with your question.\n\n**Moderator**\nSo there have been reports that a major GPU customer has resumed shipments of AI chips with performance that's just for the export to China. And I believe that this could also be beneficial for the future supply expansion and so on. So can you could this lead to an upside in HBM demand? So it was only recently reported that a major GPU customer has resumed shipment of AI product bound for export to China. We are currently in the process of assessing concrete information regarding how HBM demand will shift in relation to this product.\n\n**Moderator**\nHowever, as we were a primary HCM supplier for this product prior to the export control, we believe that if customer demand and our internal supply conditions are aligned, we are well positioned to respond swiftly and capitalize on this opportunity. And leveraging the close partnership that we have built with customers, we will do our best to generate win win outcome for both our customers and the company. This will be the final question.\n\n**Moderator**\nThe last question will be presented by Min Seok Chai from Korea Investment and Securities. Please go ahead with your question.\n\n**Moderator**\nCongratulations on your great performance. My question is back to HBM. SK Hynix has emerged as a leading HBM supplier backed by strong product technology and manufacturing capabilities. However, concerns continue to mount over intensifying competition and uncertainty due to changes in business environment with the AI semiconductor ecosystem. So as an ACBM leading supplier, what is your strategy moving forward to navigate these challenges?\n\n**Moderator**\nRight. So it is very natural to worry about intensifying competition, especially given the situation that the number of suppliers are growing. But I believe that as long as we are in the memory business, competition is something that we have to take. And I believe this is our mission to deliver great performance despite the fierce competition as well as provide great values to our customers and investors. So with the emergence of the ATBM product, I believe memory market has also shifted from the pure computing storage and we believe that this can also affect and as a result the leading suppliers now have greater leveraging powers.\n\n**Moderator**\nHBM influences over computing chips for AI, where HBM is directly employed as well as broader AI computing system performance and cost basis far greater than conventional general memory product. As a result, the demand for HBM has become very sticky and leading players now have greater advantage in having all the engagement with customers. SK Hynix despite its previous minimal presence in the HBM market, we have been able to grow as a leading player today and I believe this comes from our corporate culture. We put customer before anything else to address customer pain points in product design, production and supply. We are also backed up by strong teamwork.\n\n**Moderator**\nSuch competitive ads in corporate culture cannot easily be emulated or mimicked by others. Going forward, based on such solid corporate culture, we'll make sure SK Hynix will continue to stay top of mind of HBM customers. And we believe this is the way to secure and solidify our leadership in the future in the AI memory market. Due to various restrictions in AI computing infrastructure today, we are required to develop further granular HBM product as well as design new memory product. Through early engagement with customers, SK Hynix will continue to provide customized HBM products catering to the needs of customers in AI ecosystem and solidify our strong leadership in new memory products for AI, including PIM.\n\n**Moderator**\nThis will conclude the conference call for the SK Hynix for the second quarter of twenty twenty five. Thank you very",
      "fetched_at": "2026-02-04T15:55:46.205Z"
    },
    {
      "ticker": "000660.KS",
      "title": "SK hynix (000660.KS) Q1 FY2025 earnings call transcript",
      "published_date": "Apr 24, 2025, 9:00 AM GMT+9",
      "fiscal_year": "2025",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/000660.KS/earnings/000660.KS-Q1-2025-earnings_call-308850.html",
      "content": "**Park Seong-Hwan** (Head of Investor Relations)\nGood morning, afternoon, and evening. Thank you for joining the SK Hynix 2025 Q1 Earnings Release Conference Call. Today, SK hynix will first make their presentation, and then we'll have a Q&A session with the participants. If you have a question, please press the asterisk key and press one. Also, the company's business performance will be simultaneously interpreted, and the following Q&A session will be consecutively interpreted. Let us begin today's Earnings Release Conference Call. Good morning, afternoon, and evening. I'm Park Seong-hwan, Head of IR at SK hynix. Welcome to the SK Hynix 2025 Q1 Earnings Release Conference Call. Allow me to introduce the executives present here with me today. We are joined by CFO Kim Woohyun, Head of DRAM Marketing Kim Gyuhyun, Head of NAND Marketing Kim Seok, and Head of HBM Sales and Marketing Kim Kitae.\n\n**Park Seong-Hwan** (Head of Investor Relations)\nLet me issue a disclaimer that all outlooks presented by the company are subject to change depending on the macroeconomic and market circumstances. With that, we will now begin SK Hynix Earnings Release Conference Call for the Q1 of 2025. CFO Kim Woohyun will present the earnings, which will be followed by the company's future plans and market outlook, and a Q&A session with the attending executives.\n\n**Woo Hyun Kim** (CFO)\nGood morning, everyone. I'm Kim Woohyun, CFO at SK hynix. Allow me to first introduce the company's performance for the Q4 of 2025. Despite the expected seasonal demand weakness and customer inventory digestion, the memory market improved faster than anticipated, driven by Chinese subsidies for consumer electronics, intensified by intensified AI development competition, and some restocking demand. Amidst weak seasonality, we recorded KRW 17.6 trillion in revenue, marking our second highest quarterly revenue following the last quarter's all-time high.\n\n**Woo Hyun Kim** (CFO)\nThis represents an 11% sequential decrease but a 42% increase year-on-year. Starting with DRAM, bit shipments exceeded guidance with a sequential decrease of high single-digit % due to strong sales of high-value-added products such as HBM3E and DDR5, as well as higher-than-expected sales for PCs and Smartphones. ASP remained flat despite a decrease in conventional DRAM pricing thanks to expanded high-value product sales. HBM sales, in particular, continued growth with the expansion of HBM3E high products as planned. NAND saw some price increase in the spot market due to production cuts in the industry, but demand recovery was relatively weaker than DRAM. Our shipments declined 19% compared to the previous quarter as planned, and ASP dropped about 20%, mainly due to increased sales of discrete products driven by customer inventory restocking.\n\n**Woo Hyun Kim** (CFO)\nOur Q1 operating profit was KRW 7.44 trillion, the second highest following the KRW 8.08 trillion recorded last quarter. Operating margin improved by 1 percentage point sequentially to 42% despite a decrease in revenue. We believe the improvement in operating margin during a market correction proves not only the structural transformation of the memory business due to AI but also our strengthened competitiveness. We will continue our efforts to improve business fundamentals to deliver differentiated results even during down cycles in the memory market. Depreciation and amortization expenses for Q1 slightly increased from that of last quarter to KRW 3.33 trillion. EBITDA stood at KRW 10.77 trillion with EBITDA margin of 61%. Non-operating gain net of loss reached KRW 1.86 trillion.\n\n**Woo Hyun Kim** (CFO)\nNotable items include foreign currency-related net gain of KRW 0.12 trillion due to strong US dollar against Korean Won and KRW 1.74 trillion in other non-operating income such as valuation gains from investment in KIOXIA. Pre-tax income was KRW 9.3 trillion, and net profit was KRW 8.11 trillion with a net profit margin of 46%. In Q1, we completed the second closing of the Solidigm acquisition and paid the remaining balance of $2 billion.\n\n**Woo Hyun Kim** (CFO)\nCash and cash equivalents, including short-term investments at the end of Q1, were KRW 14.3 trillion, up KRW 0.2 trillion from the previous quarter. Interest-bearing debt rose by KRW 0.6 trillion to KRW 23.3 trillion, and net debt increased by KRW 0.5 trillion to KRW 9 trillion. Consequently, our debt-to-equity and net debt-to-equity ratios improved slightly QOQ to 29% and 11%, respectively. Next, the company's market outlook and plan.\n\n**Woo Hyun Kim** (CFO)\nAlthough we initially expected the memory market to recover towards the second half of the year, heightened global certainties such as tariff policies have increased volatility in the second half demand projections. We will maintain close communication with customers and strengthen cooperation across the supply chain to meet customers' needs seamlessly amid this evolving environment. Looking at demand by application, we maintain our previous outlook on PC demand that the demand will be driven by replacement of PCs following Windows 10 end-of-support and the ramp-up of AI PCs. In smartphones, demand for high-performance memory is expected to continue with the adoption of AI models like small LLMs. Upcoming smartphone launches with enhanced AI features are expected to drive replacement demand, further increasing demand for high-performance mobile DRAM such as LPDDR5X and LPDDR5T.\n\n**Woo Hyun Kim** (CFO)\nIn Q1, both PC and smartphone segments saw some demand recovery due to China's subsidy program, and customer inventories are decreasing. While supply side remains tighter than expected, we have some preemptive purchases due to ongoing market uncertainties. Server market demand is accelerating as big tech companies race to develop high-performance AI training and inference models. These companies are actively releasing new AI models and agents, highlighting their commitment to investing in AI infrastructure.\n\n**Woo Hyun Kim** (CFO)\nAs a result, demand volatility in the server market is expected to be relatively limited. The release of efficient open-source AI models like DeepSeek earlier this year has lowered entry barriers, allowing more companies and research centers to participate in the ecosystem. This is expected to stimulate demand for AI servers further. Additionally, many countries are building AI infrastructure at national level, which should positively impact long-term demand for AI memory.\n\n**Woo Hyun Kim** (CFO)\nMeanwhile, in NAND, while AI impact has been relatively limited, market recovery this year is expected to be fueled more from supply-side factors. While demand remains somewhat muted, NAND suppliers are adopting conservative investment strategies and even production cuts for certain products, which will continue affecting the market positively throughout the year. In the mid to long term, enterprise SSDs are expected to lead NAND demand growth. Some big tech companies are considering replacing traditional HDDs with QLC-based enterprise SSDs for certain workloads. When we see more meaningful progress in these efforts, the shift will become a significant growth driver for the NAND market. Now, I will discuss the company's plans for this year. Although market uncertainties are heightening, we currently anticipate a low 10% sequential increase in DRAM shipments and over 20% growth in NAND shipments in the Q2.\n\n**Woo Hyun Kim** (CFO)\nHBM demand, which is contracted a year in advance with customers, is expected to roughly double from that of last year, as previously forecasted. The transition to HBM3E 12-high is progressing smoothly, and more than half of our total HBM3E shipments in Q2 will be 12-high products as planned. Due to the strong product competitiveness of our HBM3E 12-high product, customer demand remains robust. We are optimizing product mix of our existing fabs and reallocating resources to ensure a stable supply of HBM that meets customer needs. In March, we shipped samples of HBM4, the mainstream product for 2026, to major customers for the first time in the world and reaffirmed our technological leadership. We plan to complete mass production preparation for HBM4 12-high within the year and will maintain our leadership in next-gen HBM markets.\n\n**Woo Hyun Kim** (CFO)\nWe also began shipping LPCAMM2 High-performance Memory Module for AI PCs to certain PC customers in Q1. For SOCAMM, low-power DRAM module for AI servers, we are preparing for timely supply of the product through close cooperation with customers. In NAND, while there are positive signs like rising spot prices and declining customer inventories, global uncertainties make it difficult to determine whether the recovery will be sustained. We will continue to focus on profit-oriented operational decisions and maintain a prudent approach to CapEx spending. Constructions for the first FAB in Yongin and M15X are progressing as planned. The Yongin FAB broke ground in Q1 and is targeting completion by Q2 2027, while M15X is scheduled to open in Q4 this year. Our strategy remains to prepare for future growth while maintaining flexibility in FAB utilization based on market conditions.\n\n**Woo Hyun Kim** (CFO)\nGiven today's uncertain environment, we will continue to focus our spending on value-added products with high visibility, as we have previously emphasized, and also enhance investment efficiency even more than what we have done. Going forward, as an AI memory leader, we will actively cooperate with partners, continuously overcome technological limitations, and maintain industry-leading product competitiveness so that we can continue our profit growth. Thank you. With that, we are in.\n\n**Operator**\n지금부터 질의응답을 시작하겠습니다. 질문을 하실 분은 전화기 버튼의 별표와 1번을 누르시기 바랍니다. 질문을 취소하시려면 별표와 2번을 누르시면 됩니다. Now Q&A session will begin. Please press star one, that is star and one, if you have any questions. Questions will be taken according to the order you have pressed the number star one. For cancellation, please press star two, that is star and two on your phone. 처음으로 질문해 주실 분은 메리츠증권의 김선우 님입니다. The first question will be provided by Sunwoo Kim from Meritz Securities. Please go ahead with your question.\n\n**Sunwoo Kim** (Senior Analyst)\n예, 안녕하세요. 메리츠의 김선우입니다. 저는 관세 관련해서 질문 좀 드리고 싶습니다. 최근 미국의 관세 정책으로 인해서 경영 환경의 불확실성이 나날이 커지는 것 같은 그런 느낌입니다. 추이를 좀 더 지켜봐야겠지만, 관세 영향에 따라서 회사 측에서는 올해 메모리 수요 그리고 시황은 어떻게 변화할 것으로 보시는지 말씀 좀 부탁드리겠습니다. 감사합니다. Sir, I'm Kim Sunwoo from Meritz Securities. I do have a question regarding US tariff policy. With the US tariff policy, it seems the uncertainty in the business environment is growing. While we still need to keep an eye on how things are unfolding, how do you currently expect memory demand to change this year as a result of this tariff impact?\n\n**Woo Hyun Kim** (CFO)\n네, 질문 감사드립니다. 일부 국가 간 상호 관세 조치가 유예 중입니다만, 반도체 품목에 대한 관세 부과 가능성도 제기되고 있습니다. 따라서 현 시점에서는 관세 정책 방향과 이에 대한 영향을 예측하기에는 불확실성이 커서 구체적인 답변을 드리기 어렵다는 점을 먼저 양해 부탁드립니다. While reservoir goal tariff measures between some countries are currently suspended, there are growing concerns that tariffs can be applied to semiconductor products. Given the high level of uncertainty surrounding tariff policy direction and its potential impact, we kindly ask for your understanding that it is difficult to provide a definitive answer at this point of time.\n\n**Woo Hyun Kim** (CFO)\n당사가 공급 관련해서 고객과 논의 중인 상황에 대해 설명을 드리자면, 글로벌 고객들은 전반적으로 당사와 협의 중이던 메모리 수요를 변함없이 유지하고 있습니다. 또한 일부 고객들은 단기적인 공급 풀이를 요청하면서 수요를 앞당기는 움직임도 있습니다. To share our current ongoing discussions with customers regarding supplies, global customers are generally maintaining their planned memory demand as previously discussed with us. In fact, some customers are even requesting short-term supply pull-ins to expedite their demand.\n\n**Woo Hyun Kim** (CFO)\nPC 그리고 스마트폰과 같은 IT 소비재들은 당분간 관세 적용이 유예되면서 올해 AI 기능을 탑재한 신제품 출시 효과를 기대하고 있습니다. 또한 최종 소비자 입장에서는 가격 인상 전에 구매를 서두를 가능성도 있는 만큼 오히려 교체 수요를 촉진할 수도 있지 않을까 생각하고 있습니다. For IT consumer goods such as PC and smartphones, tariffs are temporarily on hold for now. We are anticipating the positive impact of new product launches this year that feature AI functionalities. Additionally, from the perspective of end customers, there is a possibility that some of them may rush purchases before price increase, which could in turn stimulate replacement demand.\n\n**Woo Hyun Kim** (CFO)\nAI 서버는 상대적으로 관세로 인한 수요 영향이 제한적일 것으로 보고 있고요. 당사는 고객과의 협력을 바탕으로 영향을 최소화하는 방향으로 대응할 계획입니다. As for AI servers, we expect the impact of tariffs on demand to be relatively limited. We plan to respond in close cooperation with our customers to minimize potential disruption.네, 다음 질문해 주십시오.\n\n**Operator**\nNext question. 다음으로 질문해 주실 분은 Bank of America의 Simon Wu님입니다. The following question will be presented by Simon Wu from Bank of America. Please go ahead with your question.\n\n**Simon Wu** (Director of Hedge Fund Credit)\n예, 질문 기회 감사드립니다. 제 질문은 올해 HBM 수요와 공급 계획에 대해 변화가 있으신가입니다. 제 질문의 배경은 많이 보셨겠지만 주요 고객의 어떤 제품 출시, 그다음에 로드맵 변경에 대한 논의가 계속되고 일부 제품의 GPU 중국 수출 제재에 따라 HBM 수요도 영향이 있을 것이라는 우려가 있어서입니다. 감사합니다. My question is about the changes in HBM demand and supply plans. As you know, there is ongoing speculation about the potential changes in the roadmap of major customers, and given export restrictions of certain GPU products to China, HBM product demand can also be affected. From your perspective, do you anticipate any changes in this year's HBM demand and supply plans?\n\n**Woo Hyun Kim** (CFO)\n네, 질문에 답변드리도록 하겠습니다. 최근 미국의 관세 정책 변화와 규제로 인해 메모리를 포함한 반도체와 이런 반도체를 사용하는 응용 제품의 수요에 대한 불확실성도 높아진 상황입니다. Due to recent changes in U.S. tariff policies and regulations, uncertainties have increased surrounding the demand for semiconductors, including memory, as well as semiconductor-based application products. 따라서 고객과 어느 때보다 긴밀하게 소통하며 시장 변화를 반영하고 있습니다. 이에 당사의 HBM 사업에 대해서 분명하게 말씀드릴 수 있는 부분은 올해 주요 고객 향후의 판매 계획은 기존 체결한 계약 수준에서 변동이 없다는 점을 말씀드리고 싶습니다. Accordingly, we are engaging in closer communication with customers than ever before to stay aligned with market changes. Regarding our HBM business, one thing that we can state clearly is that our sales plan for major customers this year remains unchanged from the levels agreed upon in existing contracts.\n\n**Woo Hyun Kim** (CFO)\n자사는 프라이머리 HBM 벤더로서 최선단 HBM3E, 12단 제품을 포함한 HBM 전 제품 라인업을 공급 중에 있으며, 고객 수요 변화에 유연하게 대응할 수 있는 내부 양산 캐파를 운영하고 있습니다. As the primary HBM vendor, we are supplying a full lineup of HBM products, including the most cutting-edge HBM3E 12-high. Additionally, we maintain internally max production capacity that allows us to flexibly respond to changes in customer demand.\n\n**Woo Hyun Kim** (CFO)\n올해 당사의 HBM 매출은 전년 대비 2배 이상 성장한다는 기존 계획을 유지하고 있으며, 올해의 HBM3E 매출의 대부분을 차지하는 12단 제품도 2분기에 HBM3E의 절반 이상이 된다는 기존 계획에 변함은 없습니다. Our plan to more than double our HBM revenue year-on-year remains unchanged. Furthermore, there is also no change in our initial plan for HBM3E that this 12-high product, which constitutes the majority of this year's HBM3E revenue, will account for over half of the HBM3E sales in the Q2. 네, 다음 질문해 주십시오. Next question, please.\n\n**Operator**\n다음으로 질문해 주실 분은 시티그룹의 이세철 님입니다. The following question will be presented by Peter Lee from Citigroup. Please go ahead with your question.\n\n**Peter Lee** (Head of Fixed Income Discretionary Portfolio Management)\n네, 안녕하세요. 시티그룹 이세철입니다. 1분기 좋은 실적 축하드립니다. 저는 고용량 서버 DRAM 수요 관련 질문 드리겠는데요. 앞에서도 조금 말씀하셨는데 최근 딥시크 이후에 여러 가지 변화가 있는데 사실 시장에서는 조금 우려가 좀 많이 있었거든요. 근데 시장 예상과 달리 96 GB 같은 고용량 서버 DRAM 수요가 늘고 있는데요. 그 이유와 향후 전망에 대해서 설명 부탁드리겠습니다. 감사합니다. So, I'm Peter Lee from Citigroup. First of all, congratulations on your excellent Q1 performance. My question is about the high-capacity server DRAMs. Due to DeepSeek impact, demand for high-capacity server DRAMs is increasing, such as 96 GB models. Can you explain the reasons behind this trend and what your outlook for the future is?\n\n**Woo Hyun Kim** (CFO)\n네, 질문 감사드립니다. 딥시크는 MLA를 통해서 AI 모델 개발 비용을 획기적으로 절감할 수 있었고, 이에 동일 성능의 AI를 더 적은 하드웨어 자원으로 구현할 수 있게 만들었습니다. 이는 AI 개발 시장의 진입 장벽을 크게 낮추는 효과를 가져온 것으로 보입니다. DeepSeek utilizes multi-head latent attention, or MLA, which significantly reduces AI model development costs and enables the development of AI with the same performance with much fewer hardware resources. This has significantly lowered barriers to entry for AI development. 개발 비용이 저렴해지면서 AI 개발 시도가 급격히 증가했고, 이 과정에서 HBM뿐만 아니라 고용량 서버 DIM 수요도 크게 확대되고 있는 상황입니다. With development costs decreasing, initiatives for AI development have surged, which has led to a sharp increase in demand, not only for HBM but also for high-capacity server DIMs.\n\n**Woo Hyun Kim** (CFO)\n1분기 동안 당사도 DDR5 기반 96 GB 모듈 수요 증가를 경험했고요. 올해 지속적으로 AI 모델 개발과 추론량 수요를 위한 고용량 DIM 수요는 증가할 것으로 보입니다. During the Q1, we also experienced rising demand for DDR5-based 96 GB models, and this year we anticipate continued growth in demand for high-capacity DIMs for AI model development and inference workloads. 추가적으로 오픈AI의 O3나 딥시크의 R1과 같은 이러한 리즈닝 AI 모델들은 더 정확한 결과를 위해서 추론 과정을 길게 수용하는 방식을 채택하고 있어서 더 많은 메모리를 필요로 할 것으로 보입니다. Additionally, reasoning AI models such as OpenAI's O3 and Deepseek's R1 extend inference processing time to achieve greater accuracy, which requires more memory.\n\n**Woo Hyun Kim** (CFO)\n이렇게 AI 모델들이 더 정교한 결과를 제공하기 위해 더 많은 하드웨어 자원을 필요로 하면서 AI 시장의 중심이 모델 훈련에서 추론 중심으로 확장되고 있습니다. 이 또한 추가적인 고용량 메모리 수요를 창출하는 요인으로 볼 수 있을 것 같습니다. As AI models require more hardware resources to deliver more precise results, the AI market is transitioning from model training to inference-focused approach, which creates additional demand for high-capacity memory.\n\n**Woo Hyun Kim** (CFO)\n고품질 추론 서비스를 위해서는 지속적인 모델 훈련도 필요하기 때문에 이러한 흐름 속에서 고용량 서버 인프라 확대는 필연적으로 보입니다. 당사는 고용량 서버가 중장기 서버 수요의 핵심이 될 것으로 보고 있습니다. To ensure high-quality inference services, continuous model training will be needed, which will inevitably lead to the expansion of high-capacity server infrastructure. In this light, we believe high-capacity servers will be a key driver for mid- to long-term server demand.\n\n**Woo Hyun Kim** (CFO)\n딥시크의 기폭제가 되어 AI 개발 저변이 확대된 영향을 고려한다고 하면 앞으로 AI 개발 및 응용이 점차 확대될 것으로 보이고 장기적인 AI 서버 수요 성장과 이에 따른 메모리 수요를 견인할 것으로 예상됩니다. DeepSeek has acted as a catalyst to broaden the foundation for AI Development. As a result, AI Development and Applications are expected to expand further, which will drive long-term growth in AI server demand and increasing memory demand. 네, 감사합니다. 다음 질문해 주십시오. Next question.\n\n**Operator**\nYour question. Yes, hello. This is Young Ho Ryu from NH Investment and Securities. The following question will be presented by Young Ho Ryu from NH Investment and Securities. Please go ahead with your quesiton.\n\n**Young Ho Ryu** (Senior Industry Analyst)\nThank you for giving me the opportunity to ask a question. I also would like to ask about tariffs. First, I am curious about what portion of SK hynix sales is directly exported to the U.S. Also, as you mentioned earlier, although there is still a lot of uncertainty and many things have not been decided yet, I would like to know, as of now, to what extent tariffs have impacted the business and if you could share your future response strategies, I would appreciate it. Young Ho Ryu from NH Investment and Securities. I do have a question regarding tariffs. What portions of sales in SK hynix is directly exported to the U.S.? Although you previously mentioned uncertainty still persists and nothing has been determined and finalized yet, and therefore how significant do you expect the business impact from tariff to be and what's your strategy for responding to this?\n\n**Woo Hyun Kim** (CFO)\n네, 답변 드리겠습니다. 저희 회사의 어떤 높은 AI형 매출 비중을 감안하면 미국 고객형 매출 비중은 감사 보고서에 나와 있는 법인 소재지 기준으로는 약 60%로 높은 상황입니다. Taking into account that AI-related products represent a high proportion of our sales, the percentage of revenue from US customers is quite significant, approximately 60% based on the corporate locations stated in our audit report.\n\n**Woo Hyun Kim** (CFO)\n다만 알고 계시겠지만 관세 부과 기준은 미국으로 선적되는 물량에 적용되기 때문에 실제 본사를 미국에 두고 있는 고객이라 하더라도 메모리 제품의 선적은 미국 외 지역으로 진행되는 경우가 많아서 미국에 직접 수출되는 비중은 그리 높은 편은 아닙니다. However, as you know, tariffs are imposed on shipments sent to the U.S., and sometimes even customers headquartered in the U.S., their memory product shipments often go to locations outside the United States. Therefore, the actual percentage of direct export to the U.S. is not that high.\n\n**Woo Hyun Kim** (CFO)\n복잡한 어떤 글로벌 반도체 서플라이 체인의 특성상 명확한 어떤 영향도를 산출하기 위해서는 관세 기준과 방법 등의 어떤 정책의 세부 사항이 필요한 만큼 현재로서는 정확한 영향을 산출하기에는 제약이 있습니다. Given the complexity of the Global Semiconductor Supply Chain, detailed information such as tariff criteria or the methods are required to precisely assess the impact. Therefore, it is difficult to assess the impact accurately at this point of time.\n\n**Woo Hyun Kim** (CFO)\n향후 관세가 발효되는 시점에 고객과 협의해서 고객 공급 안정성을 최대한 유지할 수 있도록 대응할 생각입니다. In the future, around the time when the tariff becomes effective, we'll talk and collaborate with customers to ensure the most stable supply possible. 네, 답변 감사합니다. 다음 질문해 주십시오. Next question.\n\n**Operator**\n다음으로 질문해 주실 분은 골드만삭스 증권의 이준희 님입니다. The following question will be presented by Jin Yong Lee from Goldman Sachs Securities. Please go ahead with your question.\n\n**Jin Yong Lee** (VP of Equity Lifecycle Middle Office)\n네, 좋은 실적 축하드립니다. 저는 수요 풀림 및 재고 조정 관련돼서 질문이 있는데요. 워낙 유동적인 상황이라는 건 이해하지만 혹시 좋았던 1분기 실적과 견조한 2분기 가이던스의 수요 풀림 영향이 얼마나 된다고 보시는지 말씀해 주실 수 있으면 감사하겠습니다. 그리고 이와 관련 특히 고객 재고 조정 리스크가 궁금한데요. 상반기에 수요가 풀림되어서 고객 재고가 늘어나면 하반기에는 또다시 고객 재고 조정으로 구매 수요가 둔화될 가능성은 없을지 궁금합니다. 감사합니다.\n\n**Jin Yong Lee** (VP of Equity Lifecycle Middle Office)\nI'm Jin Yong Lee from Goldman Sachs Securities. I do have a question regarding the demand pooling and its impact, as well as the inventory adjustment. How much impact did tariff-related pooling demand have on Q1 performance and Q2 guidance? If demand is pooled in during the first half of the year, this will lead to increased customer inventory. Is there a risk that demand will decline in the second half due to inventory adjustment at the customer side?\n\n**Woo Hyun Kim** (CFO)\n네, 질문 감사합니다. 1분기 중에는 아직 관세 정책이 구체화되기 전이었던 만큼 일부 고객의 풀림 수요가 포함은 되어 있겠지만 그 비중은 그리 크지 않았던 것으로 보입니다. In Q1, tariff policies were not finalized. As a result, while some pool-in demand from customers may be reflected in the results, it did not come in a significant way, and the impact was relatively limited.\n\n**Woo Hyun Kim** (CFO)\n당사 1분기 DRAM 투자량이 기존 계획을 상회한 수준이 그리 크지 않고, 또한 모바일과 PC 등 클라이언트 제품에 국한되어 있고 고객들의 재고 수준도 유의미한 변화는 없는 것으로 파악하고 있습니다. Our Q1 DRAM shipment exceeded original projection but not by a significant margin, and the increase was mostly limited to client products such as Mobile and PC. In addition, we understand that customer inventory levels did not show significant changes either.\n\n**Woo Hyun Kim** (CFO)\n2분기의 경우를 보면 여전히 국가별 관세와 관세 부과 대상 등 세부 내용이 아직 정해지지 않은 상황이고, 또한 고객들 역시 수요에 대한 가식성이 낮기 때문에 풀인 수요의 규모가 재고 조정을 우려할 만큼 크게 증가할 것으로 보기는 좀 어려울 것 같습니다. In Q2, key details such as country-specific tariffs and the scope of items subject to tariff, they are still not yet finalized, which means customers will continue to have limited visibility into their demand. Therefore, it is unlikely that pool-in demand will increase significantly to a level that would trigger concerns about inventory adjustment.\n\n**Woo Hyun Kim** (CFO)\n공급업체 역시 시장의 불확실성을 반영해서 투자와 생산 운영을 할 것으로 보이기 때문에 팬데믹 때와 같은 급격한 구매 수요의 조정이 올해 하반기에 발생할 가능성은 낮다고 보고 있습니다. In addition, suppliers are also expected to reflect market uncertainties in their investment and production operations, which suggests that a drastic demand adjustment like the one that we saw during the pandemic is unlikely to occur in the second half of the year. 네, 답변만 해 주십시오. Next question.\n\n**Operator**\n다음으로 질문해 주실 분은 UBS의 Nicholas Godiwalla 님입니다. The following question will be presented by Nicolas Gaudois from UBS. Please go ahead with your question.\n\n**Nicolas Gaudois** (Managing Director of Equity Research)\nYes, good morning. Thanks for taking my question. It seems to us that you may actually have recently decided to up your CapEx budget for 2025 and 2026 with a slight pooling in schedule for equipment delivery for M15X within Q4, as you suggested in the call. Could you confirm this and clarify rationally how does this factor in, in particular, the current uncertainty around tariffs? Where would that put your total CapEx in 2025? Dietarily, where would you be going into 2026? Thank you.\n\n**Nicolas Gaudois** (Managing Director of Equity Research)\n예, 안녕하십니까. 최근에 SK하이닉스가 M15X 스케줄을 풀인하자는 계획과 함께 2025년, 2026년 설비 투자를 확대하기로 결정을 한 것 같은데 이 내용이 맞는지 확인해 주실 수 있을지요? 그리고 왜 이런 결정을 하셨는지 설명해 주시면 좋겠습니다. 특히 관세를 둘러싼 현재의 불확실성이 어떻게 반영이 되는지, 그리고 이러한 투자로 말미암아서 2025년 총 설비 투자 규모와 또 내년도의 방향이 어떻게 되는지 말씀 부탁드립니다.\n\n**Woo Hyun Kim** (CFO)\n예, 질문 주셔서 감사합니다. 답변 드리겠습니다. 저희 회사는 CapEx 디스플레인을 준수하면서 수익성이 확보된 제품에 한해서 우선적으로 투자를 집행하고 있습니다. 최근 관세 정책과 수출 규제 등 보험 의혹 주의가 확산되며 그 어느 때보다 향후 시장을 예측하기에는 어려운 상황입니다. Thank you for the question. Our company adheres to CapEx discipline, prioritizing investment only in products with secured profitability. With the expansion of protectionist policies such as tariff regulations and export restrictions, it has become more challenging than ever before to predict future market conditions.\n\n**Woo Hyun Kim** (CFO)\n이러한 불확실성에 대비해서 당사는 올해 신중하지만 유연한 투자 기조를 유지할 계획입니다. 시장 수요 대응을 위한 필수 투자를 우선하면서 선두 기술 경쟁력이 적기 사업화될 수 있도록 펩 등의 미래 인프라 투자 위주로 추진하면서 올해 전체 투자비는 전년 대비 다소 증가하는 기존 투자 방향성을 유지할 계획입니다. To mitigate these uncertainties, we plan to maintain a cautious yet flexible investment approach this year. While prioritizing essential investments to meet market demand, we'll focus on future infrastructure investments such as fabs to ensure that our technology leadership and competitiveness can be monetized at the right time.\n\n**Woo Hyun Kim** (CFO)\nOur overall investment this year will see a slight increase compared to last year, which is in line with our existing investment direction. 불확실성이 높은 어떤 대외 환경에서 안정적인 사업 운영을 영위할 수 있도록 저희 회사는 기존 펩의 제품 믹스 최적화와 그리고 저수요 저수익 제품과 관련된 어떤 자원의 재분배 등 투자 효율성을 강화하는 동시에 지속적인 차입금 축소 및 현금 보유 수준의 확대 등 재무 건전성을 강화해 나갈 방침입니다. In order to ensure stable business operation in the midst of a highly uncertain external environment, we will optimize product mix for existing fabs, reallocating resources away from low-demand and low-profitability products to enhance investment efficiency and strengthening financial soundness through continuous debt reduction and increased cash reserves. 네, 다음 질문해 주십시오. Next question, please.\n\n**Operator**\n다음으로 질문해 주실 분은 한국투자증권의 최민숙 님입니다. The following question will be presented by Minseok Kim from Korea Investment and Securities. Please go ahead with your question.\n\n**Minseok Kim** (Manager)\n안녕하세요. 한국투자증권 최민숙입니다. 저도 앞선 질문과 좀 유사한데요. 최근에 낸드 현물가가 반등하고는 있지만 일각에서는 이 같은 현물가 반등이 고객의 일시적인 재고 축적 수요 때문이 아닌가 하는 우려를 제기하고 있습니다. 낸드 가격 상승세와 수요의 회복세가 향후 계속 지속될 수 있을 것으로 보시는지 회사의 전망을 공유해 주시면 감사하겠습니다. My question is similar to the previous question, but it is NAND spot prices have rebounded, and some believe that such increase in spot price comes from the customer demand for temporary investment build-up increase. Do you think NAND price recovery and demand growth will continue?\n\n**Woo Hyun Kim** (CFO)\n네, 최민숙 연구위원님 질문 감사드립니다. 1분기 낸드 시장은 전형적인 계절적인 비수기로 주요 어플리케이션 수요는 저조했지만 일부 채널형이나 단품 위주로는 재고 감소와 관세 정책을 고려한 선구매 움직임이 있었습니다. 또한 공급업체의 감산 기조가 겹쳐서 현물 시장 중심으로 가격이 상승세를 보였습니다. Thank you for the question. In Q1, demand in the NAND market for major applications remained weak due to seasonal factors. However, there were signs of preemptive purchasing, particularly for some channels and discrete products, mainly driven by tariff considerations and potential inventory reductions. Coupled with suppliers' production cutbacks, this resulted in a price increase, especially in the spot market. In the case of Q2, following the announcement of tariff policies, uncertainties have increased.\n\n**Woo Hyun Kim** (CFO)\nThe increase in purchasing for discrete products in Q1, as well as uncertainties around the recovery of demand for major applications, have both risen. However, NAND suppliers have already maintained a conservative production stance since the second half of last year, so the pressure for price declines has relatively eased. Having said that, NAND suppliers have maintained a conservative production stance since the second half of last year, which has helped ease downward pressure on prices.\n\n**Woo Hyun Kim** (CFO)\n예, 낸드의 가격 회복 흐름은 공급사들의 감산 기조와 낸드의 고용량화 수요가 맞물리면서 단기적으로는 이어질 가능성은 높다고 판단됩니다. With the combination of production cuts by suppliers and increasing demand for higher capacity, the price recovery trend is likely to continue in the short term. SAT 수요 회복세는 최근 매크로 불확실성 해소 여부에 따라 달라질 수 있으나 중장기적으로는 엔터프라이즈 SSD 고용량화 추세가 이어지며 낸드 수요 성장세는 긍정적으로 보고 있습니다. While the pace of recovery in SAT demand will depend on how macroeconomic uncertainties unfold, the mid to long-term trend toward higher capacity enterprise SSD is expected to continue. Therefore, we believe NAND demand will continue to grow. 네, 다음 질문해 주십시오. Next question, please.\n\n**Operator**\n다음으로 질문해 주실 분은 HSBC의 리키 서 님입니다. The following question will be presented by Ricky Seo from HSBC. Please go ahead with your question.\n\n**Ricky Seo** (Analyst)\n예, 질문 기회 주셔서 감사합니다. 2026년 HBM 수요 관련해서 질문 드리겠습니다. 최근에 출원 모델이 증가하면서 전반적인 수요가 증가할 거라 하는 보급이 확대되면서 증가할 거라 하는 견해하고 내년도 HBM4 채용량의 컨텐츠 그로스가 예상보다 좀 많이 올라가지 않아서 수요가 좀 둔화될 수 있을 거라는 견해가 있는데 우리 하이닉스에서 보시는 내년도 수요 전망은 어떻게 되시는지하고 그다음에 내년도 공급 계약 관련해서 어떤 지적 현황이라든가 이런 게 좀 업데이트할 게 있으시면 공유해 주시면 감사하겠습니다. 이상입니다. We have a question regarding the HBM market demand. Regarding the HBM market in 2026, there are mixed views. Some believe demand will grow due to inference AI, while others are concerned that slowdown in HBM adoption will hinder growth. What is SK hynix's outlook on the HBM market in 2026, and how is the progress of your supply and contracting? Are there any things that you can update?\n\n**Woo Hyun Kim** (CFO)\n답변 드리도록 하겠습니다. 올해 초 발표된 DeepSeek는 효율적인 AI 모델을 사용해 다양한 산업에서 AI 서비스가 접목된다면 AI 사업이 기존 전망을 뛰어넘는 성장 잠재력을 가지고 있음을 보여주었습니다. The DeepSeek announced early this year demonstrated that if AI services are incorporated into various industries using an efficient AI model, it will have the potential to grow beyond existing forecasts and expectations.\n\n**Woo Hyun Kim** (CFO)\n주로 불확실성이 있겠으나 지금까지 글로벌 기업들의 AI 인프라 투자 확대 기조가 유지되고 있고 기업뿐 아니라 국가별 자체적인 AI 생태계 구축 노력도 증가하고 있어서 HBM의 장기 수요 성장에 대해서는 의심의 여지가 없다고 보고 있습니다. While uncertainties will persist going forward, global enterprises continue to expand investment in AI infrastructure. Not only enterprises but even governments are actively working to build their own AI Ecosystems. This has led us to believe, with no doubt, that HBM will continue to experience strong long-term demand growth.\n\n**Woo Hyun Kim** (CFO)\n현재 우리 회사는 수요 가시성을 기반으로 24년에서 28년까지 연평균 약 50% 수준의 HBM 수요 성장을 전망하고 있습니다. Based on demand visibility, we currently anticipate an average HBM growth rate of approximately 50% per year between 2024 and 2028. 특히 내년은 HBM4가 주력 제품이 될 것으로 예상되는데 HBM4는 기존 제품 대비해서 IO 수가 2배 늘어나면서 밴드위스 개선 효과가 크기 때문에 이에 대한 지속적인 수요 증가가 예상되고 있습니다. Next year, HBM4 is expected to be our flagship product as the number of IO channels for HBM4 will double compared to the previous model. HBM4 will significantly enhance bandwidth efficiency and therefore they are expected to drive sustainable demand growth.\n\n**Woo Hyun Kim** (CFO)\n2026년 공급 물량에 대해서는 기존 계획대로 주요 고객과 상반기 내 연간 물량에 대한 가시성을 확보할 계획이며 이후 다른 고객과 협의도 마무리하려고 하고 있습니다. As for 2026 supply volume, we plan to secure visibility for our annual supply volume with major customers within the first half of the year in line with our existing plan. We will also finalize agreements with other customers thereafter.\n\n**Ricky Seo** (Analyst)\n네, 답변 감사합니다. 다음 질문해 주십시오. Thank you for the answer.\n\n**Operator**\nNext question, please. 다음으로 질문해 주실 분은 SK증권의 한동희 님입니다. The following question will be presented by Daehoon Han from SK Securities. Please go ahead with your question.\n\n**Daehoon Han** (Analyst)\n네, 안녕하세요. SK증권 한동희입니다. 저는 수익성에 대한 질문 드리고 싶은데요. 이번 1분기 매출액 감소에도 불구하고 수익성은 더 개선되었는데 그 배경이 뭔지, 그리고 제품별 수익성에 대해서 조금 더 구체적으로 설명 부탁드립니다. 감사합니다. So I have a question regarding profit and profitability. Despite a decline in revenue during Q1, your margin improved. Can you please elaborate on the background and provide more details on product-level profitability?\n\n**Woo Hyun Kim** (CFO)\n네, 답변 드리도록 하겠습니다. 계절적 비수기 영향으로 판매량 감소와 낸드의 가격 하락으로 매출이 감소하며 영업이익 규모도 전 분기 대비 소폭 줄었지만 수익성이 높은 D램의 영업이익률이 소폭 개선되고 매출 비중이 전 분기 74%에서 이번 분기에 80%로 확대되면서 전사 영업이익률도 전 분기 대비 개선되었습니다. Seasonal weakness led to a decline in sales volume, and falling NAND prices reduced revenue. Operating profit also saw a slight decrease compared to the previous quarter. However, in the highly profitable DRAM segment, operating profit margin improved slightly, and DRAM share of total revenue grew from 74% to 80% quarter to quarter. As a result, the overall operating margin also improved compared to the previous quarter.\n\n**Woo Hyun Kim** (CFO)\n제품별 수익성은 D램은 컨벤셔널 제품 가격 하락에도 HBM3E와 DDR5와 같은 수익성이 높은 제품의 판매가 확대되면서 수익성이 전 분기 대비 개선이 되었고 낸드의 경우는 가격 하락과 판매량 감소 등 매출이 줄었지만 흑자 기조는 유지하였습니다. Turning to product-level profitability for DRAM segment, despite a decline in conventional product prices, the overall profitability improved from the previous quarter, mainly driven by expanded sales of high-margin products such as HBM3E and DDR5. As for NAND, the revenue declined due to falling prices and lower sales volumes, however, the NAND segment remained in the black with positive profitability. 네, 다음 질문해 주십시오. Next question. 다음으로 질문해 주실 분은 하나증권의 김록호 님입니다.\n\n**Operator**\nThe following question will be presented by Young-Ho Kim from Hana Securities. Please go ahead with your question.\n\n**Young-Ho Kim** (Managing Director)\n안녕하세요. 하나증권 김록호입니다. 저는 낸드 쪽 질문 드리고 싶은데요. 작년에 낸드 시장 같은 경우가 ESSD 수요가 성장한 견해는 왔었는데 올해도 해당 추세가 지속될 건지 좀 의견 부탁드리고요. 그리고 하이닉스에서 준비하고 계신 AI 양 ESSD 제품은 어떤 것들이 있는지 공유 부탁드리겠습니다. 감사합니다. I have a question regarding NAND. Last year, enterprise SSD demand drove the NAND market growth. Do you expect this trend will continue this year? What are your plans for ESSD products for AI application?\n\n**Woo Hyun Kim** (CFO)\n네, 질문 감사합니다. 지난해 AI 수요가 본격화되면서 고용량, 고성능 엔터프라이즈 SSD 수요가 급격히 증가했고요. 당사는 고용량 QLC ESSD 제품 리더십을 바탕으로 수요에 적극 대응하면서 지난해 ESSD 매출은 2023년 대비 300% 이상 성장하는 성과를 달성했습니다. With the rapid surge in AI demand last year, there was a sharp increase in the need for high-capacity, high-performance enterprise SSDs. Leveraging our leadership in high-capacity QLC ESSD products, we actively responded to this demand, achieving over 300% growth in ESSD sales compared to year 2023. 올해는 대외 불확실성이 커지고 있는 상황이나 글로벌 기업의 AI 양 투자는 지속될 것으로 예상되는 만큼 ESSD 수요는 다른 응용 제품 대비 견조할 것으로 예상하고 있습니다.\n\n**Woo Hyun Kim** (CFO)\nWhile external uncertainties are growing this year, global investment in AI is expected to continue, and we anticipate that demand for ESSD will remain resilient and strong compared to other applications. 특히 올해 들어 생성형 AI의 추론 서비스 수요 및 높은 품질의 서비스에 대한 요구가 증가되면서 데이터 센터 서버 내에 추가적인 메모리랑 검색, 지식 저장소를 위한 인프라가 필요해집니다. 그에 따라서 HBM D램뿐만 아니라 고성능 TLC ESSD 수요 또한 증가할 것으로 기대하고 있습니다. This year, demand has grown for generative AI inference services and for high-quality performance in terms of accuracy and speed. As a result, data center servers now require expanded infrastructure, not only for memory but also for storing retrieved knowledge. We expect this will drive demand both for HBM and DRAM, as well as for high-performance TLC Enterprise SSDs.\n\n**Woo Hyun Kim** (CFO)\n한편, 고용량 QLC ESSD 시장에서도 유의미한 변화가 예상됩니다. 작년에는 61 TB에서 올해 122 TB로 무게 중심이 옮겨지고 있는 고용량 ESSD 수요에 당사는 적극 대응할 계획입니다. Significant shifts are also expected in the high-capacity QLC ESSD market. With demand transitioning from 61 TB last year to 122 TB this year, we plan to actively respond to this growing trend for higher-capacity ESSDs. 예로 지난 11월 개발한 세계 최고층의 321단 기반의 244 TB 제품 개발도 추진해서 향후 초고용량 ESSD 시장까지 지속 선도해 나갈 방침입니다. For example, leveraging our world's highest 321 Hi-technology, which was introduced last November, we are advancing the development of 244 TB products to continuously lead the ultra-high-capacity ESSD market going forward. 답변 감사합니다. 이제 마지막 질문 받도록 하겠습니다. We'll take last question.\n\n**Operator**\n마지막으로 질문해 주실 분은 다이와증권의 SK팀 님입니다. The last question will be presented by SK Kim from Daiwa Securities. Please go ahead with your question.\n\n**SK Kim** (Analyst)\n예, 안녕하세요. 마지막 질문 주셔서 감사합니다. 우선 좋은 실적 축하드리고요. 저는 D램 쪽 관련해서 좀 전략에 관한 질문이 있습니다. 최근에 조사기관의 자료에 따르면 당사가 SK hynix가 D램 시장에서 수익성뿐만 아니라 매출액 기준으로도 점유율 1위를 차지했다는 그런 발표가 있었습니다. 향후에 지금 HBM 시장의 성장성이나 프리미엄, 그리고 당사의 리더십을 감안하면 앞으로도 지금 이런 위상이 지속될 것으로 예상이 됩니다. 이 경우에 HBM 시장과 커머디티 시장에 대한 회사의 대응 전략이라든지 이런 향후 전략 방향성에 대해서 좀 말씀해 주시면 감사하겠습니다.\n\n**SK Kim** (Analyst)\nI take the chance to ask the last question, and congratulations on your excellent performance. I do have a question regarding DRAM strategy. A recent market research report announced that SK hynix ranked first in the DRAM market, not only in terms of profitability but also in market share. Given HBM's growth potential and premium positioning, SK hynix's leadership in this market is expected to continue. My question is about your response strategies for HBM and commodity markets.\n\n**Woo Hyun Kim** (CFO)\n네, 질문 감사드립니다. 저희 회사가 수익성뿐만 아니라 매출액 기준으로도 올해 1분기 D램 시장 1위가 되었다는 발표는 당사가 고수익 AI 메모리 중심의 포트폴리오 전략을 수립하고 실행함으로써 D램 기술 리더십을 입증한 결과라고 생각합니다. The announcement that our company ranked first in the DRAM market in Q1 2025, both in terms of profitability and revenue, reflects that our portfolio strategies that focused on highly profitable AI memory were well executed. It also demonstrates our leadership in DRAM technology.\n\n**Woo Hyun Kim** (CFO)\nHBM 시장은 AI 반도체의 핵심 메모리로서 기술 선도력과 고객 맞춤형 대응력이 경쟁력을 좌우하는 시장입니다. 따라서 고객 니즈에 선제적으로 대응할 수 있는 제품을 개발하고 안정적으로 양산을 하는 것이 중요합니다. The HBM market is critical in AI semiconductor, and competitiveness is determined by technological leadership and the ability to cater to customer needs. It is essential to proactively develop products that meet customer needs and ensure stable mass production.\n\n**Woo Hyun Kim** (CFO)\n당사는 기존의 HBM 개발과 양산 경험을 기반으로 해서 HBM4 역시 조기 양산을 위한 개발, 그리고 고객 인증을 적극 추진하고 있고, 또한 고객과 긴밀한 협업을 통해서 제품 완성도를 높이고 있습니다. Based on our extensive experience in HBM development and manufacturing, we are actively pursuing development and customer qualification for HBM4 to accelerate mass production. We also work in close collaboration with our customers to ensure meticulous product quality.",
      "fetched_at": "2026-02-04T15:55:50.928Z"
    }
  ]
}