{
  "ticker": "005930.KS",
  "last_updated": "2026-02-04T15:55:32.190Z",
  "total_transcripts": 4,
  "transcripts": [
    {
      "ticker": "005930.KS",
      "title": "SamsungElec (005930.KS) Q4 FY2025 earnings call transcript",
      "published_date": "Jan 29, 2026, 10:00 AM GMT+9",
      "fiscal_year": "2025",
      "quarter": "Q4",
      "url": "https://finance.yahoo.com/quote/005930.KS/earnings/005930.KS-Q4-2025-earnings_call-405206.html",
      "content": "**Operator**\nHello everyone, and welcome to the Samsung Electronics 2025 fourth quarter financial results conference call. I will be your coordinator. All participants will be in a listen-only mode until we open the question and answer session following the presentation. As a reminder, this call is being recorded. I would now like to turn the conference over to the investor relations team. Please go ahead.\n\n**Daniel Oh** (EVP and Head of Investor Relations)\nGood morning, everyone. Thank you for joining us this morning in Seoul time. I'm Daniel Oh, Head of Investor Relations at Samsung Electronics. I'm grateful to have you with us today for our earnings call for the fourth quarter of 2025. Before we proceed, allow me to address several key administrative and legal points. For your convenience, today's webcast and slide deck are accessible via our IR website at www.samsung.com/global/ir. I would like to note that this call is being recorded, and it will remain available on our website for future reference. We appreciate your engagement and focus as we move through the results, as today's session aims to deliver comprehensive insights into our financial performance and outlook. Please be aware that today's discussion may contain forward-looking statements reflecting our present expectations about future developments. Such statements should not be viewed as guarantees of future outcomes.\n\n**Daniel Oh** (EVP and Head of Investor Relations)\nActual results may vary significantly from these projections due to numerous factors, including, but not limited to, market dynamics, regulatory changes, and operational environments. We respectfully seek your understanding of these important considerations as we seek to uphold transparency and accuracy. I will begin the discussion today with the highlights of our fourth quarter financial performance, followed by EVP Sooncheol Park, our Head of Corporate Management Operations and Chief Financial Officer, with details on our business outlook and shareholder returns. I will then share a brief update on capital expenditures and sustainability initiatives. At that point, our executives will provide in-depth comments on their respective business areas. Following their presentations, we open the call to analyst questions. This call is expected to last about one hour, and we appreciate your time and attention throughout. Several key executives have joined us on today's call.\n\n**Daniel Oh** (EVP and Head of Investor Relations)\nIn addition to myself and our CFO, we have with us EVP Jaejune Kim, representing Memory. Joining the call for the first time, EVP Jason Shin for System LSI. For Foundry, EVP Sukchae Kang, and returning to the call, EVP Charles Hur for Samsung Display Corporation. Also, both joining the call for the first time, EVP Seong Cho for Mobile Experience and EVP Hun Lee for Visual Display. Now, let's begin with our consolidated financial performance for the fourth quarter of 2025. We delivered our highest quarterly revenue ever at KRW 93.8 trillion, up 9% quarter-on-quarter. In the DX division, revenue declined 8% sequentially due to the fading impact of new smartphone launches and softness in home appliances in the wake of U.S. tariffs.\n\n**Daniel Oh** (EVP and Head of Investor Relations)\nOn the other hand, the DS division showed strength with a sales increase of 33% quarter-over-quarter, driven by expanded sales of HBM and other high-value added products, thanks to stronger market prices. Memory recorded another new all-time high for quarterly revenue, surpassing the level set one quarter ago. SG&A expenses were KRW 24.2 trillion, up by KRW 2.9 trillion, quarter-over-quarter, and SG&A, as a percentage of sales, was up by one percentage point sequentially to 25.8%. R&D investments totaled KRW 10.9 trillion, up by KRW 2 trillion, quarter-over-quarter, and set a full year record of KRW 37.7 trillion, a testament to our commitment to investing for the future.\n\n**Daniel Oh** (EVP and Head of Investor Relations)\nOperating profit also set a new quarterly high of KRW 20.1 trillion, up KRW 7.9 trillion from the previous quarter. Operating margin also increased, rising 7.3 percentage points sequentially to 21.4%. While operating profit in the DX division declined due to the slowdown in the MX and home appliance businesses, the DS division more than compensated with its significantly stronger quarter-on-quarter performance, driven by robust improvements in memory profitability. Currency movements also worked in our favor. The sharp appreciation of the U.S. dollar and other currency had positive effect of adding approximately KRW 1.6 trillion to company-wide operating profit centered on the component businesses. More detailed fourth quarter results of each business will be presented by executives shortly.\n\n**Daniel Oh** (EVP and Head of Investor Relations)\nBefore that, I would like to pass the conference call over to our CFO, Sooncheol Park, who will discuss our outlook and shareholder return.\n\n**Sooncheol Park** (EVP, Head of Corporate Management Operations, and CFO)\nThank you, Daniel, and good morning, everyone. I am Sooncheol Park, CFO of Samsung Electronics. I am pleased to continue our update. We entered 2025 under difficult conditions, both at home and abroad, and the first half of the year posed many challenges. Yet, thanks to the trust and support of our shareholders, the second half unfolded as we promised, and marked a clear turnaround for the company. We achieved the highest annual revenue in our history. Profit in the fourth quarter also set an all-time high, and our stock price increased sharply. I am deeply grateful to our shareholders for standing with us through the challenges and this turnaround. The DS division introduced globally competitive products, including HBM4 and GDDR7, and some customers summed up our achievement with the idea, Samsung is back, sending a clear signal of the strength behind our differentiated performance.\n\n**Sooncheol Park** (EVP, Head of Corporate Management Operations, and CFO)\nThe Foundry business is primed for a major leap forward, supported by each technology and the trust it has earned through recent deals with leading global clients. The DX division added to our technology leadership with a TriFold smartphone and Micro RGB TVs, while delivering distinct customer experiences powered by advanced AI technology across the Galaxy ecosystem. We also secured new growth drivers through strategic acquisitions, including FläktGroup in HVAC, ZF in ADAS, Zelis in digital healthcare, and Masimo audio business. Looking ahead to 2026, we expect several risks to persist, including continued global trade barriers and geopolitical uncertainties. To address this, we'll remain proactive and stay ahead of external shifts.\n\n**Sooncheol Park** (EVP, Head of Corporate Management Operations, and CFO)\nThe DS division will continually secure leadership in the AI semiconductor market by drawing on our unique position as the one semiconductor company in the world capable to delivering a true one-stop solution, including logic, memory, foundry, and advanced packaging. In memory, we'll regain our core technology leadership, and in Foundry, we'll turn our expanded order opportunities secured through advanced process maturity into tangible results. For System LSI, we aim to transform the business by reinforcing our core strengths. We also drive innovation by applying AI solutions optimized for semiconductors, and capture new opportunities with enhanced customer-centric products. The DX division will expand AI-driven products and constantly integrated our AI technologies across all of the DX division's device features and service ecosystem, while providing the best AI experience to our customers. Through this, we aim to become the leader in the era of AI transformation.\n\n**Sooncheol Park** (EVP, Head of Corporate Management Operations, and CFO)\nTo maintain our competitive advantage, we'll secure our position by leveraging our distinctive products, diversifying our supply chain, and optimizing global operations to address the issues such as component costs and global tariff risks. Furthermore, we'll continue to invest in future growth engines, including HVAC, automotive, electronics, medical technology, and robotics, to secure technology leadership in the years ahead. Company-wide, we'll strengthen our processes and improve cost efficiency by promoting AI-driven innovation and adopting digital twin technologies. Also, we strive to make this a year in which we deliver tangible progress in our humanoid robotics business as part of our preparations for the future. Next, our for the first quarter of 2026. In the semiconductor industry, we expect structural growth opportunities to increase, driven by AI and server demand. In response, we'll maintain our focus on profitability while monitoring macro uncertainties, including tariff impacts.\n\n**Sooncheol Park** (EVP, Head of Corporate Management Operations, and CFO)\nFor the DS division, in memory, we believe market conditions will remain favorable, driven by AI demand and the industry-wide supply constraints. We expect to sustain our strong performance by focusing sales on server DRAM, eSSD, and other high value-added products, supported by our technology leadership. In Foundry, although revenue may decline somewhat due to seasonal effects, we'll preserve our growth momentum by advancing process maturity and securing new orders from major customers. In System LSI, while there are concerns regarding customers' cost burdens, we'll seek to maximize sales of new and high value-added products. For the DX division, the MX business, we will reinforce its leadership in the AI smartphone market by delivering AI experiences that enhance everyday life, supported by the launch of new models.\n\n**Sooncheol Park** (EVP, Head of Corporate Management Operations, and CFO)\nWhile headwinds from rising component costs are expected to persist across the industry, we aim to secure profitability through improved supply stability and resource efficiency initiatives. In the VD and home appliance businesses, amid continued challenges, such as intensifying competition and tariffs, we expand our presence in the high value-added product market by delivering hyper-personalized customer experiences, powered by enhanced AI technology. Moving on to the shareholder returns, the board of directors today approved a year-end per share dividend of KRW 566 for common stock, and KRW 567 for preferred stock. Under our shareholder return policy for 2024-2026, we committed to regular quarterly dividends of KRW 2.45 trillion, for an annual payout of KRW 9.8 trillion.\n\n**Sooncheol Park** (EVP, Head of Corporate Management Operations, and CFO)\nLast year, the government introduced a separate taxation scheme for dividend income from high dividend companies, aiming to increase dividends and vitalize the capital markets. To meet the requirement for 2025, the board resolved to declare an additional dividend of KRW 1.3 trillion. The fourth quarter distribution is scheduled for payment in April, following final approval at the AGM in March. Thank you.\n\n**Daniel Oh** (EVP and Head of Investor Relations)\nThank you, CFO. This is Daniel again. Now, I'll provide a brief update on capital expenditures. In the fourth quarter of 2025, CapEx rose by KRW 11.2 trillion from the previous quarter to KRW 20.4 trillion, with KRW 19 trillion allocated to the DS division and KRW 0.7 trillion to the display business. For the full year, total CapEx was KRW 52.7 trillion, down KRW 1 trillion from a year earlier. Of the total, the DS division accounted for KRW 47.5 trillion, while the display business represented KRW 2.8 trillion. In the Memory business, investments increased both quarter-on-quarter and year-on-year, as we transition to advanced process to expand sales of high value-added products, such as HBM.\n\n**Daniel Oh** (EVP and Head of Investor Relations)\nIn the Foundry business, CapEx was up from the previous quarter, driven by increased investments in the U.S. Taylor Fab. For the full year, CapEx declined as we maintain our conservative investment approach overall. In display business, CapEx decreased both in the fourth quarter and on a full year basis, following the completion of 8.6 generation line. For 2026, although detailed investment plans are still being finalized, we expect memory CapEx to increase considering the market outlook. Now, I would like to highlight our sustainability performance. We are proud to be the first in the industry to develop and deploy a helium reuse system for semiconductor manufacturing.\n\n**Daniel Oh** (EVP and Head of Investor Relations)\nHelium is essential to the manufacturing process, and this system, which has been applied to selected production lines, enables us to recover and purify helium for redeployment, cutting annual consumption by approximately 4.7 tons and achieving a reuse rate of around 19%. This initiative not only helps stabilize the procurement of helium, which has a high import dependency, but also enhances our resource circularity in our semiconductor manufacturing process. In addition, to verify the energy saving impacts of the SmartThings AI Energy Saving Mode, we partnered with The Carbon Trust, a global carbon footprint verification organization, to conduct a year-long measurement of actual energy saving, well, sorry, actual energy consumption across approximately 187,000 high efficiency washing machines in 126 countries.\n\n**Daniel Oh** (EVP and Head of Investor Relations)\nThe results confirmed energy savings of around 5.02 GWh, equivalent to around 30% of the total energy consumption. To put that in perspective, this is enough electricity to power 14,000 households in Seoul during the hot summer season. We remain committed to strengthening our sustainability practices and delivering measurable impacts. Now, let's hear from the executives for detailed commentary on their respective business units' fourth quarter performance and outlook. First up is Jaejune Kim, EVP of the Memory business.\n\n**Jaejune Kim** (EVP of Memory)\nGood morning, this is Jaejune Kim from Memory Global Sales and Marketing. In the memory market, in the fourth quarter, demand for servers increased continuously and significantly exceeded industry supply, driven by hyperscalers expanded CapEx, in the race to establish early dominance in the AI market. In addition, for mobile and PC, the supply-demand situation remained tight, as the industry supply response focused on server combined with seasonal demand effects. Under the low inventory levels and supply constraints, we expanded HBM sales and concentrated on improving profitability by addressing the demand for high value-added products for servers, such as high-density DDR5, LPDDR5X, and server SSDs.\n\n**Jaejune Kim** (EVP of Memory)\nAs a result, in the fourth quarter, our sales for both DRAM and NAND matched the initial bit growth guidance, and combined with the overall market price increases, our QQ performance improved by more than it did in the previous quarter. Now, let's move on to the outlook for the first quarter. In the first quarter, we expect the market will remain robust following the previous quarter, as AI applications continue to drive the overall market. Thus, we plan to keep our product mix focused on high value-added products for AI. However, considering the significantly low inventory levels, we expect that QQ DRAM bit shipment growth will be limited to the low single digits.\n\n**Jaejune Kim** (EVP of Memory)\nFor NAND, we expect bit shipment to increase by mid-single-digit precentages, due to the base effect from the low bit shipment in the last quarter. Lastly, let me talk about the outlook for 2026. We anticipate that, the demand for AI applications will remain strong this year. In particular, the high-performance HBM4 market should dramatically arise, and the high density trends for server DRAM is likely to keep expanding. For NAND, we expect demand growth for high-performance QLC products to accelerate, with the introduction of PCIe Gen 6 SSD, which is Key-Value SSD for AI inference.\n\n**Jaejune Kim** (EVP of Memory)\nHowever, in the case of mobile and PC applications, we need to monitor potential decline in such shipments, resulting from increased end product prices and reduced contents per box, driven by BOM cost pressure from rising memory market price. In an environment of rapidly growing demand focused on AI, we aim to lead the AI era with our product competitiveness in 2026. For DRAM, targeting on GPU and ASIC that will be newly introduced in the AI market, we will proactively address customer demand by expanding supply of our HBM4 with competitive performance in a timely manner. In the meantime, we plan to continue increasing the portion of AI-related products, such as high-density DDR5, SOCAMM2 GDDR7, and so on.\n\n**Jaejune Kim** (EVP of Memory)\nFor NAND, we plan to focus on demand expansion for high-density QLC-based Gen 5 SSDs, in conjunction with the strong demand for Key-Value SSD for AI. In addition, while PCIe Gen 6 server market is projected to rapidly expand in the second half, with the introduction of new GPU platforms, we will lead the market from the initial stage with our V9-based high-performance products. Thank you.\n\n**Jason Shin** (EVP of System LSI)\nGood morning. This is Jason Shin from the System LSI business. In the fourth quarter, the smartphone market continued a gradual recovery, despite ongoing U.S.-China trade uncertainties and persistent regional geopolitical tensions. While demand in the premium segment remained resilient, shipment volume in the mid- to low-end segment declined, resulting in a different pace of recovery across segments. Our earnings declined quarter-over-quarter due to seasonal demand fluctuation among major customers and adjustments to new product launch schedules. However, image sensor revenue grew on the back of expanding sales of the 200 MP and 50 MP products launched in the second half of last year. In particular, we strengthen our technology leadership through the industry's first 200 MP image sensors, featuring 0.5-micrometer pixels.\n\n**Jason Shin** (EVP of System LSI)\nIn the first quarter, external uncertainties are expected to persist, while rising prices of key components are increasing cost burden for smartphone OEMs. As a result, shipments are likely to slow, particularly in the mid to low-end segment. However, demand for high-value components is expected to remain relatively solid, supported by the launch of new premium smartphones. We plan to focus on improving earnings by ramping up supply of new SoC products and expanding our lineup of 200 MP image sensors, while further strengthening our portfolio of high-value products. Looking ahead to 2026, overall smartphone demand is expected to soften, while growth opportunities should continue to be concentrated in the premium segment. With the expansion of on-device AI, performance enhancements and differentiated user experience are becoming key competitive factors across devices, and demand for related semiconductors is expected to continue to increase.\n\n**Jason Shin** (EVP of System LSI)\nIn SoC, we will focus on improving earnings by expanding sales based on differentiated performance and stable yields, while also exploring new opportunities in the custom SoC business. In image sensors, we will continue to strengthen our competitiveness in fine pixel technology and sustain our leadership through nano-prism technology, which enhances light sensitivity. Thank you.\n\n**Sukchae Kang** (EVP of Foundry)\nHello, everyone, this is Sukchae Kang from the Foundry business. In the fourth quarter, strong demand from AI and HPC applications continued to drive growth in advanced nodes. Meanwhile, virtual nodes sustained growth, supported by demand stemming from China's localization strategy, even as non-AI and consumer segments remained stagnant and price competition intensified. We began ramping up mass production of our first generation 2nm products and initiated shipments of 4nm HBM-based die products. Revenue increased quarter-on-quarter, driven mainly by strong demand from U.S. and Chinese customers. However, earnings improvement was limited due to the recognition of provisions. For the 2nm GAA process, we focused on process stabilization while developing next generation processes on schedule. In packaging, we continue to strengthen our advanced packaging competitiveness by establishing 3D hybrid copper bonding technology for advanced nodes.\n\n**Sukchae Kang** (EVP of Foundry)\nLooking ahead to the first quarter, seasonal demand softening is expected. However, overall, the overall market is projected to continue growing, supported by price increases in advanced nodes. We expect our revenue to decline quarter-over-quarter due to seasonally weaker customer demand. For 2nm, we expect our first generation mass production to further stabilize, and we are working to secure manufacturability and develop design infrastructure for the second generation process, targeting its mass production in the second half of the year. In addition, we are focusing on expanding specialty processes, including 4 nm RF, 8 nm eMRAM for automotive applications, and 14nm RF millimeter wave to enhance our technological competitiveness. On the other front, we will continue to expand orders, focusing on HPC and mobile customers.\n\n**Sukchae Kang** (EVP of Foundry)\nFor 2026, as policy supports for the global semiconductor industry continues to expand, we expect ongoing supply chain restructuring, driven by increased domestic production and persistent geopolitical risks. With the full-scale entry into mass production of 3 nm and 2 nm processes, demand for the advanced nodes is expected to remain robust, led in particular by AI and HPC applications. In contrast, mature nodes are projected to face intensifying competition due to continued capacity expansion, especially in China. Based on solid demand from AI and HPC applications, we plan to broaden our customer base and target double-digit year-on-year revenue growth, centered on advanced nodes, along with continued improvement in earnings. In the second half, we will begin mass production of new products based on second-generation 2 nm process, and prepare performance- and power-optimized 4 nm process for mass production.\n\n**Sukchae Kang** (EVP of Foundry)\nThrough these efforts, we will continue to stabilize advanced nodes and strengthen our technological competitiveness. In addition, Taylor Fab in the U.S. is under construction as planned, aiming for a timely commencement of operation this year. Finally, to meet the high performance, low power, and high bandwidth requirements of advanced nodes, we will continuously strengthen our business competitiveness by delivering optimized solution that integrate logic, memory, and advanced packaging technologies. Thank you.\n\n**Charles Hur** (EVP for Samsung Display Corporation)\nGood morning, everyone. This is Charles Hur from Samsung Display. I will now brief you on our results for the first quarter of 2025. For the mobile display business, we achieved solid results, thanks to a sales increase of high-end smartphones and our stable supply capability. In addition, IT and automotive performance increased quarter-on-quarter, which contributed to earnings growth. For the larger display business, revenue increased in comparison to the previous quarter, supported by market demand during the year-end peak season and improvements in productivity and product mix. Next, let me share the outlook for the first quarter of 2026. For the mobile display business, even though overall smartphone demand is likely to be weak due to seasonality and memory supply and price impacts, we'll increase sales through the timely development and supply to support our major customers' new flagship smartphones.\n\n**Charles Hur** (EVP for Samsung Display Corporation)\nFor the larger display business, while overall market demand is expected to decrease, QD-OLED is likely to be relatively stable. We actively respond to the new product launches and keep expanding sales. Next, I'll share the outlook for 2026. In 2026, price pressure on non-memory components is expected to intensify due to memory supply and price issues. We'll maintain profitability by extending high value-added products and retaining our leadership in smartphone market with differentiated technologies. Also, we'll drive revenue growth through mass production of a brand new 8.6-generation IT OLED line, while expanding sales of non-smartphone product too. For larger display, demand for high performance product is expected to keep rising in premium TV and monitor market. We'll maintain our premium market leadership by focusing on high brightness products for TV market and continue to expand the monitor sales based on QD performance advantages. Thank you.\n\n**Seong Hyuk Cho** (EVP for Mobile Experience)\nHi, everyone. This is Seong Cho from the MX Strategy Marketing. Let me share our Q4 results as well as our future outlook. The smartphone market rebounded in Q4, driven by the year-end peak season effect, with global demand increasing, particularly for premium products compared to the previous quarter. For the MX business, Q4 saw smartphone shipments of 60 million units, tablet shipments of 6 million units, and a smartphone ASP of $244. Due to the fading effects of the new model launches and then lower flagship smartphone sales, both revenue and profit declined compared to the prior quarter. However, year-on-year, quarterly smartphone sales increased, resulting in revenue growth. On an annual basis, we achieved steady growth in both unit volume and sales for flagship smartphones.\n\n**Seong Hyuk Cho** (EVP for Mobile Experience)\nNotably, the strong growth of our foldable series, combined with the stable sales performance of the A series and the ecosystem products, enable us to deliver double-digit profitability for the full year. Let me share the outlook for Q1. Overall, smartphone demand will decrease quarter-on-quarter due to seasonality trends. In the MX business, we expect to see an increase in smartphone shipments and ASP due to the launch of the new models, while tablet shipments should stay similar sequentially. We plan to drive sales growth focused on flagship models with the launch of the Galaxy S26. We will actively promote agentic AI experiences and enhance competitiveness of our products while strengthening collaboration with partners to continue leading the AI smartphone market.\n\n**Seong Hyuk Cho** (EVP for Mobile Experience)\nHowever, as cost pressure of the key components increases across the industry, we'll ensure stable supply through strategic partnership with major suppliers, and continue to drive resource efficiencies to minimize profit erosion risks. Next, I'll share our outlook for 2026. The smartphone market is projected to experience modest revenue growth, while volume are expected to remain flat. However, given the heightened volatility in industry conditions, including fluctuation in memory supply, market forecast may be subject to further adjustment. For ecosystem products, while tablets are experiencing a slowdown in replacement demand, the notebook PC segment is expected to expand due to growth of the AI PCs and the Windows 10 replacement demand. Additionally, the watch and TWS market are projected to grow as interest in health and fitness rises, together with the expansion of the AI features.\n\n**Seong Hyuk Cho** (EVP for Mobile Experience)\nMX will maintain our strategy focused on expanding flagship sales by delivering AI experiences that provide real benefits in daily life from the customer's perspective, along with the innovations in slimmer form factors and lightweight design. The S26 series, scheduled for re-release in the first half of 2026, will revolutionize the user experience with the user-centric next generation AI experience, and second generation custom AP, and stronger performance, including new camera sensors. Leveraging these strengths, we will innovate the user experience and drive sales expansion. For foldable devices, we plan to strengthen our product lineup and continue form factor innovations such as TriFold, launched in December 2025, to deliver new user experiences in order to expand our customer base.\n\n**Seong Hyuk Cho** (EVP for Mobile Experience)\nAdditionally, we plan to drive growth across all segments by expanding into new regions and channels, as well as, as well as upselling based on stronger products to solidify our leadership in volume. In ecosystem products, we aim to increase premium product sales with superior products and more advanced and intuitive Galaxy AI features. In particular, we'll continue to enhance health AI experiences in our watches, and further expand our TWS lineup in order to create new demand. For XR, we plan to deliver rich, immersive, multimodal AI experiences through diverse form factors, such as next generation AR glasses. 2026 is expected to be a challenging year due to the rising cost pressure across the industry. Nevertheless, we'll maintain our focus on expanding flagship sales, powered by AI leadership, and pursue cost efficiency initiatives across all processes to secure profitability. Thank you.\n\n**Hun Lee** (EVP of Visual Display)\nHello, everyone. I'm Hun Lee, Head of the Global Sales and Marketing team of Visual Display. I'll briefly explain the market situations and share our results in the first quarter of 2025. In the first quarter, TV market demand increased compared to the previous quarter, mainly due to year-end peak seasonality, but it decreased modestly year-on-year because of continuous stagnant global TV markets. We improved the results compared to the previous quarter by expanding volume and sales during the year-end season, which was driven by strong sales of premium Neo QLED and OLED products, as well as diversifying the volume-generating lineup of QLED and 75 inches above big TVs to counter competitors' aggressive pricing strategies. Next, I will review the outlook for 2026.\n\n**Hun Lee** (EVP of Visual Display)\nAs for TV market demand, in the first quarter of this year, it is expected to remain flat versus last year due to slowing down demand after year-end peak season and growing internal and external uncertainties. Nevertheless, demand for high value-added products such as Super Big TVs, QLED, and OLED models, is expected to show decent growth. In line with this, we will focus on promoting differentiated value of our AI TVs by strengthening communication of Vision AI Companion, which was introduced at CES, while focusing on enhancing sales and securing profitability by launching new models in 2026, including Super Big MICRO LED TV, and maximizing marketing buzz. The TV market in 2026 is forecasted to record a modest growth in the first half, thanks to impact of global sports events like Winter Olympics and World Cup.\n\n**Hun Lee** (EVP of Visual Display)\nMoreover, QLED, OLED, and 75 inches above big TVs will be the key drivers of continuous growth, which will also contribute to increasing our sales portion of premium products. Especially, we will drive sales growth by targeting replacement demand, driven by this global sports event, and leveraging our 2026 new lineup, including MICRO LED and OLED. At the same time, we will continuously strengthen growth momentum and improve profitability by further expanding advertising service business, supported by enhanced OS competitiveness.\n\n**Hun Lee** (EVP of Visual Display)\nMore specifically, we will improve targeting advertising, together with the performance-based advertising. This is end of my speech, and thank you for your undivided attention.\n\n**Daniel Oh** (EVP and Head of Investor Relations)\nThank you, everyone. This is Daniel again. So that completes our presentation on the fourth quarter performance of 2025, and now we'll move on to the Q&A session, which will be conducted in Korean. Questions regarding company-wide matters will be addressed by our CFO, Sooncheol Park, and questions for the other business segments will be answered by relevant business representatives. Please, operator.\n\n**Operator**\nWe'll now begin the Q&A session. If you have a question, press star and one. If you wish to withdraw your question, press star and two. The first question will be made by S.K. Kim from Daiwa.\n\n**S.K. Kim** (Executive Director and Analyst)\nYes, good morning. Thank you for the opportunity to ask some questions, and congratulations for your good performance. I have two questions. First, for memory, regarding fourth quarter performance. It seems, yes, memory has achieved very solid performance in the fourth quarter. Could you provide more color on DRAM and NAND bit growth and also the rise in ASP? I'd appreciate more details. Second question has to do with MX. Could you also elaborate on your smartphone sales performance for Samsung Electronics overall for full year 2025? Also, as we expect changes to the business environment going forward, could you take us through some key strategic initiatives for 2026?\n\n**Jaejune Kim** (EVP of Memory)\nYes, let me take your question regarding fourth quarter performance for Memory. In the fourth quarter, AI-related demand, particularly from hyperscalers, came through even stronger.\n\n**Jaejune Kim** (EVP of Memory)\nWith the spread of agentic AI, inference workloads expanded significantly, leading to a significant surge in demand, not only for AI servers but for conventional server applications as well. As a result, DRAM demand was strong and robust, driven by HBM and high-density DDR5, LPDDR5X for server. Meanwhile, in NAND, we saw a rapid rise in demand for SSDs optimized for AI inference workloads, especially for key value data processing. Also, as supply conditions worsen for nearline HDDs, we also saw a rising replacement demand for QLC SSDs. For mobile and PC applications, with the industry continuing to prioritize server shipments, supply constraints have become even tighter, prompting concerns among customers about possible memory shortage, leading to a disruption in their end products, and they are now actively securing supply.\n\n**Jaejune Kim** (EVP of Memory)\nWith AI server applications driving the overall market, in Q4, we responded proactively to HBM demand while directing supply primarily to the higher margining server segment. As a result, bit shipments achieved a new record high, consistent with our bit growth guidance from the previous quarter. And, driven by higher overall market pricing and our product mix centered toward high value-added server products, DRAM ASP increased by about 40% quarter on quarter. For NAND, bit growth, well, due to the high base effect from strong bit shipments in the third quarter, low inventory levels, and also bit loss from migration of legacy processes to advanced nodes, including the discontinuation of planar NAND products, NAND bit growth inevitably declined quarter on quarter, but this was already factored into our bit growth guidance from the previous quarter.\n\n**Jaejune Kim** (EVP of Memory)\nThat being said, working within the limits of our available capacity, we focus on expanding higher-margin server SSD sales, and the server sales mix as a percentage of total sales increased by about 10 percentage points Q-o-Q, in line with our guidance. For NAND ASP, certain factors made the increase in blended ASP per bit appear somewhat muted, including a higher mix of QLC sales and phase-out of planar NAND. However, driven by a server-focused product mix, overall rise in market pricing, NAND ASP increased by mid-20% quarter-on-quarter. In conclusion, amid a favorable market environment driven by AI, memory delivered a record high quarterly performance in Q4. In 2026, as we address unprecedented AI-driven demand, we intend to continue to deliver results that meet market expectations.\n\n**Jaejune Kim** (EVP of Memory)\nThe company has consistently maintained strong leadership in smartphone volume, and for the fourth quarter of 2025, as well as for the full year, smartphone shipments increased year-over-year and outperformed the market. Furthermore, at this inflection point driven by AI, what matters most is providing better experiences to consumers and leading the direction of the market. In 2026, amid significant industry changes due to rising component prices, we will leverage our AI technology leadership and stable supply chain to expand sales of new inflection models. In the first quarter, following the successful launch of the S26 series, we will drive revenue growth through sustained sales of foldables, which are showing strong sales momentum, as well as previous NFE models. In the second half, we plan to launch a new foldable product with enhanced competitiveness to pursue further growth.\n\n**Jaejune Kim** (EVP of Memory)\nAs for the A series, we will accelerate efforts to discover new business opportunities in growth markets.\n\n**Jaejune Kim** (EVP of Memory)\nAnd also create conditions where consumers can purchase our devices more easily, and through the broader application of competitive AI features and Knox security solutions, will drive volume expansion.\n\n**Operator**\nYes, thank you. We'll move on to the next question, please. The next question will be by Mr. Peter Lee from Citigroup. Please go ahead.\n\n**Peter Lee** (Semiconductor Analyst)\nYeah, yes, good morning. This is Peter Lee from Citigroup. I'd like to first congratulate you on a record high quarterly performance. Congratulations. I have some questions about HBM. It seems that we've been hearing quite a lot of good news recently about HBM4 performance from Samsung. Could you provide us an update on the status of your customer qualifications for HBM4 and your development plans for HBM4E, also an update on advanced packaging technology? Also, your outlook for expected HBM sales for 2026 as well.\n\n**Sooncheol Park** (EVP, Head of Corporate Management Operations, and CFO)\nYes, let me comment on our HBM business first. First, for HBM4, with the goal of strengthening the fundamental competitiveness of our technology, we have set our performance target high above JEDEC standards from the outset of development.\n\n**Sooncheol Park** (EVP, Head of Corporate Management Operations, and CFO)\nEven as major customers have been raising their performance requirements, we supplied sample shipments last year with no redesign required and have now entered the final phase of qualifications. Everything is proceeding smoothly. We are receiving positive customer feedback on the competitive performance of HBM4, and based on this input, we've already commenced production, and HBM4 is now in stable full-scale production as scheduled, including HBM4 at 11.7 Gbps products at the highest performance bin pursuant to customer requirement, and shipments will start in February as well.\n\n**Sooncheol Park** (EVP, Head of Corporate Management Operations, and CFO)\nNext, for HBM4E, we are planning to start sampling of standard products for customers sometime around the middle part of this year, whereas, custom HBM products based on HBM4E core dies will follow in the second half of the year as we plan to roll out first wafer runs, using a cross-project, horizontal rollout approach to meet customer timelines. Regarding, your question on HBM packaging and technology, I am aware that there is a lot of market interest toward our 16-high stacking or HCB, hybrid copper bonding technology.\n\n**Sooncheol Park** (EVP, Head of Corporate Management Operations, and CFO)\nFor the HBM3E or HBM4 16-stack product, customer demand is quite limited at this time, and since we'll be doing sampling of HBM4E 12-high product of equivalent density around midyear, we have concluded that it will not be necessary to do mass level commercialization of previous generation HBM3E or HBM4 16-high products. That being said, because we've already secured technology for TC-NCF-based 16-layer HBM packaging at mass production ready level, even if there are changes to customer requirements, we do not foresee any issues in terms of providing a timely response. For HCB, the next generation advanced stacking technology, we have shipped samples based on HBM4 last quarter and have begun technical discussions and will be proceeding with partial commercialization of select products at the HBM4E stage.\n\n**Sooncheol Park** (EVP, Head of Corporate Management Operations, and CFO)\nWe will continue to reinforce the competitiveness of our products, focusing on the high-end part of the HBM market, where supply shortage is expected for differentiation. For HBM4E and custom HBM, building on the stability of our established 1c nm process, we'll continue to maintain our position as a technology leader. Next, regarding our 2026 HBM sales outlook, all production-ready capacity is currently fully booked with customer POs, and we expect 2026 HBM sales to improve substantially, increasing by more than threefold year-on-year. One thing of note is that despite our efforts to ramp up supply, major customer demand for HBM in 2026 still exceeds available supply from us. So for volumes in 2027 and beyond, major customers are seeking to finalize supply discussions as soon as possible to secure supply.\n\n**Sooncheol Park** (EVP, Head of Corporate Management Operations, and CFO)\nAnd so in the short term, we'll be focusing on expanding capacity to respond to increased demand for HBM3E, while also carrying out proactive investments to secure 1c nm capacity for HBM4 and 4E at the same time, and so that we can continue to scale up our HBM supply capabilities, amid the surge in AI demand. Thank you.\n\n**Operator**\nThe next question will be by Mr. Jay Kwon from J.P. Morgan. Please go ahead.\n\n**Jay Kwon** (Executive Director)\nYes, good morning. Thank you for the opportunity. I will also ask two questions, one on memory and then display in this order. It seems first for memory, AI demand has been growing faster than the pace of capacity expansions by memory suppliers, and market supply shortages appear to be worsening. So if you could explain more about your business operations and directions for 2026, including your plans for portfolio mix. For display, in 2026, how do you think the rise in memory prices will be impacting displays overall, and what are your expectations for full year performance as well?\n\n**Jaejune Kim** (EVP of Memory)\nSo let me take the first question on our 2026 business operations for Memory.\n\n**Jaejune Kim** (EVP of Memory)\nYes, so demand has been rising sharply across AI applications, whereas expansion of supply capacity remains constrained within the memory sector. We expect a significant shortage of supply relative to demand to continue across all product categories, whether it is HBMs, conventional DRAM or NAND, with tight undersupply conditions expected for the time being. We've already been receiving requests from large customers, including GPU or ASIC developers and hyperscalers, who are projected to experience a steep rise in demand for multi-year supply contracts. Given these market demand trends driven by AI servers, we believe that for DRAM, the product portfolio will have to be adjusted with a greater focus around HBM and server DDR for AI applications.\n\n**Jaejune Kim** (EVP of Memory)\nAlso, when considering that price increases have varied across different products used in AI server applications, we may need to focus our product mix more on server DDR over HBM in the short term from a profitability perspective. However, to support the long-term health and sustainable growth of AI demand, we intend to maintain flexibility and provide a more balanced product mix between HBMs and server DDRs, rather than disproportionately favoring any single product category. Also, in the non-server segment, with profitability in mind, we'll focus supply on high performance, high capacity products in each segment to serve the high value and high-end market. For NAND, similar to DRAM, we continue to see strong demand from AI servers. We expect a particularly sharp rise in demand for TLC-based PCIe Gen 6 SSDs, especially for Key-Value SSD applications.\n\n**Jaejune Kim** (EVP of Memory)\nSo our market strategy will focus on TLC product category, which provides differentiated performance and expected to deliver higher margins to solidify our leadership in the server SSD market and steadily grow server SSDs as a share of total NAND revenue. Now, due to limited clean room availability, supply growth is expected to be constrained, in 2026 and 2027, and we expect supply shortages to continue. We have been receiving requests from customers for multi-year supply commitments, which we intend to respond to selectively, to hedge investment risk, while internally leveraging clean room space that we have already secured, through preemptive investments to expand supply.\n\n**Jaejune Kim** (EVP of Memory)\nAmidst stagnation in the smartphone market and rising competition among panel makers, along with other challenging business conditions, we are strengthening our leadership while delivering robust performance. In 2026, due to demand uncertainty in the smartphone market, stemming from rising memory prices and increased pricing pressure on panels, we expect the year to be more challenging than any previous year. Thus, we will significantly boost cost competitiveness through measures such as productivity improvements, and will continually develop differentiated technologies to reinforce product competitiveness, thereby maintaining our stable revenue. Also, through the mass production at the 8.6 generation IT OLED line slated to commence this year, we expect to lead the expansion of OLED adoption in the IT market and contribute to revenue growth. Despite changes in the external environment, we'll maintain a stable profit structure to further solidify the foundation for continuous revenue growth. Thank you.\n\n**Operator**\nThank you. I will move on to the next question. The next question will be by Mr. Sunwoo Kim from Meritz Securities. Please go ahead with your question.\n\n**Sunwoo Kim** (Senior Analyst)\nYes, good morning. This is Sunwoo Kim from Meritz. I would like to ask about your CapEx for 2026. So, like you have said, there is a supply shortage, and you're expecting strong AI-related demand to persist in the long term. So then what is the direction for your CapEx investments for memory this year?\n\n**Jaejune Kim** (EVP of Memory)\nYes, so let me cover the Memory CapEx question. Yes, we do expect AI-related demand to continue, and as we explained last quarter, we are planning a meaningful increase in our CapEx versus last year.\n\n**Jaejune Kim** (EVP of Memory)\nUp to now, we have been making preemptive investments over time, and have secured new fabs and clean room space in advance, and the additional CapEx will go towards supporting utilization of the available space. This can help us build up more supply in the short term, help us build a more competitive position within the industry. Going forward, we will continue this strategy of preemptive investments, in particular, as we position ourselves for a potential long-term rise in AI-driven demand. Our basic approach is to continue to invest, make advanced investments in new fab space and clean rooms. As we monitor demand trends, we may determine that capacity expansion is needed at some point, at which we'll be able to promptly execute the investment quickly.\n\n**Jaejune Kim** (EVP of Memory)\nThe increased CapEx amount budgeted for this year, like I said, will go toward preemptively securing new fab space and clean rooms. This will help strengthen our future supply capacity while allowing us to hedge against market volatility risk. In addition, we have also been investing in our next-gen semiconductor R&D complex, NRD-K. NRD-K will be a independent, self-sustaining research complex, where foundational technological research and product development can be carried out in one place, offering access to advanced infrastructure. NRD-K phase I opened starting in Q2 of last year, and we'll continue to expand the complex to solidify our development capabilities in advanced processes. Thanks to our efforts over the past year to regain technology leadership, we believe we have largely been able to secure product competitiveness. Now, building on this, we're actively expanding our advanced node mix.\n\n**Jaejune Kim** (EVP of Memory)\nIn the rapidly growing AI application market, securing high performance, high density products is critical, and to meet these market demands, advanced processes will become increasingly important for both DRAM and NAND. So in response, this year we'll focus on accelerating the build-up advanced process capacity, the 1c nm process for DRAM and V9 for NAND. Thank you. Thank you. We'll move on to the next question.\n\n**Operator**\nThe next question will be made by Mr. Nicolas Gaudois from UBS. Please go ahead, sir.\n\n**Nicolas Gaudois** (Managing Director of Equity Research, Head of Research ASEAN and Head of APAC Technology)\nThanks for taking my question. So first one is on Foundry. Could you update us on the progresses for 2 nm and 1.4 nm nodes in particular? And whether you expect further major customer wins after the Tesla order last summer? And if so, in which segments those would be between mobile and HPC-AI. Also, could you comment on your process for your memory foundry advanced packaging turnkey strategy? And then the second question relates to consumer electronics. Similar to what we discussed in mobile earlier, with consumer electronics and TV business is facing intense competition, top line margin pressure, perhaps component going forward by memory shortages, limiting potentially the sets units.\n\n**Nicolas Gaudois** (Managing Director of Equity Research, Head of Research ASEAN and Head of APAC Technology)\nHow do you see demand in the year ahead, and what could actually Samsung do to overcome those challenges? Thank you.\n\n**Sukchae Kang** (EVP of Foundry)\nYes, let me answer your question on Foundry. First, regarding the 2nm process, second generation, well, development is proceeding smoothly. We've been hitting our yield and performance targets and are on track to start 2nm mass production the second half of the year. We're working closely with key customers on PPA assessments and test chip collaboration in parallel for product design, so technology validation is moving along as planned ahead of mass production. The 1.4 nm process is also under development, where we're hitting major milestones as planned, with the goal of starting mass production in 2029. We're planning to distribute the PDK version 1.0 in the second half of next year, and with the release, we plan to initiate customer designs and ramp up early ecosystem development.\n\n**Sukchae Kang** (EVP of Foundry)\nBased on the progress achieved on our advanced node development, we are now in talks with mobile and HPC customers about product or commercial business collaborations. And since the Tesla award, we have been engaged in active discussions with large-scale customers from the U.S. and China. Most notably, we are expecting this year's 2 nm project awards to increase by 130% year-on-year, driven by HPC and AI applications. We are the only company in the world offering a fully integrated one-stop solution, spanning semiconductor design, foundry, memory and advanced packaging all together. We are actively developing and working with partners on the mass production of a range of HBM products, leveraging our one-stop solutions for 3D stacking of base dies built on logic process technology, and core dies built on memory process technology.\n\n**Sukchae Kang** (EVP of Foundry)\nWe're in talks with numerous customers seeking our one-stop solution for both product and commercialization opportunities. And so we expect this kind of turnkey business model to deliver tangible results in the mid to long term.\n\n**Sooncheol Park** (EVP, Head of Corporate Management Operations, and CFO)\nI'll take the question on VD. Amid a challenging environment marked by prolonged stagnation in the TV market and intensifying competition, we will secure new growth drivers through next-gen devices and expand our service business, which is expected to keep growing fast. Based on our premium technological capabilities, we will continue to strengthen differentiated product competitiveness to maintain brand advantages in the premium markets. We plan to introduce new Micro RGB models ranging from 55 to 130 inches, to preempt customer demand and establish a new mainstream category. Also, through the introduction of a differentiated Vision AI Companion, we plan to expand AI experiences that consumers realize in their daily lives. Furthermore, we'll enhance lineup efficiency, strengthen purchasing competitiveness, and improve process efficiency using AI to lift overall profitability. Second, we will proactively address the market trend towards service businesses.\n\n**Sooncheol Park** (EVP, Head of Corporate Management Operations, and CFO)\nIn the global ad-based free streaming service market, Samsung TV Plus is garnering the most attention. Samsung Art Store has solidified its position in the TV art market. We will further sophisticate these services and strengthen partnerships with diverse content companies to differentiate our offerings and drive revenue growth. Thank you.\n\n**Operator**\nThank you for the answer. We'll move on to the next question. The next question will be made by Simon Woo from Bank of America.\n\n**Hu Wenjie** (Director of Data Science and Global Risk Analytics)\nI am Hu Wenjie from Bank of America. I have two questions: First, when will the company cancel the treasury shares it currently holds? And could you please explain the scale of shareholder return resources generated in 2025? And the second question is that, what impacts does rising semiconductor costs have on the mobile business, and what are your corresponding strategies?\n\n**Sooncheol Park** (EVP, Head of Corporate Management Operations, and CFO)\nI will take the question on the shareholder return policy. First, with respect to the treasury shares, the board will decide the cancellation schedule and make a public disclosure in the first quarter of 2026. In addition, with the 2025 results in the books, the company's free cash flow was approximately KRW 36.5 trillion, and 50% of free cash flow, which is the basis for shareholder returns, is around KRW 18.3 trillion. Based on this, the company plans to provide KRW 9.8 trillion in regular dividends for 2025, and KRW 1.3 trillion in additional dividends. In addition, out of the KRW 8.2 trillion worth of shares acquired in 2025, excluding those reserved for employees, KRW 6.6 trillion worth will be canceled to faithfully implement the shareholder return policy.\n\n**Seong Hyuk Cho** (EVP for Mobile Experience)\nWe'll move on to the MX question, and I will answer this. As memory demand for AI server has expanded, memory supply shortages for mobile devices and sharp price increases started materializing in the fourth quarter of 2025. Therefore, we expect a challenging business environment in 2026. However, since this is an industry-wide issue, our competitors will also face the same environment. Based on a stable component supply through strategic partnerships with key suppliers, we plan to respond proactively and flexibly to changes in the market and competition landscape, while promoting resource efficiency activities across the entire process, thus minimizing risks of profit decrease through strategic measures.\n\n**Seong Hyuk Cho** (EVP for Mobile Experience)\nThank you for the answer. We'll move on to the next question.\n\n**Operator**\nYes, the final question will be by Mr. Young-Ho Ryu from NH Investment & Securities. Please go ahead.\n\n**Young-Ho Ryu** (Seinor Industry Analyst)\nYes, good morning. This is, Young-Ho Ryu from NH Investment & Securities. Congratulations on the good performance. I have a question on System LSI and then, on your shareholder returns. So for System LSI, I think it was mentioned about the rise in memory prices are placing added cost pressure for device makers, in mobile and PC. So what is the impact from System LSI's perspective, and how will you respond? And 2026 is the final year of your 2024 to 2026 shareholder return policy cycle. So I know this is still, early on in the new year, but have you been examining the new direction for your next cycle? And can you explain more about the additional dividend payout that was mentioned earlier?\n\n**Jason Shin** (EVP of System LSI)\nYes, let me answer your question on System LSI. So as you've noted, rising memory chip prices have been weighing on mobile set makers, driving up BOM costs. Based on our analysis of the smartphone market, while the mid- to low-tier segments are experiencing significant pressure on costs, in contrast, flagship and premium segments, the device makers are expected to differentiate through on-device AI and camera performance, and as a result, we anticipate sustained demand for high-performance SoCs and sensors to continue. We will leverage our new flagship SoC and 200-megapixel image sensor products to support our customers' differentiation strategies and plan on expanding supply to flagship and premium segments.\n\n**Sooncheol Park** (EVP, Head of Corporate Management Operations, and CFO)\nI'll answer the question on the company-wide matters. First of all, we are faithfully implementing the current three-year shareholder return policy, and when it comes to a new shareholder policy, management and the board believe enhancing shareholder value is a top priority, and are actively reviewing a new active shareholder return policy based on sustainable growth. We will provide updates when the direction of the new policy is finalized. The regular dividend is KRW 371 per common share and KRW 371 per preferred share, and the additional dividend is KRW 196 per share for both common and preferred shares. In order to increase dividends and vitalize the capital markets, the government introduced a separate taxation scheme for dividend income from high dividend companies.\n\n**Sooncheol Park** (EVP, Head of Corporate Management Operations, and CFO)\nTo meet the requirements, a company must maintain a dividend payout ratio of at least 25% and increase its total dividend amount by at least 10% compared to the previous year. The company decided to join the government initiative aimed at promoting cash dividends and stimulating both the domestic stock market and real economy, while meeting market expectations and offering potential tax benefits for shareholders, and accordingly resolved to pay additional dividends. Thank you.\n\n**Young-Ho Ryu** (Seinor Industry Analyst)\nThank you for the answer.\n\n**Sooncheol Park** (EVP, Head of Corporate Management Operations, and CFO)\nI'd like to thank everybody who shared their valuable opinion.\n\n**Operator**\nThat completes our conference call for this quarter. We wish all of you and those close to you stay strong and in good health. We thank everyone for your participation today. Thank you.",
      "fetched_at": "2026-02-04T15:55:09.300Z"
    },
    {
      "ticker": "005930.KS",
      "title": "SamsungElec (005930.KS) Q3 FY2025 earnings call transcript",
      "published_date": "Oct 30, 2025, 10:00 AM GMT+9",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/005930.KS/earnings/005930.KS-Q3-2025-earnings_call-369009.html",
      "content": "**Operator 1**\nHello everyone, and welcome to the Samsung Electronics 2025 third quarter financial results conference call. I will be your coordinator. All participants will be in a listen-only mode until we open the question and answer session following the presentation. As a reminder, this call is being recorded. I would now like to turn the conference over to the Investor Relations team. Please go ahead.\n\n**Daniel Oh** (Head of IR)\nWelcome everyone, and thank you for joining us from around the globe. I am Daniel Oh, Head of Investor Relations at Samsung Electronics. It's my pleasure to be with you on our earnings call today to discuss our third quarter results. Before we begin, I would like to address some important housekeeping and legal matters. As a reminder, you can follow today's broadcast and slide presentation on our IR website at www.samsung.com/global/ir. Additionally, this call is being recorded, and it will be accessible on the same platform for those who wish to review it at a later time. We kindly ask for your attention and cooperation as we move forward, as this session is designed to provide you with comprehensive insights into our financial performance and strategic outlook.\n\n**Daniel Oh** (Head of IR)\nI would like to remind everyone that this conference call may include forward-looking statements, which are based on our current expectations regarding future events. These statements are not intended to serve as guarantees of future performance. Our actual results could differ materially from these statements due to a variety of factors, including but not limited to market conditions, regulatory changes, and operational challenges. We appreciate your understanding and attention to these important considerations in our efforts to provide transparent and accurate information. With that in mind, I would like to outline today's format. I will begin the discussion with our third quarter financial performance, followed by EVP Sun Choi Park, our Head of Corporate Management Office and CFO, who will share our business outlook, capital expenditures, and updates on shareholder returns.\n\n**Daniel Oh** (Head of IR)\nWe'll then turn the call over to our executives, who will take this opportunity to discuss their respective business areas in detail. Following their presentations, we'll open the floor to our valued analysts for any questions they may have. Please note that this call is planned to last approximately one hour, and we appreciate your time and attention throughout the discussion. In addition to myself and our CFO, the other executives joining today's call are EVP Jaejune Kim, representing Memory, VP Hyeokman Kwon for System LSI, EVP Seok-Chai Kang for Foundry, who has joined us for the first time, EVP Joonyoung Park for Samsung Display Corporation, VP Daniel Araujo for the Mobile Experience, and finally, VP Mark Kim, representing Visual Display for this quarter. Now, let's begin with our consolidated financial performance for the third quarter of 2025. Our total revenue reached ₩86.1 trillion, up by 15.4% quarter on quarter.\n\n**Daniel Oh** (Head of IR)\nIn the DS division, sales increased by 19% sequentially, with the memory business setting a new all-time high for quarterly sales, driven by strong growth of HBM3E and server SSDs. In the DX division, revenue was up 11% quarter on quarter, thanks to the launch effects of new foldable phones and solid flagship sales. SG&A expenses came in at ₩21.3 trillion, and SG&A expenses as a percentage of sales declined by 3.1 percentage points sequentially to 24.8%. As of the end of the third quarter, year-to-date R&D expenses climbed to a record high of ₩26.9 trillion, reflecting our commitment to innovation and long-term growth.\n\n**Daniel Oh** (Head of IR)\nOperating profit totaled ₩12.2 trillion, representing a sequential increase of ₩7.5 trillion, and operating margin increased by 7.9 percentage points quarter on quarter to 14.1%, led by the DS division with increased memory sales, improved foundry utilization, and significantly reduced one-time inventory value adjustments compared to the previous quarter. Meanwhile, in the DX division, an increase in sales of high-value added products such as Fold7 contributed to the growth. Regarding currency effects, the Korean Won's relative strength against the U.S. Dollar weighed on our component business, as a significant portion of its transactions are in U.S. Dollars. However, the negatives were largely offset by positives in the DX division, resulting in a minimal overall impact on the company's operating profit. More detailed third quarter results of each business will be presented by executives shortly.\n\n**Daniel Oh** (Head of IR)\nBefore that, I would like to pass the conference call over to our CFO, Sun Choi Park, who will discuss the outlook for the fourth quarter and 2026.\n\n**Sooncheol Park** (CFO)\nThank you, Daniel, and good morning, everyone. I am Sun Choi Park, CFO of Samsung Electronics. It's a pleasure to join you once again on our earnings call. Firstly, our management is fully aware of the concerns the market and shareholders had concerning our performance through the previous quarter. However, thanks to the collective dedication of our employees in overcoming challenges, our third quarter results showed a clear rebound and meaningfully met market and shareholder expectations. Looking ahead, we'll continue strengthening our business overall, and we remain committed to delivering strong performances to meet expectations. Before we move on, I would like to express my sincere gratitude to our shareholders for your patience and confidence in Samsung Electronics, especially during such a challenging environment. Now, let's begin with the outlook for the fourth quarter of this year.\n\n**Sooncheol Park** (CFO)\nWe anticipate a mixed market environment in the fourth quarter, characterized by ongoing global trade and geopolitical risks on one hand, and on the other, the potential for growth driven by the rapid advancement of the AI industry. In light of this outlook, the DS division will focus on enhancing its performance by increasing sales of high-value added memory products tailored for AI. In the DX division, ongoing challenges such as heightened competition and tariffs may impact our projections for additional earnings growth. Nonetheless, we'll persist in our efforts to expand sales, placing a strong emphasis on advanced AI products. Next, I would like to share our outlook for the coming year. In the first half of 2026, we expect the semiconductor market to remain strong, driven by ongoing AI investment momentum.\n\n**Sooncheol Park** (CFO)\nHowever, due to the uncertainties such as tariffs for the second half, we'll provide a more detailed outlook during our earnings call for the second quarter of 2026. To navigate this uncertain environment, we'll utilize our strong technologies and diverse product portfolio to mitigate risks and maximize opportunities, resulting in continued sustainable growth. In the DS division, the memory business will make a timely investment and maintain its operational focus on profitability to actively respond to demand for high-value added AI products. At the same time, we'll promote the expansion of sales for cutting-edge products such as HBM and high-capacity DDR5 and eSSD. For System LSI, we plan to increase sales of premium SoCs and image sensors. The foundry business will work to strengthen its advanced processes and ensure a timely ramp-up for the U.S. Taylor Fab.\n\n**Sooncheol Park** (CFO)\nIn display, we'll further reinforce our leading market position with our competitive products from the new 8.6 generation IT OLED line, and by advancing our differentiated technologies and product excellence to meet the demand of AI devices. The DX division will strengthen its efforts to launch AI products equipped with the most innovative technologies through open collaborations with leading global partners in respective business segments. Through these initiatives, we'll expand sales of premium products and enhance profitability, driving overall growth and reinforcing our leadership across the board. In the MX business, the launch of the S26 series and other flagship products will provide our customers with enhanced performance and a more intuitive and elevated AI experience. Moreover, we'll continue to lead form factor innovations with the recently released Galaxy XR and the upcoming launch of TriFold, and leverage our differentiated Galaxy ecosystem to grow sales led by premium devices.\n\n**Sooncheol Park** (CFO)\nIn the video business, we'll drive sales growth by enhancing our premium leadership through the innovative new lineup, including Micro RGB and OLED TVs, and we'll deliver unique customer experience with continually improving AI features. In the DA business, we'll accelerate sales by strengthening the product lineups overall and improving differentiated connectivity between our products. Turning to CapEx, in the third quarter of 2025, CapEx decreased by ₩1.9 trillion compared to the previous quarter and by ₩3.3 trillion compared to the same quarter last year, coming in at ₩9.2 trillion. This included ₩7.8 trillion invested in the DS division and ₩0.8 trillion in display. For the first three quarters of this year, total CapEx was ₩32.3 trillion, down ₩3.6 trillion year on year. Of this amount, the DS division accounted for ₩28.5 trillion, while the display business represented ₩2.1 trillion.\n\n**Sooncheol Park** (CFO)\nFor the full year of 2025, CapEx is projected to decline by ₩6.3 trillion year over year, reaching a total of ₩47.4 trillion. Within this total, the DS division is expected to account for ₩40.9 trillion in CapEx, down ₩5.4 trillion, while the CapEx for the display business is anticipated to be ₩3.3 trillion, down ₩1.6 trillion. In memory, we expect overall CapEx to remain relatively flat year over year, although infrastructure investments are projected to decline. On the other hand, equipment investments, particularly those related to advanced node transitions, are anticipated to increase as we focus on expanding sales of high-value added products. In foundry, we are continuing to invest in advanced nodes, including 1.4 nanometer technology. However, we foresee a decline in total investment, with operations focused on improving and transitioning our current mass production lines.\n\n**Sooncheol Park** (CFO)\nIn the display business, our CapEx has mainly concentrated on reinforcing and upgrading existing production facilities. As major investments in the 8.6 generation line are nearing completion, we expect overall spending to decrease compared to the last year. In 2026, we'll flexibly respond to the growing demand for AI by increasing investment strategically as needed. Moving on to shareholder returns, the Board of Directors today approved a quarterly dividend of ₩370 per share for both common and preferred stock. Under our shareholder return policy for 2024 to 2026, we are committing to an annual payout of regular dividends totaling ₩9.8 trillion. The distribution for the third quarter, amounting to ₩2.45 trillion, is scheduled for payment in late November. Thank you.\n\n**Daniel Oh** (Head of IR)\nThank you, CFO Sun Choi Park. To wrap up this portion of the call, I am pleased to report that Samsung Electronics has maintained its position as the world's fifth most valuable brand for the sixth consecutive year in the Interbrands Best Global Brands Top 100 ranking. Our brand value was assessed at $90.5 billion, which was the highest among non-U.S. companies. The evaluation highlighted positives such as our AI capabilities across all business units, the application of AI home experiences across all products, focused investments in AI semiconductors, and a consumer-centric brand strategy. Now, the executives will provide more detailed information on their respective business units' third quarter performance, followed by their own business outlook. We'll start with Jaejune Kim, EVP of Memory Business.\n\n**Jaejune Kim** (EVP of Memory Business)\nGood morning. This is Jaejune Kim from Memory Global Sales and Marketing. In the memory market in the third quarter, demand remained strong and continued focusing on HBM, high-density DDR5, and server SSDs, as the need for high-performance and high-density server products is growing with the increasing investment in generative AI. As for mobile and PC, supply-demand dynamics remain tight due to the impact of industry supply response focusing on servers. In this situation, along with increasing HBM3E sales, we proactively addressed the demand in overall application, including servers, and our memory business in the third quarter recorded its strongest sales performance ever. Also, our performance improved significantly quarter on quarter, and the reduction in the inventory-related one-time charge that occurred in the previous quarter also somewhat contributed to the performance improvement. Now, let's move on to the outlook for the fourth quarter.\n\n**Jaejune Kim** (EVP of Memory Business)\nAlthough uncertainties from tariffs and macroeconomic trends exist, we expect data center companies to continuously expand their hardware investments because of the ongoing competition to secure AI infrastructure. Therefore, AI-related server demand keeps growing, and this demand significantly exceeds industry supply. For mobile and PC, we expect supply shortages to intensify further in conjunction with the industry server-focused supply trend, increased content superbucks driven by on-device AI, and seasonal demand effects. In the fourth quarter, we will maintain our active response to rising server demand. For DRAM, we plan to optimize overall profitability by managing our product mix, focusing on HBM3E and high-density server DDR5 products in response to the robust demand for AI and conventional servers. Also, for NAND, we will concentrate on expanding sales of high-density, high-performance server SSDs. Now, let's move on to the outlook for 2026.\n\n**Jaejune Kim** (EVP of Memory Business)\nWith the continued expansion of AI investments next year and the increase of memory-intensive computer servers prompted by the spread of AI agents, we expect to see simultaneous growth in AI and conventional server demand. Moreover, in the mobile and PC segments, we expect the trends of growing content superbucks to continue with the spread of on-device AI. Especially for NAND, we expect supply constraints to intensify as industry inventory levels slow down sharply, with the effect of SSD adoption as a replacement for nearline HDDs, which ensure supply. Accordingly, across overall applications, we are currently receiving memory demand for the year of 2026, and it's much stronger and faster than usual. It is expected that customers' demand for the next year will exceed our supply, even considering our investment and capacity expansion plans. In this situation, for DRAM, we plan to continue increasing the sales base for HBM.\n\n**Jaejune Kim** (EVP of Memory Business)\nIn particular, as for HBM4, from the initial stage of product development, we have already secured speed above 11 Gbps, exceeding the customer's requirement. With our industry-leading performance, we will focus on offering HBM4 centering on the high-end segment. Also, for conventional DRAM, we plan to increase the portion of high-value added products related to AI applications, such as high-density DDR5, LPDDR5X, and GDDR7. Also, for NAND, we will increase the sales portion of server SSD and high-density QLC in line with strong demand for AI, and we plan to strengthen our portfolio, focusing on cutting-edge products by continuing the transition to v8 and v9. Thank you.\n\n**Hyeokman Kwon** (VP of System LSI)\nGood morning. This is Hyeokman Kwon from the System LSI business. In the third quarter, the smartphone market showed signs of slowing growth following modest gains in the first half. Major smartphone OEMs, which had built up inventory in anticipation of potential U.S. delivery risks, began de-stocking in the second half, leading to weaker overall demand. We launched the industry's first 200-megapixel image sensors, featuring 0.5 micrometers ultra-fine pixels, laying the foundation for expansion in the high-resolution segment. In SoC, our approach focused on the stable supply of premium products to major customers' flagship lineups. However, overall demand declined for the first half due to broad-basis inventory adjustments and seasonal effects, resulting in flat quarterly earnings. In the first quarter, growth is expected to remain limited amid continued global economic uncertainties. With major OEMs maintaining cautious inventory levels, demand recovery is likely to be gradual.\n\n**Hyeokman Kwon** (VP of System LSI)\nAgainst this backdrop, we aim to expand Shimmer to two key customers' premium lineups and continue cost reduction initiatives to defend earnings. Looking out to 2026, overall smartphone demand in major markets such as China and the U.S. is expected to remain subdued, while the premium segment should continue to post solid growth, driven by lineup expansion and specification upgrades by leading OEMs. We are accelerating process stabilization and performance enhancement of our Exynos to secure adoption in key flagship models, while continuing to expand its market share in image sensors through differentiated technologies such as 200-megapixel and nano-prism sensors. Thank you.\n\n**Seokchai Kang** (EVP of Foundry)\nHello, everyone. This is Seok-Chai Kang from the foundry business. In the third quarter, while U.S. export controls on China impacted sales to certain clients, revenue was sustained at the previous quarter's level, driven by expanded sales to key customers in the U.S. and increased sales of memory products. Furthermore, profits saw a significant improvement due to a reduction in one-off costs, better line utilization, and the realization of cost-saving efficiencies. We also began mass production of our first product using the first generation of 2nm GAA process, while achieving a record-high order backlog driven by large-scale customer wins centered on advanced nodes. Looking ahead to the fourth quarter, the market is projected to see a slowdown in demand that had temporarily surged due to the U.S. government's tariff policies.\n\n**Seokchai Kang** (EVP of Foundry)\nHowever, strong demand in AI and HPC, along with the trend of semiconductor self-sufficiency in China, is expected to fuel continued growth. We aim to expand our sales by ramping up mass production of 2nm GAA process products, increasing shipments of HPC, automotive, and memory products, and further improve earnings by enhancing fab utilization. In advanced node, development of the second-generation 2nm GAA process is progressing as planned. We expect to expand orders for HPC and mobile applications based on our 2nm and 4nm GAA process. For mature nodes, we plan to broaden our customer base by diversifying into automotive and other applications through an expanded portfolio of specialty processors. For 2026, while the mobile market is projected to remain stagnant, we forecast continued robust demand for AI HPC applications. Notably, the full-scale expansion of 3nm and 2nm GAA process mass production is expected to drive growth in advanced nodes.\n\n**Seokchai Kang** (EVP of Foundry)\nHowever, global supply chain uncertainties stemming from intensifying U.S.-China technology competition and the U.S. government's semiconductor tariff policies are likely to persist, meaning demand volatility will also remain a factor. We plan to continuously increase the proportion of advanced nodes to address strong demand from AI HPC applications, thereby aiming for stable revenue growth. Specifically, we will pursue the mass production of second-generation 2nm GAA process products based on secured stability and focus on developing differentiated processors to strengthen our technological competitiveness. Additionally, we plan to expand demand for mobile and HPC through mass production of the performance and power-optimized 4nm GAA process and HBM4 baseline. In addition, our new Taylor Fab in the U.S., currently under construction, is scheduled to commence operations from 2026. Thank you.\n\n**Joonyoung Park** (EVP of Samsung Display Corporation)\nGood morning. This is Joonyoung Park from Samsung Display Corporation. In the third quarter, we delivered a sequential performance improvement in the mobile display business thanks to the robust demand for our customers' flagship smartphones and newly launched products. Furthermore, we also achieved sales growth supported by an increase in the IP OLED adoption rate. For the larger display business, amid the rising demand for QD-OLED gaming monitors, we recorded double-digit growth in monitor sales compared to the previous quarter by actively meeting our customers' needs. Also, we introduced a new 27-inch QHD lineup, laying the groundwork for an additional increase in demand for QD-OLED monitors. Next, let me share the outlook for the fourth quarter. On the back of favorable year-end seasonality, we expect the demand for premium products to stay solid.\n\n**Joonyoung Park** (EVP of Samsung Display Corporation)\nIn response, we will expand our sales by actively addressing customer demand for smartphones and boosting sales in non-smartphone segments such as IT, automotive, and gaming. We aim to maximize the sales of QD-OLED monitors with the expected full-scale launches of our new lineup. Furthermore, we will respond to our major customers' demand for TVs in the year-end peak season in a timely manner. Moving on to 2026, our outlook is quite conservative, considering the intensifying impact of tariffs and lingering macroeconomic uncertainties. However, OLED adoption is continuously rising in diverse applications thanks to its outstanding performance. Under these conditions, we plan to strengthen our product competitiveness for diverse segments, solidifying our market leadership. To start with, our new 8.6 generation IP OLED line, slated for mass production next year, will deliver competitive products, accelerating OLED penetration rate in the IT market.\n\n**Joonyoung Park** (EVP of Samsung Display Corporation)\nIn addition, we will expand our technology lead in smartphones by enhancing the quality of foldables and introducing differentiated technologies for AI devices, such as low power consumption and high refresh rate. Finally, for larger displays, we will continue to enhance the differentiated performance for TVs, such as brightness, and solidify our position in the QD-OLED monitor market by expanding lineups for both B2B and B2C and diversifying our customer base. Thank you.\n\n**Daniel Araujo** (VP of Mobile eXperience)\nHi, everyone. This is Daniel Araujo from the MX division. Let me share our results for Q3 as well as our future outlooks. The smartphone market rebounded in Q3 as macro uncertainties were somewhat alleviated due to progress in tariff negotiations among major countries, together with expectations of interest rate cuts. For the MX business, Q3 saw smartphone shipments of 61 million units, tablet shipments of 7 million units, and the smartphone ASP of $304. The launch of new flagship models contributed to growth in both sales and operating profit compared to Q2. Strong sales centered around the Fold7 resulted in double-digit growth in both shipments and value for foldable devices compared to the previous year, while the S25 series also maintained solid sales momentum.\n\n**Daniel Araujo** (VP of Mobile eXperience)\nThe growth of flagship sales as a portion of total smartphone sales, along with improved sales of new tablet and wearable products, enabled us to sustain robust double-digit profitability. Next, let me share the outlook for Q4. The smartphone market is expected to grow compared to the previous quarter due to seasonal factors. However, competition is expected to intensify, especially in the premium segment. In the MX business, we expect a decrease in both smartphone shipments and ASP in Q4, as well as a decline in tablet shipments compared to the previous quarter. We aim to continue robust sales of AI smartphones, including our foldable devices and the S25 series, and we'll also press forward with expanding Galaxy ecosystem product sales in conjunction with seasonal demand, focusing on premium new products.\n\n**Daniel Araujo** (VP of Mobile eXperience)\nAlthough we anticipate intensified competition and price increases in key components such as memory, we will persist in our efforts to achieve year-on-year annual revenue growth and maintain profitability through flagship-focused sales and efficiency improvements across all processes. Next, I'll share our outlook for 2026. The smartphone market is projected to be roughly flat in both value and volume. Within the premium segment, the ultra-premium segment is expected to see significant growth, especially around foldable devices. The mass segment is also anticipated to grow, mainly focused on higher price points. For ecosystem products, while tablets are experiencing a slowdown in replacement demand, the notebook PC segment is expected to expand due to growth of AI PCs and Windows 10 replacement demand. Additionally, the watch and TWS markets are projected to grow as interest in health and sports rises, together with the expansion of AI features.\n\n**Daniel Araujo** (VP of Mobile eXperience)\nMX will continue strengthening our leadership in AI and form factor innovation, maintaining our strategy focused on expanding flagship sales. At the same time, we plan to drive growth across all segments by expanding into new regions and channels, as well as upselling based on product competitiveness to solidify our leadership in volume. The S26 series will revolutionize the user experience with a user-centric next-generation AI experience, a second-generation custom AP, and stronger performance, including new camera sensors. For foldable devices, we plan to continue form factor innovations to strengthen our product lineup and provide new experiences, aiming to expand our customer base. In ecosystem products, we aim to increase premium product sales with superior products and more advanced and intuitive Galaxy AI features. In particular, we will continue to enhance health AI experiences in our watches and further expand our TWS lineup in order to create new demand.\n\n**Daniel Araujo** (VP of Mobile eXperience)\nThrough these efforts, we will continue our business growth momentum even in the face of anticipated challenges next year. Thank you.\n\n**Mark Kim** (VP of Visual Display)\nHello, everyone. I'm Mark Kim from the Sales and Marketing team of Visual Display. Let me briefly on the market condition and our results in the third quarter of 2025. In the third quarter, TV market demand increased quarter on quarter due to seasonality, however, it is expected to decrease slightly year on year as global TV market demand remains stagnant. For Samsung, we achieved solid sale growth in the premium segment, including new QLED, OLED, and large screen TVs. In response to intensifying competition in the entry-level market, we also diversified the QLED and 75 inches and above lineups to expand sales. Even so, our profitability decreased year on year due to stagnant TV market demand, declining sales, and increased costs driven by intensified competition. Now, let me go over the outlook for the fourth quarter of 2025.\n\n**Mark Kim** (VP of Visual Display)\nIn the fourth quarter, TV market demand is expected to increase slightly year on year, although competition is likely to intensify with the year-end peak season. For Samsung, through strategic collaboration with major channel partners, we will strengthen our sales program for premium and large screen TVs to preemptively capture peak season demand and achieve a turnaround in the second half of the year. The TV market in 2026 is projected to grow slightly compared to this year. Also, the portion of strategic products such as QLED, OLED, and large screen TVs above 75 inches, which are our core focus, is expected to expand further. For Samsung, we will strengthen premium leadership based on our innovative 2026 new lineup, including Micro RGB and OLED. In particular, with our new form factors, Micro RGB, we will secure new categories in advance and reinforce our technological edge.\n\n**Mark Kim** (VP of Visual Display)\nAt the same time, we will continue enhancing the competitiveness of the volume segment to drive a turnaround in revenue. By continuously advancing our AI features, we will deliver differentiated customer experience and solidify our leadership in the AI TV market. Lastly, the service business will drive solid profitability and growth momentum by advancing Samsung TV Plus content and advertisement. Thank you.\n\n**Daniel Oh** (Head of IR)\nThank you, Mark Kim, and all the other executives. That concludes our presentation on the third quarter performance of 2025 and brings us to the Q&A session, which will be conducted in Korean. Questions regarding company-wide matters will be addressed by our CFO, Sun Choi Park, and questions for other business segments will be answered by business representatives.\n\n**Operator 1**\n[Foreign language] We will now begin the Q&A session. If you have a question, press star and one on your phone. If you wish to withdraw, press star and two. The first question will be made by Choi KwonYoung from Citigroup.\n\n**Younghee Cho** (Financial Analyst)\n[Foreign language] Yes. First, congratulations on strong performance. I think recently on the semiconductor and memory side, I have one question for memory and then for the overall company. In the case of memory, it does seem that you have achieved strong performance in the third quarter. Could you explain more about third quarter bit growth and also pricing dynamics? Also, what is your outlook on the memory business for the fourth quarter? My second question is regarding your share buyback program. I understand that Samsung Electronics' share buybacks have recently been completed and finished. Could you provide further details on the current status?\n\n**Jaejune Kim** (EVP of Memory Business)\n[Foreign language] Oh, yes. Let me address third quarter memory performance and fourth quarter outlook. With the expansion of inference applications and wider adoption of agentic AI, AI-related CapEx among data centers has been increasing even more significantly versus our initial expectations.\n\n**Jaejune Kim** (EVP of Memory Business)\nWe continue to see strong demand in the memory market for both DRAM and NAND, driven by server applications. For mobile and PC applications, with the industry providing priority supply to address AI server demand, there are growing concerns of supply shortages, and we have seen a rise in market prices. Already strong AI-related demand is becoming even stronger, driving the overall memory market. In the third quarter, we also have expanded sales primarily of AI-related products to capture that demand. For DRAM, we expanded sales of HBM and high-density DDR5, LPDDR5X, and GDDR7 for servers, achieving bit growth in the mid-teens %. For NAND, our focus was on profitability, and we were able to proactively address demand for high-margin server SSDs, recording around 10% bit growth. Consequently, third quarter bit shipments outperformed our guidance, both DRAM and NAND, with a further reduction in our inventory levels.\n\n**Jaejune Kim** (EVP of Memory Business)\nIn the third quarter, impacted by rising pricing trends across the broad memory market, also increase in HBM sales mix, DRAM ASP rose by mid-10% Q on Q, and then by mid-single-digit %. Profitability-wise, as we explained, inventory valuation adjustments in the previous quarter were reduced, partially contributing to improved earnings performance. In the fourth quarter, with major CSPs expected to expand CapEx, solid AI-related demand will continue. Meanwhile, on the supply side, with inventory across the industry dropping to subnormal levels, supply is expected to be highly limited, and rising prices are expected to increase further for DRAM and NAND across all applications. Given these conditions, we intend to continue our profitability-focused operations for DRAM while actively capturing HBM3E demand. We'll also increase the share of high-margin products for server applications. Within servers, we'll focus on high-value products such as high-density DDR5 and LPDDR5X to drive sales.\n\n**Jaejune Kim** (EVP of Memory Business)\nThat being said, as overall inventory levels come down, our bit shipment growth is likely to be limited to the low single-digit % in the fourth quarter. In NAND, as we continue to transition to V8 and V9, we'll also look to expand sales of high-performance 16 terabyte and above TLC SSDs for AI inference servers. Meanwhile, we'll ramp up supply of ultra-high-density QLC SSD, which we collaborate on with large-scale data centers, starting from the fourth quarter onwards. However, as inventory has been declining at a faster pace and amid continued migration of legacy lines to advanced nodes, bit production loss may be inevitable in the short term. We expect fourth quarter bit shipments to come down to around 10% on a Q-on-Q basis. However, the share of server SSDs in our sales mix is expected to increase substantially.\n\n**Sooncheol Park** (CFO)\n[Foreign language] I will provide an update regarding our treasury shares. In November 2024, we announced a phased share repurchase program worth ₩10 trillion, which was fully completed by September 29. This was ahead of our original target date, and the revised target stated in the third share repurchase disclosure. By executing this share repurchase within a shorter time frame, we aim to actively enhance shareholder value. In addition to the annual dividend of ₩9.8 trillion, the company also completed further share repurchase during the quarter, reinforcing our active approach to shareholder returns. Also, following the completion of the share repurchase, regarding the possibility of additional returns, the management and the board are fully aware of the market's increased interest. As a result, the company is continuously reviewing strategies to enhance long-term shareholder value.\n\n**Sooncheol Park** (CFO)\nAdditionally, excluding those reserved for employee compensation, we'll decide on the appropriate timing to cancel the remaining repurchased shares in the near future. Collectively, these actions reaffirm our commitment to creating long-term value for our shareholders. Thank you.\n\n**Operator 2**\n[Foreign language] Yes, thank you very much. We'll now move on to the next question, please. The next question will be by Mr. Kim Dongwon from KB Securities.\n\n**Kim Dongwon** (Analyst)\n[Foreign language] Yes, congratulations on the highest performance in three years. I actually have one question for HBM. I think there's been a great deal of recent interest on whether Samsung Electronics passed the final qualifications from NVIDIA or not for HBM3E. Generally, on the status of your HBMs, could you provide an overview of your HBM3E and HBM4 business? Also, your sales outlook for HBMs in 2026?\n\n**Jaejune Kim** (EVP of Memory Business)\n[Foreign language] Yes, let me take your question on HBM. First of all, I must say that regarding our HBM qualifications, we are quite aware that the market is very interested. Due to our MDA commitments with our client, I'm afraid we are not able to comment further.\n\n**Jaejune Kim** (EVP of Memory Business)\nWhat I can share with you at this point is that we are seeing HBM demand grow at a faster pace than supply and that we have been expanding HBM3E mass production and sales to all of our customers. As a result, in the third quarter, our HBM bit shipments increased by mid-80% Q on Q. Excluding some small tail-end sales of legacy HBMs, our overall sales mix has now fully transitioned to HBM3E. For HBM4, as we explained at our earnings call late July, our development work is already finished, and we have shipped samples to all customers and are ready to start mass production and delivery in line with customers' required project timelines.\n\n**Jaejune Kim** (EVP of Memory Business)\nOne thing to look at regarding HBM4 commercialization is that as competition intensifies among customers for GPU performance, this has prompted some of the customers to change their original plans, and they have been asking for HBM4 with even stronger performance. From the startup phase of our development work on HBM4, we have made it a point to reflect these market needs in advance of the market, setting our performance targets above customer requirements in all our developments. Samples shipped to customers to date are fully capable of meeting 11 Gbps plus performance on low power consumption. Meanwhile, there's now fiercer demand for improved performance from AI applications. Because we expect a rise in demand for related HBM4, we will be proactive in executing on necessary investments to expand our 1C nano capacity. Lastly, let me address our sales forecast for HBM next year.\n\n**Jaejune Kim** (EVP of Memory Business)\nWhile our 2026 HBM bid production plan was set reflecting a significant YOY increase, we have already secured significant customer demand for the planned volumes. However, as additional customer interest keeps coming in, we are internally reviewing possible capacity expansions. That said, the recent rise in conventional DRAM prices has resulted in a sharp improvement in profitability. For any additional product mix, we will be considering the relative profitability of HBM versus conventional DRAM. Any additional capacity expansion will also be set at an adequate level as we continue to monitor evolving market conditions.\n\n**Operator 2**\n[Foreign language] Yes, the next question will be Mr. Jae Kwon from JPMorgan. Please go ahead.\n\n**Jay Kwon** (Executive Director of Global Equity Research)\n[Foreign language] Yes, this is Kwon Jae Han from JPMorgan. Thank you for the opportunity to ask some questions. My first is on memory. This is an extension of the prior question, but could you share your outlook on the memory market for 2026? Second, I understand that the company has recently announced an expanded stock compensation scheme for all employees and executives. Could you explain more about this in further detail?\n\n**Jaejune Kim** (EVP of Memory Business)\n[Foreign language] Yes, the 2026 memory market outlook, let me take that. Next year, we expect the memory market to continue growth momentum, continuously driven by AI application demand. As DRAM requirements become more advanced for AI use cases, the high-performance HBM4 market is expected to emerge at full scale, while server DRAMs will continue to shift toward higher capacities. As industry supply tilts toward HBM and server DRAM, mobile and PC applications will likely experience supply constraints.\n\n**Jaejune Kim** (EVP of Memory Business)\nFor legacy products like DDR4, LPDDR4X, GDDR6, as legacy processes accelerate transition to advanced cutting nodes across the industry, supply constraints have already been impacting prices, which rose sharply in the second half. This constrained supply condition is expected to continue next year as well. For NAND, similar to DRAM, demand is likely to increase mostly around high-performance, high-density products for AI. Also, a supply shortage in nearline HDDs may solidify demand for substitute products QLC SSDs, and industry inventory levels may bottom out faster than initially expected. Consequently, next year, amid overall bullish market conditions, even when assuming our CapEx and expansion and maximum production, customer demand will still exceed available supply, and our available supply will remain far short of meeting customer demand.\n\n**Jaejune Kim** (EVP of Memory Business)\nThat said, for the second half of 2026, given various geopolitical uncertainties such as tariffs or export controls on high-end AI chips, we are looking more cautiously at the possible impact to market conditions. Even under such market uncertainties, we will continue to strengthen the competitiveness of our products in line with market demand, and we plan to expand the supply of AI-related products. Targeting the high-growth AI market, we'll focus on commercialization of HBM4 with differentiated performance while expanding sales of high-density DDR5, SoCAM, GDDR7, and server SSDs. With products like 10.7 Gbps LPDDR5X and UFS 5.1, we'll also actively address specialized demand for on-device AI to lead the market.\n\n**Sooncheol Park** (CFO)\n[Foreign language] Next, I'll provide an update regarding employee stock compensation. As reported in the media on October 14, to support mid-to-long-term value creation, we plan to use performance stock units, or PSUs, and we'll expand stock compensation in the OPI performance incentive to include all employees. The goal is to motivate our people to focus on long-term performance and foster mutual growth across the company through this foundation. Under the performance stock units, or the PSU program, the final number of shares granted will be determined by the stock's three-year performance, and the granting of shares will then be made in installments over three years. This is an advanced compensation method linked to the company's future performance, designed to align employee rewards with the stock price and enhance shareholder value.\n\n**Sooncheol Park** (CFO)\nNext, the OPI stock compensation program will be expanded from executives only to include all employees, starting from the payout in January 2026. The program for executives, which began in January 2025 to strengthen responsible management, will be available company-wide. Of the ₩10 trillion worth of treasury shares repurchased over the past year, excluding the portion allocated for employee stock compensation, ₩8.4 trillion worth will be canceled at an appropriate time consistent with our previous disclosure. The ₩1.6 trillion worth of treasury shares repurchased for employee stock compensation will be used for existing programs such as OPI, while additional shares for the newly announced PSU program will be purchased in the future. The specific acquisition period and volume will be determined in consultation with the board and disclosed to shareholders accordingly.\n\n**Sooncheol Park** (CFO)\nOverall, linking employee compensation to the stock price enables employees to focus on enhancing the company's value and delivering long-term performance, while providing direct incentives to increase shareholder value so that we can remain committed to enhancing corporate value over the mid-to-long term. Thank you.\n\n**Operator 2**\n[Foreign language] We'll move on to the next question.\n\n**Operator 2**\n[Foreign language] The next question will be by Mr. Han Dong Hee from SK Securities. Please go ahead.\n\n**Han Donghee** (Analyst)\n[Foreign language] Yes, this is Han Dong Hee. I'm in charge of semiconductors at SK Securities. I have a question on foundry and another on smartphones. First, for foundry, it seems a third quarter loss appears quite noticeably reduced versus the second quarter. What are the main reasons and drivers? Do you expect this improvement to continue into the fourth quarter? For smartphones, in terms of profitability, amid a rise in memory and other component prices, do you think that you will be able to maintain current levels of profitability?\n\n**Seokchai Kang** (EVP of Foundry)\n[Foreign language] Yes, let me answer your question on foundry. In the first half of this year, there was impact from U.S.-China sanctions on advanced AI chips, and we did see an increase in certain one-off costs, such as inventory write-downs from products that became unsellable due to sales restrictions.\n\n**Seokchai Kang** (EVP of Foundry)\nThere was also impact from the sale of certain products produced at high cost during a period of low utilization in the second half of 2024 and also low utilization in the first half of 2025. However, in the third quarter, one-off costs from the second quarter declined, and we saw utilization improve, primarily around the advanced processes, resulting in cost savings, which combined led to a significant reduction in third quarter loss. In the fourth quarter, we will be ramping up mass production of new products, applying first-generation 2nm GAA process, and we also expect an uptick in sales in high-demand HPC and auto products from main customers in the U.S. and China, as well as memory products overall. We will engage in ongoing activities to further improve utilization and for cost efficiency gains, and we expect this to present additional improvements to our earnings.\n\n**Daniel Araujo** (VP of Mobile eXperience)\nI'll take your question on MX. Memory prices have seen a significant rebound beginning in Q3, with a steeper rise expected in Q4, leading to increased material costs for MX. Given the rising cost pressures, we aim to leverage the strong sales momentum of the Fold7 and Flip7, as well as the continuing strong sales of the S25 series to drive revenue growth from high-margin flagship models. We'll also drive sales of our newly launched Tab S11 and Watch8 series to strengthen our premium market position in ecosystem products. At the same time, we're continuing efforts on process optimization, such as using standardized components, as well as sharing components across product lines, while also pursuing efficiency improvements and cost reduction activities. Thank you.\n\n**Operator 2**\n[Foreign language] Yes, thank you very much. Moving on to the next question, please. The next question will be by Mr. Nicholas Godoy from UBS. Please go ahead.\n\n**Nicolas Gaudois** (Managing Director and Head of Equity Research in ASEAN and APAC Technology)\nThank you for taking my question. Earlier, you explained what you expect the memory business to be fairly strong in 2026. In light of that outlook, could you actually guide us on what Samsung memory CapEx will be looking like in 2026 compared to 2025 and maybe give a bit of clarity on DRAM versus NAND flash? Thank you.\n\n**Jaejune Kim** (EVP of Memory Business)\n[Foreign language] Oh, yes, let me address your question on memory CapEx. In 2026, we plan to maintain a proactive stance toward investments in memory. In fact, we are considering a significant year-on-year increase versus 2025. For several years now, we have been making steady investments in infrastructure to secure clean rooms for the future. Now, building on that as a base, we are looking to execute facility investments at a scale required to address rising demand. For DRAM, to address the rise in AI demand, we'll build on our 1B nano and 1C nano product portfolio and focus on capital investments to boost cutting-edge bit production. Also, to respond to mid-to-long-term future demand, we'll also carry out some construction investments as well. DRAM share of total investments will likely increase versus this year.\n\n**Jaejune Kim** (EVP of Memory Business)\nFor NAND, after confirming market demand, we intend to gradually increase the share of advanced processes in terms of our future directionality.\n\n**Operator 2**\n[Foreign language] Yes, thank you. We'll move on to the next question. The next question will be by Mr. SK Kim from Daiwa Securities.\n\n**S.K. Kim** (Research Analyst)\n[Foreign language] Yes, thank you for the opportunity to ask some questions. I'm Seong-Yoo Kim from Daiwa. I have a question for foundry and another for Samsung Display. For foundry, it seems that your investments in foundry for this year were significantly cut. Could you explain the reasons why? What is your direction for investments next year? What will be your areas of focused investment? For Display, other than smartphones, it seems that OLED penetration is increasing in these other non-smartphone applications as well. What is Samsung Display's strategy in that regard?\n\n**Seokchai Kang** (EVP of Foundry)\n[Foreign language] Yes, let me address the foundry CapEx question.\n\n**Seokchai Kang** (EVP of Foundry)\nThis year, we continue to invest for the future to secure competitiveness in our 2nm GAA process and 1.4nm advanced node processes. CapEx.\n\n**Seokchai Kang** (EVP of Foundry)\nVast production, however, was actually reduced year on year as we focused mostly on conversion of existing lines and line enhancements and upgrades. In 2026, we will maintain our basic position of flexible CapEx linked to customer demand and customer acquisition. We plan on finishing up construction on our new Taylor Fab for ramp-up of production, and we will be making facility investments toward our goal of supplying advanced semiconductor products to diverse customers in the U.S. In parallel, we'll also be preparing for mass production of new processes such as second-generation 2nm GAA process and 17nm CIS. CapEx will likely increase to 2024 levels.\n\n**Joonyoung Park** (EVP of Samsung Display Corporation)\n[Foreign language] Yeah. I'll give you an answer on the SDC. We have been extending our differentiated technologies proven over many years in smartphones to areas such as IT and auto, leading the expansion of the OLED ecosystem. Recently, across various products, including IT, automotive, and watches, the adoption of OLED has been increasing, resulting in a growing contribution to the company's revenue. In particular, with the expansion of AI IT devices, market demand for low-power and high-resolution OLED is increasing, and the adoption of OLED in IT products is expected to continue growing. In response, at the new 8.6 generation IT line, we plan to produce competitive products in 2026 to mainstream the IT OLED while strengthening production and customer support capabilities to secure a mid-to-long-term growth trajectory.\n\n**Joonyoung Park** (EVP of Samsung Display Corporation)\nFor automotive products, we'll leverage our competitive edge in rigid OLED to expand our business not only in premium but also in volume segment while applying UDC, new form factors, and other differentiated technologies to gradually increase OLED market share. We will further strengthen our competitive advantages in existing businesses while expanding our new growth industries, including IT and automotive, to establish a stable and balanced business portfolio. Thank you.\n\n**Daniel Oh** (Head of IR)\n[Foreign language] Thank you for the answer. I'll just take one more question due to time constraints.\n\n**Daniel Oh** (Head of IR)\nThank you.\n\n**Operator 2**\n[Foreign language] The next question will be made by Joonyoung Park from Goldman Sachs. You may go on.\n\n**Seung Junelee** (Managing Director and Head of Korea Alternative Investments)\n[Foreign language] Thank you for the opportunity. I'd like to ask about the DX division. Could you please provide any update on the status of the Exynos adoption as well as of AI usage patterns for smartphones? Also, the second question is centering on Chinese brands. Price competition in the TV market continues to intensify. What impact will it have on your TV business, and what are your strategies?\n\n**Daniel Araujo** (VP of Mobile eXperience)\nSure. In MX, we have clear standards for the experiences that each of our products should provide to customers. We thoroughly evaluate APs across many dimensions and select ones that meet our criteria. This year, the Exynos AP was adopted in several of our products, including the Flip7 and some Galaxy A series models. For next year's S26 series, the evaluation for the AP is still underway, so we can't yet confirm on next year's flagship lineup. Regarding AI usage patterns, this year's flagship devices show strong AI adoption with usage rates of Galaxy AI features of 60% weekly and 80% monthly. Features like Now Brief, which provides personalized information, and Photo Assist for AI photo editing have been well received by users. Going forward, we plan to integrate more AI applications through our AI agent in order to streamline complex tasks and expand AI utilization across Galaxy devices.\n\n**Daniel Araujo** (VP of Mobile eXperience)\nThank you.\n\n**Mark Kim** (VP of Visual Display)\n[Foreign language] I'd like to give you an answer on the TV part. In the TV market, aggressive pricing by competitors has boosted demand for entry-level models within each segment, heightening competition. Amid this difficult environment, we'll leverage our differentiated TV competitiveness to restore market share and return to a growth trajectory. First, we plan to launch a new form factor, Micro RGB, to reinforce our technology leadership. At the same time, we'll expand OLED sales to drive premium growth and maximize synergies between Micro RGB and the premium segments. Second, in the volume segment, we'll expand the application of our TV's key strengths, AI features, and lineups while strengthening our real QLED marketing communication to counter competitors' price-focused strategies and shift the basis of competition toward consumer value.\n\n**Mark Kim** (VP of Visual Display)\nIn September, we launched a conversational AI platform that provides natural interactions with Bixby to offer visually tailored information and recommendations called Vision AI Companion. In 2026, we plan to expand its availability across more lineups and countries to lead the AI TV market. Also, we will highlight the excellence and safety of our QLED TVs, which are the only products certified with real quantum dot display recognition. In addition, within the ultra-large TV segment, we'll expand our entry lineup, thereby strengthening our leadership in the 98-inch and up ultra-large TV market, which is showing rapid growth even within the volume segment. Last, our service business, which continues to deliver strong profitability, will further be expanded as a new growth driver for our TV business. Samsung TV Plus, our FAST service, will differentiate itself by securing exclusive and live content.\n\n**Mark Kim** (VP of Visual Display)\nTo drive growth in performance-based advertising revenue, we will also secure new advertisers. Thank you.\n\n**Daniel Oh** (Head of IR)\n[Foreign language] Thank you for the answer. I would like to thank everybody who shared their valuable opinion. That completes our conference call for this quarter. We wish all of you and those close to you to stay strong and in good health. We thank everyone for your participation today, and we look forward to speaking with you. Thank you.",
      "fetched_at": "2026-02-04T15:55:14.189Z"
    },
    {
      "ticker": "005930.KS",
      "title": "SamsungElec (005930.KS) Q2 FY2025 earnings call transcript",
      "published_date": "Jul 31, 2025, 10:00 AM GMT+9",
      "fiscal_year": "2025",
      "quarter": "Q2",
      "url": "https://finance.yahoo.com/quote/005930.KS/earnings/005930.KS-Q2-2025-earnings_call-334325.html",
      "content": "**Operator**\na reminder, this call is being recorded. I would now like to turn the conference over to the Investor Relations team. Please go ahead.\n\n**Daniel Oh** (EVP &amp; Head of Investor Relations)\nHello, everyone. Thank you for joining us today for Samsung Electronics Second Quarter twenty twenty five Earnings Call. I am Daniel Oh, Head of Investor Relations. It's my great pleasure to welcome you all to this earnings call. Before we proceed with the presentation, I want to take a moment to address some important housekeeping and legal matters.\n\n**Daniel Oh** (EVP &amp; Head of Investor Relations)\nAs a reminder, you can follow today's broadcast and presentation deck on our IR website at www.samsung.com/global/ir. Additionally, this call is being recorded and web webcast, and it will be accessible on the same platform for those who wish to review it at a later time. We ask for your full attention and cooperation as we move forward since this session is designed to provide you with comprehensive insights into our financial performance and strategic outlook. We kindly request your attention to the fact that this conference call may include forward looking statements, which are based on our current expectations regarding future events. Please note that these statements are not intended to serve as guarantees of future performance.\n\n**Daniel Oh** (EVP &amp; Head of Investor Relations)\nOur actual results could differ materially from these expectations due to a variety of factors, including but not limited to market conditions, regulatory changes and operational challenges. We appreciate your understanding and attention to these important considerations as we strive to provide transparent and correct information. With that, I would like to extend my gratitude once again for your presence and participation. Let us now proceed with the presentation, during which I will go through the key highlights of our second quarter performance, capital expenditures and sustainability management, which will be then followed by EVP, Central Park, our Head of Corporate Management Office and CFO, with our outlook for the second half of the year and comments on shareholder returns. We will then turn the call over to our executives, who will take this opportunity to discuss their respective businesses in detail.\n\n**Daniel Oh** (EVP &amp; Head of Investor Relations)\nFollowing their presentations, we'll open the floor to our valued analysts for any questions they may have. Please note that this call is planned to last approximately one hour, and we appreciate your time and attention throughout the discussion. In addition to myself and our CFO, the other executives joining today's call are Jeo Joon Kim EVP Jeo Joon Kim representing Memory VP Hyuk Man Kwon for System LSI VP Mi Jeong No for Foundry EVP, Joon Young Park for Samsung Display Corporation, who is joining us for the first time and VP, Daniel Araujo for the Mobile Experience last but not least, EVP, KL Ro for Visual Display. Let us comment through the details of our consolidated financial performance for the 2025. Our total revenue decreased by 5.8% quarter on quarter to KRW74.6 trillion.\n\n**Daniel Oh** (EVP &amp; Head of Investor Relations)\nTurning our attention to the DS division. Sales rose by 11% sequentially driven by increased sales of high value added memory products for server such as HBM3E and TDR5 as well as the expansion of major customers in foundry. In the DX division, revenue declined by 16% compared to the previous quarter due to the diminishing launch effects of new smartphone models coupled with intensified competition in TV and other segments. On the cost management front, SG and A expenses were successfully reduced by KRW0.6 trillion, bringing the total to KRW20.8 trillion. This reduction was achieved through the efficient management of sales and marketing costs, reflecting our commitment to optimizing operational efficiency.\n\n**Daniel Oh** (EVP &amp; Head of Investor Relations)\nAt the company level, operating profit stood at KRW4.7 trillion, representing a sequential decrease of KRW2 trillion compared to the previous quarter. Consequently, the operating margin contracted by 2.2 percentage points, settling at 6.3%. During the second quarter, the DS division, despite the mentioned revenue growth, recognized inventory value adjustments in the memory business and booked one off costs related to the impacts of export restrictions related to China in the non memory business. In the DX division, operating profit declined quarter on quarter weighted on a by sequential decline in sales volume following the launch of new smartphone motors in the first quarter. Regarding currency effects, the relative strengthening of the Korean won against the U.\n\n**Daniel Oh** (EVP &amp; Head of Investor Relations)\nS. Dollar has adversely impacted our operating profit by approximately KRW0.5 trillion compared to the previous quarter. This impact is primarily observed in our component business where a significant portion of transactions are conducted in U. S. Dollars.\n\n**Daniel Oh** (EVP &amp; Head of Investor Relations)\nNow turning to capital expenditures. In the second quarter of twenty twenty five, CapEx experienced a decrease of KRW0.9 trillion on a quarter on quarter basis, resulting in a total of KRW11.1 trillion. Of this amount, KRW9.8 trillion was allocated to the DS division, while KRW0.8 trillion was invested in the display business. This strategic allocation reflects the company's ongoing commitment to optimizing resource distribution across its key business areas, ensuring sustained growth and operational excellence. In memory, investments remained steady quarter on quarter as we continue the transition to advanced nodes, not only strengthen competitiveness in HBM and other high value added products, but also to ensure readiness for anticipated demand.\n\n**Daniel Oh** (EVP &amp; Head of Investor Relations)\nFoundry CapEx was down quarter on quarter reflecting on a conservative investment approach focusing on line conversions. For display, CapEx increased slightly quarter on quarter due to line upgrades for small to mid sized panels. I will now highlight our key achievements in sustainability management. On June 27, Samsung Electronics published its 2025 sustainability report. The report incorporates materiality assessments that are aligned with global disclosure standards and it features broadened disclosure of climate related scenarios to reinforce compliance with the international requirements.\n\n**Daniel Oh** (EVP &amp; Head of Investor Relations)\nIn the environmental domain, we remain committed to securing renewable energy as we demonstrated by the signing the power new power purchase agreements at key sites. As a result, the DX division achieved a renewable energy transition rate of 93.4%, while in the DFS division, we are scaling efforts to reduce direct carbon emissions by continually expanding the implementation of our internally developed regenerative catalytic system at our production sites. Also, we are committed to reducing Scope three carbon emissions across the value chain. As an example of our diverse initiatives, the application of a high efficiency energy technologies in major products achieved on average power reduction of 31.5% compared to the twenty nineteen levels. Meanwhile, we continue to advance our sustainability goals through the broad application of recycled materials in newly launched Galaxy Z47 and Z Flip seven.\n\n**Daniel Oh** (EVP &amp; Head of Investor Relations)\nThe new models incorporate an additional recycled material compared to their predecessors bring the total number to nine. With the recycled materials accounting for 13.7% of the total weight for the Z Fold 718.2% for the Z Flip seven. Notably, the cathode materials used in the batteries are made with 100% recycled cobalt and lithium. Once again, we reaffirm our unwavering commitment to further enhancing and expanding our sustainability initiatives. We recognize the critical importance of these efforts in addressing global environmental challenges and contributing to a more sustainable future.\n\n**Daniel Oh** (EVP &amp; Head of Investor Relations)\nOur dedication to this cause remains steadfast and we are actively exploring innovative strategies and solutions to ensure that our sustainability efforts are both impactful and enduring. With that, I will now pass the conference call over to our CFO, Central Park.\n\n**Park Soon-cheol** (CFO)\nThank you, Daniel, and good morning, everyone. I am Sun Chul Park, CFO of Samsung Electronics. It's a pleasure to join you once again on our earnings call. I'll now present our outlook and review our shareholder return policy. Let's start with the outlook for the second half.\n\n**Park Soon-cheol** (CFO)\nDespite ongoing global economic concerns driven by uncertain trade policies and the geopolitical tensions, the IT industry appears post for a gradual recovery fueled by increasing momentum in AI and robotics. In this context, we anticipate a rebound in our performance in the second half, following a bottoming out in the second quarter with the earnings expected to improve steadily as the year progresses. In the DS division, we are making on all our efforts to restore fundamental technology innovation. Also, we've taken steps to address operational inefficiencies and have reflected inventory value adjustments in the second quarter. Looking ahead, we are truly preparing for a turnaround in the second half.\n\n**Park Soon-cheol** (CFO)\nIn addition, we aim to further reinforce our technology leadership and proactively position ourselves to meet the growing demand for high value added and AI driven products. We expect the demand for memory to maintain its momentum across all applications. In this regard, we are actively focused on AI related products such as HBM3E as well as high capacity, high performance offerings. For system LSI, we are working to drive sales growth by enhancing the capabilities of our flagship associates and capitalizing on their rising demand for ultra high resolution image sensors. For our foundry business, we expect a gradual improvement in profitability from expanding our customer base and utilization rates while also strengthening our two nano technology.\n\n**Park Soon-cheol** (CFO)\nIn the display business, we anticipate improved results supported by new product launches from key smartphone customers. Additionally, we plan to expand the sales in the IT, auto, monitor and other segments. In the DX division, with the uncertainties stemming from tariff policies likely to persist, we are thinking diverse methods to minimize related impact. In the MX business, we will drive sales of premium mobile AI devices, including our newly launched foldables and aim to lead the market by expanding our ecosystem through innovative form factors like the upcoming Trifold device and our first XLR headset as well as services such as connected health. As the world leading sale of mobile devices, MX will establish a distinctive AI ecosystem through the collaboration with the leading global AI and tech companies by positioning our devices as the central platform of a truly open and advanced AI ecosystem will secure AI competitiveness while continually driving business innovation.\n\n**Park Soon-cheol** (CFO)\nFor the VT business, we'll further solidify our market leadership with strengthened AI features to deliver unique viewing experiences, amid diverse challenges due to stagnant growth and intensified competition in the market TV market. For the DA business, we aim to reinforce the sales of innovative AI based products and focus on aligning the business around high value added segments such as HVAC. Overall, we are actively driving AI transformation across whole business across to enhance the internal productivity and strengthen business capabilities. We will extend our leadership in launching products with the internally developed AI functionalities and maximize product differentiation and the service value by connecting AI infrastructure, models, devices and services. Moving on to shareholder returns.\n\n**Park Soon-cheol** (CFO)\nToday, the Board of Directors approved a quarterly dividend of $3.67 per share for both common and preferred stock. Under our shareholder return policy from 2024 to 2026, the annual payout of regular dividends is set at trillion and the quarterly distribution of KRW2.45 trillion for the second quarter is scheduled for payment in late August. In November 2024, we announced KRW 10,000,000,000,000 based share repurchase program. As of May 2025, we will acquire the shares worth KRW 6,100,000,000,000.0 across two separate phase. The KRW 3,000,000,000,000 worth of shares acquired in the first phase were canceled in February, while the KRW 3,000,000,000,000 worth of shares from the second phase, excluding common shares was trillion, earmarked for executive and employee compensation are scheduled to be canceled in due course.\n\n**Park Soon-cheol** (CFO)\nFor the third and final share repurchase of KRW3.9 trillion approved by the Board of Director on July 8, KRW1.1 trillion worth of shares will be allocated for executive and employee stock compensation, including incentives, with the remaining balance of KRW2.8 trillion designated for shareholder returns. We expect to complete the full program on October 8, ahead of the original one year target of November 14. Our primary objective is to fulfill our commitment to shareholders and executing these buybacks more quickly than originally planned shows our dedication to delivering on our promise in a timely manner. The KRW10 trillion repurchase program will be completed as promised And in the near future, we'll determine the appropriate timing to cancel the repurchase shares aimed at enhancing shareholder value. Thank you.\n\n**Daniel Oh** (EVP &amp; Head of Investor Relations)\nThank you, CFO, Central Park. Now each executive from different business segments will provide more detailed information on their respective business units' second quarter performance followed by their outlook. We will then start with Jejun Kim, EVP of Memory business.\n\n**Jaejune Kim** (Executive Vice President of Memory)\nGood morning. This is Jejun Kim from Memory Global Sales and Marketing. In the memory market in the second quarter, the recovery of demand became more visible than previously expected, thanks to strong AI server demand. And demand for server SSD also increased as previously suspended data center projects resumed. In addition, we saw an increase in the market price for DRAM legacy products as the supply reduced with the impact of the industry's capacity transition to cutting edge nodes.\n\n**Jaejune Kim** (Executive Vice President of Memory)\nIn this situation, we increased the sales of HGBM3E products and responded to robust demand for servers, while expanding the portion of high density TDDIO5 products. Moreover, we delivered initial mass products of LPDDR5X for AI servers to the major customer. As a result, compared to the previous quarter, BIG growth for DRAM increased by low teens percentage, in line with the initial guidance. For NAND, we exceeded our BIG guidance as the BIG growth increased by high 20% compared to the previous quarter by actively responding to server SSD demand improvements. Thus, our inventory level decreased significantly.\n\n**Jaejune Kim** (Executive Vice President of Memory)\nIn the second half of the year, although uncertainties such as tariffs are likely to persist, AI demand should remain robust, thanks to continued investments at major cloud service providers. Therefore, we expect server demand for both DRAM and NAND to remain strong. In addition, our demand for PC and mobile is expected to show momentum, driven by seasonal effects in the second half and the spread of on device AI. We plan to keep operating our business focusing on profitability for both DRAM and NAND in the second half of the year. For DRAM, to align with strong AI server demand, we plan to proactively address the trends toward high density and product diversification with our HBM, high density DDR5, HDDL5X4 AI servers and so on.\n\n**Jaejune Kim** (Executive Vice President of Memory)\nFor NAND, as we expect inventory levels to be normalized, we will prioritize the sales of high density and high performance SSDs for server and storage. And we will continue to enhance our cost competitiveness by accelerating the transition to V eight for all application. Thank you.\n\n**Hyeokman Kwon** (Vice President, System LSI)\nGood morning. This is YoungMangwon from the System LSI business. In the second quarter, macroeconomic growth forecast is faced a repeated downward revisions, underscoring a notable economic slowdown. Nevertheless, the smartphone market maintained a gradual recovery bolstered by temporary U. S.\n\n**Hyeokman Kwon** (Vice President, System LSI)\nTariff exemption and China's subsidies. In addition, the launch of new models by major customers further catalyzed component demand, contributing positively to market dynamics. Amid expanding external uncertainties, we delivered resilient performance through strategic product mix optimization and market diversifications. In the SoC business, we commenced mass production and expanded supply of our flagship products utilizing the GAA process, which is specialized in improving performance and power consumption for the future products. Combined with our sensor business' robust sensor over 200 megapixel tele and wider product lines, these efforts drove record high revenue for the first half of the year.\n\n**Hyeokman Kwon** (Vice President, System LSI)\nHowever, increased development cost for advanced products constrained our extent of profitability improvement. Looking ahead to the second half, the smartphone market is projected to experience a moderate growth momentum. While the first half will benefit from distributors' inventory buildup to mitigate tariff risk and the impact of Chinese subsidies, demand expansion is expected to be limited as major customers focus on depleting accumulated inventory. In the SoC business, will prioritize stable supply for production models launched in July, while concentrating on securing process and yielding competitiveness for next generation flagship products to secure entry into major customers twenty twenty six lineups. In the sensor business, we will continue to lead the ultra high resolution market and expand the adoption of Nanoprism technology based on products with enhanced low light image quality.\n\n**Hyeokman Kwon** (Vice President, System LSI)\nThese initiatives aim to sustain revenue and enhance profitability. Through these strategic efforts, we are committed to strengthen our competitive position and driving sustainable growth in the challenging market environment. Thank you.\n\n**Mijung Noh** (VP - Foundry)\nHello, everyone. This is Mi Jong No from the Foundry business. In the second quarter, the broader market faced continued headwind from muted mobile demand and persistent U. S.-China trade restriction. Even so, solid momentum in AI HPC application underpinned overall industry growth.\n\n**Mijung Noh** (VP - Foundry)\nWe commenced full scale volume production of three nanometer GE mobile products and expanded sales on the back of strong demand from U. S. And Chinese key customers, resulting in a significant quarter over quarter revenue increase. Even so, U. S.\n\n**Mijung Noh** (VP - Foundry)\nExport control on advanced AI chips for China led to sales restrictions and related to related inventory value adjustment, while sustained raw fab utilization at mature node weighed on profitability. Despite these challenges, we completed reliability assessments for the first generation two nanometer process, ensuring seamless wetness for mass production. Additionally, we established the technical infrastructure necessary to support customer design enablement for the second generation two nanometer and performance and power optimized four nanometer processes in a timely manner. These efforts bolstered our advanced node competitiveness, enabling us to secure increased orders from major customers. In mature nodes, we enhanced our specialty process capabilities by completing the development of PPAC optimized low power FinFET process for image sensor applications.\n\n**Mijung Noh** (VP - Foundry)\nThis has allowed us to actively pursue and expand new business opportunities. Looking to the second half, geopolitical uncertainty driven by intensifying U. S.-China technology rivalry and potential U. S. Semiconductor tariff policies will likely persist.\n\n**Mijung Noh** (VP - Foundry)\nNevertheless, robust AI and HPC demand is expected to sustain strong growth and advanced nodes. We anticipate revenue improvement in the second half driven by the full scale mass production of new mobile products using the first generation two nanometer process. By continuing to expand sales to Chinese and U. S. Customers with a strong demand, we aim to simultaneously enhance web utilization rates and profitability.\n\n**Mijung Noh** (VP - Foundry)\nIn advanced nodes, we will focus on stabilizing the two nanometer process while ensuring mass production readiness for automotive grade four nanometer processes supported by stable yields. Furthermore, we will strengthen our advanced node portfolio by securing 2.5D three d advanced packaging technologies. For mature node, we will enhance our competitive edge and specialty technologies, including 14 nanometer automotive, RF millimeter wave and 17 nanometer DDI platforms. By leveraging these advancements, we will actively pursue new business opportunities and expand the customer orders. Thank you.\n\n**Joonyoung Park** (EVP - Samsung Display Corp)\nGood morning. This is Jun Young Park from Samsung Display. I will now brief you on our results for the second quarter. For the mobile display business, we achieved revenue growth compared to the previous quarter despite the sales stagnant demand in the smartphone market. The growth was supported by timely supply of new smartphone products to our major customers and increase in sales for IP and automotive segments.\n\n**Joonyoung Park** (EVP - Samsung Display Corp)\nFor the larger display business, sales volumes for TV and monitors increased quarter on quarter, driven by strong performance of QD OLED. In detail, we responded to our major customers' needs in the TV market. And for monitors, following our high resolution products, we further strengthened our premium lineup with the launch of 500 hertz refresh rate model and achieved sales growth, especially in the gaming market. Now I will share our outlook and strategies for the second half of the year. For the mobile display business, we expect our sales to increase as our major customers launch flagship smartphones.\n\n**Joonyoung Park** (EVP - Samsung Display Corp)\nHowever, uncertainties are likely to persist due to external factors such as tariff. In response, we will concentrate on driving sales growth and maintaining our leadership in the smartphone market by further enhancing our differentiated technologies. These include the world's first commercialized polarizer free technology, which enables low power consumption as well as slim foldables with enhanced durability. We will also continue to expand the sales in IT and automotive segments. Lastly, I will discuss our outlook for the larger display business.\n\n**Joonyoung Park** (EVP - Samsung Display Corp)\nIn the premium TV market, the OLED adoption rate continues to rise. In the second half, we will not only address demand for TVs, but also strengthen our market presence in the premium segment by continually developing high performance products. In addition, we expect QD OLED monitors to continue their strong momentum, driven by rising demand for gaming monitors. By offering diverse refresh rates, we aim to broaden our product lineup across both B2C and B2B sectors, accelerating the penetration of QD OLED in the monitor market. Thank you for listening.\n\n**Daniel Araujo** (VP - Mobile eXperience)\nHi, everyone. This is Daniel Varahoe from the MX division. Let me share our results for Q2 as well as our future outlook. The smartphone market remained seasonally down in Q2 with demand declining compared to the previous quarter. For the MX business, Q2 saw smartphone shipments of 58,000,000 units, tablet shipments of 7,000,000 units and the smartphone ASP of two seventy dollars While smartphone shipments decreased compared to Q1 when our new flagship models were released, both revenue and operating profit showed year on year growth.\n\n**Daniel Araujo** (VP - Mobile eXperience)\nThis was made possible by robust sales of flagship models, especially the S25 series, as well as strong performance across our major products, including the A Series and tablets. Some components, including memory and displays, saw a slight decline in price versus last year, while we also continued initiatives focused on resource efficiency. And as a result, we maintained double digit profitability in Q2. Moving on to the second half of the year. Overall smartphone demand is expected to contract slightly year on year due to concerns about rising tariffs in mature markets and the continued slowdown driven by persistent inflation.\n\n**Daniel Araujo** (VP - Mobile eXperience)\nHowever, the premium segment is projected to grow modestly driven by shifting consumer preferences toward higher end products due in part to economic growth in emerging markets. While the tablet and wearable markets are also expected to decline year on year due to macroeconomic uncertainties, the TWS market is poised for growth as adoption expands in emerging markets. For the MX business, we expect an increase in smartphone shipments and ASP in the third quarter, while tablet shipments are expected to decline sequentially as we transition to new models later in the year. We will continue our flagship first approach in the second half, and we are confident in the strong market reception of our newly launched seventh generation foldable products, which feature significant advancements in performance, design and durability. The Galaxy Z Fold seven, the thinnest and lightest model in the Fold series to date, combines the portability of a bar type phone with the expansive display of a tablet, featuring ultra level features such as a 200 megapixel camera.\n\n**Daniel Araujo** (VP - Mobile eXperience)\nThe Galaxy Z Flip seven delivers improvements in two key areas, design and portability, and optimizes the Galaxy AI experience for the larger flip cover screen. With the integration of One UI eight optimized for the foldable form factors, alongside an expanded lineup, we aim to drive new demand and broaden our customer base. For the Galaxy S25 series, we will focus on maintaining sales momentum with seasonal promotions as well as an earlier launch of the S25 FE. We are also strengthening the A Series lineup with new entry level models, while emphasizing awesome intelligence and extended OS upgrades to differentiate our product experience. Furthermore, we're expanding channel presence in growth markets to increase our market share.\n\n**Daniel Araujo** (VP - Mobile eXperience)\nBeyond smartphones, we are accelerating our ecosystem strategy in the second half of the year with a range of new products designed to maximize Galaxy's competitive edge, including a next generation form factor. First, we are set to release the Galaxy Tab S11 series powered by enhanced AI capabilities and new mid tier and entry level models will complete our portfolio. In wearables, the recently launched Galaxy Watch eight Series introduces a bold new cushion design across all models and integrates Gemini for innovative AI functionality. With the refresh of the Galaxy Watch Ultra model for 2025 and the return of the Galaxy Watch Classic after a two year hiatus, we are poised to strengthen our position in the premium wearable market. In addition, with the pending acquisition of U.\n\n**Daniel Araujo** (VP - Mobile eXperience)\nS.-based digital healthcare company ZELF, we aim to accelerate the transformation of Samsung Health into a connected care platform. In TWS, our Galaxy Buds lineup will expand in order to address demand across all price segments. Meanwhile, we are also preparing to introduce next generation innovative products, including our XR headset and Trifold smartphone this year. Our XR headset, which seamlessly integrates the XR ecosystem developed in partnership with Google, as well as multimodal AI capabilities, will serve as a key stepping stone in solidifying our leadership in future technologies and further expanding the Galaxy ecosystem. Despite ongoing macroeconomic uncertainties and anticipated increases in material costs, the MX division will focus on expanding flagship sales and our ecosystem business with a focus on new premium products.\n\n**Daniel Araujo** (VP - Mobile eXperience)\nWe will also continue to optimize operations across the board in order to maintain robust profitability. Thank you.\n\n**KL Roh** (EVP - Visual Display)\nHello, everyone. I'm KL Lo from the sales and marketing team of Visual Display. Let me brief you on the market condition and our results in the 2025. In the second quarter, TV market demand is projected to decrease slightly year on year due to the impact of last year's big sporting event. However, demand for premium and big TV remained solid.\n\n**KL Roh** (EVP - Visual Display)\nFor Samsung, we expanded the sales portion of premium products by driving sales of Neo QLED, OLED and SuperVic TV. Even so, our profitability decreased year on year due to stagnant TV market demand, declining the sales and increased cost, driven by intensified competition. Now let me go over the outlook for the 2025. In the second half, TV market demand is expected to decrease slightly year on year as economic uncertainties raise the concern over inflation. However, the growth trend of high value added products, including QLED, OLED and SuperBic TV will continue.\n\n**KL Roh** (EVP - Visual Display)\nFor Samsung, based on the new lineup with enhanced AI feature and viewing experience, we will preemptively capture peak season demand and achieve a turnaround in sales growth. In addition, we will reinforce growth engine by enhancing communication of our key strengths such as SmartThings, NOx Security, Slim Design and App Store. Lastly, with an unmatched leadership in global TV sales for nineteen consecutive years, the service business will drive solid profitability and growth momentum by advancing TV plus content and advertisement. Thank you for listening.\n\n**Daniel Oh** (EVP &amp; Head of Investor Relations)\nMany thanks to all the executives who present their business updates. That concludes our presentation on second quarter performance of 2025 and brings us to the Q and A session, which will be conducted in Korean. Given that the company's presentation lasted longer than we expected, we will try to get receive as many as questions as we can today. Questions regarding company wide matters will be addressed by our CFO, Central Park, and the other business segments will be answered by each business representative. Operator, you may now open the line for analyst questions.\n\n**Moderator**\nWe will now begin Q and A session. The first question will be made by Simon Woo from Bank of Korea. Thank you for the opportunity. I am Udong jae from Bank of America. I'd like to ask about tariff impacts.\n\n**Moderator**\nThis morning there was a news article that U. S. Korea have reached an agreement on trade. How will it impact your business and what's your response strategy? We believe that the conclusion of the negotiations between Korea and The U.\n\n**Moderator**\nS. Has helped to reduce uncertainties. We will actively monitor the detailed aspects of the agreement by closely paying attention to the follow-up discussions between the two governments and will prepare response measures accordingly. Additionally, in mid August, the U. S.\n\n**Moderator**\nDepartment of Commerce's Section two thirty two investigation on semiconductors and derivative products is expected to be announced and we are paying close attention to the results. Considering the investigation includes semiconductors along with smartphones, tablets, PCs, monitors and other end products, the findings may significantly impact our business. We've been sharing our views on the Section two thirty two investigation directly and indirectly and are in communication with the relevant authorities of both countries. Potential risks and opportunities stemming from both the investigation and agreements will be thoroughly analyzed to prepare response measures in a way that minimizes the impact on our business. Thank you.\n\n**Moderator**\nYes, thank you very much. We will move on to the next question please. The next question will be made by Mr. SK Kim from Daiwa Securities. Please go ahead.\n\n**Moderator**\nYes, morning. Thank you for the opportunity to ask some questions. I'm Sung Kyu Kim from Daiwa. I have some questions regarding your foundry business. So I think there was a recent announcement about the large scale order win.\n\n**Moderator**\nSo if you could elaborate more on those details. And does this mean that there's a likelihood of increased CapEx either this year or next year, including at the Taylor fab? Yes. Let me answer the question on the foundry business. Well, regarding the major client award, I would like to first seek your kind understanding.\n\n**Moderator**\nWe're not able to comment on detailed contractual terms. That being said, we have won a $16,500,000,000 order from Tesla for a next generation product to be built based on our advanced process technology, which demonstrates the competitiveness of our advanced process capabilities. So with this as an inflection point, we hope to win additional orders from other major customers and we expect it to help boost higher and more stable fab utilization at our advanced nodes, including the Taylor plant, which will in turn help boost revenue and profits. Regarding investments, our goal has been to win next gen chip awards from diverse U. S.\n\n**Moderator**\nClients as we set up our new Taylor fab, which is set to ramp up operations from 2026. Currently, we are working to strengthen local execution to ensure timely operations and customer engagement at the new fab. Meanwhile, our investments in the Taylor plant for this year is projected to be inside the scope of our existing CapEx plan for 2025. That said, when considering the ramp up time line for the Taylor fab, we'd expect higher CapEx in 2026 versus this year. Yes, Thank you. And we'll move on to next question please.\n\n**Moderator**\nNext question will be made by Kim Do Kwon from JPMorgan. Yes. Thank you very much. This is Kyung Kwan from JPMorgan. I have some questions about memory.\n\n**Moderator**\nSo changes to ASP trends in the second quarter for DRAM and NAND, if you could provide some more details. And then if you look at the tentative earnings disclosure for the second quarter, it does seem that you recorded some one off expenses. So do you expect similar one offs in the third quarter as well? Yes. I will cover your question regarding second quarter performance for memory.\n\n**Moderator**\nSo due to U. S. Tariffs and other geopolitical issues, we did hold a rather conservative outlook on the memory market in the quarter. Later, however, as GPU supply conditions across the industry started to visibly improve, that's when AI related demand really started to scale. And we saw a clear turnaround in the business cycle from the midpoint of the second quarter onward.\n\n**Moderator**\nFor DRAM legacy products like DDR4 and LPDDR4X, supply declined amid a broad shift in industry capacity to advanced process nodes coupled with anxiety from clients over uncertainty of future supply. This led to a steep increase in market pricing across distribution channels starting in the second half of Q2. Given these conditions, we focused on capturing the short term upside in demand for legacy DRAM like DDR4, LPDDR4X, while boosting sales of advanced products such as HBM3E, DDR5, LPDDR5X and GDDR7. As a result, DRAM bit growth increased by a low teens percentage Q on Q in line with our bit guidance, while inventory decreased to below normal levels. For conventional DRAM, at the start of Q2 based on our conservative market view at the time, we expected ASP to drop by mid single percentage, but pricing actually ended the second quarter up by a low single digit percentage versus the first quarter.\n\n**Moderator**\nSo after declining in Q1, ASP started rebounding in the second quarter, Considering most clients do price negotiations on a quarterly basis, the uptrend in market prices will likely become more fully reflected in ASP starting in the third quarter. For NAND, driven by growing server SSD demand, bit growth increased by a high 20 percentage Q on Q exceeding our prior guidance. And we saw significant reduction in NAND inventory for two consecutive quarters. The rebound resulted in a notable improvement in market conditions, limiting the decline in ASP to a low to mid single digit percentage Q on Q and for some NAND products ASP even increased slightly versus the first quarter. That being the case, Memory business earnings declined compared to Q1 due to one off expenses including inventory valuation adjustments, which were recognized in the second quarter as part of conservative financial management, but this is expected to significantly be reduced in the third quarter. Thank you.\n\n**Moderator**\nThank you for your answer. We'll move on to the next question. Sorry, the previous question was made by Kwon Jee hyun from JPMorgan and this question will be made by Kim Dong won from KB Securities. Thank you for the opportunity. I am Kim Dong won from KB Securities.\n\n**Moderator**\nI'd like to ask you two questions. First, with three major M and As this year, visibility on Samsung strategy seems to be clearing and market expectations for a major M and A deal in the second half are also rising. What's the company's M and A strategy? And also for the display part, competition among peers to expand their smartphone market share is intensifying. What is SDC's response strategy?\n\n**Moderator**\nFirst, regarding shareholder expectations on M and A as a means to secure growth engines, we have delivered tangible results this year as promised. Following the acquisition of a controlling stake in Rainbow Robotics at the end of last year, Samsung signed agreements in May to acquire Massimo's audio division and global HVAC specialist flat group. In July, we started the acquisition process of digital healthcare platform ZElf. These M and As are a part of our strategy to swiftly respond to trends in future growth industries such as AI, robotics, data centers and digital health, while further strengthening our position as a premium brand and enhancing overall customer experiences. In the first half of this year, in addition to M and As, aiming to send future technologies and explore and incorporate with leading tech companies, we made venture investments of over 120,000,000 combined in around 40 companies, mainly in AI, robotics and digital health, marking the largest half year venture investment in Samsung's history.\n\n**Moderator**\nDespite the high uncertainties involving geopolitics and tariff impacts, as mentioned at the AGM, as part of our commitment to growth and shareholder value, Samsung will continually review its business portfolio while actively seeking opportunities for inorganic growth. In addition to strengthening the competitiveness of our business, we will proactively address rapid changes in global tech trends to secure technological leadership in a wide range of swiftly evolving industries such as AI, HVAC, medtech, robotics, automotive, electronics, fintech and components. We will share specifics when details are finalized. Thank you. Let me give you an answer for the display part.\n\n**Moderator**\nAs the smartphone market matures, competition is intensifying. We are using differentiated strategies through technological innovation to reinforce our competitive edge. Among them, our polarizer free low power technology named LEED is an industry's first technology to be developed and mass produced in 2021, where we reduced panel thickness while lowering panel power consumption by over 30%. With the recent expansion of AI, there is a growing demand for low power and high resolution technology in the market. With the aforementioned lead technology, we'll keep addressing the demand and further strengthen our competitiveness.\n\n**Moderator**\nAlso, as for our foldable products, we have demonstrated our stable technological capabilities and production capacity, through which we have introduced increasingly advanced technologies each year. In the latest foldable product, durability has improved as demonstrated by passing the 500,000 folding tests and with a slimmer panel design competitiveness was also reinforced. To summarize, touch integrated and power efficient technologies that combine LTPS and oxide and other high spec and innovative products have been proactively introduced. Going forward, informed factors like LEED will continue to develop performance and design differentiated technologies. Thank you for your answer.\n\n**Moderator**\nWe'll move on to the next question. Next question will be made by Ryu Young from NH Investment and Securities. I'm Ryu Young Ho from NH Investment and Securities. I'd like to ask questions about the Amex business. All seven is receiving better than expected feedback.\n\n**Moderator**\nHow are the initial sales trend and sales outlook for this year?\n\n**Daniel Araujo** (VP - Mobile eXperience)\nSure. So in light of stagnation in last year's foldable product sales, we very thoroughly revisited our consumer insights and reviewed the products from all angles. And so this year, we've significantly enhanced the product performance and overall user experience. The Galaxy Z Fold seven and Flip seven, which we unveiled at this year's New York Unpacked event, reflect technological innovation that surpass what existing foldable smartphones are capable of. They feature slimmer, lighter designs, top tier performance, durability and seamless integration with Galaxy AI to provide real usefulness in people's everyday lives.\n\n**Daniel Araujo** (VP - Mobile eXperience)\nSo to provide some figures, the Z Fold seven has a thickness of 8.9 millimeters when folded and only 4.2 millimeters when unfolded, which is half the thickness of our first generation model. And its weight is only two fifteen grams, so the portability is comparable to VAR type smartphones. As I mentioned before, the 200 megapixel camera supports photography on par with the Ultra and the durability has also improved, thanks to enhancements in glass, frame and hinge materials. With the Z Flip seven, we improved it to reflect customer demands in terms of design and portability. The new Infinity cover screen has the thinnest bezel among current smartphones, and it's actually 70% thinner compared to the previous model, which provides more aesthetic appeal as well as practical functionality.\n\n**Daniel Araujo** (VP - Mobile eXperience)\nAnd we also optimized the new Android OS and One UI eight for our foldable form factors together with Galaxy AI. So in actuality, initial results are showing positive growth, in line with our expectations. We look to continue the strong momentum from preorders into the remainder of the second half and aim for double digit foldables growth compared to last year. Thank you.\n\n**Moderator**\nThank you for your answer. We'll move on to next question.\n\n**Moderator**\nThe next question will be by Mr. Sejal Lee from Citi Securities. Please go ahead. Yes, this is Sejal Li from Citigroup. I have some questions about your memory business.\n\n**Moderator**\nSo there is actually a great deal of market interest still in Samsung Electronics HBM business. Could you elaborate more on second quarter HBM performance as well as future plans, including for HBM4? And then another big theme is hybrid copper bonding technology. So if you could provide a progress update on the future technology, please? Yes, I will take your question on our HBM business.\n\n**Moderator**\nIn the second quarter, HBM bit shipments increased by 30% Q on Q and the share of HBM 3E from overall HBM sales volume has increased further to a high 80% level. So our goal is to normalize the HBM business. And so we plan to achieve a meaningful expansion in HBM3E sales in the second half versus the first half. We've been steadily securing demand customer by customer by obtaining mass production approval and we expect HBM3E as a share of total HBM revenue to exceed the high 90% range in the third quarter. We have obtained mass production approval for 1C nano mother dies and we have developed samples of HBM4 based on the 1C process, which have been shipped out to some of our major clients.\n\n**Moderator**\nOur HBM4 products offer optimized design with the base die fabricated using advanced logic process delivering twice the performance of earlier generation HBM3E with significant improvements in energy efficiency. As we anticipate HBM4 demand to enter into full scale, we intend to expand timing supply in alignment to the rising demand and we continue to make investments in 1C nano capacity expansion. So next generation stacking technology, hybrid copper bonding has been drawing a lot of potential among customers and we are in discussions with key clients on the technology in the context of volume production. Yes, thank you. We will move on to the next question please.\n\n**Moderator**\nThe next question will be by analyst Min Soo Che from Korea Investment Securities. Yes, thank you for the opportunity to ask a question on foundry. So I would like to hear more about your future advanced process roadmap for foundry, what will be the overall direction? It seems not just for Samsung, but competitors are also moving toward two nano volume production. So what is your differentiation strategy in that case?\n\n**Moderator**\nYes. So we have been working to enhance the competitiveness of our advanced process technologies as we seek and obtain more supply orders from large scale clients. In terms of our advanced node roadmap, development of two nano nodes is currently underway with the goal of achieving greater performance and maturity. And this is part of our long node strategy where we seek to deliver a advanced process node with high degree of execution. Every year as new processes are developed, we face various challenges in terms of yield, maturity of performance and timely acquisition of core IP.\n\n**Moderator**\nSo to resolve these difficulties, we wish to go beyond our existing single track roadmap to adopt a two track development approach that distinguishes between leading technologies versus platform technologies. For a new process development, we will work out yield maturity, etcetera, with a small number of lead customers and building on that as a base. Then the strategy would be to then open up and make the platform technology available to other global customers across diverse application and end markets once we acquire Core IP. We want to minimize process variation between generations, focus on improving SI maturity while using design technology co optimization for additional performance enhancements and this will help solidify the foundation for future growth.\n\n**Moderator**\nThank you. We'll move on to the next question. The next question will be made by Baek Ki Leung from Yuante Securities. Thank you for the opportunity. With the recent acquisition of FLAG Group, there is growing interest in your HVAC business.\n\n**Moderator**\nWhat's the HVAC market outlook and your strategy for the HVAC business, including the acquired company? VP, Uchi kan will answer the following question on the DA business. Okay, let me give you my answer. The global HVAC market as of 2024 is valued at approximately $180,000,000,000 with global warming AI data centers and increasing demand for green products, the market is forecast to keep growing. In line with this trend, we'll not only expand our current business, but also acquire and cooperate with leading global players to foster our HVAC business as a future growth engine.\n\n**Moderator**\nCurrently, our business operates in Douglas HVAC segment. However, through the joint venture established with LINAHLX last July, we are expanding our business in North America, the world's largest air conditioning market. With the recent acquisition of FLAG Group, we'll broaden our business scope into the central HVAC segment, while also enhancing our position as a pure HVAC player. Flat Group and Lennox's outstanding capabilities and SmartThings energy technology will be incorporated to lead the market trend in energy saving. And we'll also expand into specialized markets such as data centers, biotech and commercial applications.\n\n**Moderator**\nBeyond our current Douglas business, we'll enter the Central HVAC segment and secure maintenance packages for energy savings and operational costs optimization to build the foundation for a global top tier HVAC business. Thank you. Thank you for your answer. We'll move on to the next question. Next question will be made by Han Dong Yi from SK Securities.\n\n**Moderator**\nYou may proceed. I am Han Dong yi from SK Securities and thank you for the opportunity. I have two questions. First, I'd like to ask about the MX business. What's your profitability outlook for the second half?\n\n**Moderator**\nAnd what's the direction of your AI strategy? And next, I'd like to ask about System LSI. The Xynos has reentered your recently launched flagship model and what improvements make this reentry possible? And can you talk about whether it's likely to be adopted again in the 2026 flagship model?\n\n**Daniel Araujo** (VP - Mobile eXperience)\nSo first on the MX second half profitability outlook. Given the uncertain external environment, including potential increased tariff burdens due to changes in U. S. Trade policies and currency fluctuations, memory prices are expected to rebound beginning in Q3. Despite the challenging business conditions, we're aiming to increase smartphone revenue focused on our flagship models with the momentum of our new foldables as well as maintaining the sales momentum of our S25 series.\n\n**Daniel Araujo** (VP - Mobile eXperience)\nWe're also aiming to expand sales of our ecosystem products like the Galaxy Tab S series and Galaxy Watch Ultra, driving growth especially in premium products. We'll also continue efforts in cost reduction, process optimization and eliminating inefficiencies in order to secure robust profitability. For the AI strategy, we're focusing on enhancing the performance of Galaxy AI in order to improve the user experience and deliver more real world value. We're at the forefront of a paradigm shift in smartphone interaction, which is a transition from app centric to agent centric and from touch centric to multimodal interfaces. We're aiming for a more personalized and intuitive AI experience by evolving into an open platform that connects to various AI agents and optimizes the interaction depending on the user need.\n\n**Daniel Araujo** (VP - Mobile eXperience)\nSo to get there, we are equipping our devices with optimal hardware components such as the AP and memory, while also researching and developing software technologies that maximize the performance of on device AI, improve the processing speed, make models more lightweight, while also being optimized to our systems. We have strategic collaborations to deeply integrate AI across the range of Galaxy devices as we continue to expand and develop the Galaxy AI ecosystem. Together with Google, we implemented the cross app interface in the S25, which leverages the agent to let users take action across multiple apps with one single prompt, vastly simplifying complex tasks. And as another example, the Gemini Live feature enables real time camera and screen sharing, a multimodal AI experience that understands and responds to what the user is feeling. We've optimized these features for the new Fold seven and Fold seven and we'll continue to evolve our AI functionality and its usability for future devices as well. Thank you.\n\n**Moderator**\nYes. Let me take your question on System LSI. So Exynos 2,500 made a successful entry into a foldable model that was released in July. It's improved AI performance and camera functions. We want to build on this success to expand into other new models.\n\n**Moderator**\nThe next flagship Exynos 2,600 will be the first flagship chipset fabricated on the latest two nano gate all around process. We're working closely with the foundry division on development to secure the required yield and performance, so that we can enter the flagship models of key customers in the 2026. Exynos 2,600 offers a significant improvement in NPU performance versus prior version with enhanced support for on device AI functionality, which will allow users to leverage AI functions in a more comfortable setting. We plan on leveraging two nano as our long node for the future and we're working closely with the foundry division to enhance the process maturity with Exynos as a bridgehead for securing competitiveness of future products. Because of the time, we will accept one last question.\n\n**Moderator**\nIt will be by Joon Lee from Goldman Sachs. Please go ahead. Yes, thank you for the opportunity to ask one question on memory. What is your outlook for the memory market in the second half? There are some recent concerns about competition becoming even more intense in the HBM market.\n\n**Moderator**\nSo what is your outlook for memory over the second half of the year? Okay. So let me answer your question about our outlook. For the server market, there's been a rapid rise in paid subscribers for AI services. So CSPs and also have been expanding their foreign services as well, which is driving investments into underlying infrastructure.\n\n**Moderator**\nSupply conditions have been improving for GPUs and ASICs, which are critical for building out infrastructure. So we expect accelerated growth in demand from AI server applications in the second half. Moreover, we expect robust continued demand for conventional servers and storage for general computing that is required for pretreating data in AI applications. For PC, we expect upside demand momentum from end of year promotions as well as other seasonal demand drivers, also the end of support for Windows 10. For mobile, we project growing demand for high performance, high density products driven by greater on device AI trends, aligned with new product launches by major customers.\n\n**Moderator**\nSo boosted by the overall boost in demand across applications, market prices are expected to increase by a greater margin in the second half for DRAM, while NAND is also expected to see an overall rally in pricing from the third quarter. However, the exact extent of price increases will vary by product depending on supply demand dynamics. We expect we believe prices of products in legacy DRAM and planar NAND where there's increasingly tight supply may rise by bigger extent in relative terms. So although legacy memory prices are expected to rise, we will continue to focus on advanced node migration for DRAM and NAND to secure competitiveness in the mid to longer term. We will expand sales of diverse offerings that we have been preparing in expectation of increased growth in AI over the mid to longer term.\n\n**Moderator**\nFor DRAM outside of HBM, we've also been expanding sales of high density LPDDR5X for AI servers, also high density DDR5 RDIMM 128 gigabyte and above, 24 gigabit GDDR7 as well where we already hold a leading position. In the third quarter, we'll commence mass production and supply of SOCOM as well as reinforce our AI product portfolio. In the third quarter DRAM bit shipments are expected to increase by high single percentage Q on Q. For NAND, we will speed up V eight migration across all applications including servers to strengthen cost competitiveness, while also increasing the share of server SSD sales for better margins. Server SSDs in particular, together with product leadership in Gen five TLC SSDs, we have we have obtained a series of customer approvals for high density 64, 128 terabyte QLC SSDs, which puts us on good track to boost AI server application sales in the second half.\n\n**Moderator**\nThis is why we project NAND bit growth at around mid single percentage for Q3. Regarding intensifying competition for HBM. For HBM3E supply has grown faster versus demand. So we anticipate supply demand dynamics to change, which will likely impact market prices for the time being. And considering the upward pricing momentum for conventional DRAM, so far the second half based on current signals and also near term expectations, we believe the difference in margins between HBM3E and conventional DRAMs is expected to narrow sharply.\n\n**Moderator**\nSo to optimize profitability in the short term, this may mean greater need for a more balanced product mix strategy. However, for us, given the strong mid to long term demand for HBM driven by AI, We intend to focus on addressing demand for HBM3e, while strengthening tight cooperation with customers for commercialization of HBM4 as well. And as an extension, we will continue to develop products for the future, including custom HBM, while continuing with necessary relevant investments as well. Thank you.\n\n**Moderator**\nThank you for your answer. I'd like to thank everybody who shared their valuable opinion and we'll be sure to refer to them in our decision making process. That completes our conference call for this quarter. We wish all of you and those close to you stay strong and in good health. Thank you very much.",
      "fetched_at": "2026-02-04T15:55:19.259Z"
    },
    {
      "ticker": "005930.KS",
      "title": "SamsungElec (005930.KS) Q1 FY2025 earnings call transcript",
      "published_date": "Apr 30, 2025, 10:00 AM GMT+9",
      "fiscal_year": "2025",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/005930.KS/earnings/005930.KS-Q1-2025-earnings_call-311113.html",
      "content": "**Operator**\nHello everyone, and welcome to the Samsung Electronics 2025 First Quarter Financial Results Conference call. I will be your coordinator. All participants will be in a listen-only mode until we open the question and answer session following the presentation. As a reminder, this call is being recorded. I would now like to turn the conference over to the Investor Relations team. Please go ahead.\n\n**Daniel Oh** (Head of Investor Relations)\nWelcome to all the participants worldwide, and thank you for joining Samsung Electronics' earnings call for the first quarter of 2025. I am Daniel Oh, Head of Investor Relations. Before we proceed, I have some legal house matters to take care of. First, I want to remind you that quarterly results and supplementary materials to our earnings call are on the Samsung Electronics Investor Relations website at www.samsung.com/global/ir. A webcast of today's call will also be uploaded to the website. Secondly, we must state that today's call may contain forward-looking statements. These statements represent our predictions and expectations of future events, but numerous risks and uncertainties could cause actual results to differ from those projected. Furthermore, the information provided herein reflects the company's views as the date of today's call, and the company undertakes no obligation to update the information subsequently. With that, now let me briefly outline today's agenda.\n\n**Daniel Oh** (Head of Investor Relations)\nI will first start the discussion with the first quarter financial performance, capital expenditures, and sustainability management, and our Chief Financial Officer will follow with a summary of our business outlook going forward and any updates on shareholder value. We will then turn the call over to executives for details on their respective business areas before opening the call for analyst questions. The executives joining us on today's call are EVP Sung-Choi Park, Head of Corporate Management Office and Chief Financial Officer; EVP Jae-jun Kim, representing memory; VP Hyeok-man Kwon for System LSI; VP Mijung Noh for Foundry; EVP Charles Ho for Samsung Display Corporation; VP Daniel Araujo for the mobile experience; and finally, EVP KL Roh for Visual Display. Let's begin with our consolidated financial performance for the first quarter of 2025. The company's revenue increased by 4% quarter-on-quarter to KRW 79.14 trillion, a new all-time high for any quarter.\n\n**Daniel Oh** (Head of Investor Relations)\nRevenue in the DX division was up 28%, driven by increased sales of flagship smartphones and high-value-added home appliances. However, revenue in the DS division decreased by 17%, impacted by a decline in HBM sales due to deferred customer demand, which will be addressed further in detail by EVP Jae-jun Kim from the memory business later. SG&A expenses decreased by KRW 0.6 trillion quarter-on-quarter to KRW 21.4 trillion, thanks to efficient execution. SG&A expenses, as a percentage of sales, declined 2 percentage points to 27.1%. Operating profit increased KRW 0.2 trillion sequentially to KRW 6.7 trillion, led by strong sales of the Galaxy S25 series and high-value-added products in the visual display and digital appliances businesses, despite headwinds from the DS division. Operating margin was 8.4%, comparable to the previous quarter.\n\n**Daniel Oh** (Head of Investor Relations)\nRegarding currency effects, the appreciation of major currencies, including the U.S. dollar, had a positive impact of approximately KRW 0.5 trillion on operating profit compared to the previous quarter, felt mainly in the component business, which has a high proportion of U.S.-based transactions. Next, I will cover capital expenditures. CapEx in the first quarter of 2025 decreased by KRW 5.8 trillion quarter-on-quarter to KRW 12 trillion, of which KRW 10.9 trillion was invested in DS division and KRW 0.5 trillion was invested in display. In memory, investments also declined sequentially, reflecting our more flexible approach to better align with supply and demand. However, we remain committed to investing in R&D and advanced technology. Foundry investments decreased as we prioritized tech migrations, considering market conditions and investment efficiency. In display, CapEx declined sequentially following the completion of major investments in 8.6-generation IT OLED panels.\n\n**Daniel Oh** (Head of Investor Relations)\nI will now comment on one of our key achievements in sustainability management. Our company recently ranked first in a supply chain human rights assessment of 45 leading global ICT companies conducted by nonprofit organization No The Chain. This recognition reflects our strengthened efforts to improve supply chain due diligence and grievance mechanism, with particular attention to managing forced labor risk by expanding protections for migrant workers. Our enhanced transparency through broader public disclosure of supply chain information was also positively received. The company remains committed to advancing its sustainability management practices to drive long-term value for all stakeholders. At this point, I will pass the conference over to our CFO, Sung-Choi Park.\n\n**Soon-Cheol Park** (CFO)\nThank you, Daniel, and good morning, everyone. It's a pleasure to join you once again on our earnings call. I will now present our outlook and review shareholder value initiatives. Recently, global trade tensions have led to a slowdown in global growth and increased fluctuations in financial markets, raising concerns over the performance of tech companies, especially in the semiconductor industry. We expect to encounter elevated uncertainties throughout the year. In this situation, we'll continue our efforts to launch top-tier innovative products and services to overcome the challenges and maintain our position as a leading tech company. First of all, in an environment that is changing faster than ever, we are pursuing new growth opportunities by developing diverse new businesses, including robotics and AI. For robotics in particular, we are sparing no efforts to outpace peers by advancing both hardware and software through internal development and external partnerships.\n\n**Soon-Cheol Park** (CFO)\nThrough these efforts, we are committed to positioning ourselves as an industry leader. To this end, we have emphasized our R&D investments, which reached their highest ever annual total in 2024. Moreover, our R&D spending in the first quarter increased by 15% year-on-year, setting a new record high for the first quarter. For our full-year outlook, we cautiously expect the overall performance to gradually improve as we move into the second half, assuming an easing of current uncertainties. In the DS division, we expect AI server demand to continue growing, while mobile and PC demand should benefit from the on-device AI trend. We'll proactively address demand for high-density products such as HBM and improve our market position by focusing on high-value-added products. Also, in foundry, we plan to focus on improving profitability by securing more customer orders in both advanced and mature nodes.\n\n**Soon-Cheol Park** (CFO)\nIn the DS division, despite concerns over global trade and an economic slowdown, we'll strive to increase the sales of foldable devices and other flagship products. The second half launch of these products will provide unique tailored AI experiences for wearables. We'll capitalize on rising demand across the entire lineup and prospects for broader adoption in emerging markets. Our plan is to reinforce our AI leadership by enhancing and expanding the integration of innovative AI features, including in our TVs and home appliances. However, it is widely understood that the current unpredictable environment is a product of major shifts in global politics and international trade, resulting in heightened market uncertainties. Drawing on our experience from our coming numerous crises since our founding, we have managed risks by preparing tailored countermeasures for multiple scenarios, aiming to turn this crisis into an opportunity for us to leap forward.\n\n**Soon-Cheol Park** (CFO)\nAs a global company, we are truly leaving our options to flexibly utilize our global production facilities and sales infrastructure in response to the changing environment. Through these efforts, every member of Samsung Electronics will work together to minimize business impact and enhance corporate value. Lastly, amid the rapidly shifting paradigms, we are committed to setting direction with speed and executing without hesitation. Additionally, we are applying AI and robotics technologies to our businesses and continuously expanding their use to improve operational efficiency. On top of these efforts, we'll harness diverse cutting-edge technologies, including AI, to develop smarter products and services. We aim to advance technology innovation in new growth opportunities through cross-collaborations that combine the structures of each business unit. Moving on to enhancement to shareholder value, the board of directors today approved a quarterly per-share dividend of KRW 365 for both common stock and preferred stock.\n\n**Soon-Cheol Park** (CFO)\nFollowing our three-year shareholder return policy covering 2024-2026, the total annual dividend is KRW 9.8 trillion. Thus, the payout for the first quarter is KRW 2.45 trillion, scheduled for payout in late May. In November 2024, we announced our plan to repurchase KRW 10 trillion worth of shares to enhance shareholder value. Of this amount, we purchased and canceled KRW 2.7 trillion in common shares and KRW 0.3 trillion in preferred shares by mid-February. For the remaining KRW 7 trillion, the repurchase of KRW 3 trillion worth of shares is in progress. Turning to stock-based compensation, after thorough discussions, we decided to increase the scope of stock-based compensation for all executives to encourage and reinforce long-term value creation. Linking all executive compensation to stock performance and business results that aligned with our shareholders' interests, encouraging a strong focus on corporate shareholder value as well as sustainable results.\n\n**Soon-Cheol Park** (CFO)\nIn addition, we hope to further enhance shareholder value through clear incentive structures that promote value creation in the mid to long term. Thank you. Back to you, Daniel. Thank you.\n\n**Operator**\nThank you, CFO. Now, our executives will provide more detailed information on their respective business units' first-quarter performance, followed by their outlook. We'll start with Jae-jun Kim, EVP of Memory Business.\n\n**Jae-jun Kim** (EVP)\nGood morning. This is Jae-jun Kim from Memory Global Sales and Marketing. In the memory market, in the first quarter, demand for AI servers stayed solid, and the recovery of PC and mobile demand also became more visible than initially expected. For the server SSD market, demand remained relatively weak following the previous quarter, as some data center projects were delayed. In this market situation, for DRAM, by expanding our PC months focusing on servers, we exceeded the initial guidance by a high single-digit % in PC months. As a result, our QQB growth increased by a low single digit. However, HBM sales decreased quarter on quarter caused by impacts of exports control on AI chips and deferred demand in anticipation of the upcoming enhanced HBM series products.\n\n**Jae-jun Kim** (EVP)\nFor NAND, as server SSD demand weakened, bit growth decreased by about 10% compared to the previous quarter, but we slightly exceeded our bit guidance, which was projected at the previous on-call due to additional purchase demand arising from the perceptions that the market price had reached a bottom. Now, let's move on to the outlook for the second quarter. In the second quarter, along with robust demand for AI servers, we have seen preemptive purchasing activities after the pause on the reciprocal tariffs, especially since memory inventory for PC and mobile has been normalized earlier than anticipated. Because of the stimulated domestic demand in China in the first quarter, we expect the demand to continue its momentum. However, we need to keep monitoring the direct and indirect impacts on demand, which result from additional changes in tariff policies of major countries.\n\n**Jae-jun Kim** (EVP)\nIn this circumstance, we continue to operate our business focusing on profitability. For DRAM, we plan to strengthen our position in the high-value-added market by extending our initial response to demand for enhanced HBM series products and operating a product mix focused on high-density products for servers. However, from a profitability perspective, we plan to flexibly respond to the demand from PC and mobile segments where market price increase has been recently observed. On end, based on our flexible product mix operation, we plan to focus supply on applications showing signs of recovery and improve cost competitiveness by accelerating the transition to V-NAND 8th Gen for all applications. Lastly, let me talk about the outlook for the second half of 2025.\n\n**Jae-jun Kim** (EVP)\nFor server, demand for AI server is forecasted to remain robust in conjunction with the launch of new GPUs, and demand for server SSD is also likely to recover as the previous suspended data center projects resume. For PC, we expect demand to improve due to the discontinuation of Windows 10 services and the arrival of the replacement cycle. Moreover, demand momentum for mobile devices is also projected to increase thanks to the spread of AI services and increased contents for bugs. However, as macro uncertainties such as the change of a tariff policy continue to expand, demand volatility is expected to be quite high accordingly. In this situation, for DRAM, we plan to continue expanding the transition to 1B nanometer. In addition, in the server market, we will increase sales of our enhanced HBM series e-products as well as high-density DDR5 modules such as 128 gigabyte and higher.\n\n**Jae-jun Kim** (EVP)\nAs for the mobile and PC market, in which on-device AI trends are expected to keep spreading, we plan to proactively respond to the high-density and high-performance trends with our industry-leading 10.7 Gb PSEP DDR5X products. On end, we will actively address the growing demand for high-performance computing SSDs for AI server by offering full PCI Gen 5 lineup of both 16 and 8 channels. In the mobile market, we plan to promote UFS 4.1 products featured with the industry's highest performance. In addition, we will keep strengthening cost competitiveness by accelerating the transition to V8 across all applications. Thank you.\n\n**Hyeok-man Kwon** (VP of System LSI Marketing)\nGood morning. This is Hyeok-man Kwon from the System Electronics Business. In the first quarter, revenue was initially pressured by our sluggish smartphone market and delayed adoption of our flagship SoC at our key customer. Nonetheless, stronger seasonal demand from major customers enabled us to expand the shipment of image sensors and LSI products, resulting in a slight increase in total sales and a modest improvement in profitability. Looking to the second quarter, rising geopolitical risks are leading to global customers diversifying supply chains and adjusting inventory strategies, which may heighten demand volatility and discourage new investment and development. Regional softness could reduce sensor and LSI volumes versus the previous quarters. Yet, we aim to maintain revenue steady by entering our SoCs into major customers' new flagship models and taking advantage of the growing adoption of 200 megapixel sensors in the Chinese market.\n\n**Hyeok-man Kwon** (VP of System LSI Marketing)\nIn the second half, overall mobile market momentum is expected to remain limited, but component specification upgrade is driven by on-device AI should stay resilient, and demand for premium mobile and IT devices is likely to persist. For SoCs, we will maximize supply of next-generation products for flagship lineups. For DDIs, we will sharpen our solution competitiveness, particularly in touch and T-con. For image sensors, we will actively address the high-resolution demand for main and telephoto cameras and expand our automotive sensor portfolio. By launching higher value-added products, optimizing cost, and improving product mix, we will improve the division's profitability. Thank you.\n\n**Mijung Noh** (VP)\nHello, everyone. This is Mijung Noh from the Foundry business. In the first quarter, the market recorded a quarter-over-quarter decline due to seasonal weakness in mature nodes. Our short-term performance was also negatively impacted by the ongoing U.S.-China trade tensions, continued inventory adjustment by customers on mature nodes, and the fact that revenue from the new advanced node is expected to be concentrated in the second half of the year. Despite the challenges, we remained focused on enhancing yield and ensuring seamless readiness for mass production of 2nm GAA process. Furthermore, we achieved a quarter-over-quarter increase in order intake for HPC AI applications, primarily driven by advanced process nodes, including 2nm, 4nm, and under the 5nm category. Looking ahead to the second quarter, demand for legacy nodes is projected to be somewhat subdued, but we anticipate a gradual recovery supported by HPC and AI demand.\n\n**Mijung Noh** (VP)\nTo address strong demand from the certain U.S. mobile automotive, we plan to ramp up production while simultaneously implementing hedging strategies against risks related to U.S.-China trade tensions. However, ongoing uncertainty surrounding U.S. tariff policies continues to pose a potential risk of demand slowdown. From a technical perspective, we completed the reliability assessment of the first-generation 2nm GAA process and will start fabbing for mass production in the second quarter. Simultaneously, for the second-generation 2nm and performance and power-optimized 4-nanometer process, we are systematically building the technical infrastructure required to support customer design enablement in a timely and efficient manner. We are strengthening our position in advanced node competition by focusing on securing orders from Tier 1 customers in the HPC and automotive sectors.\n\n**Mijung Noh** (VP)\nIn parallel, we are enhancing the competitiveness of our PPAC within the mature node by advancing the FinFET process development of low-power CIS and mobile DDI applications. In the second half, geopolitical and policy risks may intensify, and demand associated with mobile and PC markets could remain weak. Nevertheless, robust AI and HPC momentum is expected to sustain strong growth at advanced nodes. We will drive earning higher by increasing the revenue contribution from advanced nodes, underpinned by the full ramp-up of new advanced node products, a seasonal rebound in mature node demand, and sustained strength in AI and HPC applications. We will begin mass production for our first generation of 2nm GAA process and accelerate customer orders for the second-generation 2nm node by stabilizing the process. For 4nm, we will continue our long-node strategy by steadily improving yield and ensuring mass production capability for automotive-grade products.\n\n**Mijung Noh** (VP)\nIn mature nodes, we will deepen our specialty portfolio and expand orders for consumer and automotive products. Thank you.\n\n**Choi Seong** (Corporate Strategy Team Member)\nGood morning. This is Choi Seong from the corporate strategy team at Samsung Display. I will now brief you on our results for the first quarter of 2025. For the mobile display business, we responded to the demand of our major customers' high-end smartphones in a timely manner. As a result, our performance improved year-on-year, supported by favorable exchange rates. However, our performance declined quarter on quarter due to seasonal effects. For the large display business, our major customers launched new QD-OLED products, including a 27-inch UHD monitor, which features the highest resolution of 160 PPI. Given the positive market feedback, the QD-OLED demand continued to grow. By focusing on new products, we achieved double-digit growth in monitor sales, which contributed to performance improvement compared to the previous quarter. Next, I will share our outlooks and strategies for the second quarter of 2025.\n\n**Choi Seong** (Corporate Strategy Team Member)\nFor the mobile display business, our performance outlook is a little bit conservative due to external uncertainties such as changes in tariff policies. We will strengthen our product competitiveness and ensure a stable panel supply for our major customers' new products, including foldable smartphones. Furthermore, we will strive to expand our sales in IT and automotive applications. For the large display business, while keeping our sales performance stable, we are planning to launch monitors featuring ultra-high refresh rates. We expect the market to grow as the new monitors enrich gaming experiences. Next, I will share our outlooks and strategies for the second half of 2025. Market uncertainties are expected to increase due to intensified competition and weak consumer sentiment.\n\n**Choi Seong** (Corporate Strategy Team Member)\nFor the mobile display business, with the growing demand of AI devices, we will reinforce our competitive edge and expand sales by enhancing our differentiated technologies in smartphones such as low power consumption and diverse form factors. In addition, we will continue to increase sales in IT and automotive segments, aiming for double-digit revenue contribution to the mobile display business. We believe it will stabilize our overall business portfolio. For the large display business, QD-OLED demand continues to grow in premium TV and monitor markets, supported by high-definition image quality and superior performance. We will also expand our product lineup to include not only premium monitors but also mainstream models. As a result, we will broaden our presence in both B2C and B2B monitor markets. Through continuous efforts, we will accelerate OLED penetration in the monitor market and solidify technology leadership of QD-OLED. Thank you.\n\n**Daniel Araujo** (VP for Mobile Experience)\nHi, everyone. This is Daniel Araujo from the MX Division. I'd like to share our results for Q1 and the future outlook. The smartphone market entered into the seasonally lower Q1 with a decline compared to the previous quarter. For the MX business, Q1 smartphone and tablet shipments were 61 million units and 7 million units, respectively, with a smartphone ASP of $326. We achieved revenue and operating profit growth quarter on quarter with the launch of the S25 series. Its more robust Galaxy AI experience has helped it maintain the strong sales momentum of its predecessor. We saw flagship revenue within the smartphone segment expand year-on-year. We also continued to enhance cost competitiveness through resource efficiency initiatives, while some component prices also showed a downward trend in Q1. As a result, we maintained solid double-digit profitability and improved operating profit compared to the previous year.\n\n**Daniel Araujo** (VP for Mobile Experience)\nMoving on to our Q2 outlook, overall smartphone demand is expected to decrease quarter on quarter due to seasonality trends. Additionally, there is potential for further adjustments in the forecast due to global tariff policies. The MX business expects a decrease in smartphone shipments and ASP due to the fading effects of our new flagship model launches, while tablet shipments are expected to grow sequentially. We plan to sustain flagship-centric sales with a successful launch of the new S25 Edge and continued strong sales of the S25 series. We will also expand our AI phone lineup by introducing Awesome Intelligence to our newest A-series devices. This brings over many of the highly used AI features from our flagship devices, such as Circle to Search and Now Bar.\n\n**Daniel Araujo** (VP for Mobile Experience)\nGiven the backdrop of volatility in U.S. tariff policies and anticipated increases in key component prices, we are pushing ahead with our premium product strategy and continuing to focus on resource efficiencies. Looking ahead to the second half of the year, given macroeconomic uncertainty caused by U.S. tariff policies, smartphone market demand is expected to be revised downward and decline year-on-year. The tablet market will also see slower growth, but premium demand is expected to remain robust. Wearable product categories are projected to grow due to increased demand for premium products and expansion into emerging markets. Looking across the MX Division, for our upcoming new foldable devices, we are enhancing the performance, design, and durability, while also optimizing AI functionality to offer a differentiated user experience. We plan to strengthen our product lineup in order to create new demand and expand our foldable customer base.\n\n**Daniel Araujo** (VP for Mobile Experience)\nWith the S25 series, including the soon-to-be-added Edge, we will continue flagship-centric sales along with seasonal promotions and sustained marketing efforts. On the A-series, we are reinforcing our efforts to increase market share by offering the differentiated Awesome Intelligence experience and expanding channel presence in growth markets. We will also launch new ecosystem products with enhanced core functionality, including AI and health capabilities, to strengthen product competitiveness and differentiation. In tablets, we will drive premium revenue growth by launching the AI-enhanced Tab S11 series in the latter half of the year and strengthening targeted marketing across the Tab S lineup to capture new demand. For wearables, we will expand our market presence with a strengthened premium experience while expanding our lineup across all price segments. We plan to launch a new Galaxy Watch with an innovative design and enhanced health-related features.\n\n**Daniel Araujo** (VP for Mobile Experience)\nIn TWS, while we strengthen premium marketing on one hand, we will also address demand across all price segments by launching a new entry-level model. Furthermore, beginning with the successful launch of our XR headset, we will proactively explore new products that meet the diverse needs of consumers while also ensuring market viability. Despite ongoing macroeconomic uncertainty and anticipated increases in material costs, the MX Division will drive growth in flagship-centric sales and our ecosystem business with a focus on new premium products while we continue to optimize operations across the board to sustain robust profitability. Thank you.\n\n**KL Roh** (EVP for Visual Display)\nHello everyone. This is KL Roh from the sales and marketing team of Visual Display. Let me brief you on the market condition and our results in the first quarter of 2025. TV market demand decreased quarter on quarter after the year-end peak season, but it increased slightly year-on-year due to continued growth in the demand for premium and big TV. For Samsung, we expanded sales share of high-value-added products compared to last year through proactively addressing solid demand for Neo QLED, OLED, and above 75 inches. Also, we improved quarter on quarter profitability by raising price and reducing material costs. Even so, our profitability decreased year-on-year due to stagnant TV market demand and increased costs driven by intensified competition. Now, let me go over the outlook for the second quarter and second half of 2025.\n\n**KL Roh** (EVP for Visual Display)\nIn the second quarter, TV market demand is expected to remain the same year-on-year, while uncertainties such as the impact of U.S. tariffs are likely to continue. With Vision AI, which is the direction our AI screen should move forward, we will launch the new 2025 AI TV model globally with advanced features and lineup, and focus on enhancing sales of premium products and profitability. As for the second half of this year, economic uncertainties are projected to continue. However, demand for high-value-added products, including super big TV, QLED, and OLED models, will stay solid. With newly launched AI TV, we will lead the AI screen market not only by strengthening the core competitiveness of our TV products, including improved picture and sound quality, but also by actively promoting differentiated viewing experience.\n\n**KL Roh** (EVP for Visual Display)\nIn addition, based on the reinforced lineup of super big TV, QLED, and OLED, we will preemptively capture peak season demand in the second half through strategic collaboration with major retailers. Finally, as the global leader in the TV market for 19 consecutive years, we will advance service business through enhancing TV Plus contents and diversifying advertisements, thereby strengthening profitability and new growth engines. Thank you.\n\n**KL Roh** (EVP for Visual Display)\nThank you to all our executives for their comments. That concludes our presentation on the first quarter performance of 2025 and brings us to the Q&A session, which will be conducted in Korean. Operator, you may now open the line for analyst questions.\n\n**Operator**\nNow, we'll begin the Q&A session. If you have a question, press Star and press one on your phone. If you wish to withdraw, press Star and press two. The first question will be made by Boon Jae-woong from Bank of America.\n\n**Boon Jae-woong** (Analyst)\nThank you for the opportunity. I want to ask about tariffs. There are a lot of uncertainties in the IT sector. What are your response strategies, including supply chain management? Thank you.\n\n**Mijung Noh** (VP)\nI believe this is one of the most important questions. Due to the rapid changes in policies and geopolitical tensions among major countries, it's difficult to accurately predict the business impact of tariffs and establish countermeasures. For example, the U.S. enacted a 90-day pause on reciprocal tariffs imposed in early April, including the 10% baseline. Our flagship products, such as semiconductors, smartphones, and tablets, are exempt from reciprocal tariffs.\n\n**Mijung Noh** (VP)\nA product-specific tariff investigation is underway for these categories. There are a lot of uncertainties ahead of us. By monitoring likely policy paths in major countries, we are communicating with related countries to minimize negative effects. Also, by utilizing our core strengths, managing global production and customer relationships, our agile response measures enable immediate action. The MX business, if tariffs are imposed on semiconductor derivatives and other products, we expect the purchase price of core components to rise. The MX, by expanding sales of flagship smartphones, including for the soon-to-launch S25 Edge and new premium ecosystem devices, will secure profitability. For VD&DA, we will pursue sales expansion of premium products, and if necessary, we'll consider options such as relocating product production volumes by leveraging our global manufacturing footprint to minimize tariff impacts.\n\n**Mijung Noh** (VP)\nThe DS division will monitor the direction of U.S. semiconductor tariff policies and will review countermeasures based on various scenarios. Thank you.\n\n**Operator**\nYes, thank you for the answer. We'll move on to the next question, please. The next question will be by Mr. Jae-yeon from JPMorgan. Please go ahead. Yes, good morning. This is Kwon Jae-yeon from JPMorgan Securities. I also have one question. You explained about the performance for your memory business in the first quarter. I'd appreciate it if you could provide a little bit more detail, please. Yes, let me explain further on our memory performance. Over the first quarter, AI server demand remained solid, and there were growing perceptions that prices have pretty much bottomed out for both PC and mobile applications. As a result, we saw a pickup in additional purchasing demand.\n\n**Operator**\nAlso, amid concerns ahead of changes to global tariffs, companies have been increasing pre-production of their finished products, leading to a faster-than-expected drawdown of their components' inventories, and recovery in demand has been gaining more visibility versus our initial outlook. That said, for HBM, clients have been deferring demand ahead of the planned launch of our enhanced HBM products, and together with the impact of export controls on AI chips, this led to a gap in HBM demand, as we projected in January in our earnings call, with sales decreasing quarter on quarter. Despite these conditions, our server DRAM bid shipments increased by a mid-teens percentage Q on Q, which helped conventional DRAM post high single-digit bid growth. Meanwhile, ASP decreased by a mid-single percentage Q on Q. For NAND, as some data center storage projects were postponed, overall, we saw weaker demand in the server SSD market.\n\n**Operator**\nPreviously, in the first quarter, though, with server SSDs enjoying higher margins, there was a supply concentration in server SSDs within the industry, with server SSD product prices falling by more than other products. As server SSDs take up a big share of our revenue mix, our ASP in the first quarter fell by a mid-10% level, while bid growth was down by about 10% Q on Q. Still, as overall demand conditions improved compared to the start of the quarter, bid growth came in slightly above our previous guidance. Thank you.\n\n**Daniel Oh** (Head of Investor Relations)\nThank you for your answer. We'll move on to the next question. Next question will be made by Seong-gyu Kim from Daiwa Securities. Good morning. Thank you for the opportunity. I'd like to ask about company overall and MX. Regarding the KRW 10 trillion stock repurchase, are there any plans to cancel the shares acquired in the second phase? Do you have any plans for possible M&A deals? Regarding MX's first quarter profit growth, what drove the growth? Is the improved cost structure sustainable throughout the year? Thank you. I will answer the third question. Of the KRW 3 trillion in the second phase, excluding the share designated for employee stock compensation, we will cancel KRW 2.5 trillion worth of shares in line with the first phase to enhance shareholder value. For the program's remaining KRW 4 trillion, the board will identify options to enhance shareholder value.\n\n**Daniel Oh** (Head of Investor Relations)\nThey will thoroughly review the timing and the scale of potential cancellations, accounting for the company's management, financial, and regulatory environments. We'll provide updates when plans have been confirmed. Last, we plan to utilize our cash reserves so that even in the currently challenging and uncertain environment, we can facilitate operational stability, continue to invest in initiatives for future growth, and faithfully implement our shareholder return policy. We're continuously exploring strategies for our cash holdings to enhance shareholder value and pursue M&A opportunities. We'll also share details when plans are more concrete.\n\n**Daniel Araujo** (VP for Mobile Experience)\nOn your question about smartphone profitability, in Q1, overall sales of flagship models grew, and the product mix also improved. The portion of flagship model revenue within smartphones increased compared to last year. We also saw a profit improvement from optimization and efficiency enhancements across our development, manufacturing, and logistics processes, including sales costs. We also secured additional cost competitiveness as the memory and display prices declined compared to last year, while we also optimized product specs and standardized components across more products. Given the uncertainty surrounding U.S. tariff policies, as well as the rising component prices, we aim to expand the portion of flagship revenue through the launch of the S25 Edge and grow our premium ecosystem to sustain profitability. Thank you.\n\n**Operator**\nYes, thank you. We'll move on to the next question. The next question will be from KB Securities, Mr. Kim Dong-woon. Please go ahead.\n\n**Kim Dong-woon** (Analyst)\nYes.\n\n**Kim Dong-woon** (Analyst)\nYes, thank you for the opportunity to ask. My name is Kim Dong-woon from KB Securities. I have a question for Memory and VD each. First, on HBM. Within the market, I believe there is still a high degree of interest in Samsung Electronics HBMs. What is your business outlook for HBM from the second quarter onwards? For your TV business, it seems that your TV market share has been decreasing recently. Do you think that a rebound will be possible this year? If so, what is your main VD rebound strategy?\n\n**Kim Dong-woon** (Analyst)\nRegarding our HBM business, let me cover that first. Our enhanced HBM3E samples have already been shipped out to major accounts. We expect a gradual contribution to our top line starting from the second quarter.\n\n**Operator**\nConsidering uncertainty surrounding the tariffs and semiconductor export controls, this may introduce some volatility to improvement in sales. However, we expect HBM sales, which bottomed out in the first quarter, will likely start showing step-by-step recovery with every quarter as we expand sales of our enhanced HBM3E product. For HBM4, development is underway in accordance with customer project timelines, with mass production set for the second half as planned. Custom HBMs, which have been drawing great interest from the industry, are also under discussions with multiple clients for their HBM4 or 4E-based projects. At present, we're expecting custom HBM4 projects to start contributing to revenue starting 2026 alongside standard HBM4, and we're continuously making necessary investments to respond to customer demand for HBM4 and 4E.\n\n**Operator**\nI'd like to answer about the TV markets. In the TV market, demand for QLED and big TV products of 70 inches and larger is continually rising. In each segment, the demand centering on entry-level products is growing. The entry-level share of the TV market is rising, leading to intensified market competition. Amid this environment, we'll further differentiate our TV's competitiveness and recover market share. First, as mentioned earlier, based on vision AI, we'll enhance the core competitiveness of our TVs, such as picture and sound quality. Also, we will identify customer needs and tastes to provide tailored experiences and expand our AI TV lineup with more sophisticated and improved AI features compared to previous Neo QLED and OLED to QLED and the Frame to create new demand.\n\n**Operator**\nSecond, to solidify our leadership in the premium market, we will expand the lineup of OLED and super big TVs of 98 inches and larger while strengthening the large entry-level lineup of 75 inches and above to respond to intensifying competition in the entry-level market. Last, the key strengths of our TVs, such as security, design, and SmartThings, will be communicated more broadly. At the same time, we'll strengthen our service business, such as TV Plus and advertisements, to secure profitability and growth engines. Thank you.\n\n**Operator**\nWe'll move on to the next question.\n\n**Operator**\nThe next question is by Mr. Han Dong-yi from SK Securities. Please go ahead.\n\n**Operator**\nYes, this is Han Dong-yi from SK Securities. Thank you for the opportunity to ask a question on foundry. You have been seeing widening losses recently. It seems profitability is deteriorating. What are the reasons, and do you expect improvement in the second half?\n\n**Operator**\nYes, let me cover that question from the foundry business. In the short term, as global economic uncertainties persist, demand from mobile and PCs are also seeing a continued slowdown. Poor demand from major customers has resulted in a drop in utilization rates and rising fixed costs, which are the main reasons for the recent deterioration in our profitability.\n\n**Operator**\nIn terms of our second half outlook, uncertainties, of course, will continue to remain, but we are expecting a gradual recovery in demand, which in turn will help improve utilization and gradually help narrow our loss. More specifically, we are planning we are securing stable mass production across our advanced process nodes, helping boost customer trust as we expand customer engagements more assertively. For more mature nodes, we will be optimizing power, performance, cost competitiveness, and develop specialty process nodes as we seek to maximize cost competitiveness and expand our markets. This way, we can secure competitiveness in both technology and cost at the same time, which will help us achieve our mid-to-longer-term objective of improving performance on a sustainable basis. Thank you for the answer on foundry. We'll move on to the next question, please. The next question will be by Mr. Ejun-yi from Goldman Sachs Securities.\n\n**Operator**\nYes, I have a question on memory and also display. For memory, due to changes in the tariff policies, market uncertainties on the rise. What is your outlook for memory given these developments, and what is Samsung Electronics' strategy? For display, the small to medium-sized OLED market has been seeing intense competition. What is your strategy to stay competitive? Yes, in terms of our outlook for the memory market, let me cover that. In the second quarter, we believe that customers' component inventories will normalize. Driven by continued AI-related demand, we expect strong fundamentals underlying the memory market to continue. However, we believe changes to the tariff policies of major economies, as well as stronger export controls against AI, have already been adding to rising uncertainty of expected demand in the second half.\n\n**Operator**\nEspecially in the second quarter, the grace period on tariffs that prompted some customers to increase pre-production. We've actually been seeing some pulling demand for our components. This preemptive purchasing may likely have some negative impact on demand in the second half. Still, to assess the actual impact, it depends on additional changes to tariff policies, also available supply capacity relative to forward demand. We will have to monitor developments and see. Given these market conditions, in the short term for DRAM, we expect mobile and PC applications, which had relatively low ASP, to start seeing pricing recovery first in the second quarter. For NAND, in the second quarter, we expect the decline in prices to slow down. Some product prices may be flat, others may increase slightly. Overall, we expect a change in the pricing overall.\n\n**Operator**\nTo sum up, while there may be a slight fluctuation in our Q2 performance, we expect DRAM to see increased sales driven by an increase in overall shipments Q on Q. Meanwhile, given different supply-demand dynamics by application and market, pricing trends may end up quite different by product, which is why we plan on managing supply flexibly between different applications to manage profitability. We expect DRAM bit growth to increase by a low 10% Q on Q. For NAND, amid growing perceptions that prices have reached the bottom, we expect customer demand to recover as they rebuild inventory. We will expand supply in line with growth in demand in the Gen 5 server PCIe market while managing supply across different applications centered on profitability.\n\n**Operator**\nWe'll also be accelerating our tech migration to V-NAND to enhance cost competitiveness, and we expect NAND bit growth to be up by mid-teens % Q on Q in the second quarter.\n\n**Operator**\nI'll answer the question about display. Despite high uncertainty such as changing tariff policies and the challenging business environment caused by intensified competition among OLED panel makers, we are striving to strengthen our competitive edge and maintain our leadership. First, from the early stages of developing new technologies with differentiated performance, we'll closely cooperate with customers to continually deliver high-quality products that meet their needs while further strengthening our cost competitiveness. Especially technologies with improved brightness, low power consumption, foldable devices, and next-gen form factors will continually be enhanced so that in the AI smartphone era, we can lead the display market. Also, we'll utilize the 5.5-gen, 6-gen, and the upcoming 8.6-gen IT line to secure and expand our position with optimized products for each line, not only in smartphones but also in emerging OLED markets such as IT and automotive, thus solidifying leadership in the OLED market. Thank you.\n\n**Operator**\nThank you for your answer. We'll move on to the next question. Next question will be made by Kun Chang-lo from Hyundai Motor Securities. I am Kun Chang-lo. Thank you for the opportunity. I'd like to ask about the MX business first. It's about the foldable shipment. The increase of foldable shipment is decreasing, and some people say that it may show reverse growth rate. Can you talk about Samsung's foldable shipment target? The second question is about Trifold. Huawei and many other Chinese companies are coming up with new smartphones. Does Samsung have any plans on launching Trifold? When will we be able to meet this new smartphone? Thank you.\n\n**Jae-jun Kim** (EVP)\nWe have continued to lead the foldable market through our innovation. This year, with more innovation on the foldable form factor, we will improve the competitiveness of our products even further, enabling more customers to experience the benefits of foldables. In terms of technological innovation, we are significantly improving the portability and performance, which are key buying factors for our customers. The advanced Galaxy AI experience from the S25 series will be tailored individually to each of the foldable form factors, Fold and Flip, to deliver a more differentiated and specialized experience. With the Fold, we will offer an optimized large-screen AI experience. On the Flip, it will feature a portable AI experience that can be used anywhere, anytime. We will expand sales of the high-end models while also strengthening the foldable lineup in order to attract new customers aiming for meaningful growth.\n\n**Jae-jun Kim** (EVP)\nNow, as for new form factors, we believe that beyond the form factor itself, it's essential to ensure a level of product quality and usability in real-world scenarios that's aligned with market demands and customer expectations. We are reviewing products with new form factors with a focus on securing meaningful competitive advantage in performance and quality. Thank you.\n\n**Operator**\nThank you. Due to the time constraint, we'll accept one final question. The next question will be by Mr. Ehsay Char from Citigroup. Please go ahead. Yes, good morning. This is Ehsay Char from Citi. I have a question on memory, just on your mid-to-longer-term perspective. DeepSeek obviously caused a big buzz early in the year, and it's expected to prompt a lot of change regarding AI. Have there been any changes beyond servers, like in PCs or the mobile market, in terms of demand or product requirements? Thank you. Yeah, as you mentioned, at the start of this year, there was a great deal of attention toward DeepSeek, and it prompted rising expectations about high-accuracy AI inference models built on smaller LLMs.\n\n**Operator**\nIt seems not only for servers, but for PCs and smartphones and other edge devices, we expect lots of different ideas to be tested out on the use of AI functionality. First, workstation-grade AI PCs have shown the first signs of market traction. High-spec systems deploying at least 128-512 DRAMs per system are being released, and we're seeing a rapid increase in demand. For conventional PCs, considering the size of AI models, current hardware specifications are just not enough, so it will likely take more time to uncover a killer application for AI. Still, with end-of-support for Windows 10 in the second half of this year, we expect replacement demand mostly for AI PCs. In the mid-to-long term, as hardware specifications become increasingly upgraded, there will be continued solid demand for higher memory density and performance.\n\n**Operator**\nFor mobile applications, to enable AI processing at the device level, we expect demand for DRAM with improved power efficiency, performance, and density to increase. This year, as AI competition heated up in the flagship segment, the trend toward higher density LPDDR5X products, for example, has become more visible. To target the future market looking beyond the second half of 2026, different products such as LPW or LPPIM with improved power efficiency and performance are under active discussions, along with standard LPDDR6 as well. The spread of generative AI is unfolding in many different forms, not only in servers, but at the edge as well. We are committed to timely development of differentiated products demanded by today's changing market dynamics to proactively capture new market opportunities. Thank you.\n\n**Operator**\nI'd like to thank everybody who participated in this earnings call. I would also like to thank everybody who shared their valuable opinion. We will refer to them in our decision-making process. That completes our conference call for this quarter. We wish all of you and those close to you stay strong and healthy. We thank everyone for your participation, and we look forward to speaking with all of you soon. Thank you.",
      "fetched_at": "2026-02-04T15:55:23.771Z"
    }
  ]
}