{
  "ticker": "6723.T",
  "last_updated": "2026-02-04T15:54:08.807Z",
  "total_transcripts": 3,
  "transcripts": [
    {
      "ticker": "6723.T",
      "title": "RENESAS ELECTRONICS CORP (6723.T) Q3 FY2025 earnings call transcript",
      "published_date": "Oct 30, 2025, 10:00 AM GMT+9",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/6723.T/earnings/6723.T-Q3-2025-earnings_call-367006.html",
      "content": "**Speaker 2**\n皆様、おはようございます。Good morning, everyone. If you'd like to listen to this session in English, please click the interpretation icon at the bottom of the screen and select the English channel. 本日はお忙しい中、Renesas Electronics Co. 2025年第3四半期決算説明会にご参加いただき、誠にありがとうございます。本日は同時通訳チャネルがご利用いただけます。画面下にある通訳アイコンをクリックして言語を選択してください。それでは、スピーカーの皆様、ビデオをオンにしてください。 本日の説明会には、代表執行役社長兼CEOの柴田秀俊、執行役員兼CFOの新海秀平、他スタッフが出席しております。これより柴田からご挨拶申し上げた後、新海より第3四半期決算についてご説明いたします。続けて質疑応答を行います。説明会全体の時間は60分を予定しています。 なお、本日の説明会で使用する資料は当社ホームページのIRサイトに掲載しているものと同じです。それでは柴田さん、マイクをオンにして開始してください。よろしくお願いいたします。\n\n**Speaker 0**\n皆さん、おはようございます。柴田でございます。今日は風邪をひいていまして、大変鼻声で聞き苦しいんじゃないかと思いますが、失礼いたします。気温もだいぶ一遍に下がりましたし、学校のイベントも秋のイベントも目白押しで、私の身の回り風であふれてまして、まんまと風邪をひいてしまいました。皆さんもぜひお気をつけください。 サードクオーターはすでにご覧になってる方多いと思うんですが、ある意味で想定どおりの着地だったかなというふうに考えています。ご記憶にあるかと思いますが、アップサイドもあるかもしれませんが、慎重に運営していきますというふうに前回申し上げたんですが、おおむねそのとおりで、私たちからの売り上げは当初の予定どおり。一方でチャネルからの売り上げは少しアップサイド側に振れまして、チャネルの在庫が薄めになったというのがサードクオーターの結果かなというふうに総括をしてます。したがってちょっとこのままだとおぼつかないので、このフォースクオーターにかけては少しチャネル在庫の拡充ができるといいなというふうに思って運営をしていきます。 全体感として、チャネルからそのエンドの需要のセルスルーで申し上げると、おおむねフラティッシュな感じかなというふうに見込んでいます。出っ張り引っ込みはありますけれども、大体そんな感じかなと思ってます。 オートモーティブのほうは一部特定顧客の生産とか在庫の調整等がありまして、少し下がるかなと。一方で28ナノマイコンとジェネレーションフォーのSOCですね。こちらはもちろん継続的に順調に立ち上がってはいるんですが、まだまだ規模が小さかったりとか、あと28ナノマイコンについては先ほど申し上げた主に中国の特定の要因による調整が入ったりしまして、そんなにものすごくぐいっとまだ伸びる段階にはなってない。着々と伸びていくというところかなと思ってます。 一方で自動車以外のところで申し上げると、Q4にかけてはどうでしょうね。見通しは前回よりは随分いい感じかなと思ってまして、産業用全体としてはもちろん出っ張り引っ込みはありますけれども、全体としてはそれなりに力強い回復を見込んでいます。 それから、サードクオーターに引き続き、このフォースクオーターもAIのインフラのところは相当需要強い状態が当然にして継続していきまして、ここはどちらかというと生産サイドを今必死に頑張っていて、少しでも需要に支障をきたさないように作って売ってく、作って売ってくということを頑張ってやってくというフェーズだというふうに考えています。 あとはコンシューマーを代表とするコンシューマーモバイルのIoTの分野につきましては、これは別に何も変なことはありませんが、サードクオーターがすごく上がって、フォースクオーター下がるという季節性での減少を見込んでますけど、ここでは一部シェアゲインなんかもありまして、全体としては上向きかなと思ってます。 なので、IIoT全体としてはトレンドとしてはいいかなと。オートモーティブのところ、まだまだ特にNextpedia等もありましてね、不透明感ありますけれども、ここは従来どおりの慎重な運転、私たちの在庫、チャネルの在庫をよくよく見ながら慎重に運転していこうと思います。特にそのチャネル在庫の管理のところにつきましては、もうだいぶ前ですけどね、5年くらい前にちょっと良くないねという状況がありましたので、それを踏まえて慎重さを継続していきますので、ここはぜひ皆さんご覧いただいて、よろしければご評価いただければありがたいなと思っています。 それから、今日は前回までの、前回の決算発表までに、そろそろアルティム買収して1年を超えてくるので、どうなってんのというお声も頂戴するようになりましたので、今日少しだけお話をしようと思います。これから段階的にお話をもうちょっと充実させていこうと思ってますので、今日は本当に取っかかり、さわりだけということでご容赦いただければ幸いです。 じゃ、ちょっと事務局、スライドを表示してください。 はい、これ、アルティムの単独でのお話にはなりますが、これまでのところ、当初予定どおりコストシナジー、それからオーガニックグロースについてはまったく予定からずれることなく順調ですというのが左に書いてある上二つの意味ですね。売り上げのシナジーにつきましては、これ当然時間がかかる話なんですけど、いわゆるエンタープライズというか、世界をリードするような大口顧客に対する拡販については少しずつ始まっていますというのが一番左側に書いたことの意味です。 今、まさに集中して取り組んでるところがこの真ん中のところでして、アルティム買収してアルティムそのまんまスタンドアロンでいるんだったら、我々が取り組む意味まったくありませんので、ある種の大きな転換を今してるところであります。 一つは、これ、アルティムからすでにアナウンスしていて、ウェブサイトご覧いただくと、多少は感覚がつかめるかなと思いますが、これまで、PCBデザイナーソフトウェアとか、オクトパートとか、それぞれのプロダクトを提供する会社であったわけなんですが、今、まさにプラットフォームを提供する会社に大きな転換を遂げている最中です。それと同時並行で、ユーザーベースを拡大することを加速していきたいというふうに考えて、これ当初から言いまして、それに向けた取り組みを推進し始めたところです。 そして、なんでルネサスなのっていうとこの一つの大きなピラーっていうんですかね、柱が、このルネサス365と銘打った私たちのプラットフォームのところでして、これ今、鋭意開発中でして、今年の前半にエンベリッドワールドという、トレードショーで、デモをご覧に入れたんですけど、それを踏まえながら、年内にローンチすべく、今準備を進めているところであります。 今後のところは、右側ご覧いただきまして、今申し上げたルネサス365は年内にローンチ予定でありますと。これ、ちなみに、ローンチ時点では、そんなに皆さんびっくりするような、ものすごく素晴らしいものには当然なりませんで、その昔、ウィンドウズがひっそりデビューを飾ったときのように、ひっそりデビューをして、そこからただ、コンスタントにアップグレードを繰り返して、ウィンドウズ95でウィンドウズが大きくテイクオフしたようにですね、そういうプロセスを経ていくことを想定していますので、ほどほどの期待感でご覧いただければ幸いに存じます。 それから、アルティム、それからデジタライゼーション全体の進捗については、先ほど申し上げたように、今、大きな転換を遂げてる最中ですので、ここでKPIを全部決めてしまって、あとから変えるというのもちょっと拙速かなと思いまして、少し丁寧にKPIを今設定してる最中ですので、首尾よく行けば、次回の通期決算のときまでにこういうものをトレースしていきますということをお話しできるようにしたいなと思っています。 それから、一つの大きなマイルストーンであります、来年のキャピタルマーケットデーで、全体の進捗について、もう少し俯瞰して、もう少しデータも加えながら、進捗をご報告する予定にしておりますということであります。 では、ここから、少しアルティムのこれまでの話に端を発して、それから、今回の決算の詳細につきまして、新海にバトンタッチをして、お話を差し上げます。新海さん、お願いします。\n\n**Speaker 3**\nCFOの新海です。前のページの左側の、これまでの進捗というところをメインにアップデートしたいと思います。買収から一年経って、その間の進捗ということになりますけれども、右側見ていただいて、コストシナジーですが、コストシナジーはそもそもクロージング直後の初期的なコストカット、それからそこから先のコストの増分をルネサスのリソースを活用して吸収していくという二段階の構成を考えていまして、その最初の段階のコスト削減が今年の第一四半期を待つまでに完了しましたということです。それから二点目のオーガニックグロースですけれども、左側のチャートにあるとおり、この全体の成長を示すためにARR、アニュアルリカーリングレベニューという指標を示しています。これは期間契約とかサブスクリプションのサービスから生じる一年間部分の継続的な収益を示す指標です。ちょうど一年前ですね、20年の第三四半期と比較して、15%、イヤオブイヤーで成長しています。これは買収前とほぼ同じペースで堅調に成長していますということです。それから売り上げのシナジーは、エンタープライズ向けのクロスセールという施策からスタートをしています。最後にプラットフォーム企業への転換というところなんですけれども、ラインナップとしてのルネサス365の開発に加えて、財務、会計の分野で申し上げると、先般アナウンスした収益認識基準の変更についてなんですけれども、こちらもこのプラットフォーム企業へビジネスモデルを転換していくということを見据えて、今期からこの認識基準を変更したというところです。以上がアルティムについての進捗のアップデートです。以降、通常のスライドを使いながら第三四半期決算について解説いたします。 6ページお願いします。決算概要についてです。第三四半期については真ん中の濃い青の列をご参照ください。売り上げ収益については¥3,342億円。売り上げ総利益率は57.6%。営業利益は¥1,032億円。営業利益率は30.9%。当期利益は¥882億円。EBITDAは¥1,225億円。為替は、ドルが¥146円、ユーロが¥170円となりました。予想費については、その三つ右の列をご参照ください。後のページで解説します。それからギャップの業績、こちらはノンギャップの業績ですけれども、ギャップの業績については後ほど改めてご説明します。 次のページお願いします。第三四半期の売り上げ収益、売り上げ総利益率、営業利益率について、それとセグメント別についてです。全社合計についてですけれども、予想費、売り上げ収益は1.3%の上振れとなりました。ほぼ3分の2程度が為替円安の影響で、3分の1程度がそれ以外の影響ということになります。自動車は予想費ほぼインラインで着地。元々セルスルーのアップサイドに対応できるような出荷を計画していますよということでしたが、セルスルーは好調で出荷はほぼ予想どおりに着地したということでございます。産業インフラIoTでも総費で増加しておりまして、ここはAI向け、サーバー、PC向けのデジタルパワー、それからメモリーインターフェースが中心となって上振れをしました。続いて売り上げ総利益率については予想費で1.1%ポイントの上振れとなりました。その中身は大きく分けて、ミックスの改善と稼働度によるものでした。ミックスの改善は、その売り上げの上振れでも出てきましたけれども、メモリーインターフェース等の比較的高いグロースマージンのものが売れたということと、稼働度に関しては後ほどにも触れますけれども、インプットの稼働率が想定よりも若干増えましたと。投入スケジュールの見直しによって第三四半期での投入が増えたということになります。それから営業利益率については3.9%ポイントの予想費の上ということで大きなギャップが生じております。ここは先ほど申し上げたその売り上げと売り上げ総利益率、利益の改善に加えて、営業費用の減少による改善が大きく寄与していまして、実額で申し上げると、この営業費用、R&DとSGAを合わせたオペックスで¥63億円が予想費で減少しています。おおむね半分がこの研究開発費のずれ、第四四半期にずれたもの。それから、もう残りの半分が正味のコスト削減と言いますか、正味の減少でして、これが効果が予想において織り込めてなかったというところでございます。したがって、そのずれ部分がもうこの第三四半期、第四四半期というふうに見ていくと、かなりインパクトを起こしてるところなんですけれども、後ほど第四四半期のところでもお話ししますけれども、上期の、上期じゃない下期の平均で見ていただくと、より実態に近しい営業利益率になるかなというふうに考えております。それから、QオンQについてはこの右下のボックスご参照ください。売り上げ収益は2.9%の増で、自動車がQオンQで減、産業インフラIoTで増という結果になりました。売り上げ総利益率は0.8%ポイントのQオンQでの増でして、ミックス改善、稼働増、それから費用減が若干ずつ寄与しています。営業利益率についてはQオンQで2.9%ポイントの増ということになりました。要因は売り上げ、費用減、先ほど申し上げたとおりです。 次のページお願いします。失礼しました。こちらですね。セグメント別ですね。自動車については一番下の営業利益率のご参照いただくと、営業利益率でQオンQで大きく改善しています。これは第二四半期で反映していた一過性の損失、具体的には訴訟費用等なんですけれども、それの反動増ですね。でこのQオンQで大きく見えています。実力っていうかですね、その定常的にはどうなのという観点で申し上げると、三四半期、こう、均してみ、合計で見ていただくと、第三四半期までの九か月の累積で、自動車向けの営業利益率は29.5%となりますけれども、そこがおおむね実態に近いかなというふうに考えております。産業インフラIoTについては特筆すべきところはないですので、次のページをお願いします。 売り上げ収益ですね。全体についてイヤオブイヤーで3.2%の減収。QオンQで2.9%の増収となりました。セグメント別は以下に記載のとおりです。次のページお願いします。 各種数値のトレンドです。こちらも特筆すべきところはないので、次のページをお願いします。 在庫についてです。QオンQの増減と見通しについて整理しております。まず自社在庫ですね。第三四半期ではQオンQで在庫、それからDOIともに想定どおり増加しました。第三四半期でDOIが111日となりました。第四四半期についてはこのQオンQで増加をしていくことを見込んでいます。仕掛かりについては内製を中心に大バンクを若干積んでいくという方針でおります。一方で需要の旺盛な部分、AI向けやDC向けは大バンクを積みたいんですけれども、積めていないという状況です。完成品については年初の出荷対応のため、年末に向けてですね、若干の作り込みを行うということを予定しています。続いて、チャネル在庫右下についてです。第三四半期はWOIも在庫も実額で減少することになりました。第二四半期が8.9週だったのが第三四半期末で8.1週というように減少しております。いずれもセルスルーの上振れでチャネル在庫が減少という結果になりました。第四四半期については全体で微減というのを見込んでおります。自動車はセルスルー並みの出荷を行って在庫は横ばい。それから産業インフラIoTはセルスルーに合わせた出荷を行うものの、AI向けやDC向け、データセンター向けでは引き続きセルスルーのほうが旺盛で、結果的にこう、チャネル在庫が減少していくという見込みでいます。先ほどの柴田のコメントで、チャネル在庫拡充方向というふうに申し上げましたが、QオンQで見ると、セルスルー、第三四半期から第四四半期ですね。QオンQで見ると、セルスルーがおおむねフラットなところをセルインが増加するという見込みを持っておりまして、そういった意味でチャネル在庫が減る幅が減るということを言っています。 次のページお願いします。前工程の稼働率についてです。第三四半期は先ほど少し申し上げましたが、見通し、50%を下回るところから50%というふうに若干、インプットベースの稼働率が増加しました。ただこれは、ファンダメンタルというよりかは、年末年始の稼働スケジュールを見直して、投入を第四四半期から第三四半期に前倒ししたという影響でして、そういった意味で第四四半期ではその反動減による微減を見込んでおります。設備投資については特にありません。 次のページお願いします。第四四半期の予想についてです。第四四半期について真ん中の濃い青の列ご参照ください。売り上げ収益の中央値は¥3,400億円。売り上げ総利益率は57.0%。営業利益率は27.5%。前提としている為替ですけれども、ドル¥150円。QオンQで¥3円円安。ユーロは¥175円。同じくQオンQで¥5円円安を見込んでおります。売り上げ収益についてですが、中央値での¥3,400億円は右側見ていただいて、イヤオブイヤーで16.2%。QオンQで1.7%の増収を見込んでおります。ただ、QオンQの増収について為替によるものが多く、デバイスでの売り上げが微増ということです。デバイスの売り上げのQオンQですけれども、モバイル、それからIoTセグメントによる季節性の減少を堅調なAM系、GC向け、それからボトムアウトが見えてきた産業系で打ち返すと、そういった見通しになっております。売り上げ総利益率は57.0%で、QオンQで59ベーシスポイントのマイナスと微減の見通しです。ミックスの悪化が主要因です。それから営業利益率については27.5%。QオンQで338ベーシスポイントのマイナスなんですけれども、こちらはQオンQで見たときのオペックスの増加が主要因でして、第三四半期のところでも申し上げた第三四半期から第四四半期へのシフト。それから定常的に起こるこの期末の集中。それから為替その他の費用増といったものがおおむね3分の1ずつ貢献して、オペックス全体でQオンQで¥110億円増加する見込みとなっております。営業利益率については27.5%ですけれども、この四半期平均で見ると29.2%で、上期平均、これが27.7%なんですけれども、そこから約150ベーシスポイント改善しております。それはトップラインの伸長、段階的な伸長とそれからコスト削減の効果の寄与という二つの方向が要因となっております。それからこの表の右下、ご覧いただくと、為替感応度について今回から追加しております。為替のボラティリティーがそれなりに高いのと、あとは定常為替、いわゆるドル¥100円に換算すると、どういうふうに見えるのかということを見ていただけるように試算できるように足しています。で、ここで申し上げると、この為替感応度として各、その対ドル対ユーロが1円変動したときの売り上げ、それから営業利益に与える影響を記載しておりまして、ドルが1円変動すると、この第四四半期の売り上げ収益に対して¥17億円、営業利益に対して¥7億円というインパクトがあります。でこの感応度をベースにですね、でドル¥100円、それからユーロ¥120円のコンスタントカレンシーに換算するとどう見えるかというと、この第四四半期の業績予想は27.5%から22.3%となります。それから年間についてはこの28.5%が23.0%となります。 続いてアペンディックスで、ギャップについて少し補足します。19ページお願いします。当期利益が¥1,063億円というふうになっております。売るスピードに関する評価益をその他金融費用に計上しておりまして、それが¥445億円あります。 次のページお願いします。その構成要因というか考え方について解説いたします。まずこの左側見ていただくと、元々そのチャプターイレブンに入る前の債権支援契約のタイミングで、元々我々の持っていた債権を、この転換社債と普通株式と新株予約権という三つの資産に交換するということを合意しました。そして、チャプターイレブンの手続きが9月末に完了したという状態です。でこの資産を四半期末でそれぞれ我々のその会計的に評価をするんですけれども、基本的にはエクイティー性の資産なので、その評価額っていうのはこの売るスピードの株式価値、時価、時価総額に大きく依存して決まっていくことになります。この真ん中に書いてありますけれども、第二四半期末ではその時価総額を$16.6億というふうに試算しました。これは債権支援債権計画の基礎となった数字です。そしたがって、その我々の持分ですね、それに対する我々の持分として$5.75億と試算しました。第三四半期末では、そのチャプターイレブンの手続きが終わって、時価が株式の時価っていうのがアップデートされて、流通している株価に対して完全規約化後の株数を乗じて、この株式価値、時価総額っていうのを算出しています。9月末時点の参照株価が$28.6で、それに対して株式価値、時価総額を$27.1億というふうに試算しております。したがって、我々の持分、そこから計算される持分が$8.74億ということで、日本円に直すと¥1,301億円。でこの差分として¥445億円をこの評価益として計上しております。でそれが第三四半期までの財務影響で、今後についてどうかということを、この右下に少しまとめております。現時点では、CFRの承認を得てない状態でして、厳密にはですね、この普通株式や新株予約権っていうのは取得していない状態です。その株式性のものはですね、CFR承認後に取得することになっています。したがって現在は、この株式や新株予約権についてはですね、同等の経済価値を有する代替的な権利を保有しているという状態です。一方でこのCFRの手続きは進行中で、早晩承認を取得する見込みです。ただ、足元はですね、米国の政府機関の閉鎖によって、そのスケジュールが延伸しているという状態になります。それから最終的にこのCFRの承認を経て、それから株を取得して、それから転換社債を転換し、新株予約権を行使すると、株式で約30%を取得することになります。そういう状態になるんですけれども、株主権を一部制限することによって、この持分法連結による財務影響から隔離するという方針で今進めています。 以上で全体の説明を終了します。\n\n**Speaker 0**\nありがとうございました。それでは質疑応答に入ります。柴田さん、ビデオをオンにしてください。まず質問の仕方について説明いたします。ご質問のある方は画面上の挙手ボタンを押してください。手を挙げていただいた方から順に会社名とお名前をお呼びいたします。司会が指名した方は発言が可能となりますので、ご自身でマイクのミュートを解除いただき、ご質問をお願いいたします。なお、時間の関係上、ご質問はお一人様につき二問まででお願いいたします。最初に、ゴールドマン・サックス証券、高山様、ご質問をお願いいたします。ミュートを解除の上、ご発言ください。\n\n**Speaker 3**\nどうもありがとうございます。よろしくお願いします。最初にインフラのところで、メモリーインターフェース並びにNVIDIA関連のピーミック、ここは多分すごく強いというふうに見えていますが、例えばどういう要求ベースの話が御社にこの来年に向けて来てるのか、今作れないほどって話なので、その要求ベースでこんなにオーダーが来てるとか、ニーズがあるんだよっていうところがもしあればということと、あとその御社のポジション、従来シェアにおいては、メモリーインターフェースもちょっと下がったところをまた上がるって話とか、NVIDIA関連のところも、三分の一から半分っていう表現ありましたけど、そのあたりが予定どおりうまく自社のポジションを上げられてるのかどうか、そこも合わせてお願いいただきたいと思います。お願いします。\n\n**Speaker 0**\nはい、メモリーインターフェースRDMについては、引き続き強気な見通しを持っています。特にその見通しを変える要因はありませんので、シェアについても強気な見通しを継続してます。パワーについては、特定顧客に言及することは控えますけれども、こればっかりはちょっと、例えば一年、あるいは数クオーターという見通しを立てるのはちょっと難しいなというのが正直なところです。\n\n**Speaker 3**\nうん。\n\n**Speaker 0**\n要求自体はものすごく強い数字をいただいてます。ものすごく。でも一方で、クオリファイするサプライヤーの数も増えてきていますので、あんまりこう油断をしてはいけないなというふうに考えてます。目先のところで申し上げると、三分の一よりはこうだいぶ上に振れて推移していく見通しを持ってますので、まあ例えば次のクオーターとか、そういうこうあの時間軸で申し上げると、まあかなり高いシェアを維持していくだろうというふうに思ってます。で、まあそれ以降のことはもうその次のクオーターにならないと、はい、あのよう分からんという感じだと思いますが、まあ需要自体は非常に強いので、あとは私たちがちゃんとエクスキュートすれば取っていけるだろうと、そういう見通しでおります。\n\n**Speaker 3**\nなるほど、ありがとうございます。メモリーインターフェースのところは、昨今、DRAMメモリー非常に強い見通しになっておりますが、ここは、ちょっとどういう表現でおっしゃっていただきたいんですけど、例えば1、3、4、6、来年に向けて、こう、どういう、こう、階段の上がり方をするようなペースっていうんですかね。どういうご要求がお客さんから来てる感じでしょうか。\n\n**Speaker 0**\nうーん、まあ、そんなに先のことまでは確たる数字はありませんけれども、まあ、例えば私たちのバックログの推移を見てると、今足元のところですね、9月末、それから10月の末にかけてのバックログは、まあ、まさに高山さんおっしゃった言葉をお借りすると、ちょっと階段状に上がってくるようなイメージですかね。\n\n**Speaker 3**\nああ。\n\n**Speaker 0**\nクロールして上がってくるというよりは、こう、かなり強く上がっているというのが今の足元の状況だと思います。\n\n**Speaker 3**\nあ、なるほど、ありがとうございます。あと、二つ目なんですが、ちょっと同じような形で車のところで、地域別の見え方というのを教えてください。先ほど中国ですかね、多分特定顧客というところで、ここも12月がちょっとへこむけど、また1月、3月から戻るような想定なのか。で、それ以外の日本またはヨーロッパ、主要なところの今後の見通しっていうんですかね、お客さんの引きの度合いっていうのはどういうふうにご覧になってますでしょうか。\n\n**Speaker 0**\n足元で申し上げると、日本は、サイクル的に強いなというふうに見えてます。\n\n**Speaker 3**\nうん。\n\n**Speaker 0**\nそれに対して、ヨーロッパが弱いかなというふうに見えてます。で、中国は、中国全体としては、一時よりはやっぱりスローダウンしてるようには見えていまして、その中で、顧客ベースによってまだ上がるところと、ちょっとやっぱ調整を行ってるところっていうふうに、こう、ノウハウが分かれてるっていうのが実態かなというふうに思います。なので、その顧客のエクスポージャーによって、まあ、その総和としての、数字の動き方が変わってくるんだと思いますが、全体の市況感としては、ちょっと弱含んでるような印象を持っています。\n\n**Speaker 3**\nなるほど。ちょっと補足という意味で、この全体の今回のトーンという意味では、ちょっと年末の利益率という意味では、費用の部分もあるので下がるということですが、まあ、ある種のボトムアウト、業績利益率のボトムアウトというのがなんとなくこの来年前半に向けて見えるようになってきたというメッセージなのか、それとも従前どおり、慎重でまだまだ横ばいですというトーンなのか、どういうふうに柴田さんとしてのメッセージとしては発せられたいようなイベントというか、今日はどういうふうなメッセージなんでしょうかというところはいかがでしょうか。\n\n**Speaker 0**\nここがね、難しいんですよね。\n\n**Speaker 3**\nうん。\n\n**Speaker 0**\nあの、まあ、横ばい微増ぐらいで、マージンとしては行ければいいなっていう感じですかね。ま、ここが本当に、ご質問の背景も理解してるつもりではいるんですが、やっぱり、こう、私としてはかなり長期に向けた投資を本当にアクセル踏んでかなきゃいけないと思ってますので。\n\n**Speaker 3**\nうん。\n\n**Speaker 0**\nまあ、それを考えると、どんどんどんどんこっからマージンを上げていくというよりは、あの、売り上げの伸長に伴って少しずつ拡大していくっていうふうなピクチャーが、まあ、ベストシナリオかなというふうに考えてます。\n\n**Speaker 3**\nなるほど、分かりました。どうもありがとうございました。\n\n**Speaker 0**\nはい、ありがとうございます。ありがとうございました。それでは続きまして、UBS証券、安井様、ご質問をお願いいたします。ミュートを解除の上、ご発言ください。\n\n**Speaker 3**\nありがとうございます。それでは私も、データセンター関連で、一つ目の質問をお願いいたします。GPUのお客様に加えて、来年はカスタムASICが増えてくる年になろうかと思います。ここでも変わらぬ3分の1以上のシェアみたいなところが、御社として、ある一定の規模感で、GPU以外の需要を取り込めるかどうか、確認をさせてください。一点目です。\n\n**Speaker 0**\nこれはまさにグッドクエスチョンでして、まあ、なんて言うんでしょうね、どう言ったらいいんだろうな。イエスはイエスなんですけど、当然そのカスタムになるので、なんて言うんでしょうね、我々の、こう、手数の問題というか、バンドウィズの問題になります。なので、どれもこれも同じようにやっていくっていうのは、できないし、そういうふうにしてしまうとやっぱりエクスキューションがおぼつかなくなってしまうので、まあ、一つ一つ、こう、ソケットを選んで取り組んでいくっていうことになろうかなと思います。で、実際この、数字は今申し上げませんが、四級の見通しの段階から、カスタムのパワーの数字は、入ってます。で、これは来年強く伸びるだろうと思ってますが、まあ、それぞれ、カスタムの、プラットフォームが、まあ、ハイパースケーラーに応じて数種類も立ち上がってく中で、全部をこう、のべつまくなしに、例えば、50%取ります、100%取りますっていうのは、これはまあ、現実感がないので、まあ、その中のいくつかを選んで、3分の1というよりはもっと大きなシェアを取りに行くっていう、そういうアプローチを取っています。以上です。\n\n**Speaker 3**\nその意味では、このピーミックのデジタルパワーのところというのは、えっと、まあ、顧客別でかなり仕様がちょっと異なってるって考えるべきなんでしょうか。\n\n**Speaker 0**\nうーんと、まあ、かなり異なっているということはありませんけれども、やっぱり顧客によって求めるアーキテクチャーが違うということもありますし、あとは、その世代交代のタイミングも違うんですよね。で、そうは言っても、こう、ウェファーとかバックエンドを実際に作っているところは同じだったりしますので、キャパシティーのアロケーションの問題とか、必要な設備の問題とか、もろもろの問題があって、エンド・トゥ・エンドで見ると、一個作ったらそれを横展開すればいいっていう、そういうふうにはなってないっていう、そういう意味ですね。\n\n**Speaker 3**\nありがとうございます。二つ目、自動車のところ、サブクオーターで粗利益、粗利益率が55%で、開示いただいた範囲内では過去最高に高いように見えます。これが、もっと高くなるのか、このサードクオーターでちょっと高かった背景と持続性があるかどうか、このへん、感触いただければ幸いです。以上です。\n\n**Speaker 0**\nはい、じゃあ、今のご質問は新海から回答します。新海さん、お願いします。\n\n**Speaker 3**\nはい、第三四半期の自動車ですけれども、稼働率の増とそれから清掃費用の減といったコストサイドの改善影響が寄与して、この2.8%ポイントのQオンQの増となっていますので、継続するかという観点で申し上げると、稼働による部分も相応にはあるかなというふうに考えてます。ざっくり半分ぐらいが稼働によって連動していって、それから半分ぐらいがこのコスト削減の継続的な進捗によって維持されると、そういったふうに考えております。以上です。\n\n**Speaker 0**\nありがとうございました。\n\n**Speaker 2**\nありがとうございました。それでは続きまして、POVA証券の平川様、ご質問をお願いいたします。ミュートを解除の上、ご発言ください。\n\n**Speaker 3**\nありがとうございます。POVA証券、平川でございます。一つ目なのですけれども、ノンコア事業の整理の進捗と考え方について教えていただきたいと思います。報道では、タイミング部門の売却との報道が出ておりましたけれども、それは個別のところは、言及できるところはもちろん教えていただきたいんですけれども、そのほか全体として今どの程度のものがノンコア事業もしくは周辺事業として位置付けられていて、それについてどのような取り組みをされていくのか、時間軸とともに教えていただければと思います。以上、一点目です。\n\n**Speaker 0**\nはい、じゃあ、新海さん、お願いします。\n\n**Speaker 3**\nはい、その事業のプロダクトポートフォリオの見直しというのは、年間のサイクルで継続的に行っているところです。で、そこでこのフォーカスするところ、それから、オルタナティブを考えるところというふうに分けをしていってるところです。なので、現時点において、ここがこんだけが、例えばそのリストに入ってますとか、そういったことはなくて、継続的な取り組みとして見ているというところです。で、そこでのその基準というか、クライテリアというのは、我々のそのコア、いわゆるエンベデッド整備というところに、どれだけその内部的なシナジスティックなバリューがあるかというところを考えて、コア、ノンコアと、フォーカス、フォーカスしないというようなところを検討してるというところです。以上です。\n\n**Speaker 2**\nあの、すみません、ちょっとフォローアップですけれども、そのシナジーの価値を生み出せるそのアセットというのは、大体今のNESASの全体のアセット100とすると、どれぐらいが今見込まれているのでしょうか。\n\n**Speaker 3**\nはい、すみません、そこもですね、定量的にこれだけですということは、なかなかお答えするところが難しいところですけれども、はい、今後継続的なアップデートと、それから、プロダクトラインのレビューによって、ある意味相互、相対的に変わってくるものだというふうにご理解いただければ幸いです。以上です。\n\n**Speaker 2**\nありがとうございました。二つ目は、アルティム、ルネサス365についてお伺いしたいのですけれども、そのユーザーベースを今拡大されて、力を入れていらっしゃるということですが、そのユーザーベース拡大のためにやられていることと、そのどのような拡大のペースなのか、もし定量的にいただけるものがあればということと、そのルネサス365、Windowsのようにだんだんということで、先を急ぐなということなのかもしれませんが、今年年末にローンチされるときには、どのような機能を持ってローンチされるのかというところについて教えていただきたいと思います。以上です。\n\n**Speaker 0**\nユーザーベースの拡大はまだ始まったばかりですので、こんなペースですというものはまだないです。クラウド化によって、かなりプライシングのストラクチャーも変えてまして、従来よりは小さいユーザーにとって取り組みやすいオプションを設けるというのが一つと、それからその地域的に、これまで以上にリソースをかけて、中国とかインドとかのマーケットに本腰を入れて取り込んでいこうというようなところが、大きな二本柱として、ユーザーベースの拡大をこれから推進していきます。 Office 365について申し上げると、一つは、Embedded Worldでお見せしたものが、ベンチマークになるというふうに考えていただければ結構なんですが、それよりも何よりも、一番その見て分かりづらいけれども実態として効果があるかなと考えてるのが、クラウドイネーブルメントのところです。これまでは、私たちもそれなりにいろんなツールを提供してきたつもりではあるんですけど、例えばウェブサイトから、ダウンロードします、バージョン管理が複雑です、みたいなものが、非常にクラシックな形でやってきたわけなんですが、これから、全部、クラウドをイネーブルされる格好になりますと、まさに皆さんが今、皆さんおそらくお使いだと思いますが、マイクロソフトのOffice 365を使ってると、もうバージョンなんか全然気にしなくてもいいですし、必要な、バグフィックスも、自動的に行われていくということだと思いますが、そういった形で、常に最新のものがクラウド上で、シームレスに使えるようになっていくと、そういう状態をまず第一段階としては、志向しています。 したがって、ファンクショナリティーがすごくドラスティックに増えていくとか、そういうことはなくて、これまでのその使い勝手を、大幅に向上していくというのが最初の取り組みかなというふうに考えてます。そこから私たちの考えとしては、そんなに数多くない、リードパートナーカスタマーみたいな方々と一緒に、どういうファンクショナリティーを本当に充実させていくと、一番顧客にとってユーザーにとって効果があるのかというところをそこから、一緒に見極めていって、開発の優先順位を決めていこうと考えてます。 ご案内のとおり、クラウドになりますと、もう、アップデートのサイクルが、大幅に変わっていきますので、まさにアジャイルを旨として、常にアップデート、アップグレードをして、気づいてみたら、だいぶ使い勝手が良くなったねって思っていただけるような、そういうような、取り組みに、していきたいと考えています。以上です。\n\n**Speaker 3**\nありがとうございました。\n\n**Speaker 2**\nありがとうございました。それでは続きまして、大和証券、大川様、ご質問をお願いいたします。ミュートを解除の上、ご発言ください。 本日はありがとうございました。大和証券の大川です。まず一点目が、産業インフラIoTの粗利率についてお伺いさせてください。採算性の高いデータセンター関連が増えている割には、QオンQではそんなに伸びていないような気がしますので、ここの背景と四クオーターのご計画、ミックスが悪化しますというお話がありましたので、そこをもう少し詳しく、ここは自動車、IoT、どちらともかもしれないんですけども、ここも補足いただけませんでしょうか。お願いいたします。\n\n**Speaker 0**\nじゃあ、新海さん、お願いします。\n\n**Speaker 3**\nはい、まず第三四半期のところから申し上げると、産業インフラIoTの中もいろいろありまして、粗利予想比で言うと粗利率の相対的に高いデータセンター向けメモリーインターフェースが伸びましたということなんですけれども、例えばその同じデータセンターのセグメントにあるものでも、ものによってはその平均よりも低いものも当然ありますので、そういったもののミックスをドライブしてるということです。で、今伸びているものの中にも必ずしもその非常にこの平均よりもグロスマージンが高いものばかりではないので、そういったものの伸びの出っ張り引っ込みによって、この産業インフラIoTの部分のマージンの変動が構成されているということになります。例えばで申し上げると、ハイデンシティパワーなんていうのはそんなにこの平均よりもグロスマージンが高くないので、それが伸びてくると全体のマージンの押し下げ要因になると。したがって、このマージンのグロスマージンの伸びがミュートされてるというふうにご覧になるのかなというふうに思います。で、第四四半期の部分で言うと、同じような理由でして、第三四半期で良かった分の反動ということもあるんですけれども、相対的にこのマージンの低いものが伸びる結果、全体としてはマージンを押し下げるということになります。はい、以上です。 ありがとうございました。二点目が産業の見通しについてお伺いさせてください。競合をちょっと扱ってる製品違うとは思うんですけども、結構産業について慎重な見通しをしゃべってる競合他社さんもいるとは思うんですけども、御社ベースの中では、どういうふうな見通しを持っていらっしゃるのか、またちょっと地域別で見たときに、なんか回復に差があるのかどうか、産業のところについてお伺いできませんでしょうか。お願いいたします。\n\n**Speaker 0**\nはい、えーと、どうだろうな、まあ、頑張って三つぐらいの塊に分けてみますと、えー、まあ、一つは、いわゆるこう伝統的なファクトリーオートメーションみたいな世界で、もう一つは、まあ、あの、広くこうエナジーマネジメントみたいな世界で、えー、もう一つは、あのー、まあ、スマートアプライアンス、あの、いわゆる家電みたいなもんですね、の塊で申し上げると、えー、エナジーマネジメントは、あのー、強いなあというふうに、あの、見えてます。あのー、まあ、これ、これはなんて言うんでしょうね、その地域によってノウハウがあるというよりは、エナジーマネジメントに強い顧客が地域によってノウハウはありますけど、あの、おそらくジオグラフィーに関係なくエナジーマネジメントは強いなというふうに、あのー、感じてます。で、家電も、あのー、かなり強いなあというふうに感じています。これもそんなに地域性というのはなくて、まあ、中国も大きいですけどね、ボリュームとしては、あの、大きいんですけど、地域でノウハウというよりは、あのー、やっぱりこう、そ、ちゃんとそこを打って、あのー、回復サイクルには入ってるかなというふうに、あの、感じてます。で、そのハードコアのファクトリーオートメーションのところが多分一番こう、ミックスとビューというところかなと思いまして、えー、日系顧客そんなにやっぱ強くは見えてないですね、正直申し上げて。で、世界的にもここがものすごく強いというふうには見えていませんけれども、あのー、まあ、一時のその、非常に厳しい状態はもう脱していて、えー、緩やかな回復基調に向かってるのかなというのが、あのー、見立てです。地域的には先ほど申し上げた、えー、ところが大きいかなと。あの、短期で言うと、えー、日本と、あの、ヨーロッパが、あの、この四半期に向かっては、あのー、なんて言うんでしょうね、三半期との反動もあって、あのー、伸びを牽引するように見てますけれども、あの、こう、趨勢として、あのー、すごく強いかっていうと、まあ、そういうことではないのかなと思ってます。以上です。 ありがとうございました。\n\n**Speaker 2**\nありがとうございました。それでは続きまして、シティグループ証券、藤原様、ご質問をお願いいたします。ミュートを解除の上、ご発言ください。\n\n**Speaker 3**\nお世話になっております。シティグループ証券の藤原です。私からも二問お願いできればと思います。まず一問目なんですけれども、まだ起きたばかりで恐縮なんですが、Nextpediaの供給問題につきまして、改めて教えていただければと思います。お客さん側で一生懸命今整理してる状況かなと思いますけれども、第四クオーターにどういった影響が出ると想定をされているのか、ないしはお客さん側からどういった可能性を示唆されているのか、シェアできる範囲で教えていただければと思います。これが一点目です。\n\n**Speaker 0**\nはい、じゃあ、新海から回答します。お願いします。\n\n**Speaker 3**\nはい、現在の見通しには織り込まれてないんですけれども、出荷に関しては、そこまで大きな影響はないというふうに考えています。バックログとの関係でですね。ただ一方で、セルスルーに対しては、多少影響が出てくるかなと可能性もあるかなというふうに考えています。今はそのセルスルーに従った出荷をするという想定でおるんですけれども、仮にそこが下振れてくるようであれば、結果的にこう、在庫が、チャネリングに対応する在庫が増えるという可能性もあるというふうに考えております。ただ、具体的にはですね、まだ不明確なところが多くて、見通しには織り込んでいません。以上です。\n\n**Speaker 2**\nありがとうございます。ちょっと確認ですけれども、まあ、12月期は、まあ、よほど大きな短期的な調整にならない限りは予定どおりで、まあ、何か影響が出たら少し1月、3月で調整をするというようなイメージになるんでしょうか。\n\n**Speaker 3**\nはい、そうですね、十二月期だと在庫に影響して、それがもしあれば、一九、三月期に反動としてくる可能性があるということになります。\n\n**Speaker 2**\n分かりました。ありがとうございます。二点目なんですけれども、お客さんの調達姿勢について教えていただければと思います。今年、かなり短期のオーダーがずっと続いているという話かなと思いますけれども、業界全体比較的在庫が薄い状態の中で、お客さん側はそこの在庫を積み上げるという方向にはなかなか進んでいっていないようにも見受けられます。足元でお客さんの調達動向はどう変わってきているのか。もし何か示唆できる情報がありましたら、来年度に2026年に向けてこの調達姿勢がどういう方向に向かいそうなのか、もし感覚でも結構ですので、教えていただけることがあれば教えていただければと思います。よろしくお願いします。\n\n**Speaker 0**\nこれは、まさにグッドクエスチョンでして、今足元で申し上げると、趨勢的に在庫拡充っていう動き、あるいはリードタイムの長期化っていうものは見えてないです。ただ、ありうるとするとですね、やっぱりデータセンターというかAIを中心にして、一部の部材をたくさん使うんですよね。デバイスが台数が大きいので。そうするとそこが逼迫するわけですよね。部材とか、キャパシティーとか。そうするとスワって言ってみんな取りに行くっていう動きみたいなことが起こらないとも限らないので、リードタイムが長くなるっていうことも出てくるかもしれません。そうなってくると、在庫拡充の動きと、特に初期的にはちょっと見分けがつきにくい可能性もあるかなと思うので、そこは顧客とのコミュニケーション密に取りながらですね、何が何をドライブしてるのかっていうのを、しっかりトレースしていきたいなっていうふうに考えてます。ということで、今時点ではあんまり目立った変化は見られていません。短期的にちょっとやっぱり在庫を絞りすぎちゃったから、もうちょっとっていう、そういうものは、スポッティーには起こってますけどね。趨勢としてどんどんっていうふうには今は見えてないです。以上です。\n\n**Speaker 2**\n分かりました。ありがとうございます。以上となります。\n\n**Speaker 3**\nありがとうございました。それでは終了予定時刻が近づいておりますので、以上で質疑応答を終了させていただきます。最後に柴田よりご挨拶申し上げます。柴田さん、お願いします。\n\n**Speaker 0**\nはい、ということで、引き続き、AIがとても強い、それからAIの派生としての影響もあるかもしれませんが、エネルギー関係のところが強いと。それと、IoTの分野においては、一部ちゃんとシェアゲインができてるところもあって、堅調ですということなので、そういったところを中心に、特にエクスキューションのミスを起こさないように、しっかり内部を固めていきたいなと思ってます。自動車のところは、いろいろ不透明要因はありますので、慎重に見ながら、ただ、アップサイドを逃さないようにっていう、これまでの姿勢を当面継続してやっていこうと思いますので、引き続きどうぞよろしくお願いします。本日はどうもありがとうございました。\n\n**Speaker 2**\nはい、以上を持ちまして、ルネサス・エレクトロニクス、2025年度第3四半期決算説明会を終了いたします。本日はご参加いただき、誠にありがとうございました。",
      "fetched_at": "2026-02-04T15:53:45.702Z"
    },
    {
      "ticker": "6723.T",
      "title": "RENESAS ELECTRONICS CORP (6723.T) Q2 FY2025 earnings call transcript",
      "published_date": "Jul 25, 2025, 10:00 AM GMT+9",
      "fiscal_year": "2025",
      "quarter": "Q2",
      "url": "https://finance.yahoo.com/quote/6723.T/earnings/6723.T-Q2-2025-earnings_call-332662.html",
      "content": "**Moderator**\nCEO, Hideyoshi Shibata and Senior Vice President and CFO, Shuhei Shinkai and some other staff members from the company. After opening remarks from Mr. Shibita, Mr. Shinkai will explain the second quarter results. After that, we would like to take questions.\n\n**Moderator**\nWe expect to finish the entire session in about sixty minutes. Please be advised that the material to be used for today's session is already posted on the IR site of our homepage. Now Mr. Shibata, please turn the microphone and the floor is yours. Good morning, everyone.\n\n**Moderator**\nThis is Shibata. First of all, recently, we have seen a certain conclusion with respect to the tariff issue, which I think is wonderful. The government, I think, has arrived at the best possible solution out of the options available. So from here onwards, the private companies in the current environment we'll have to consider how to respond and deliver results. I think that is the phase that we are currently moving into.\n\n**Moderator**\nHaving said that, however, the uncertainty still remains. The numbers that we have provided to you, including the third quarter numbers, were we have not factored in any numbers that could be affected by this tariff rate of 15%. Instead, the second quarter, a 5% or so risk had been factored in, in the second quarter numbers, which is something that we had already announced, but this did not materialize, fortunately. Still, uncertainty continues. So around 3% around the haircut numbers outlook is provided this time around.\n\n**Moderator**\nSo that is the overall picture. Now in particular about the second quarter, no big surprises. The tariff impact did not materialize, so no big surprises for the second quarter numbers. Wall speed impairment, as we have been informed you before, we've been able to land the numbers in the line with the projection that we had given to you earlier. And that is reflected in the difference between GAAP and non GAAP numbers.\n\n**Moderator**\nAs for the third quarter, the conventional servers and other data centers and because we've been able to acquire market share slightly and because of seasonality, mobile is expected to grow quite healthily. And in the area of IIoT, solid growth is therefore expected. On the other hand, when it comes to automotives, the second quarter, in particular in China, the performance was stronger than expected. The subsidies is now coming to an end, and there are some reactions about that. So therefore, in the third quarter, China is expected to slow down slightly.\n\n**Moderator**\nSo that is factored in the numbers. So automotive, therefore, is expected to remain flattish. So overall, the tariff impact still is uncertain. Therefore, although not as significantly as the second quarter, we have made a little haircut. And in order to include some risks, that is the overview of the guidance for the third quarter.\n\n**Moderator**\nSo that is the overall picture. So from here, as always, we would like to go through the presentation and have more details explained by Mr. Shinkai. Mr. Shinkai, please begin.\n\n**Moderator**\nThank you very much. This is Shinkai, CFO. I would like to explain the results for the second quarter of the year ending December 2025 using the material. If you can go to the fourth page. This is the second quarter results.\n\n**Moderator**\nAs for the actuals of the third quarter second quarter, please look at the columns in the dark blue on the middle. Revenue JPY 334,600,000,000.0 gross margin, 56.8% operating profit, 91,900,000,000.0 and DOP margin, 28.3% profit attributable to repairant, JPY 77,800,000,000.0 EBITDA, JPY 110,200,000,000.0 foreign exchange rate, 146 to the dollar and JPY 162 to the euro. Compared to the difference with the forecast, if you look at the three columns to the right. And for the first quarter, first half is at the far right, the dark blue part. And what is written on this slide is that is the non GAAP based results.\n\n**Moderator**\nThe GAAP based results are in the appendix. There, the deposit to work fleet has been recorded as valuation losses JPY $235,000,000,000. For this fiscal year. It was originally anticipated to be JPY $250,000,000,000, but it came in at JPY $235,000,000,000 at the end of the day. That's the final number.\n\n**Moderator**\nAnd those are recorded under financial expenses and have impacted our profit attributable to the owner of the parent. Next page, please. This is the second quarter revenue, gross margin and OP margin, operating margin. I would like to explain them here. Compared to the forecast on the upper right, if you look at the upper right box, revenue was up 7.5% compared to the forecast median number.\n\n**Moderator**\nLess than half of that was due to the weaker yen and remaining slightly over half was due to the fact that, as Mr. Shibata mentioned, when we developed our second quarter forecast due to the uncertainties over the reciprocal tariff impact, we factored in some risk. But those risks did not really materialize. And to give you some more details, automotive achieved an increase compared to the forecast that accounted for 80% and the remaining coming from the IIoT area. As for the gross margin, 56.8% and compared to the median value, 180 basis points higher.\n\n**Moderator**\nSo that was an improvement. And due mainly to the weaker yen increased utilization and improved production costs, those were the factors behind this increase. As for the utilization, the input utilization increased slightly. And also for the manufacturing cost, the manufacturing related projects footprint optimization and those projects expenses was pushed out, and those are going to be delayed into the third quarter. As for the OP margin, operating margin, 28.3%.\n\n**Moderator**\nSo compared to the median value, up by 3.3 improvement. This was due to the size increase of the gross margin gross profit. So the size improvement and the COGS improvement and push out of the expenses, due to these factors, we arrived at these numbers. The cost itself, OpEx itself, excluding the foreign exchange impact, came in as projected. And if you look at the bottom right on the Q on Q, operating revenues was an increase of 5.1%, excluding the impact of foreign exchange, up 9%.\n\n**Moderator**\nBoth automotive and IoT achieved an increase. And for the OP operating margin, our gross margin was nearly flat. The foreign exchange and the deterioration due to the manufacturing expenses was offset by utilization improvement. For OP profit, because of the foreign exchange and the expense increases. These were offset by utilization, so up 2.1 percentage points on Q on Q basis, 1.2 percentage points on a Q on Q basis.\n\n**Moderator**\nBy segment, if I look at the middle part here, would like to give some commentary here. The P and L for the by segment, the one off PL, this is excluded from the non GAAP adjustment for the entire company, but for segment specific P and L, it's already adjusted for in each segment. So therefore, the segment total, it does not really match up with the company total. So those are I would like to just add some comments here. For the automotive sector, in the second quarter, we have added back the losses such as the impairment losses from SIC business.\n\n**Moderator**\nThose are recorded here. So therefore, the OP margin on a Q on Q basis was down 6.3. And because of this irregular factor, if they were not for this impact, that automotive Q on Q was almost flat. When it comes to IIoT, in the first quarter, there were one off factors factored in, in the first quarter such as the legal expenses allowances mainly. And because of this reaction on a Q on Q basis, in the second quarter, the operating profit improved more than the growth of the revenue. The next page, please.\n\n**Moderator**\nThis is the quarterly revenue trends. You can see the second quarter results on the far right. Year on year, overall, we had minus 9.5% in revenue, Q1 Q plus 5.1% excluding the FX impact. As you can see on page four, year on year revenue was down 9.6% and increased to 9% Q on Q. And as you can see this by segment results as follows.\n\n**Moderator**\nAnd these are the financial numbers and their trends. At this time, there's nothing in particular that I would like to highlight, so this is just for your reference. Please go on to the next page. This is showing in house inventory and channel inventory changes and forecast. First, please take a look at top right, in house inventory and DOI.\n\n**Moderator**\nIn the second quarter, both inventory, the actual amount and DOI decreased Q on Q. As for DOI, from one hundred and eighteen to one hundred and six days at the end of second quarter. There was a decrease. The main reason comes from a decrease in line with the revenue increase. Particular reasons include the April power outages in Naka factory disposals and recovery efforts in relying with that.\n\n**Moderator**\nOther than that, due to production and shipment, the raw materials and work in process decreased as a result. As for the third quarter forecast, we expect an increase Q on Q. Dai Bank is to be increased according to our plan, and this is for the Linear V and others. And as for the finished goods, we expect there may be some upturn in the demand, so we would like to build up the inventory to some extent. And the lower half, this is for the channel inventory, in the second quarter, although inventory increased Q on Q, sell through also increased.\n\n**Moderator**\nAs a result, the WOI decreased Q on Q. At the end of the first quarter end, it was nine point two weeks decreased to nine point zero weeks at the end of the quarter. As for the automotive sell through was mostly in line with our expectation, but we are we have increased sell into the channel inventory with the expectation that demand increased in the third quarter. As for the IIoT sell through increased slightly above our expectation. And as a result, the sale in also increased.\n\n**Moderator**\nAnd as a result, the channel inventory decreased in line with our expectation. For the third quarter, we expect a slight increase Q on Q. For automotive, this will follow shipment in line with sell through, but we would like to accommodate a potential upside in the sell through with sufficient buffer. As Shibata said at the outset, in the third quarter, of course, there remains uncertainties with regards to tariff issues, and we expect some impact of that. In case risks materialize.\n\n**Moderator**\nAnd if there is going to be an upside, we would like to be in a position to accommodate with sufficient buffer. Therefore, for WOI, we expect a slight increase. But if there is a upturn in the end demand, of course, the amount as well as WOI would decrease as a result. As for the IIoT, the plan is to further expand our channel inventory, and this is to accommodate seasonality coming from the mobile among others. And as a result, WOI is expected to increase.\n\n**Moderator**\nPlease go on to the next page. This is on the utilization rates on the left hand side. This is the front end utilization rate based on wafer input. From the initial expectation in the second quarter, our utilization rate increased. It was mid-forty percent as originally expected, but the result was slightly below 50%.\n\n**Moderator**\nPartly, this is due to in relation to the power outages at the Naka factory and the recovery efforts in production. There was a temporary increase, but mostly this increase in utilization rate came from other factors. As for the third quarter, we expect a flat Q on Q. So from mid 40% to upper 40% is our expectation. As for the capital expenditures, the recent trend is that the capital expenditures are mostly for non production related.\n\n**Moderator**\nBut the second quarter, in addition to R and D, for increasing efficiency in the production equipment, there were some investments made. In the third quarter, mostly capital expenditures will increase mostly around R and D. Please go on to the next page. This is the third quarter forecast. Please refer to the dark blue column in the middle of the slide.\n\n**Moderator**\nThe midpoint revenue forecast, JPY $330,000,000,000 Gross margin, 56.5%. Operating margin, 27%. FX assumes 145 yen to the dollar and 169 yen to the euro. As for revenue forecast, I would like to give additional comments here. We expect year on year minus 4.4% plus 1.7% Q on Q for revenue.\n\n**Moderator**\nIf you look at two rows below, device sales excluding FX impact, we expect a plus 2% Q on Q. Furthermore, gross margin, our forecast is 56.5%. This is 0.3% decrease Q on Q. Overall, because of the weaker euro, this will have an upturn. But due to the mix with mobile increasing and also the cost increased in the second quarter, As a result, the gross margin is expected to slightly decrease.\n\n**Moderator**\nOP margin, 27%. We expect 130 basis points decrease Q on Q. This is mainly due to OpEx increases. On Q on Q basis, we expect 3,200,000,000.0 yen or so increase. 70% comes from R and D, 30% from SG and A.\n\n**Moderator**\nThis year, in the first half, OpEx had a slow start. We maintained low levels. And in the second half, we will gradually increase our OpEx spending. And for the appendix, I will also give some additional comments. Page 16, please.\n\n**Moderator**\nThis is a bridge from non GAAP to GAAP on an operating margin basis. Second from the right, nonrecurring items in the second quarter, there was JPY 16,300,000,000.0, a substantive amount. This includes restructuring related one off costs and suspension of SIC business. This is also a onetime cost and the provision for litigation costs as well as loss as a result of the power outages at a factory are all included here. In the next page, page 17, this is what I referred to at the beginning of my explanation, the results in a GAAP basis.\n\n**Moderator**\nThe impairment loss related to Wolfspeed is included here. As a result, a profit attributable to owners of parent was minus JPY201.3 billion. This concludes my explanation. Thank you.\n\n**Moderator**\nThank you very much. Now we'd like to move on to the Q and A session. First of all, I would like to explain how to raise your question. If you have any question, please press the raise hand button on the screen. From the order of the hands, we would like to call out the name of the company and your name.\n\n**Moderator**\nIf you are nominated by the MC, you are able to speak, so please unmute your microphone and begin your question. In the interest of time, we would like to limit the number of questions to two questions per one questioner. Now the first question. Goldman Sachs, Takayama san, please begin your question. Please unmute yourself and begin.\n\n**Moderator**\nTakayama san, we cannot hear your voice. Can you confirm your audio status? UNIDENTIFIED Takayama san, we cannot confirm that we have your audio feed. So please check your audio environment, and we would like to give you an opportunity for your question later. Now we would like to move on to the next questioner.\n\n**Moderator**\nBofA Securities, Hirakawa san, please begin your statement after unmuting yourself. Hirokawa from BOFA. I have two questions. First, as Mr. Shibata said at Delta said that the tariff was now set to be 15%.\n\n**Moderator**\nSo we have better visibility in that regard compared to before. In the realm of what you can see right now, after the fourth quarter into the second twenty twenty six, automotive and IIoT, what are the scenarios that you are foreseeing in that time frame? So that's my first question. Well, it's very difficult for me to foresee 2026 at this point time. Even the fourth quarter, still at this point, it's very difficult for us to foresee what is going to happen then.\n\n**Moderator**\nBut as an overall trend, we are expecting flattish or slight increase. Well, that is a modest forecast as we have right now. The vectors of the growth remains unchanged from the third quarter. I think nearly unchanged. Data center, AI related will be driving the growth, I believe.\n\n**Moderator**\nAs far as automotive is concerned, although the size is still very limited, but still in the fourth quarter, the fourth generation ADAS related SoC for automotive will come start to pick up. So I think that will be a positive development for us. And for the MCU in 2028, twenty eight nano, those were driven by China, but these will be expanded into Japan and Europe. So that is going to sustain the growth, I believe. But on the other hand, when it comes to the overall demand for automotive, we still have no clue as to how that will unfold.\n\n**Moderator**\nSo there will be both positives and negatives. And therefore, on a net net basis, we believe we will be happy if it's a slight increase compared to now. A follow-up question. Other companies compared to three years ago, they believe that they have a more cautious view on the market environment forecast. That's another that was a comment by your competitor.\n\n**Moderator**\nBut have you changed your forecast of out as for the market outlook compared to before? Well, as we have always been pointed out and criticized in many cases, but we always have a modest view or it doesn't mean that we have moderated our forecast compared to before. This is something that we have factored in from before. Okay. My second question.\n\n**Moderator**\nAt the Capital Market Day event in the June, you talked about the initiatives for competitive improvement, and you're going to run the R and D projects in order to raise your competitiveness. And therefore, the OP target OP margin target was changed from compared to before. So but also the company message also gave after that, you also talked about the time horizon. So what is your financial model that you're currently contemplating? It's getting us difficulty to see what is your current model.\n\n**Moderator**\nSo as of this point, compared to the message that you have given at the Capital Market Day, are there any changes or anything that you would like to add as a comment to what you said at the Capital Market Day? And so the OP margin, the target range was changed and also the two percentage point increase of OP margin, you're going to work on cost reduction this fiscal year. So then what is the net net results out of that? Can you if you can comment on those points? That would be appreciated.\n\n**Moderator**\nThe latter half will be explained by Shinkai san later after me. But for the former part of the question, there are no changes. These are things that's going to change so suddenly. But what are the issues for us? Although this was pointed out by some of the investors, but we cannot compare the compare performance of the company unless we use a constant foreign exchange, so JPY 110 to the dollar and JPY 120 to the euro.\n\n**Moderator**\nWe have been comparing our performance based on the current constant currency basis. And the numbers that we show on a quarterly basis is based on the actual foreign exchange rate, and therefore, the baseline is different. So that kind of explanation was insufficient. So that was pointed out by some of the investors. And therefore, if that is the case, then I want to you to deepen your understanding.\n\n**Moderator**\nSo that's one point. So in the recent years, 100 yen to the yeah. Dollar and 120 yen to the dollar. If that is the case, this is lower than 28%, so we would like to put it to somewhere in the range of 25% to 30% range. So that remains unchanged as a message that we have given you at the Capital Market Day.\n\n**Moderator**\nAnd this is something that we have to apologize. Mr. Shinkai mentioned back then regarding the R and D intensity, there was a simple miscalculation, so we would like to make that correction. Those are the two points that I would like to convey here. The total message remains unchanged, 25% to 30% range.\n\n**Moderator**\nThis range of margin, this is what we like to adhere to in our operations because in Japan, we often do this. But the emergency and the priority, when we look at things at those quadrants, then previously important but not urgent, those items had been postponed in many cases, and we're not really able to tackle them so much. So so important but not urgent, we have decided to steadily tackle these issues. So that is the main focus here. So especially when it comes to r and d, we have decided to focus more on the r side of r and d.\n\n**Moderator**\nThat is the reason why we have decided to take on this initiative. So but having said that, it's not going to be that we are going to recklessly make investments and we don't want to dilute the operating margin as a result of that. So if you look at the second quarter numbers and if you look at the guidance of the third quarter, you should be able to confirm. I think that would be the best way for best that it is best for you to confirm those numbers with the third, second and third quarter numbers. And Shinka san will follow-up.\n\n**Moderator**\nAs we've been talking about from the beginning of the year, the full year run rate, two percentage point of improvement of operating margin, that was of cost reduction is currently in progress, and we are making progress on track with our plan. And this two percentage point COGS and OpEx related initiatives, 1.5 percentage point is related to the OpEx run rate verification. So on a full year basis, this is currently in progress. And also for the run rate impact on the operating profit margin, there was a changing due to the accounting rules and also the change of depreciation period. Because of these impacts, three percentage point worth of cost reduction is currently in progress.\n\n**Moderator**\nBut this is only at the run rate basis. And for example, if you compare with last fiscal year, the year on year revenue impact is also kicking in here. And, also, there is also a onetime cost reduction. So that was caused a little bit of inflation. So in reaction to that, there is an increase.\n\n**Moderator**\nSo if you compare with this year versus last year at the current margin, it doesn't really seem to be visible. But again, on a run rate basis, the reduction is making good progress as planned. So that's all for myself. Thank you. Thank you.\n\n**Moderator**\nNext from UBS Securities, Yasee san. Please unmute and go ahead. Thank you. This is Yasee of UBS Securities. I have two questions.\n\n**Moderator**\nThe first, from April, June term, you talked about onetime costs. SGA, SGA, I think, seems to be bigger by $8,000,000,000 And also the power outages related costs, should they be considered onetime? In my calculation, a non GAAP basis, OP margin, I think, was above 31% according to my calculation. So how should we consider this? That's my first question.\n\n**Moderator**\nAnd my second question also relates to Hirakawa san's question. At the Capital Market Day, the way you communicated was what I would like to talk about. What was the message? Was the message that OP margin would decrease? I think that was how we understood your message.\n\n**Moderator**\nSo once again, we would like to clarify what the message is. The actual OP margin or the OP profitability compared to the target, since it is low, should we expect the increase? And by how many percentage points should we expect an increase in the profitability going forward? I would like to get specific numbers. Sorry for asking this in a roundabout way, but what are the assumptions?\n\n**Moderator**\nAnd how many percentage point increases should we expect in terms of profitability? First, regarding automotive, the onetime costs seem more concentrated for the automotive segment, and they are a onetime costs. Since these involve counterparties, I would not go into details. But for a prolonged period, this has been going on. Going back certain periods, the so called patent trolls initiated lawsuits.\n\n**Moderator**\nAnd then regarding these litigations, we would like to settle them finally. In order to do so, we allocated certain costs for bringing those losses to an end. And also, as Shinkai said, in mostly around SIC, we made capital expenditures and investments Without setting any timeline, we have made a decision to suspend this business. So this portion would be impaired, and that is why we refer to these as onetime costs. As for the Capital Day market, I did not understand the intention of behind your questions, but we introduced a lower end for the range, and that's precisely what we did.\n\n**Moderator**\nSo it is not that we will unilaterally lower the profitability, but rather than trying to increase, we would like to ensure there is flexibility in our management, Nothing more, nothing less. As for what the numbers would look like based on constant currencies, I would like to refer to Shinkai san for this part of the question. On a constant currency basis, our currency sensitivity for this year is as follows. Well, going forward, so I will first talk about the third quarter for revenue with JPY one change against the dollar, 1,700,000,000.0 on a operating margin basis, 700,000,000 in terms of euro, 200,000,000 yen against 1 yen OP margin, 100,000,000 yen sensitivity against 1 yen difference. So using these, if you calculate, you can see what the numbers would look like today on a constant currency basis or the exchange rates of 100 yen to the dollar, 120 yen to the euro.\n\n**Moderator**\nAs Shibata said, the 25% to 30% range, as we've been saying, currently, we are below the 25% level. Thank you very much. So when excluding those onetime factors, what would be the amount for the operating profit? Is it going to be 100,000,000,000 yen on the dot? When you say 100,000,000,000 yen, this is the company wide impact, I believe.\n\n**Moderator**\nNo. I'm talking about the second quarter 901 91,900,000,000.0. So would that be 100,000,000,000 with constant currency or excluding onetime factors? I would like to go back to the presentation materials, page five. If you look at the numbers on page five company wide, there are litigation related costs, as was mentioned, and also SIC, impairment loss costs.\n\n**Moderator**\nSo these are have been excluded from the company wide, numbers. They have been excluded. But for segment specific factors, they have been added to these segment specific numbers. So for automotive segment, if you look at this segment, operating margin is 23.4%. And q on q, it's 6.3 percentage decrease.\n\n**Moderator**\nThis minus 6.3%, mostly almost all of it comes from onetime factors. So excluding onetime factors, Q on Q, automotive would have been flat around 30%. So company wide impact will be neutral. I see. Sorry.\n\n**Moderator**\nI did not understand that point. Thank you. It's clear now. Thank you very much.\n\n**Moderator**\nThank you. Now moving on to the next question. The previous questioner who did not have a good audio condition. Goldman Sachs, Takayama san, please begin. Please unmute yourself and begin your question.\n\n**Moderator**\nSo sorry about that. Can you hear me now? Yes, we hear you. Two questions, if I may. But the first question, the third quarter revenue guidance, I just wanted you to give us some more breakdown about IIoT segment.\n\n**Moderator**\nThere are three segments. And the growth rate that you have in your current guidance, this 3% haircut you talked about, is this going to be applied across the board, including automotive? So can you give us some more color to that? And also, you mentioned that the automotive business is expected to be flattish. But I think with Japanese customers, I think the numbers are going to are you expecting a number increase, a volume increase among the Japanese customers?\n\n**Moderator**\nSo what is your view, Mr. Shibata, on that? So that's my first question. As of this point of time, there are both ups and downs. The situation is mixed.\n\n**Moderator**\nEven if it's the Japanese customer, the same Japanese customer, some customers are increasing, other customers are not increasing. So it's quite divided. On a net net basis, then a slight increase, I would say. So the big variance comes from China. On a Q on Q basis, if I talk about the Q on Q changes, China second quarter reactionary decrease in the third quarter will be most noteworthy or most conspicuous.\n\n**Moderator**\nEurope, from our viewpoint, remains weak. We don't really see any strong signs out of Europe. Japan is mixed. Some companies increasing, others decreasing. China, not really weak trend, but there is a reactionary decrease that is going to be quite remarkable in the third quarter.\n\n**Moderator**\nAnd then in Europe, we'll continue to be weak. That is the color that we see at the moment. And for the guidance, how we develop the guidance, the approach to developing guidance for the third quarter, if I give you some breakdowns of the elements, The data center if I talk about the data center first, we believe this is going to be firm, as I mentioned earlier. Mid teen percentage increase is what we project here for the data centers in the third quarter. Consumer mobile, when we blend them all together, only high single digit level growth.\n\n**Moderator**\nBut if you just talk about mobile in particular, high teen level of growth is what we are projecting right now. But then other than mobile segments, those growth are muted when it comes to consumer segments. So that's how we look at things. As for industrial, the core industrial automation related, As far as those demands are concerned, I think double digit growth can be expected as we see things right now. But again, this is just like the Chinese automotive.\n\n**Moderator**\nBut in China, the white appliances, home appliances in China, from the second quarter to the third quarter, we are expecting a reactionary decrease in the third quarter. So industrial overall, if you look at the entire industrial, we're not really sure. There are some growth in some other areas, but decrease in other areas. And therefore, we are expecting generally a flattish growth for industrial overall. So a haircut of around three percentage points, 3%, I said.\n\n**Moderator**\nSo we are seeing some solid growth in applications, data center, mobile. We have not applied a universal haircut there, just a rounding level haircut was applied there. But other than that, when it comes to particular sockets where there is a solid decrease or insufficiency in supply, Otherwise, other than those elements, we have applied a universal haircut in general, okay, including all. Okay, my second question, not really sure if I can ask this in an easy to understand way. But the other day during the Capital Market Day, you talked about reinforcing your capabilities for the mid to longer term.\n\n**Moderator**\nAnd I do understand that you are taking all these initiatives in order to for that direction, for that purpose. But investors are not really looking at things on a three year horizon, but I think they tried they are they have to live with the reality that they have to improve their capital gains in like six months range. And I think it's difficult to achieve both. So in that environment, I think software strategies will take time for you to materialize and deliver results. Given that in the one year, two year time frame, what do you want us to evaluate on you from an outsider's perspective?\n\n**Moderator**\nWhat is going to be the driver for you to raise your stock price? I'm sure you are thinking about that. So if you can, in terms of your communication with the stock market, how are you going to harmonize your views vis a vis the investors or the stock market? If you have any plans for the company in the next six months, one year period, what are the elements for us to evaluate the company? Or in your view, what will drive the growth of your stock price in the next six months time one year time frame?\n\n**Moderator**\nExactly. Capital Market Day, we have been setting this at Acadian so far once a year. So at the next Capital Market Day, we'll try to provide information that could specifically address your question. I will try to comment that and provide you communication in a very easy to understand way as much as possible, especially when it comes to software and digital. How should I put it?\n\n**Moderator**\nWe are looking at things quite aggressively. So we would like to translate them into matrix so that you can precisely understand what that means. But before that, like, in a six months, twelve months time frame, in within that time frame, this is not really about software digital. This is rather more about the the conventional semiconductor center topics, where I think will be key and that's more suitable for that growth. So we would like to continue to provide information on the extensions of what we have done so far.\n\n**Moderator**\nAnd right now, 15% tariff, I think, is a wonderful conclusion, but still uncertainty remains. That is true. So therefore, we have to move in line with the visibility enhancing in the total market and give you more visibility as to the semiconductor market. We'll try to respond to your request based on that approach. Thank you.\n\n**Moderator**\nSo correct me if I'm wrong, but in the next six months, twelve months, you'll talk more about the conventional things like semiconductor. And for IIoT, you'll try to raise revenues based on different product level. But for automotive, the 15% tariff, given that this conclusion, if this turns positive, now we are seeing slight signs of that, then therefore, the expectations are beginning to increase. And I think that is going to you're expecting those hopefully to be the driver of your stock price. Is that correct as your as my interpretation?\n\n**Moderator**\nYes, that's true. But also, as I said, the 28 nano MCU at last in other geographies than China, this is going to take off is expected to take off. Although the number is not going to increase significantly, but Gen four SoC also, we would like to also give you some more color on that product as well. Okay. Thank you very much for that.\n\n**Moderator**\nThank you very much. Next, from Nikanko Kyo Shimbun, Kobayashi san. Please unmute and ask your questions. Can you hear me? Yes.\n\n**Moderator**\nThank you. I'm Kobayashi from Nikon Kogyo. My first question is this, regarding utilization of your factories. In total, in 2025, you had a slight increase, I believe, for 12 inches, eight inches, but for six inches, it's below 40%. I think that's the level you're continuing to see with regards to the utilization rate.\n\n**Moderator**\nSo I would like to know more about the outlook, particularly for the six inches. Is it going to increase? That's a difficult question. It's not that we have a plan to launch new products for six inches, but so our approach is to maintain the utilization rate. Thank you.\n\n**Moderator**\nAnd my second question is this. I apologize for asking this every time, but for Corfu factory, are there any updates? In the previous Capital Day Market Day, you talked about 300 milli GaN and also power MOSFET. Future vision was presented to be used for these products for GaN. What is your timeline for the mass production I think it's it's going to be longer range. So what is the current utilization outlook? How are you going to use this plant for the time being? Well, I don't have any new information to share since last time. It's only been one month.\n\n**Moderator**\nNo big situational change has taken place in over a month. We've made a decision for the CapEx. So for MOSFET process, we will make sure that, the process will be launched. And I would say in a low single digit number of years, we hope that this will be fully launched. So currently, we are making preparations in a very steady manner.\n\n**Moderator**\nThat's all for me. I see. Thank you very much.\n\n**Moderator**\nMoving on to the next question. Okawa san from Daiwa Securities. Please unmute and begin your statement. Thank you very much for this opportunity. This is Oka from Daiwa Securities.\n\n**Moderator**\nMy first question regarding your gross margin, your approach thereof. In the third quarter, automotive and IoT, when you separate between the two, what is the gross margin you projection? The reason why I'm asking is because, of course, mobile is going to increase and the mix may deteriorate, but industrial and data center applications increasing in ADAS and automotive. If those increasing, I thought that the gross margin would improve. But if we can give a comment on that.\n\n**Moderator**\nAnd also the mid to longer term, during the IR day, you said that you're going to increase your gross margin and also the SG and A ratio would also increase. But as long as the gross margin is going to increase, I think you said that the profit margin would stay flat. But then the gross margin has not been revised upwards. So if you can comment on the reason behind that, then that can be explained by Shinkai san, all right? Yes.\n\n**Moderator**\nOver the medium term, the model for the medium term, if you can comment on that, gross margin is 55%, remains unchanged from the last presentation. So the reason for that is because the mix improvement will be there, but we are not expecting a significant change in the mix. And therefore, depending on how things unfold in the future, such as pricing and also the cost base, there are there could be variations there, changes there. So we'll try to offset them properly so that we can manage in a good way. So with that, that's the reason why we are expecting flattish growth for the gross margin.\n\n**Moderator**\nThe details pertaining to automotive and the changes between the mix between automotive and the industrial, there might be some short term changes. But if you even them out over a longer time horizon, the gross margin is not going to increase sharply given the current situation. So we are not foreseeing a significant increase in the gross margin at this point of time, but we are not expecting a decrease either. For this fiscal year, for example rather not this fiscal year, if you look at the second quarter third quarter gross margin trends, in the second quarter, if you look at the slide, there's a gross margin by segment. On a Q on Q, the changes are not that significant.\n\n**Moderator**\nAutomotive on 0.2 percentage point for IIoT, 0.8 percentage point. So that is the changes that we have been seeing. So we are not expecting a dynamic change from that level of changes. Thank you. My second question is about now that the autonomous driving increasing, you're expecting SoC to increase in this fiscal year.\n\n**Moderator**\nBut even the mid to long term, are you having tangible progress in terms of the order receipt for autonomous driving? Do you rather believe there's something needed such as R and D and reinforcement? So if you can talk about the autonomous driving related SoC or microprocessor units, order acquisition status over the mid to longer term? Well, this is not going to change significantly from what we had commented before. In this segment, in this area, we are not a dedicated automotive portfolio, mobile graphics, all these things we are not bringing automotive these things developed for mobile and graphics, bringing them to automotive because we are a dedicated automotive player in that regard. So looking at the entire customer as a target and building up things, that is not our direction because that does not make sense in terms of our strategic rationale. So since last year, we have made announcements that we are going to collaborate with a major Japanese OEM. Think I'm sure you have read that press release.\n\n**Moderator**\nSo we are going to meticulously build up those kind of projects going forward. That is the approach that is fit to our strategy. So that's what we are doing. So therefore, it's only six months since we made this comment or announcement, so we are not seeing a significant increase of these orders. So these things can increase only one to three or maybe one to two cases per one year, if that that kind of increase is going to be very matching with our strategy.\n\n**Moderator**\nSo that is what we are looking at right now. That is the level we are looking at. So if the next opportunity arrives, maybe sometime around the end of this year or maybe early next year, if those materializes, that will make us believe that we are in a favorable trend and a steady progress. Gen four, those are going to take off from here onwards. So for those products, fortunately, we have so far not been able to enter the Korean market in a significant way, but fortunately, we were able to make a foray into that market.\n\n**Moderator**\nSo for the next several years, not five, seven years, but in a shorter time frame, in a short term, we believe this is a very exciting opportunity for us. So we have high expectations there. So what I'm trying to say here is that we are doing okay, so so okay, I believe. So we cannot be too proud with this current level performance, but we are not facing dire situation either. So I think we really believe we are progressing so, so well.\n\n**Moderator**\nThat's about the SOC. When it comes to R and D, SoC consumes money. That's exactly correct. But not only that, as I mentioned earlier, important but not urgent, those kind of initiatives will have to be executed. So the design methodology drastically modernized implementing AI or as far as the research part, as you may be aware, SIC, have been a laggard.\n\n**Moderator**\nWe try to be enter that space as a laggard and the situation is what you have seen. So those things, those research that will lead us to future, we have to tackle them early on, earlier on. So based on that awareness, we have decided to reinforce our research activities. So that is currently being contemplated. So with respect to SOC, it is true that SOC requires a lot of money, but not only that.\n\n**Moderator**\nWe are a technology company, so we would like to brush up our technology, and we would like to spend the necessary investments for that. Again, at the sake at the risk of repeating myself, but important but not emergence not emergent, not urgent, pushing out to next year or the next half, we tend to fall into that that trap. But while we'll try but instead of that, we'll try to prioritize things and and tackle them one by one. Our operating cadence is about once a year, we develop an annual operating plan, and we decide on the theme of the year and make investments according to the theme. So on an annual basis, we run this cycle planning.\n\n**Moderator**\nAnd the model that we talked about the other day, all the themes that I'm talking about right now will be factored in in the plan for next fiscal year. That's already factored in the plan for next fiscal year. So if you ask me what we are doing right now, we are doing the on the only the things on the extensions that of what I mentioned the last time. But for next fiscal year, we are developing the multiyear plan that will continue from next fiscal year. Thank you. Thank you.\n\n**Moderator**\nIt is almost time to start wrapping up. So the next person will be the last person to ask questions. Yoshikawa san from Morgan Stanley Securities. Please unmute. Hi.\n\n**Moderator**\nThis is Yoshikawa from Morgan Stanley. Thank you for this opportunity. I have two questions. First, regarding automotive, based on what you've said so far, the idiosyncratic automotive driver will be 28 nano microcontroller unit. And although scale is small, you have ADAS SoC based on what you said.\n\n**Moderator**\nBut with regards to 28 nano MCU, for Japanese OEMs, certain models will have significant volume, and they will be making a shift to the new e architecture. And as a result, the overall MCU market, for example, content growth is expected for the next one to two years or two to three years. Do you think such improvement will be made? Will this have certain impact to result in such improvement? Or they might MCU growth will remain just as before.\n\n**Moderator**\nAnd as a result of that, your company for the next one to three years, the automotive revenue will grow at a higher pace than TAM? There are many uncertainties, I understand, and therefore difficult to make a prediction. But whether you will be able to outperform the market or not, I would like to get your views on this. And the second question is this. It's more on the short term horizon.\n\n**Moderator**\nAfter the acquisition of Altium, it's almost one year since the acquisition. So looking back the past one year, what would you say were the good things? What are some areas where you were lacking to some extent? And also, compared to before the acquisition, have you seen accelerated revenue growth? Or has it remained the same in the mid-ten percent range?\n\n**Moderator**\nWith respect to Altium, over the past one year, I would say not much has changed. This will be something we will cover again in next year's Capital Market Day. Of course, we target aggressive growth, and that's where we are shifting our focus. We are pivoting. And hopefully, next year, we will be able to share the progress of that.\n\n**Moderator**\nSo I think we hope to go in the direction of accelerating growth from now on. As for automotive, what will happen in one year or one to three years? All I can say is that we will do our best. For twenty eight nano, this will be, launched. This will take off.\n\n**Moderator**\nBut in reality, customers other than in China, how should I put it? Should I say migration, changing platforms, the speed with which they are changing platforms? China, is overwhelmingly fast. Other geographies, we have not seen much change, the same for Europe or The Americas. So I think, five years is is the the the the reality with which we are working with.\n\n**Moderator**\nWe will have, the ramp up, the the launch, and and this will have a positive impact, in an incremental manner. Of course, we would like to further accelerate. We are working hard in China as well. So our views remain the same. SAM, we will outpace the SAM growth, and we will make efforts to achieve that.\n\n**Moderator**\nBut what will happen one year from now or three years out, it's difficult to say unless we reach that time horizon to share more details with you. And this topic, in my mind, is basically the same as the my MCU share discussion. As we've said before, for twenty eight nano in the initial phase, we were quite rushed. We were overzealous, and I think that shows in the real share status. Going forward, we will launch products to be aligned with the marketplace.\n\n**Moderator**\nThat's something we've already shared with you. And for these to to fully take off, how much longer do we need, I believe, is going to be the answer to your question. I wouldn't say one year, but we are looking more in the period of two to three years. That's when we will start to see these fully take off. So I don't know.\n\n**Moderator**\nAll these things combined, if you allow us a three year time, then you will be able to see what I'm talking about today. I see. Thank you very much.\n\n**Moderator**\nThank you very much. With this, we would like to finish the Q and A session. Finally, we would like to close the meeting with the closing remarks from Mr. Shibata. So there's nothing new in particular as of today.\n\n**Moderator**\nSo in many different regards, we are in a very difficult situation, but the Japanese government have made a lot of efforts and achieved this great result. So we would like to pay respect to that. And also, although we are a very small private company, only a single private company, but now it's the parts that the private sector to exert effort. So we would like to give out our best and lead it So we continue to seek your support and collaboration.\n\n**Moderator**\nThank you very much for your participation today. With this, we would like to finish the twenty twenty five second quarter earnings call by RuneSAS Electronics. Thank you very much indeed for your participation today.",
      "fetched_at": "2026-02-04T15:53:50.671Z"
    },
    {
      "ticker": "6723.T",
      "title": "RENESAS ELECTRONICS CORP (6723.T) Q1 FY2025 earnings call transcript",
      "published_date": "Apr 24, 2025, 10:00 AM GMT+9",
      "fiscal_year": "2025",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/6723.T/earnings/6723.T-Q1-2025-earnings_call-313331.html",
      "content": "**Operator**\nA generation upgrade, I think, will progress.\n\n**Operator**\n[Foreign language] and for mobile.\n\n**Operator**\n[Foreign language] A modest upside.\n\n**Operator**\n[Foreign language] Could be expected.\n\n**Operator**\n[Foreign language] For auto, the 28 nano, I think, will be a setup outside of China. So for the second half.\n\n**Operator**\n[Foreign language] We had seen some positive news.\n\n**Operator**\n[Foreign language] Our expectation was getting elevated.\n\n**Operator**\n[Foreign language] Of course, at this point, we cannot foresee the exact impact of the tariff.\n\n**Operator**\n[Foreign language] Over the short-term.\n\n**Operator**\n[Foreign language] There could be some disruption.\n\n**Operator**\n[Foreign language] We do not want to be disrupted by that.\n\n**Operator**\n[Foreign language] Also, we position this year as the year of the change.\n\n**Operator**\n[Foreign language] Also, with the tariff situation.\n\n**Operator**\n[Foreign language] A lot of uncertainties were looming over the business.\n\n**Operator**\n[Foreign language] Also, auto。 [Foreign language] is something that we need to be ready for, so.\n\n**Operator**\n[Foreign language] We need to really focus on the medium to longer-term initiatives.\n\n**Operator**\n[Foreign language] From that perspective.\n\n**Operator**\n[Foreign language] especially.\n\n**Operator**\n[Foreign language] with the organic opportunities.\n\n**Operator**\n[Foreign language] We will focus on.\n\n**Operator**\n[Foreign language] Looking at the investment opportunities with a mid to long-term perspective, especially in such an environment that we stand today.\n\n**Operator**\n[Foreign language] Also, for Q1, we don't send the guidance for Q2. I would like to hand over to Mr. Shinkai, and he will give you the presentation on the numbers. Mr. Shinkai, please.\n\n**Operator**\n[Foreign language]\n\n**Shuhei Shinkai** (CFO)\nMr. Shinkai, the CFO.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] We'd like to quickly go over the course of the results based on the presentation material. Please turn to page four.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] For the Q1 results, please refer to the column in the middle with the dark blue color. The revenue was JPY 388 billion, and the gross margin was 56.7%. Operating profit was JPY 83.8 billion, PM was 27.1%. Planet profit was JPY 73.3 billion, EBITDA was JPY 103.5 billion, currency was JPY 154 against the dollar and JPY 161 against the euro. Compared to the forecast, and compared to the column at the far right, and one point that I would like to note is that, from revenue to gross revenue, the first line from that, oh, give us revenue, excludes the effects impact.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] To the forecast for, for forecast, we're expecting a 2% revenue growth, but the positive or negative was smaller. Also, Q on Q, it ended up as a 1.2% revenue growth.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] Next page, please.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] Regarding the revenue, gross margin, and operating margin.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] On the top right, we have a difference resulting from forecast. For the revenue, it was -0.1% vis-à-vis the midpoint forecast.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] The effects, impact was quite positive. Overall, effects were stronger yen against the forecast, but because the foreign currency demand made itself through, net-net was positive. Excluding the effects, it was small negative.\n\n**Shuhei Shinkai** (CFO)\nOkay.\n\n**Shuhei Shinkai** (CFO)\nSmall upside, but the device revenue was lower. For device revenue, excluding the effects, the forecast was given to +40%, where the actual was 1.0%.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] Increase, as I said earlier.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] For IIoT, compared to the forecast, it was positive, but for the auto, it was negative against the forecast. The reason is because we suppressed other shipments, so that the inventory will not increase too much. For IIoT, the digital power for AI and home appliances had some upside in the demand, so that led to a positive growth. For gross margin, it was +2.7%.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] The key factors are the production cost decrease, higher utilization, and better product mix. Production cost benefit was 70% of the benefit. There were multiple reasons. The production fixed cost savings was higher than planned.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] Specifically, the repair cost and the consumables cost.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] Were improved. We were able to enjoy the benefit of reducing those. For the power utility cost, we tried to consume less electricity, which also benefited on the cost side. The accounting impact was not fully incorporated. For the inventory right now, we were not able to foresee the rebound from that. There are also multiple cost improvements that led to the supposed growth. It is improved in the utilization rate increase. The database utilization rate was slightly higher than the plan, so that led to a better gross margin. For operating profit margin, compared to the forecast, it was better by 3.1%.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] The operating margin improved, and also compared to the plan, the cost reduction had a big benefit. For the redevelopment, delay on the R&D OpEx was lower.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] Q on Q, compared to the bottom left.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] For the revenue, excluding the effects, it was -0.9%, and device revenue was +1%. For gross margin, it was 1.9% of growth. Q on Q, the yen depreciated, and the utilization rate increased, those were the main reasons.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] For the Q on Q gross margin.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] I would like to make one additional comment regarding the depreciation cost. From fiscal year 2025, for the production of equipment and facilities.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] Without the change in the life cycle of the equipment, and also how we are using the equipment, we reassessed that, and to better reflect the reality, we revised the usable life. With that, the depreciation period was revised again. Also, previously, on average, the depreciation period was over five years, but this was extended to eight years. From Q1 onward, this will be implemented, and we will not reflect this in a retrospective manner. The impact is a reduction of depreciation cost by JPY 3.1 billion from this quarter. For the operating margin, OpEx increased Q on Q. We made efforts for cost control, but in Q4 of 2024, there was a one-off factor that led to cost reduction. Q on Q, the cost increased. By segment, for automotive, the operating margin, in the previous Q4, there was a one-off factor, which was the receiving the development cost.\n\n**Shuhei Shinkai** (CFO)\nA Q on Q basis, the operating margin went down for auto. For IIoT, there was a one-off factor in Q1. We put the reserve of the litigation fee. On Q on Q, compared to the revenue growth, the operating margin did not grow as much.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] The next page, please.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] This is showing quarterly revenue trends. Please refer to the column on the far right for the 1Q results. Overall, we had a decrease by 12.2% year on year and +5.5% Q on Q. However, exchange impact excluded, we had -16.8% year on year. You can see the breakdown by segment below. Please go to the next slide. These are showing financial numbers and their trend for your reference. Please go to the next slide. This is the inventory status. We have our own in-house inventory and sales channel inventory. Starting with the top right, this is showing the in-house inventory in first quarter Q on Q. Both actual amount and DOI both decreased. DOI was decreased by two days. For Daibank, we mainly received replenishment from the foundries for smartphones and AI servers, digital power.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] Daibanks were mainly replenished. On the other hand, the consumption of finished goods and also the appreciation of the yen at the end of the quarter resulted in a decrease in the actual amount. As for the second quarter, the production plans are expected to remain largely unchanged, and inventory levels are expected to remain roughly flat.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] We want to support short-term demand, so we don't want to limit inventory too much. This has been the policy, and we will continue with this policy. The bottom right is showing channel inventory. You can see in the first quarter, sales through was higher than expected, mainly due to IIoT, and overall channel inventory was reduced more than expected. Both actual amount and WOI decreased Q on Q. For automobile, mobiles, channel inventory decreased, but mainly for Japanese companies, sales through increased more than our expectations. As a result, WOI increased slightly. This goes back to what I said about reduced shipment when I explained about the revenues. As for IIoT, sales through increased from our expectation. As a result, channel inventory decreased steadily. In the second quarter, in the base case, we plan to reduce channel inventory for both automotive and IIoT.\n\n**Shuhei Shinkai** (CFO)\nThe intention here is to keep inventory lean due to the large uncertainties. As for the upside, we will cover upside from the in-house inventory. In order to assess the impact of tariffs, as Shibata mentioned at the outset, we are being rather conservative in our views, particularly on the sale-in side. We have been conservative. On the other hand, for the sales through, in the second quarter, we assume that sales through will be greater than sale-in, resulting in a decrease in channel inventory and WOI. However, there are still some uncertainties with respect to sales through. If the situation turns downside, both inventory and WOI will be higher than expected in the second quarter. Please go to the next slide. This is showing utilization rate and CapEx. On the left-hand side is the utilization rate.\n\n**Shuhei Shinkai** (CFO)\nIn the first quarter, we had a slight increase in the utilization rate from forecast. From the second quarter and beyond, we expect overall utilization rate to be flat from the first quarter. Depending on the factories, there may be increased production. However, some others are slightly reducing their utilization rates due to holidays. Overall, we expect the rates to be flat. As for the capital expenditures, we continue to see the same trend. We will have a lot of capital expenditures outside of production. From this fiscal year, we have been imposing stronger control over CapEx from the viewpoint of cost and cash management. In the next slide, this is the Q2 forecast. Please refer to the dark blue column in the middle. The midpoint forecast is JPY 302.0 billion, gross margin 55.0%, operating profit margin of 25%.\n\n**Shuhei Shinkai** (CFO)\nExchange rate assumption is JPY 142 to the dollar. This is a JPY 12 higher Q on Q and JPY 156 to the euro, which is JPY 5 Q1 increase from Q on Q. I'd like to give additional information, on the revenue. The midpoint forecast is JPY 302.0 billion. As you can see on the right-hand side, this is a -15.8% year on year and -2.2% Q on Q. This Q on Q - 2.2%.\n\n**Shuhei Shinkai** (CFO)\n[Foreign language] The breakdown to the device revenue, the appreciation of the yen, will be -7.0%. On the second line, you can see, increase by 4.8%, excluding exchange impact. On the other hand, Altium impact results in -0.5%. Device revenue, excluding the effects impact, is +5.3%, as you see on line three. This 5.3% increase Q on Q is broken down as follows. Automotive is a slight increase. On the other hand, IIoT mainly contributes to this +5.3% increase. As for the impact of Altium, +0.5%, this is due to a technical reason. In the first quarter, new sales recognition standards have been introduced. Because this shift took place midway through the first quarter, the timing, or rather the periods for which these new standards are applied, are longer in the second quarter than in the first quarter.\n\n**Shuhei Shinkai** (CFO)\nThis results in the revenue numbers. The gross margin of 55.0% is -175 basis points Q on Q. This is mainly due to exchange impact and increase in manufacturing costs, one third coming from the exchange impact and two thirds from the manufacturing costs. We have an increase in utilities, both in unit price and the usage volume, resulting in increased costs and also repair costs and project costs to optimize the production footprint. This contributes to the increase. We've continued our efforts to reduce costs, but looking at Q on Q numbers, operation-related cost increase and project-related cost increase were bigger than cost reduction. As for the 25% operating profit margin, this is a 215 basis points decrease Q on Q. Major reasons are the exchange impact and decrease in the gross profit margin. Also, we have factored in R&D expense increase.\n\n**Shuhei Shinkai** (CFO)\nThis is mainly SOC for automotive, generation 5, our car R&D increase contributes to the increase in R&D. For example, hiring more people in India and procurement. Overall cost increases. That is the forecast for 2Q. I would like to also provide an explanation on the appendix slides. Please go to page 16. This is the non-GAAP to GAAP reconciliation. Second from the right, the non-recurring items appear to be large. There is JPY 18.1 billion, and this is one-time costs related to structural reform, business sales, goodwill related, the right of RIF and other structural reform related costs, as well as provision for litigation costs are included in these one-time items. Please go to page 18. This is the highlight. Altium PMI, as part of this effort, although small in scale, Altium acquired a company called Part Analytics.\n\n**Shuhei Shinkai** (CFO)\nFor the divestiture of RF business, I talked about goodwill in relation to the sale of business and the fixed asset impairment. This comes from this divestiture of RF business and the embedded world. Renesas 365 has been launched. This concludes my explanation. Thank you very much.\n\n**Operator**\nThank you for the presentation. Now we'd like to go into join the session. Mr. Shibata, please turn on your camera. I will explain how you can ask your questions. Those of you who have questions, please use the raise hand button. We will call upon your name or your affiliation. When your name is called, you will be able to raise your question. Please unmute yourself and ask your question. Given the interest of time, we would like to limit the two questions per person. The first question is from Mr. Takayama from Goldman Sachs. Please unmute yourself and ask your question.\n\n**Daiki Takayama** (Research Analyst)\nYes, thank you very much. I have two questions. First, Mr. Shibata mentioned in his comment that there was some modest haircut to the guidance. What is the magnitude of that, and what exactly do you mean by that? I guess this will be subject to the tariff. What would be the direct impact and the indirect impact to your business? I would assume the direct impact will be small, but would the tariff mean less volume for you? To a certain extent, the supply chain sharing would be done through the tariff. Can you explain the actual impact of the tariff?\n\n**Hidetoshi Shibata** (CEO)\nYes. The psychological haircut is what I said in my comment. It's like a middle single digit percentage point haircut, I guess it's fair to say.\n\n**Hidetoshi Shibata** (CEO)\nFor our operation, we fix the currency, because otherwise it will make it difficult to manage the business. We fix the currency basis, we kind of round it down. There is no logic behind that. It is very emotional or psychological. Regarding the impact of the tariff, as you pointed out, the direct impact will not be that material. For indirect impact, of course, within the supply chain, there could be some share of burden, but more than that, I think the impact may be greater on the volume. It depends on the product, and depends on the future outlook. Generally speaking, if the product is priced at JPY 5 million and if the price spike is 25%, normally the volume will come down. I would expect the volume decline as the indirect impact of the tariff. To confirm, you mentioned round down.\n\n**Hidetoshi Shibata** (CEO)\nIn Q2, you may have had this level of expectation of revenue, and you reduced that outlook by a mid single digit percentage point. Is that right?\n\n**Daiki Takayama** (Research Analyst)\nYes, that is correct. Thank you. My second question is for IIoT. I want to understand the specific trends for different businesses. The AR5 Gen3, you are increasing your market share, and also the AI PMIC, and also mobile app size. I think those are the three key factors. From Q2, do you expect the trend to continue as you expected in Q1 as you look out into the second half, or are you seeing some signs of weakness? I will try not to mislead you, but this is about the second half, so from Q3 onward. It's really difficult to see the future, but at this point, to a certain extent, trying to foresee our business growth.\n\n**Daiki Takayama** (Research Analyst)\nWe do see some positive data. For example, in Q1, no, in Q4, compared to the earnings of Q4, if you ask, are we more optimistic or pessimistic?\n\n**Hidetoshi Shibata** (CEO)\nWe are slightly more optimistic. I'm repeating myself again, but due to the tariff, at this point, it's difficult to foresee the impact on the volume, so that factor needs to be discounted. Looking at the specific factors, in the second half, we do see some positive signs of trend.\n\n**Daiki Takayama** (Research Analyst)\nYou mentioned that from Q3 onward, but in your Q2 guidance, you mentioned about the expert really going up by roughly 5% in effect. You mentioned that it's mostly from IIoT or non-OT business. Is this upside coming from a different factor?\n\n**Hidetoshi Shibata** (CEO)\nYes, for Q2, the demand will not go up substantially by different factors, risk factors.\n\n**Hidetoshi Shibata** (CEO)\nAs I said earlier, in Q1, the channel inventory has been nearly fully corrected. With that, looking at the underlying demand, we will be shifting, reflecting the underlying demand. Our sell-in should grow to a certain extent and sell-through may be more stabilized, maybe just a slight pickup from the drop. That is how we see the trend. The end demand may be weak, but if you ask is it positive or negative, we see some positive growth. We are selling, because the inventory correction has been completed, sell-ins should grow.\n\n**Daiki Takayama** (Research Analyst)\nI see, thank you very much.\n\n**Daiki Takayama** (Research Analyst)\n[Foreign language]\n\n**Operator**\nThank you very much. Next, UBS Securities, Mr. Yasui, please go ahead. Please unmute yourself and ask your questions.\n\n**Kenji Yasui** (Co-Head of Research)\nThank you. This is Yasui from UBS. I have two questions. The first question, the negative factors seem to be abound.\n\n**Kenji Yasui** (Co-Head of Research)\nHaving said that, within the expectations of tariff impact, if you have any positive upside, for example, anything on the supply chain or for data centers, we are seeing significant changes. Perhaps you want to capture the data center demand ahead of others. At this time, is there any factors for you to think that demand may be stronger for some businesses? Do you foresee any positive factors at this time? That's my first question. The second question, the automotive impact, I believe, is something you mentioned. Companies that can be on the offensive now, taking the approach of wait and see. I would like to ask about the demand situation given that automotive demand is uncertain. Have you seen any differences in behavior amongst your customers? Are they more active in introducing new platforms?\n\n**Kenji Yasui** (Co-Head of Research)\nHave you seen any strategic change among your customers? Those are my questions. Thank you.\n\n**Hidetoshi Shibata** (CEO)\nRegarding your first question, needless to say, this is not something structural or sustained, but looking at the recent situation, for example, PC and home appliances, at least our expectation, perhaps 2Q will have a slight decrease from the first quarter. However, these are areas that will be maintained at relatively high levels. China's economic stimulus measures, the government giving out subsidies for replacement with new products, or because of the 90-day pause on tariffs, maybe companies want to make and sell products during this probationary period. I think there is a mix of both reasons.\n\n**Hidetoshi Shibata** (CEO)\nAreas closer to consumers, like the PC, consumer devices, and home appliances, these are the business areas that in the near-term may have an upside, maybe they will remain at a relatively higher level or even have an upside. That is the image. As for the automotive segment, towards the second half of the year, as I said in the beginning, there is a topic of Gen4 of our car, but this is small, but the launch of 28 nano MCU launch will be bigger. There are two reasons. The first one is that China clients, China customers continue to be quite robust, and they continue to adopt this into their new platforms for EV. We have the powertrains, and the component chips for the ADAS. We are seeing greater adoption in these areas.\n\n**Hidetoshi Shibata** (CEO)\nOf course, in the short-term, VV, PHV, which is better, there may be some ups and downs, but the momentum is there. We expect a strong and robust launch, mainly in China, in EV, ADAS, and powertrain. These are the possible areas. The other factor is Japan, Europe. These are the central regions. We are seeing Tier 1 customers and their platforms evolving their generations of their platforms. Partially, this will result in net increase and replacement from 40 nano. 28 nano will replace the 40 nano in increasing manner. The new platforms will be launched, and this gives us somewhat of a certainty. This is certainly a positive factor. Ultimately, the final demand, we are not sure. China's OEMs compare to them. There are greater uncertainties with respect to the demand.\n\n**Hidetoshi Shibata** (CEO)\nThose are largely the factors that I can share with you now.\n\n**Kenji Yasui** (Co-Head of Research)\nThank you very much. I have something to supplement regarding data centers. Data centers are certainly garnering attention. The BEV Auto Assembly, perhaps they are struggling a little bit. In relation to the supply, maybe this is lagging behind. Will this have any impact on the demand? Have you seen any increase or decrease?\n\n**Hidetoshi Shibata** (CEO)\nOur AI business, in terms of growth, has been strong, but it only accounts for less than 5% of the total company's revenues. Whether it is big enough to shift companies' posture, it is not. In terms of growth, we do expect growth to continue to be robust. The reasons I say this are because of course I will not go into individual customers or details, but business related to power, this is an endeavor. This is a difficult business.\n\n**Hidetoshi Shibata** (CEO)\nJust because a company is an established supplier, they will not be called upon and they will not be able to increase their sales. This is not how things go in this business. Given the situation, the generations that are currently being mass produced and the one next and the ones to be launched in the second half, in terms of the platforms that are expected, of course we are working on many trials, and so far we have been able to avoid any troubles. Two companies or three companies are now fighting over the power socket business or maybe segmenting. Overall, we are positioned relatively in a very strong position. Coming from the first quarter to the second quarter, we see steady growth. Furthermore, from the second quarter to third quarter and beyond, of course, these are future quarters.\n\n**Hidetoshi Shibata** (CEO)\nIt is perhaps better not to have any predictions or estimates in terms of figures, but we do expect steady growth. As Yasui-san has just now indicated, the troubles that you refer to, these small mishaps, whether they are headwinds or tailwinds for us, for us they are tailwinds. Thank you.\n\n**Kenji Yasui** (Co-Head of Research)\nThank you very much.\n\n**Kenji Yasui** (Co-Head of Research)\n[Foreign language]\n\n**Operator**\nNext question is from Mr. Hirakawa from BofA Securities. Please unmute yourself and ask your question.\n\n**Mikio Hirakawa** (Senior Equity Analyst)\nYes, thank you. This is Hirakawa from BofA. I have two questions. My first question is on cost. In the previous earnings call, operating profit, you said improving 2 percentage points by optimizing cost. Mr. Shinkai, you mentioned about the cost reduction as making good progress. At this point, how much cost savings in an uncertain environment can you achieve to reflect in the profit? What is your progress at the end of Q1? That's my first question.\n\n**Hidetoshi Shibata** (CEO)\nYes, I will ask Mr. Shinkai to take that question.\n\n**Shuhei Shinkai** (CFO)\nYes. Regarding the cost reduction plan and the progress, the plan, as we mentioned previously, for a year, we want to improve the operating margin by 2 percentage points. In today's earnings call, I mentioned that the impact of the change in the accounting policy, like changing the depreciation expenses, is not within that plan. Also, overall, if you include that, we should expect a 3 percentage point improvement approximately on the operating margin. Overall, the impact is more backward-ended by the end of the year. In Q1, Q2, the improvement may look modest. Some may actually not even be visible because it's very modest. The cost reduction program overall is progressing slightly above the plan.\n\n**Shuhei Shinkai** (CFO)\nIn the second half, we will continue to make efforts so that we can reap the benefit of the cost reduction program in the second half. I see.\n\n**Mikio Hirakawa** (Senior Equity Analyst)\nThank you very much. My second question is regarding Wolfspeed with which you put the JPY 2 billion as deposit. You may have to wrap up that deposit. That is a rumor in the market. You may have to engage in the turnaround of Wolfspeed, I think is a concern in the market. At this point, what is your behavior toward the Wolfspeed situation?\n\n**Hidetoshi Shibata** (CEO)\nTo add to Mr. Shinkai's previous comment before answering that question, the cost reduction effort is making steady progress. As Mr. Shinkai said, we are seeing good progress. As I said at the outset, we are also keen to make investments.\n\n**Hidetoshi Shibata** (CEO)\nThis is because of wake-up calls and the global economy separated into different blocks. Despite those noises, we ourselves and also many of the market were in a way dismissing that. I think with this recent event, many companies and countries have been awakened. It's not just ourselves. Like China, who benefited from being part of the supply chain, for China, this will be a bigger wake-up call. Also, how businesses run by the competitors and the clients may fundamentally change. Having said that, in order for us to survive and to be a company that's needed, that topic needs to be addressed with a mid-to-long-term perspective. In a way, utilizing the power of digital. We need to accelerate our investment because with automotive, we see some change in the market share of microcontrollers. Chinese players are really rapidly increasing their presence.\n\n**Hidetoshi Shibata** (CEO)\nAs a countermeasure, we would like to be active in investment. We will be looking at the operating margin. We will not just pursue improvement in operating margin and also have more focus and emphasis on investing for future opportunities. Switching to your next question about Wolfspeed, we are actually in the middle of dealing with that. At this point, there are not many things that I can talk about. One direction is early May, after the Golden Week, there will be the earnings announcement from Wolfspeed and the 10-Q submission. I think that will be one milestone for us. We will be looking at that and hoping that we can make some progress. We are currently working on this issue. In the next two weeks or so, this should make some progress.\n\n**Hidetoshi Shibata** (CEO)\nAlso, I hope to ask for your patience for another couple of weeks. Are we going to be involved in the management of Wolfspeed? At this point, my answer is no. With the lift perspective, the SiC demand and the EV takeoff, and also with the change in the geopolitical situation, I think a lot of things will be changing. Also, we are open to what we are going to do over the long run. At this point, we are not going to roll up our sleeves to deeply get involved in the turnaround of Wolfspeed. At this point, we have no intention of doing that.\n\n**Mikio Hirakawa** (Senior Equity Analyst)\nThank you very much for your answers.\n\n**Mikio Hirakawa** (Senior Equity Analyst)\n[Foreign language]\n\n**Operator**\nNext, Daiwa Securities, Mr. Okawa, please unmute and ask your questions.\n\n**Junji Okawa** (Analyst)\nThank you for today. I am Okawa from Daiwa Securities. I have two questions. The first one, IIoT segment.\n\n**Junji Okawa** (Analyst)\nThere may be some overlap, but the second quarter forecast, just IIoT, it's a 10% growth Q on Q. You have industry, infrastructure, and IoT. If you break down by these different areas, what are the growths respectively? Texas Instruments had an announcement this morning, and they were quite aggressive for the industrial business, but I didn't get that from this presentation. I was wondering if there are any differences. That's my first question. Thank you.\n\n**Junji Okawa** (Analyst)\n[Foreign language]\n\n**Hidetoshi Shibata** (CEO)\nThank you. Industry, this term is always difficult. What do we mean by industry? I think depending on the answer, we mean different things. Industry automation, factory automation, the so-called these things, the hardcore industrial, if we only look at that, I don't think this is going to have a very strong performance. The end demand is moderate.\n\n**Hidetoshi Shibata** (CEO)\nAs I said before, the inventory reduction is now completed. In terms of sell-in from us, we expect a growth in the second quarter. However, given the current situation, investments into factories are unlikely. There may be some semiconductor factories to be constructed in the U.S., but elsewhere, we cannot expect much. At least that's my thinking. In terms of industry, normally we may refer to energy, or in our case, we have home appliances, or we call them smart appliances. All these things may or may not be included. It depends on the categorizations, how you look at it. As I said before, sequentially Q on Q, there may be some ups and downs, but the underlying trend remains strong. Perhaps this area may also be impacted by China-related factors and some last-minute demand or rush demand.\n\n**Hidetoshi Shibata** (CEO)\nWhether these things continue in the second half or not, we have to be cautious in observing. At least for Q1 and Q2, we think that this remains quite robust. As a data point that I can share with you, MCU for non-automotive segments, this is mainly for industrial, and this is used in broad-based markets. For this business, looking at the current booking trends so far, it is very robust. In terms of the four product group segmentations, it is the strongest, actually, of the four. If TI is saying that this area is strong, then that's the same for us. We are strong. Given the current situations, it's unlikely that huge investments will be made into the industrial area. We should reserve a cautious view on this. Thank you very much.\n\n**Junji Okawa** (Analyst)\nThe second question regarding the software, the new platform between Renesas and Altium, what has been your views so far? What has been the reaction? Other companies are also making investments into the software area. Is there any area that you would like to strengthen going forward? Is there any area that is currently lacking? Is that why R&D expenses are going to increase?\n\n**Hidetoshi Shibata** (CEO)\nWe've only just showcased this. The full-scale launch will be next year. It is still early to talk about it. I think that at a glance, what you see on the screen and in videos, you may feel that there may be similar products out there. What is decisively different is that in the background, all the data is connected.\n\n**Hidetoshi Shibata** (CEO)\nIn the past, there have been similar things, similar products available, but interpreting data or data being connected to something else or the validation, the verification, all of these things were done manually by human. What we've showcased is that everything is connected, data is all linked, and everything is automated. That is the fundamental difference. At least technology-wise, the launch and the preparations have been going steadily. I myself am very much looking forward to the launch. The remaining challenge is what to be put on top of this. I call them ingredients. What devices, what solutions can be on board? This requires a substantial effort. We need to be on top of that to ensure success. The technology that goes into the platform, there's no doubt about it. I am very confident.\n\n**Hidetoshi Shibata** (CEO)\nWhat is to be placed on top of this platform is going to be a significant challenge for us. Okawa-san and others, I hope you will have a critical eye on this. What is lacking today? Largely, there are two things. Function-wise, some of the functions are already there. For PLM, product life cycle management, this is where we are still lacking. This is an area that needs to be addressed. Of course, we are working in an organic manner, but perhaps at some point in the future, bolt-on something like an acquisition may be necessary. There is nothing concrete that we are currently considering. This is something we have been talking about since before. We may need something in the future. Our platform is for the broad-based market for a broader audience.\n\n**Hidetoshi Shibata** (CEO)\nLast year, when we made the announcement back in February, we are going to reach a broader audience. That will not be sufficient. We also need to go after the enterprise segment customers. In order to attract them, we may need to come up with something to attract these customers. Maybe very sophisticated simulations or design capabilities may be required to do so. Are we going to acquire them through partnerships or through other means? This is another thing to consider. For now, we've just made this announcement of Renesas 365. Towards the launch next year, we will continue to thoroughly work on the implementation. That is our absolute priority.\n\n**Junji Okawa** (Analyst)\nThank you very much.\n\n**Junji Okawa** (Analyst)\n[Foreign language]\n\n**Operator**\nNext question, ask for Mr. Fujiwara from Citigroup Securities. Please unmute yourself and ask your question.\n\n**Takero Fujiwara** (Equity Analyst)\nHi, this is Fujiwara from Citigroup. I have two questions.\n\n**Takero Fujiwara** (Equity Analyst)\nMy first question is for the up-to-business. We are starting to see some implementation of the tariff and including ourselves. The impact on that tariff, how is the budget going to be shared within the supply chain? What is your view, Mr. Shibata, on that point?\n\n**Takero Fujiwara** (Equity Analyst)\n[Foreign language] Over the short run? Toyota was saying that they will try to make sure that the tariff burden will not go to the component suppliers. The prices can be raised, so Toyota will not be able to bear the burden of that tariff forever. How is the burden going to be shared within the supply chain?\n\n**Hidetoshi Shibata** (CEO)\nFrom that point, that's a very difficult question to answer. I'm hoping that the impact will not be material. In reality, the reason could be the tariff or the demand, but at the end of the day.\n\n**Hidetoshi Shibata** (CEO)\nWhat is going to be the strong factor in price setting is the competitive landscape of the suppliers. Also, someone said, \"I will take the tariff burden, and we will lower the price.\" That is going to be the biggest determining factor. Also, with the tariff, the demand and the volume upload is uncertain. If there is impact on the ASP, then the situation is going to be very challenging. Also, in a good way, we will try to get the understanding of the client to overcome this. That is about all I can say at this point.\n\n**Takero Fujiwara** (Equity Analyst)\nI see. My second question is a little bit more short-term sighted. Looking at the inventory level, the in-house inventory is now close to your target level. I think that has been the case for two consecutive quarters.\n\n**Takero Fujiwara** (Equity Analyst)\nAlso, with uncertainty still being over the demand, the in-house inventory, do you consider to lower the in-house inventory further? Also, for your Kofu factory, can you give us the update on your Kofu plant?\n\n**Takero Fujiwara** (Equity Analyst)\n[Foreign language]\n\n**Hidetoshi Shibata** (CEO)\nRegarding the in-house inventory.\n\n**Hidetoshi Shibata** (CEO)\n[Foreign language] Compared to a few years ago.\n\n**Hidetoshi Shibata** (CEO)\n[Foreign language] We should not be proud about this. We have been able to all manage the inventory. At this point, we do not feel the need to make changes here. If I were to point out some needs for change, if the global demand shrinks significantly, then that will mean that the supply will spike. Also, we will try to manage that and control that. We will take countermeasures. As we have seen in the peers' results today, and they have been saying that, also, like that, we have a lot of short-term lead time orders.\n\n**Hidetoshi Shibata** (CEO)\nWe do not want to lose this opportunity. We will have some robust level of dive-out. When there is an immediate request, we will be able to cater to that. At this point, we do not want to reduce the OI from this level. For the Kofu plant, the demand is very uncertain. We have not set any deadline and are maintaining a very extreme conservative view that remains unchanged.\n\n**Takero Fujiwara** (Equity Analyst)\nI say thank you very much. I have a follow-up question regarding the Kofu plant. Also, you have taken a pause in taking up the operation. Are there any impairment risks on Kofu?\n\n**Hidetoshi Shibata** (CEO)\nAt this point, for the Kofu plant, we have not decided to downsize permanently or decided not to start the operation. Also, looking out into the future, the power demand will definitely grow.\n\n**Hidetoshi Shibata** (CEO)\nAlso, for the products that need to be manufactured in Kofu, not just over the short-term, but over the next few years, we are working on the development. I think the biggest uncertainty is how long is this pause going to last. In the future, we continue to maintain the view of operating on this plant. At this point, we do not feel the need to make a big impairment.\n\n**Takero Fujiwara** (Equity Analyst)\nI say thank you very much.\n\n**Takero Fujiwara** (Equity Analyst)\n[Foreign language]\n\n**Operator**\nThank you very much. We are almost at time to wrap up. This concludes the Q&A session. Lastly, Shibata will give some remarks. Mr. Shibata, please.\n\n**Hidetoshi Shibata** (CEO)\nCertainly, things are uncertain. How to respond to these uncertainties is different among companies, industries, client industries. Situations vary depending on who you are.\n\n**Hidetoshi Shibata** (CEO)\nGiven these circumstances, we are being a bit more conservative than usual given the recent developments. What is more important, I believe this is a wake-up call. Taking this as a trigger, something we have thought about. Going forward, we will be more grounded and focused on improving our long-term competitiveness. That should be our focus. Situations change rapidly. As we have done before, if needed, we will communicate to you and share information with the relevant stakeholders. We ask for your continued dialogue with us. Thank you very much.\n\n**Hidetoshi Shibata** (CEO)\n[Foreign language]\n\n**Operator**\nThis concludes Renesas Electronics' 2025 first quarter earnings call. Thank you very much for joining us today.",
      "fetched_at": "2026-02-04T15:53:54.798Z"
    }
  ]
}