{
  "ticker": "6758.T",
  "last_updated": "2026-02-04T15:55:04.134Z",
  "total_transcripts": 5,
  "transcripts": [
    {
      "ticker": "6758.T",
      "title": "SONY GROUP CORPORATION (6758.T) Q2 FY2026 earnings call transcript",
      "published_date": "Nov 11, 2025, 4:00 PM GMT+9",
      "fiscal_year": "2026",
      "quarter": "Q2",
      "url": "https://finance.yahoo.com/quote/6758.T/earnings/6758.T-Q2-2026-earnings_call-347200.html",
      "content": "**Operator**\nSince it is time, we would like to start the Sony Group Corporation's FY 2025 Q2 Consolidated Financial Results Presentation. This is Ishii from PR. I will be the emcee. Today we will present the FY 2025 Q2 financial results, as well as the full-year forecast from Lin Tao, the CFO, Corporate Executive Officer. We will have questions and answers after that. The total time will be 70 minutes. Lin Tao's financial results will be presented in English based on the pre-recorded video, which will be streamed.\n\n**Lin Tao** (CFO)\nHello everyone. Today I will explain the content shown here. Sales of continuing operations for the quarter increased 5% compared to the same quarter of the previous fiscal year to JPY 3,107.9 billion, and operating income increased 10% to JPY 429 billion. Both were record highs for the second quarter. Net income increased 7% to JPY 311.4 billion. The financial results by segment are shown here. As for our full-year result forecast, we upwardly revised sales from our previous forecast 3% to JPY 12 trillion, operating income 8% to JPY 1 trillion 430 billion, and net income 8% to JPY 1 trillion 50 billion. We expect that the impact of additional U.S. tariffs on the operating income of our continuing operations to decrease JPY 20 billion from our previous forecast to JPY 50 billion, and we have reflected that impact in the forecast for each segment from this quarter.\n\n**Lin Tao** (CFO)\nWe upwardly revised our forecast for operating cash flow 18% to JPY 1.5 trillion. The forecast for each segment is shown here. Now I will turn to an overview of each business. First is the GNNS segment. Fiscal year 2025 Q2 sales increased 4% year on year, primarily due to the growth of network service revenue and the software sales. Despite the impact of the increase in sales, operating income decreased 13% year on year. This was primarily due to the recording of approximately JPY 49.8 billion in non-recurring losses resulting from an impairment of intangible and other assets and the correction in the amount of previously capitalized development costs. Excluding these non-recurring items, operating income would have increased 23%. We upwardly revised our sales forecast 3% from the previous forecast to JPY 4.47 trillion. This is primarily due to the impact of foreign exchange rates.\n\n**Lin Tao** (CFO)\nDespite the negative impact of the non-recurring items and the inclusion of a JPY 30 billion tariff impact that we are recording from this quarter, our JPY 500 billion operating income forecast is unchanged from the previous forecast. This is primarily due to the positive impact of foreign exchange rates. Our PlayStation platform continues to demonstrate its strength as the best place to play and best place to publish. User engagement trended well with the number of monthly active users across all of the PS in September increasing 3% compared to the last September, 219 million accounts, and total playtime for the quarter also increased 1% year on year. Game software and network service sales are steadily growing. We expect this trend to continue in the second half due to a continued shift to higher tiers in our network service business and the contribution of first-party titles.\n\n**Lin Tao** (CFO)\nAs for PS5 hardware, we plan to expand the install base during the year-end sales season while continuing to balance that expansion with the profitability of the entire segment. Although performance varies by title, our live service game overall accounted for more than 40% of our first-party software revenue, similar to the previous quarter, and are a recurring source of revenue. Regarding Destiny 2, partially due to the changes in the competitive environment, the level of sales and user engagement have not reached the expectation we had at the time of the acquisition of Bungie. While we will continue to make improvements, we downwardly revised the business projection for the time being and recorded an impairment loss against a portion of the assets at Bungie.\n\n**Lin Tao** (CFO)\nOn the other hand, Helldivers 2, which was also released for Xbox in August of this year, is doing extremely well, not only attracting new users on Xbox but also seeing increased engagement from existing users on PS5 and PC. This resulted in a significant increase in sales of the title year on year. MLB The Show 25, released in March, also continued to perform well during the quarter. In the single-player AAA title space, following the release of Death Stranding 2: On the Beach in June, we released Ghost of Yotei in October. Ghost of Yotei surpassed 3.3 million units sold globally as of November 2, becoming a major hit like its predecessor. Building on this recent progress, we aim to strengthen our studio business and expand our IP franchises through continuous learning and improvement. Next is the music segment.\n\n**Lin Tao** (CFO)\nFY 2025 Q2 sales increased 21% year on year, and operating income increased 28%, reaching record highs for the second quarter. This was primarily due to a higher visual media and platform revenue driven primarily by the success of the theatrical release of Demon Slayer: Kimetsu no Yaiba - Infinity Castle. It was also due to an increase in streaming revenue. On a U.S. dollar basis, streaming revenue for the quarter increased 12% year on year in recorded music and 25% in music publishing. We have upwardly revised our full-year forecast for sales 6% to JPY 1 trillion 980 billion compared to the previous forecast and operating income 7% to JPY 385 billion. During the quarter, SMEJ made great strides, recording its highest-ever quarterly sales and operating income and contributing significantly to the growth of this segment.\n\n**Lin Tao** (CFO)\nDemon Slayer, produced by Aniplex, became a global hit due to our collaboration with Toho for distribution in Japan, as well as the strengthening and expanding of distribution overseas by Crunchyroll and Sony Pictures. As of October 13, 77.53 million people worldwide, including in Japan, have seen the movie, and the total box office revenue has exceeded JPY 94.8 billion. Cocoa has enjoyed a long run in theaters in Japan and has captivated a large audience, being selected as Japan's entry to the 98th Academy Awards in the Best International Feature Film category. The successes of Demon Slayer and Cocoa are examples of how we can increase the value of IP by discovering appealing IP and combining them with the production capability of talented creators. We look forward to attracting not only fans but also many creators and actors.\n\n**Lin Tao** (CFO)\nIn recorded music, Ari Sout and Jendo by Kenichiro Yonezu, an artist affiliated with SMEJ, have been breaking records on music charts both in Japan and overseas, thanks to synergy with the theatrical release of the anime Chainsaw Man: The Movie - Reze Arc. Outside of Japan, SMG is also achieving very strong results. The global success of artists and songwriters such as Tyler, the Creator, and Bad Bunny has led to a double-digit increase year on year of sales and operating income for the quarter. In addition, SMG is further enhancing its relationship with DSPs. It entered into licensing agreements with Spotify during the quarter, and in collaboration with several other record labels, agreed to support Spotify's efforts to ensure that AI is used in a manner that will benefit artists and songwriters. Next is the picture segment.\n\n**Lin Tao** (CFO)\nFY 2025 Q2 sales decreased 3% year on year, and operating income decreased 25%. This was primarily due to the impact of a decrease in sales from theatrical release, which benefited from hits like It Ends With Us in the same quarter of the previous fiscal year. Partially offsetting the decrease in operating income was the impact of higher sales at Crunchyroll. There is no change to our full-year forecast for sales and operating income. Crunchyroll continues to work to enhance the 360-degree IP experience of anime fans through the theatrical distribution of Demon Slayer, the launch of Crunchyroll Manga Service, and other efforts. Crunchyroll Manga, which currently digitally distributes hundreds of popular Japanese manga titles, has been positively received by fans and publishers since its launch in October. We expect it will contribute to an increase in fan engagement and grow in subscribers.\n\n**Lin Tao** (CFO)\nIn television productions, new seasons of popular existing series were released this quarter, such as Doc, Gen V, and Twisted Metal. In motion pictures, production has begun on the major title Spider-Man: Brand New Day and The Next Jumanji, which are scheduled to be released next fiscal year. Fans are eagerly awaiting the two titles, with five years having passed since the previous Spider-Man film Spider-Man: No Way Home, and seven years have passed since the previous Jumanji film Jumanji: The Next Level. Next is the ET&S segment. FY 2025 Q2 sales decreased 7% year on year, primarily due to a decrease in unit sales of TVs. Operating income decreased 13% year on year, primarily due to the impact of the decrease in sales, partially offset by reductions in operating expenses.\n\n**Lin Tao** (CFO)\nWe have slightly increased our full-year forecast for sales from the previous forecast to JPY 2 trillion 300 billion, and we have decreased our operating income forecast 11% to JPY 160 billion, reflecting a JPY 20 billion impact from tariffs from this quarter. In the imaging markets, demand has slowed in two regions: China, where government subsidies that last through the first quarter ended June 30 significantly declined, and the U.S., primarily due to the impact of additional tariffs. However, this decrease in demand is essentially in line with our previous forecast, and global demand remains solid, primarily because of Asia. The severe operating environment for TVs and smartphones continues, but we are adapting by proactively reducing operating expenses and have been able to minimize the impact on profitability.\n\n**Lin Tao** (CFO)\nAt the segment level, there are no major changes to the demand outlook for the year-end sales season and second half of the fiscal year. We plan to continue to control costs and inventory and operate our business cautiously. In our sports business, which is a growth area, we completed the acquisition of Stats Perform in October. Stats Perform excels in active tracking technology, which collects and analyzes real-time data on athletes' physical condition and performance during games. By combining this data with the optical tracking technology of Hawk-Eye and KinaTrax, we aim to provide industry-leading sports data solutions to teams and athletes around the world. We also hope to accelerate the growth of our sports business overall. Last is the INSS segment. Sales for the quarter increased 15% year on year, and operating income increased 50%, both reaching record quarterly highs for the segment.\n\n**Lin Tao** (CFO)\nThis was primarily due to higher unit prices resulting from larger-sized sensors for mobile devices and increased sales volume of sensors for consumer cameras. We upwardly revised our full-year forecast for sales 2% to JPY 1.990 trillion and operating income 11% to JPY 310 billion, primarily due to the impact of foreign exchange rates. Based on the trends in the final product market and the demand forecasts from our customers to date, we have decided not to include any impact from tariffs in this forecast for this segment. The smartphone market continued to show signs of gradual recovery on the global basis. Sales of mobile sensors during the quarter increased significantly year on year due to higher unit prices resulting from larger sensors being used in new products by our major customers and a higher shipment volume than our previous forecast.\n\n**Lin Tao** (CFO)\nIn addition, growth of the market for cameras that use new video shooting styles such as handhelds contributed to the growth in sales. Our customers might have brought forward the purchase of components during the first half of the fiscal year due to the additional tariffs and other factors. Therefore, we have kept our fiscal year sales forecast unchanged from the previous forecast when the impact of foreign exchange rate is excluded. We expect sales for the fiscal year to increase an already significant 11% from the previous fiscal year. During the third quarter ending December 31, 2025, we plan to carefully assess the possibility of another upward revision. The higher sales of image sensors and our fixed cost management through an accelerated review of low-profit business and a shift of resources and costs to priority areas are contributing significantly to profit growth this fiscal year.\n\n**Lin Tao** (CFO)\nDuring this mid-range plan period, we intend to continue to focus on improving the efficiency of business operations and product development. In the next mid-range plan period, we aim to build on those efforts by continuing to work to improve the profitability of the business by considering measures that balance business expansion with improved efficiency of capital expenditure. To summarize, excluding non-recurring items, the GNNS, music, and INSS segment all achieved record-high operating income during the quarter, and we believe that our business momentum is strong. Looking ahead to the second half of the fiscal year, given the uncertain business environment, we intend to continue to operate our business cautiously while striving to steadily achieve results.\n\n**Lin Tao** (CFO)\nThe upwardly revised operating income forecast for this fiscal year presented today projects an average annual growth rate of operating income of 18% compared to the final year of our fourth mid-range plan, an accumulative operating income margin for the fifth mid-range plan to date of 11.3%. This demonstrates that we are making steady progress toward achieving the targets of our fifth mid-range plan. As for shareholder return, we established today a share repurchase facility of a maximum of JPY 100 billion to be executed by May 2026, and we successfully completed the partial spinoff of the financial service business on October 1. We would like to reiterate our sincere gratitude to our shareholders and investors. This concludes my remarks. Thank you.\n\n**Operator**\nThat was a presentation from Lin Tao. From 4:25 P.M., we will accept questions from the media, and from 4:50 P.M., we will accept questions from investors and analysts.The time allocated for questions and answers is 20 minutes each. Those of you who have registered your questions beforehand, please click the link which says \"Participate in Webinar.\" As for the instructions on how to ask questions, please refer to the information that was sent to you beforehand. We will break for a while. We are about to start the Q&A session for the media. You are kindly requested to wait for a few more minutes. Thank you for waiting. Let's start the Q&A session. To answer your questions, we have on the podium Lin Tao, CFO, Corporate Executive Officer, Hirotoshi Korenaga, Senior Vice President in Charge of Accounting, Naoya Horii, Senior Vice President in Charge of Corporate Planning and Control, Disc Manufacturing Business, and Storage Media Business. Now we would take questions from ladies and gentlemen of the media.\n\n**Operator**\nPlease be reminded that each one may ask up to two questions. To ask questions, please click the raise hand button on the Webex screen. The first one is from NHK, Mr. Taruno or Ms. Taruno, please. Can you hear me? Yes, we can hear you. Thank you. I have two questions. You have just explained the results this time in and out of Japan. What about the market conditions as you see it, including the consumer behaviors and activities? That is my first question. The second is that Demon Slayer or Kokuhou have become such a big hit. There is a music and pictures related content business. How are you going to grow these content-related businesses, and what kind of initiatives are you going to continue? Thank you for your questions. First, about the market conditions and the business sentiment in and out of Japan.\n\n**Operator**\nFor Japan and the U.S., it seems that there's some stability. Quite recently, however, we are doing business globally, and the U.S. economy is something that we focus on. In the latter half, towards the latter half of the year, it seems that there's signs of slowing down in the U.S. economy in terms of inflation. The inflation rate is going up, and the job applicant ratio is coming down. Statistics, because of the closure of the government services, we do not have much data, but it seems to me there's a lack of transparency or certainty. Towards the latter half of this year, we are being cautious and trying to be conservative in our business operation. About your second question, Demon Slayer and Kokuhou.\n\n**Lin Tao** (CFO)\nThanks to your patronage in Japan and outside Japan, they have become such a big hit and then that they contributed a big positive impact on our business. Going forward, as content IP, we will continue to adapt the titles to the films and motion pictures, and then partnering with the distributors both in Japan, we would like to grow this business. Not only Demon Slayers, but especially in Hollywood, the box office revenue, very high box office revenue was achieved, and I think culturally this gives us a big power. Japanese content, make it successful in Hollywood going forward, is good not only for Sony but for content publishers of Japan as a whole. Going forward, in addition to the deployment of IPs, 360 degrees utilizations and LPs, merchandising, we will make an effort to expand this. Thank you very much.\n\n**Lin Tao** (CFO)\nWe would take the next question. Yoshida-san from Nikkei. This is Yoshida from Nikkei. I hope you can hear me. Yes, we can hear you. I do have two questions. The first one is as follows: the live service in game business and the development status of Marathon and whether you wish to launch it this year. Have you made any changes to the plan? That's the first question. Also, looking at the actual performance of add-on service from July and in September, you recorded the underperformance for the first time in 13 quarters, and this might have been attributable to the delay in the live service or new title releases. That's the first question. Second question, you said that Demon Slayer has a really culturally significant impact. What is the reason in your view that these titles are exceeding your expectation in terms of performance?\n\n**Lin Tao** (CFO)\nThank you very much for your question. The first question, with regards to the development of Marathon, is we are still working on it. From October 22 and then 28 for a week, there was a technical test that involved 80,000 people. As a result, the gameplay and then retention, those are the key KPIs that we tested on. We are in the process of analyzing the performance against those KPIs. As needed, we will make corrections. We are fully dedicated to launching the title as scheduled. Yes, we assume that we will launch this within this year, and that is included in the forecast. With regards to add-on, compared to last fiscal year, there has been a reduction, as you mentioned.\n\n**Lin Tao** (CFO)\nWith regard to add-on, and then whether it is add-on or full game, it really depends on the most popular titles, most played by the gamers and users. We do not believe that this represents a reduction or slowdown. As we gear up for the year-end sales season, and we have launched new titles, I hope that the performance will be even strengthened. The second question, Demon Slayer app side and the reason for it. First, as a content business, or thinking about the nature of the content business, it is really difficult to accurately predict the performance. The previous title was really successful during the pandemic. At the time of the launch, we had a lot of confidence. However, this title exceeded the expectation, and this could be attributable to the great performance in the overseas market in Hollywood.\n\n**Lin Tao** (CFO)\nWe generated top grossing revenue, and that was unprecedented. From that perspective, we were able to deliver performance that was unexpected. Thank you.\n\n**Operator**\nLet's go to the next question. From Toyo Keizai, Umegaki-san. Umegaki from Toyo Keizai, thank you. I have two questions. The first question is about the music segment. JPY 25 million, I think, was the upward revision that you made in operating income. I wonder how much of the contribution was from the Demon Slayer. I understood that it was already reflected in the forecast, but in the visual media platform, it was like JPY 200 billion revenue. What kind of contribution did this upside impact make? The next is on pictures. The JPY 250 billion was the operating income. I believe that in the first half, you had a little bit of a difficulty.\n\n**Operator**\nThe TV production, I understand, is kind of going down. You mentioned about the sequels, but I'm wondering what the sequels, how the sequels will be contributing. Those are the two questions. Thank you very much for the questions. In music, in the music segment, the upward revision was the JPY 25 billion upward revision that we meant. The contributions were from Demon Slayer and Kokuhou and the streaming music. Kokuhou and Demon Slayer together, they contributed about 50% of the upside impact. As for the pictures, the full year forecast for the first half, the picture segment, the nature of the picture segment tends to have this launch in the latter half rather than in the first half. Please understand that this is a seasonal impact. TV production and movie production, structurally, we are seeing the depressed business of the industry.\n\n**Operator**\nHow can we control the cost and produce projects or items that will be very successful? As for the pictures segment, Crunchyroll is one of the driving forces for growth. The subscribers, as well as the sales, have both increased since the previous year. In the pictures segment, Crunchyroll will be focusing on that in order to grow the business. Thank you. Let us proceed to the next question. From Yomiuri Newspaper, Nakayama-san, please. Thank you. My name is Nakayama of Yomiuri Newspaper. Thank you for the opportunity. I have two questions, if I may. One, a very detailed question. As you have just said, in the music, the operating incomes, half of the upside comes from Demon Slayer and Kokuhou. If you could give me a breakdown between Demon Slayer and Kokuhou, I would appreciate it. Second, about the impact of tariff, JPY 50 billion.\n\n**Operator**\nLast time, you talked about the utilization of the strategic inventory. What would be the background of this JPY 20 billion worth of decline? Now, about the breakdown for each individual title, may I refrain from making comments on the breakdown of each title? About the tariffs impact, Horii will answer. Thank you for your question. As you rightly pointed out, the impact of the tariff used to be JPY 70 billion. Now it is JPY 50 billion. That is a JPY 20 billion worth of decline. In the I&SS segment, the impact of the tariff in the previous time, we incorporated that to a certain extent in the I&SS segment. If you look at the final products market and the orders received from the customers, we look at these factors.\n\n**Operator**\nAnd then this time, in this particular segment, we do not see any further need of incorporating the impact of the tariff in this. We excluded that. The 20 billion decline comes mainly from I&SS segment. Thank you.\n\n**Operator**\nWe are running short on time. The next person will be the last questioner. Narisawa-san from Asahi Shimbun. Narisawa-san, can you hear us? Can you hear me? Yes, we can hear you. Sorry about that. This is Narisawa from Asahi. I have a question about game segment. PlayStation 5, celebrating a sixth anniversary since 2020. This year, the performance is quite good. You are looking to expand the install base. Can you talk a little bit about the future strategy? Thank you very much. This year, we are in year six since the launch.\n\n**Operator**\nPS5 has been growing in its install base. Our view is that, compared to conventional console life cycles, and looking at the PS4 life cycle, it seems to be getting longer and longer. Especially the PS4, which was launched in 2013, and it's been over a decade since then. There are many active users enjoying the console, and they are enjoying the other consoles. From that perspective, we believe that the PS5 is only in the middle of the journey. We are really planning to expand it even further. As for the year-end sales season, and thinking about the customer lifetime value, and also thinking about the profitability, we want to promote so that we will expand the install base.\n\n**Operator**\nAs for the future launches and successors, we are not in a position to make any comments about that. That is all we have. This concludes the Q&A session for the media. The Q&A session for the investors and analysts will commence at 4:40 P.M. We will soon begin the Q&A session for investors and analysts. Please remain on standby. Thank you for waiting. We will now take questions from investors and analysts. I am Kondo from the IR Group, and I will serve as your moderator. Thank you. The same three speakers from the media session will be responding to your questions. We will now begin the Q&A session. If you have questions, please limit yourself to two questions per person. If you have a question, please click on the raise a hand button on your web screen.\n\n**Operator**\nSNBC Nikko Katsura-san, please go ahead.Thank you very much. This is Katsura from SMBC Nikko. I would like to ask about GNNS and then INSS. The first question is about GNNS. Apart from the JPY 14.9 billion impairment, the operating income for the second quarter is 15.3%, and Q1 is 15.8%, and you are able to achieve this high level of profit without major titles, and this could be a threshold. Can you talk a little bit about how you see it? Are there any factors contributing to this great performance? That is the first question. Also, the NAND flash price is increasing, and that might have a negative impact on the PS5 hardware profitability. What is your plan for the remainder of the years and the next fiscal year?\n\n**Operator**\nThen with regards to INSS, you said that you are going to strike a good balance between business expansion and the profitability improvement. In North America, smartphone seems to be doing really well. Three months ago, there were a lot of news. With regards to changes in geopolitical situation, what sort of plans that you are planning to take for the midterm? Do you have any updates? Those are the two questions. Thank you. First, I would like to take the questions on game. The profitability in Q2, and the major contributing factor is the Forex and Network Service, and then SNNA. There was a reduction in M&A expenses. From that perspective, we were able to realize a relatively high rate of profitability. Whether this is sustainable or not, that is the question.\n\n**Operator**\nBasically, the network service, which commands higher profit, and then software, and especially first-party software, if they perform really well, we should be able to maintain a high level of profitability. With regards to memory prices, and then with the potential impact on the hardware profitability, for this fiscal year, we have already secured all the parts that we need. Because the market is continuing to fluctuate, we keep a close eye on the situation on the market. Of course, the supplies and then parts, and then their prices, when they go up, that will have an impact on the profit of the hardware.\n\n**Operator**\nFor the NFI, next fiscal year and onward, we have already achieved the 18 million install base for PS5, and assuming this will grow next year, instead of additional hardware profitability, we want to really continue to monetize the install base that we have already secured. I think that would be the priority. The second question will be addressed by Horii-san. Thank you very much for your question. First, the first half of the question. The business expansion for next year, and then also enhancement of the investment efficiency. We have been able to manage these quite well this year. Especially on the expenses side, we have been able to restrain the expenses so that we can generate the sales growth versus previous year. We want to maintain this and then further improve into next year.\n\n**Operator**\nAs for our response to the geopolitical risks, continuously, and with regards to production in the U.S., we want to ensure the quality so that we can produce in a stable way. Trying to do that in-house, that would be really difficult to achieve. However, working closely with the different partners or making a joint investment, and what else we can do to really address this issue of the U.S. production, there is no clear answer, but we will continue to explore all the options. Thank you.\n\n**Operator**\nNext, from Nomura Securities, Okazaki-san. This time, the impairment loss Bungie's intangible assets was reflected in that. In the balance sheet, how much assets do you still have, and what is the risk of the impairment loss? The second question has to do with the PlayStation 5.\n\n**Operator**\nIn Q1 and Q2, I think you sold more than in the previous year. Toward the end of the year, you said you're going to expand. Are you aiming to have an upward revision, or is the sales going to be more than previous year? First, on the impairment loss Bungie, this is an impairment loss of Bungie, the intangible assets, as well as the tangible assets. They are the target for the impairment loss. Goodwill, that is supported by the whole game segment. There will not be any impairment loss for the goodwill. For this time, Destiny 2, which is a game performance, did not reach the expectation that we had when we acquired Bungie. The balance, the assets, more specific, it's very difficult to give you specifics. Yes, we still have some intangible assets.\n\n**Operator**\nThe question of whether there is still any risk remaining or not, Marathon, which is going to be launched, and Destiny 2, the performance, if the performance is not going to reach what we expect, of course, there is a risk of impairment loss. We do not believe that this will impact the whole game segment, at least at this point in time. Your second question was about the install base in Q1 and Q2. It was more than in the previous year. 150 million units is the goal we have for the year. The number of units we believe we have forecasted for this year, we believe we can reach that. Thank you. Thank you. JP Morgan from JP Morgan, Ayata-san, please. Thank you very much. My name is Ayata from JP Morgan. I have a question about games and INSS. One question each.\n\n**Operator**\nFor games, as has been discussed earlier, network service sales in dollar terms increased by 35% in the second quarter. What would be the breakdown, if possible? I would like to know. Two years ago, there was a price increase. Maybe there is an effect from that. Then the shift toward the higher-priced products or the number of paying subscribers increase. I think these are the possible items. What would be the breakdown in terms of priority? INSS. In the first half, it seems that there is a customer, some customers brought forward the purchase of the components. In the third quarter, the input of wafers from 155 to 160, there seems to be a shift. Against the spectrum toward the U.S. and the Chinese market, what would be your take on the market conditions? I am sure there is an upside.\n\n**Operator**\nPlease explain the risks and upside both. Thank you. The network service and the factors contributing to the increase in sales, as you rightly said, price comes at the top of the list. The price increase impact still lingers. Then the number of subscribers or users increased compared to the previous year. The product mix, tier two and tier three, higher tier users, we have more and more people going to the higher tiers. I think those are the contributing factors for the increased sales. There is a factor contributed to the increase in the operating income. That is to say, acquisition of the contents, efficient way of acquisition, looking at the data, that contributed to the operating income improvement. INSS, please. Thank you for your question. As you rightly pointed out, in the first half, the shipment, the sensors' shipment exceeded what we expected.\n\n**Operator**\nFor the full year forecast, we place it unchanged. The supply chain of the set, because of the U.S. tariffs or the shift in the production base, because of these, there seems to be a certain level of opaqueness or lack of clarity. What we shipped, some of them go directly to the final markets, and some of them still linger in the supply chain. We have to look at this. In the third quarter, we will continue full capacity wafer import opportunistically. If things go well, we can see the increase in sales. From next fiscal year onwards, of course, we can think of accumulating the strategic inventory as well. About the amount of volume of the input, we look at these factors. About customers, I cannot mention each and individual customer's situation.\n\n**Operator**\nGenerally, as has been reported in the media, depending on the customers, there are ups and downs. The smartphone market is still on the recovery track, gradual recovery track. That is our understanding. At this point in time, in terms of market and customers, North America seems to offer a bigger chance and opportunities. Thank you.\n\n**Operator**\nWe will take the next question. Ezawa-san from Citigroup Securities. This is Ezawa from Citigroup Securities. We have one question, big question for game. There was a mention of the three things, R&D, capital, and as an expenses. Can you talk a little bit more about that? Is this related to some sort of impairment? Also, the titles related to this, if there are any specific titles related to this, and if you could talk about them, that would be great.\n\n**Operator**\nFurthermore, also the development asset capitalization. As you run your business, will you foresee this will happen more often? That is the one big question. The next question is also, this has to do with the development asset. If you look at the supplementary presentation, when you look at the depreciation by segment, it appears that there is no apparent increase. However, the depreciation of the development is not really included, I believe. The capitalization of a development for the game biz, what would be the scale of the asset for the gaming development? Thank you for your questions. The capitalization and correction, this is not attributable to the nature of the business. Korinaga-san will talk more about the details of the revision. Thank you for the question.\n\n**Operator**\nThis value is not an impairment of asset. In the past, there was the network development, which was treated as the intangible asset, and then part of it should not have been capitalized. We found out. That is why for the past years, and then for this fiscal year, we made the correction in one go. Specifically, the network-related asset and R&D are capitalized, but console and hardware R&D are treated as expenses. This treatment was mistakenly done in the past, which we made a correction retroactively. That is all. Through operational improvements, we will prevent the recurrence. We believe that this will not happen again. The next one is the game capitalization, and then the depreciation or monetization. The depreciation of the game itself, we do this in accordance with the rules.\n\n**Operator**\nIt is not that all the games are capitalized. We will work closely with the auditing firm. At the stage of the development, we will be able to finalize the value of the asset later in the process. In terms of value, it is not really that high. On an annual basis, we believe the tens of billions of JPY, that level. As for the depreciation expenses, when we launch the contents, we start to depreciate, and that is the nature of the business. Thank you.\n\n**Operator**\nWe have very little time left. The next person will be the last person to ask questions. Please only ask one question. From Goldman Sachs, Munakata-san. This is Munakata from Goldman Sachs. Thank you for this opportunity. One question on GNNS.The full year operating profit, I think it was JPY 500 billion, but the tariff impact was not included in the forecast. When you consider these items, I believe that the profitability has improved. The current platform, I think, is looking at hardware and other services, which the prices are going up. By looking at the competitors' trends, next year, after next year, in order to improve your profitability, what will be the upside? It will be probably the game contents and these items. Are you planning to revise the prices of the game contents, for example? Thank you very much for the question. The game business for next year, first, we have to focus on the year-end season and try to expand the installed-based units so that we can have 90 million units by the time we start next year. The upside and downside.\n\n**Operator**\nThe upside for next year, the first-party contents. The Insomniac Studio is developing that. The Wolverine will be launched. Tentpole contents, that's there. Marathon, it's a live service. If we can be launched this year, next year, I think we will enjoy revenue, profitability. On the other hand, the market situation, somebody else asked this question. The components and the supply chain are not very transparent. We have to be careful about that, looking at the profitability, how to balance that. Going forward, when we plan next year's strategy, we need to take that into account. As for prices, I do not have anything that I can comment. Thank you very much. Since it is time, we would like to conclude Sony Group Corporation's consolidated financial results presentation. Thank you very much.",
      "fetched_at": "2026-02-04T15:54:42.134Z"
    },
    {
      "ticker": "6758.T",
      "title": "SONY GROUP CORPORATION (6758.T) Q1 FY2026 earnings call transcript",
      "published_date": "Aug 7, 2025, 4:00 PM GMT+9",
      "fiscal_year": "2026",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/6758.T/earnings/6758.T-Q1-2026-earnings_call-335329.html",
      "content": "**Moderator**\nIt's now time to begin the Sony Group Corporation Consolidated Earnings Announcement Meeting. I'll be serving as the emcee. I'm Ishi from Corporate Communications. Today, the financial results for the fiscal twenty twenty five first quarter and the full year forecast will be presented by Lin Tao, Corporate Executive Officer and CFO. Then an overview of the Financial Services segment, which is scheduled for partial spin off and listing at the September will be given by Toshihide Endo, President and CEO of Sony Financial Group Inc.\n\n**Moderator**\nThat will be followed by a Q and A session. The entire session is scheduled to last about seventy minutes. Please note that Ms. Tao wishes to deliver her remarks directly in English to the global audience, so a prerecorded video will be streamed on the English channel.\n\n**Lin Tao** (Corporate Executive Officer &amp; CFO)\nHello, everyone. Today, I will explain the content shown here. After that, Mr. Endo will explain the financial results of Sony Financial Group. Sales of continuing operations for the quarter increased 2% compared to the same quarter of the previous fiscal year to JPY 2,621,600,000,000.0, and operating income increased 36% to JPY $340,000,000,000, both of which were record highs for the first quarter.\n\n**Lin Tao** (Corporate Executive Officer &amp; CFO)\nNet income increased 23% to JPY $259,000,000,000. The financial results by segment are shown here. Next, I will explain to our full year results forecast. Our sales forecast is unchanged from our previous forecast of JPY 11,700 billion, and we have upwardly revised our operating income forecast from our previous forecast by 4% to JPY $1,330,000,000,000 and our net income forecast by 4% to JPY $970,000,000,000. We raised our forecast for operating cash flow by 2% to JPY 1,270,000,000.00.\n\n**Lin Tao** (Corporate Executive Officer &amp; CFO)\nThe forecasts for each segment are shown here. Now I will provide an update on the impact of additional U. S. Tariffs. Although there have been significant developments in the past few weeks regarding the situation surrounding the additional tariffs, there are still some fluid aspects such as product specific tariffs.\n\n**Lin Tao** (Corporate Executive Officer &amp; CFO)\nWe plan to carefully assess the impact and our response throughout this fiscal year based on multiple scenarios. Furthermore, we need to carefully consider the impact on each business of the product and pricing strategies we aim to undertake in response to the additional tariffs. Taking this into consideration, we have decided to present the impact of the additional tariffs as an estimate for all of our continuing operations, as was the case in the previous forecast. We expect the impact on operating income for FY 2025 to be approximately JPY70 billion, which is a decrease of JPY30 billion from the previous forecast based on the tariff rates announced as of August 1. We had nearly completed the diversification of the production locations of our main products by the end of the quarter, and we expect to complete the measures we're planning by the end of the first half of the fiscal year.\n\n**Lin Tao** (Corporate Executive Officer &amp; CFO)\nWe intend to continue to monitor the situation and take actions to minimize the impact. Now I will turn to an overview of each business. First is the GN and S segment. FY twenty twenty five Q1 sales increased 8% year on year to JPY 9 and 36,500,000,000.0, primarily due to an increase in third party software sales, partially offset by the negative impact of foreign exchange rates. User engagement continued to increase year on year with the number of monthly active users across all of the PlayStation in June increasing 6% compared to the same months of the previous year to 123,000,000 accounts.\n\n**Lin Tao** (Corporate Executive Officer &amp; CFO)\nAnd total play time for the quarter also increased 6% year on year. Operating income increased approximately 2.3 times year on year to 148,000,000,000, a new quarterly record high for the segment, primarily due to the impact of the increased sales of third party software and increase in network service revenue. As a consequence of the recent strong user engagement trend, we have upwardly revised our FY twenty twenty five forecast for sales slightly from last time to JPY 4,320 billion and our FY twenty twenty five forecast for operating income by 4% to JPY 500,000,000,000. The improvement in operating income for FY twenty twenty five compared to the previous fiscal year is expected to be driven primarily by an increase in our strong network service revenue, cost reduction and an increase in first party software revenue. In our studio business, our live service game revenue is steadily growing, thanks to the MLB The Show series, Destiny two and Helldiverses two.\n\n**Lin Tao** (Corporate Executive Officer &amp; CFO)\nAnd it contributed more than 40% of our first party software revenue during the quarter. In the single player AAA title space, we plan to release Ghost of Yate in October, following the release in June of Death Stranding two on the beach, which received a Metacritic score of 90. We look forward to many game fans enjoying these titles. We decided to postpone the release of Marathon to further improve the quality of the gameplay. Based on community feedback, we think we can further enhance the overall gaming experience by deepening gameplay and elevating narrative immersion.\n\n**Lin Tao** (Corporate Executive Officer &amp; CFO)\nSo we are working hard to do that. MAU in June, four years and seven months after the launch of PS5 increased 32% from the 93,000,000 MAU accounts in June 2018, the same period after the launch of PS4, and they continue to consistently grow. Content and service revenue is expected to grow approximately 50% on U. S. Dollar basis in the current fiscal year forecast compared to the level recorded in the fiscal year ended March 3139, exceeding the MAU growth.\n\n**Lin Tao** (Corporate Executive Officer &amp; CFO)\nThis indicates that in addition to the increase in the number of users and increase in spending per user is contributing to revenue growth. We expect content and service revenue to continue to grow steadily from next fiscal year onwards as well, thanks to the user community we have cultivated to date. Next is the Music segment. FY twenty twenty five Q1 sales increased 5% year on year to JPY 4 and 65,300,000,000.0, primarily due to higher revenue from streaming service and increase in revenue from a mobile game, partially offset by the impact of foreign exchange rates. Operating income increased 8% to JPY 92,800,000,000.0.\n\n**Lin Tao** (Corporate Executive Officer &amp; CFO)\nOn a U. S. Dollar basis, streaming revenue for the quarter increased 7% year on year in recorded music and 8% in music publishing. We have upwardly revised our previous FY 2025 forecast for sales and operating income slightly to JPY $1,870,000,000,000 and JPY $360,000,000,000, respectively. In recorded music, albums from Sony Music Entertainment owned and distributed labels claimed 42% of weekly top 10 global albums on Spotify during the quarter with Bad Bunny's new release taking the number one spot for six consecutive weeks.\n\n**Lin Tao** (Corporate Executive Officer &amp; CFO)\nThe contribution of catalog products to our revenue continues to increase and we remain committed to acquiring catalogs in both the recorded music and music publishing business since we believe that the opportunity to increase the monetization of these assets by acquiring more of them will continue. In Visual Media and Platform, Demon Slayer Kimetsu no Yaiba, the movie Infinity Castle, which was released on July 18 in Japan, has been a massive hit attracting 12,550,000 people to theaters and generating JPY17.6 billion in box office revenue as of August 3. We plan to release the film in The U. S, Europe and certain countries and territories in Asia, Central And South America, distributing it along with Crunchyroll and Sony Pictures, and we look forward to it being a major global success. Next is the Pictures segment.\n\n**Lin Tao** (Corporate Executive Officer &amp; CFO)\nFY twenty twenty five Q1 sales decreased 3% year on year to JPY 3 and 27,100,000,000.0 and operating income increased 65% to JPY 18,700,000,000.0. On a U. S. Dollar basis, sales increased 4% year on year and operating income increased 76%, primarily due to higher serious deliveries in television productions. There is no change to our forecast from the previous forecast.\n\n**Lin Tao** (Corporate Executive Officer &amp; CFO)\nIn television productions, the second season of The Last of Us, which was renewed for a third season, received several Emmy nominations. In feature films, 28 Later has become a box office hit after crossing $150,000,000 globally. And k pop demon hunters produced by Sony Picture Animation has achieved massive success, becoming the most watched Netflix original animated film of all time. Crunchyroll is steadily growing its paying subscribers and is expanding the global anime community through such activities as hosting the Crunchyroll Anime Awards in Tokyo in May. Now I will explain our strategic partnership with Bandai Namgou, which we announced on July 24.\n\n**Lin Tao** (Corporate Executive Officer &amp; CFO)\nThrough this partnership, we plan to accelerate our collaboration with Bandai Namgou even more than before, working to do such things as co create new IP, collaborate on video production, distribution and merchandising in the anime and manga fields, as well as strengthen marketing through the sharing of data. Additionally, in the field of experiential entertainment, we aim to create new condo experience by bringing together the strengths of both companies such as Bandai Namco's knowledge and venue and Sony's technology. Next is the ET and S segment. FY twenty twenty five Q1 sales decreased 11% year on year to JPY 5 and 34,300,000,000.0, primarily due to a decrease in unit sales of TVs and the impact of foreign exchange rate. Operating income decreased 33% to JPY 43,100,000,000.0, primarily due to the impact of decrease in sales and the impact of foreign exchange rates.\n\n**Lin Tao** (Corporate Executive Officer &amp; CFO)\nThere is no change to our forecast from the previous forecast. Except for televisions where competitors engaged in more aggressive pricing than we had anticipated, market conditions during the quarter progressed generally in line with our expectation across the other major product categories. The Imaging business performed well, essentially in line with our original projection, supported by the continued tailwind of the subsidy program in China. Last June at the largest Hollywood film production equipment exhibition, Cine Gear Expo twenty twenty five, We exhibited a system that links Zeng's spatial reproduction display with the Venice Extension System Mini as a form of new content creation. It attracted strong interest from the film production creators in attendance.\n\n**Lin Tao** (Corporate Executive Officer &amp; CFO)\nIn this segment, we aim to accelerate the expansion of our creation centered business through these products and solution services. Next is the I and SS segment. Despite the impact of foreign exchange rate, sales for the quarter increased 15% year on year to JPY408.2 billion, primarily due to increased shipment of sensors for mobile phones and digital cameras. Operating income increased 48% to JPY54.3 billion as the impact of the increase in sales significantly exceeded the negative impact of foreign exchange rate. There is no change to our forecast from the previous forecast.\n\n**Lin Tao** (Corporate Executive Officer &amp; CFO)\nThe market for smartphone continued to recover gradually on a global basis. Excluding the impact of foreign exchange rate, mobile sensor sales for the quarter grew steadily due to an increase in sensor shipment volume and an increase in unit price on a U. S. Dollar basis. Although recent shipment volume is increasing year on year, taking into account the possibility that customers are bringing forward orders due to the additional tariffs, we expect the annual shipment volume to be on par with the previous fiscal year.\n\n**Lin Tao** (Corporate Executive Officer &amp; CFO)\nFrom FY twenty twenty five Q2 onwards, we expect sales to steadily increase due to rising unit price resulting from further progress towards larger sized sensors and higher added value, despite an expected deterioration in foreign exchange rate compared to the previous fiscal year. In the consumer camera space, in addition to robust demand for single lens camera, the growing demand for video is driving demand for sensor used in new video camera, such as handheld cameras. We aim to benefit from this market expansion and create new revenue opportunities. To summarize, we believe that during the quarter, we made steady progress toward achieving the numerical targets we established in our fifth midrange plan as profit continued to increase, primarily in the GN and S, Music and I and SS segment. On the other hand, we expect that uncertainty in the business environment, such as additional tariffs in The U.\n\n**Lin Tao** (Corporate Executive Officer &amp; CFO)\nS. Will have a greater impact from FY twenty twenty five Q2 onwards, and we will focus on conducting business operations that anticipate change while preparing for risks. This concludes my remarks.\n\n**Moderator**\nNow Mr. Endo will provide an overview of the Financial Services segment performance. Mr. Endo, please.\n\n**Moderator**\nNow I will explain the financial results of the Sony Financial Group. On an IFRS basis, adjusted net income for the quarter increased 300,000,000.0 yen compared to the same quarter of the previous fiscal year to 23,000,000,000 yen primarily due to the improvement in loss ratio at the Sony Assurance. Adjusted net income of Sony Life decreased 1,000,000,000 yen year on year to 15,600,000,000.0 yen primarily due to the impact of rising interest rates, partially offset by an improvement in funding costs as a result of the decrease transaction. Insurance and accounting under IFRS requires an amount prepared for the future uncertainty be recorded as a risk adjustment liability. As interest rates rose during the quarter, the risk of mass cancellations increased from an accounting valuation perspective, which reduced adjusted net income through the recognition of a loss and a decrease in the contractual service margin amortization.\n\n**Moderator**\nThe new business acquisition at Sony Life continued to trend at the high level of the previous fiscal year with the annualized premiums from the policies in force during the quarter increasing JPY16.1 billion to JPY1313.6 billion, demonstrating strong growth, especially in the corporate insurance sales channels. The recruitment of Life Planners and an agency supporter is progressing well, and our sales channels are continuing to expand. Next, I will explain the progress of our measures to strengthen our financial foundations. As I explained at the Investor Day in May, the interest rate sensitivity of our assets exceeds that of our liability, resulting in an overhedged position at Sony Life. To address this, we are selling bonds and then undertaking reinsurance over the course of two years, including this fiscal year.\n\n**Moderator**\nIn the quarter, we accelerated the sales of bonds that we had planned to sell over the course of the full fiscal year. As a result, the ESR level at the end of the quarter improved three percentage points, mitigating a significant negative impact of rising interest rates. Our consolidated ESR was 184% and then Sony Life's stand alone ESR was 163%. Loss on sales of securities is deducted as an adjustment item from the adjusted net income. Going forward, we aim to further strengthen our financial foundation by accumulating economic value based capital through the acquisition of a high level new insurance contract and our efforts to reduce risks.\n\n**Moderator**\nThere is no change to our full year forecast of JPY 60,000,000,000 in income before income taxes. Our forecast for adjusted net income has been reduced by 9% to JPY 98,000,000,000. We downwardly revised the forecast because we have revised our long term interest rate assumption this time from the previous 2.7% to 3.3%, the average interest rate level in July and because we have incorporated additional risk adjustments. However, going forward, we will continue to make every efforts to bring adjusted net income as close as possible to our initial plan by accelerating the acquisition of new policies and reviewing expenses. Lastly, preparations for the listing on September 29 are progressing smoothly, and we plan to submit the final application for the listing to the Tokyo Stock Exchange tomorrow, August 8.\n\n**Moderator**\nAdditionally, at the Board meeting of Sony Financial Group Incorporated, we will which will be held on the same day, we plan to officially approve the establishment of a share repurchase facility with a limit of JPY 100,000,000,000, effective from September 29 through August 8 of the following year. There is no change to the JPY 25,000,000,000 we plan to pay at the fiscal year end dividend. Heretofore, we have announced our financial results at the Sony Group's earnings announcement, including when we were a listed company in the past. From the second quarter onward, we will hold our financial results briefings as an independently listed company. We are fully committed to becoming a financial services group that is truly valued by a wide range of stakeholders, including shareholders and investors.\n\n**Moderator**\nWe sincerely appreciate your continued support after the listing. The presentations were given by Ms. Tao and Mr. Endo. We will begin the Q and A session for media representatives at 04:25 p.\n\n**Moderator**\nM. Followed by the Q and A session for investors and analysts at 04:50 p. M. Each Q and A session is scheduled to last approximately twenty minutes. For those who have registered in advance to ask questions, please click the join webinar link and remain on standby in the session.\n\n**Moderator**\nPlease kindly make sure to review the guidance document sent in advance for details on how to ask questions and important notes. We will be resuming shortly.\n\n**Moderator**\nWe will soon start the Q and A session for the members of the media. Please wait a little while longer. Thank you for waiting. We will now start the Q and A session. First, the officers on stage.\n\n**Moderator**\nCorporate Executive Officer and CFO, Lin Tao Senior Vice President in charge of Finance and IR, Satahiko Hayakawa Senior Vice President in charge of Corporate Planning and Control, Disk Manufacturing Business and Storage Media Business, Naoya Horii President and CEO, Sony Financial Group, Inc, Toshihide Endo. We will now take the questions from the members of the media. Please limit your questions to two per person. If you would like to ask a question, So the first question will come from Toda san of Yomiuri newspaper. Can you hear?\n\n**Moderator**\nYes. About the tariffs, two questions. So initially, tariff outlook was JPY 100,000,000,000. Now that's been reduced by JPY 30,000,000,000 to JPY 70,000,000,000. Can you explain in a little more detail why the decline?\n\n**Moderator**\nThat's one. The other thing, the Trump administration in The U. S. Talking about 100% tariff rate for semiconductors. I don't know how it will be applied for Japan, but what will be the risk if that becomes 100?\n\n**Moderator**\nThank you for the question. Let me respond. The 100,000,000,000 yen tariff impact that we explained previously and the difference this time. For Q1, for semiconductors, there is no impact and four gs and NS games and Sony Electronics, total of 100,000,000,000 plus impact. That's according to assumptions.\n\n**Moderator**\nSo there was some postponement and there was a strategic inventory and this was smaller than in Q2 onwards. And based on the assumptions and measures Q2 onwards, the decline, there's it's lower compared to expectation in May. So GNS, ETNS, INSS, JPY 20,000,000,000 to JPY 30,000,000,000 each. So that's total of JPY 70,000,000,000 impact from tariffs. That's now factored into our forecast.\n\n**Moderator**\nSo you asked about the Trump administration's semiconductor tariffs. Today, we announced our forecast that's based on the tariff rate that was officially announced August 1. So there's a lot of information coming out about tariffs and the situation is shifting daily, but we rely on the officially announced numbers. And based on that, we will evaluate the direct and indirect impact that we will continue to do going forward. Thank you.\n\n**Moderator**\nOne additional thing. In our business, semiconductor components itself, direct export to The U. S. Is very limited. So I would just like to make that point.\n\n**Moderator**\nLet's move on to the next questions. From Nikkei, Yoshida san, please go ahead and ask your questions. Yoshida san, are you there? Can you hear me? This is Nikkei Yoshida speaking.\n\n**Moderator**\nSorry about that. I do have two questions. The first one is about animation. And so current your evaluation of the titles in pictures and Demon Slayer got off to a really great start. And then also National Treasure has been hugely successful.\n\n**Moderator**\nAnd how are you evaluating the box office performance of these two titles compared to your initial estimate? And with regards to Daemon Slayer, and it is expected that the box office revenue will continue to increase? And do you think that this will be good enough to so that it will cause you to really revise upward your forecast, including merchandising? And then also your investment in Bandai Holdings, and so you have been aggressively investing in IP content creation. And so how are you evaluating the result of the investment so far?\n\n**Moderator**\nAnd is there any specific investment that caused you to upward revise your forecast? So the first question, I will take that. And then second question will be answered by Hayakawa san. With regards to anime titles, and as you said, the Daemon Slayer and the National Treasure have been quite successful. And we are getting a really positive feedback.\n\n**Moderator**\nAnd these titles, whether they are in line with our expectation, but Daemon Slayer, because they are previous release, which was launched by many users and that was a really successful IP. So we had a really high expectation for this IP. So that has been factored in our forecast. But as for the National Treasure, and under the umbrella of Aniplex and then Midian Studio was producing this title, and this was the first title and which has met with a really positive response, and this significantly outperformed our expectation. But in terms of the overall impact on our revenue and profit, the impact is not that sizable.\n\n**Moderator**\nAnd so that has been already included in our forecast or our outlook. So this with regards thank you very much for the question. So the investment in abandon and of course, we have been shifting to the creation. So for example, the Entertainment three businesses basically account for 60% of consolidated revenue. So basically, business portfolio is shifting more to the creation.\n\n**Moderator**\nAnd then as for the Electronics business, in TV and in compared to output devices, and we are now shifting creation devices that include digital camera. So as a result, we are seeing more stability in profitability and in revenue and also the productivity of our performance is increasing. And then against such backdrop, and for example, in the Music business, the Music streaming and EMI Music Publishing has been acquired, and then we increased the Music Catalog. And as I mentioned in the speech, in gaming business and moving away from a hardware centric business to more to the community based engagement business, and then that has been increasing. So now as we make more transition to entertainment creation, the stability and productivity, our performance is increasing.\n\n**Moderator**\nSo this upward revision might not have been a direct result of these, however, the Music Publishing and also acquisition of our music catalog and then also the acquisition of Crunchyroll. And these are the areas where we are seeing growth. And as a portfolio, we have been expanding our businesses and also improving our profitability.\n\n**Moderator**\nMoving on to the next question. Nishida san, a freelance reporter, please. Do you hear me? Yes, we do. This is Nishida.\n\n**Moderator**\nI have two questions about the semiconductor business and electronics business. First, about the semiconductor business. Today it was reported in the news that Apple investing in The U. S. As partner it has so it is possible that they will have production facility in The U.\n\n**Moderator**\nS. So this type of risk might not appear this year, but towards the end of this year to next year, how would you mitigate this risk like risk hedge? Number two, within the electronics, I would like I have a question on smartphones. In the first half, Xperia Mark seven, there has been a risk of recall. And what would be the impact on the sales and impact on the smartphone business itself?\n\n**Moderator**\nKen, thank you for the question. I have received two questions. And I would like to respond to the smartphone questions on ET and S and I and SS question, Hori san will respond later on. About the Xperia about the defect of Xperia smartphone, so we are very sorry that we caused inconvenience to the users. I would like to apologize.\n\n**Moderator**\nAbout identifying the defect and the countermeasures have already been completed. The malfunction itself was coming from the production process. The impacted loss and so we have exchanged the parts, which have been impacted. And about the quality, so this is a big management agenda for Sony. So we will work so that this will not happen going forward.\n\n**Moderator**\nThe smartphone business itself is an extremely important business for us. The telecom technology is a technology that we have been nurturing for a long time. And also this is used to other areas other than smartphone. So we will continue to grow this business. The first question about the semiconductors.\n\n**Moderator**\nHorizan, please. Thank you for the question. About so I cannot respond to questions pertaining to particular customer. However, about the risks and countermeasures on overall risk, I would like to respond. As you have indicated in The U.\n\n**Moderator**\nS, we do not have any semiconductor production facilities in The U. S. In the short term, it is not really feasible to produce in The U. S. In the short term.\n\n**Moderator**\nHowever, where the source is and offering very high quality devices to the customers and how to make the final product delivered to the customers as attractive as possible. This is what we have been working on from before. And we will make sure that we will provide devices that even exceed that of competitors. And this type of risks always exists. And as a device manufacturer, the competitiveness and quality of the product.\n\n**Moderator**\nWith this, we would like to get involved in this market. Thank you.\n\n**Moderator**\nWe'd like to move on to the next question. Tanno san from NHK, please. Can you hear? Taruno from NHK. Can you hear?\n\n**Moderator**\nYes. Thank you. About The U. S. Tariffs, I want to ask about the impact.\n\n**Moderator**\nIn the last announcement, the President said that there is no major change occurring in the short term, but there's time lag about economic sentiment, and so you look carefully. So about your views about the economy, what's the current situation with The U. S. Consumers? And also for this fiscal year, well, you talked about earnings and you said that there are uncertainties and you'll be watching carefully.\n\n**Moderator**\nBut in terms of the performance forecast, if you can also talk about that, please. Thank you. I'd like to respond to that question. About The U. S.\n\n**Moderator**\nEconomy, it's slightly decelerating, slowing down a bit, but a rapid deterioration we expect can be avoided. However, we need to carefully monitor the situation is what we think. Q2, so April to June U. S. GDP was 3% growth, higher than expectations.\n\n**Moderator**\nPersonal consumption starting to show recovery, but compared to last year, the strength is less. And concerning our business, as a portfolio, we have hardware, and we have to carefully watch the situation for hardware. On the other hand, for entertainment business as a whole, they can withstand the impact of the economy. Their business is less impacted by the economic situation. That's the nature of that business.\n\n**Moderator**\nSo the impact have those impacts have been already factored into our forecast that we announced today. Thank you.\n\n**Moderator**\nWe are running out of time. So the next question will be the last one. Iwato san from Nikkei Business. Go ahead and ask your questions. Can you hear me?\n\n**Moderator**\nCan you hear us? This is Iwata from Nikkei Business. And I do have one question. And during the presentation, you talked about the partnership with Bandai Namco. And then also last year, you forged in partnership with Kadokawa.\n\n**Moderator**\nSo and what would be the time line of the seeing the result in terms of the performance? And I know that Kadokawa and Mbando Namco, you already have the partnership before your decision to investment. So what are the changes that we can expect after the investment? Thank you for the questions. You are right.\n\n**Moderator**\nAnd Bandai Namco and then Sony Group are already collaborating through partnership on the ground and in especially game, music and anime areas. And before our investment, we treat them as a really important partner for collaboration. So with this recently announced investment, and we can go deeper and then wider in terms of collaboration. We are seeing a possibility of that. More specifically, the game and anime IP using as access so that we can really expand the community.\n\n**Moderator**\nAnd then also the Bandai Namco is really great at creating venues, and we believe that Sony's technology can really shine in the venues by Bandai Namco so that we can really collaborate together to deliver a condo experience. And we believe that, that's something that we can do. And in terms of time line, and this is kind of difficult to say, but I think we and then there are longer term collaboration or there are immediate collaboration, including IP community building. And there are some low hanging fruits that can be achieved within one year. So and looking at the overall collaboration at the group level, we want to produce the appropriate output and then to see if we can we are producing returns, and we will regularly consider and then assess the situation going forward.\n\n**Moderator**\nThat's all. So that concludes the Q and A session for the members of the media. So the Q and A session for investors and analysts will start at 04:50 p. M.\n\n**Moderator**\nWe will start the Q and A session for investors and analysts shortly. Please wait a few more moments until we resume. Okay. Thank you for waiting. We will now begin the Q and A session with investors and analysts.\n\n**Moderator**\nI'm Kondo from IR Group, and I'll be moderating this session. As with the media session, the four individuals here will be responding to the questions. Now let's begin the Q and A. And Mizuho Securities, Nakane san, please. So this is Nakane from Mizuho.\n\n**Moderator**\nDo you hear me? Yes, we do. Thank you. I have two questions. The first question is about Finance and the second question is on Games.\n\n**Moderator**\nSo about the so you are trying to improve the asset over hedge in Finance. So the progress from the first quarter and the business environment is changing. So please tell me if there has been any changes from the first quarter. The second question is on gaming. About Marathon, in the profit, you have factored in some negative in the profit that so how have you incorporated that, the sales and profit as well as the timing of launching Marathon.\n\n**Moderator**\nSo please give us hints in. And about Bunge, the so it seems like an autonomous region. So we would like to hear about the governance of Bunge. And so and also you can say if this is not probable, but the worst case scenario, if you are not going to launch it, if there are any risks such as impairment? So I have such two questions here.\n\n**Moderator**\nThank you for the questions. Endo san will respond to the first question and the second question, I will respond. Okay. I will respond to the first question. About asset sales, improvement of finances in the Investor Day in FY 2025 and FY 2026, we have explained and announced the measures for FY 2025 and 2026.\n\n**Moderator**\nAnd the partial sale of assets, what was scheduled for this fiscal year has been advanced. So these were sold in advance. And thanks to this, this is done to improve the ESR and selling bonds. And through these activities, Sony Life's ESR improvement, it has improved by three percentage points. This fiscal year, the interest has risen significantly.\n\n**Moderator**\nSo there has been lots of downside pressure on ESR. But overcoming that, we have been able to prevent ESR from slumping. Group consolidated was 189%, but that was end of FY twenty twenty four. But now this quarter, we have kept the ESR to 184%. So that is within the ESR target range.\n\n**Moderator**\nSo we have been so this is thanks to advancing our initiatives to improve our finances. So these advanced initiatives were carried out. And about selling U. S. Bonds, as I said in the Investor Day, the losses the liabilities, so we are trying to sell the bonds as reinsurance.\n\n**Moderator**\nSo these are still remaining and we will be working on that going forward. And beyond that in FY 2025, 2026 and beyond, we don't have any plans as of now. Second question, I would like to respond to the question on Marathon. First about Marathon, how we factored in the forecast. We expect the launch to happen within this fiscal year.\n\n**Moderator**\nBut having said that, this is not a commitment. We cannot and no official announcement has been given yet. So we are expecting this to be launched within this fiscal year. However, compared the sales is very small compared to the overall sales and the timing of launch. So we are now doing modification development and based on the progress in the autumn timeframe, we believe we can communicate when we will be launching that.\n\n**Moderator**\nWe can launch that either from Bunge or PlayStation. And about governance of Bungie, as you have said, when we the governance at the time of acquisition, we were offering a very independent environment. So that was one way of thinking. However, thereafter, we have gone through structural reform as we have announced last year. So this type of from this type of independence, this independence is getting lighter.\n\n**Moderator**\nSo Bungee is shifting into a role, which is part which is becoming more part of PlayStation Studio and integration is also proceeding. So in the long term, if you can see this as an ongoing process, so the direction is to become part of PlayStation Studio. And about the launch of Marathon, we are now fixing the problems. So we believe this launch will happen. And if this launch is canceled, the we need so we need to do the revision of the valuation.\n\n**Moderator**\nHowever, as of now, this is not expected. Thank you.\n\n**Moderator**\nFrom Goldman Sachs, Munakata san, please. Munakata from Goldman Sachs. Can you hear me? Yes, we hear you. Thank you.\n\n**Moderator**\nI also have two questions about the games. First, improvement of margins. Y o Y seems that margin has improved quite substantially, but what will be the mix between hardware and software? And what is the gross margin of hardware and what is inside software? I think there's also contribution from network services.\n\n**Moderator**\nSo can you talk about this in more detail? Also second quarter onwards, tariff impact will be larger than Q1 is what's expected. So this high margin, is that something that you'll be able to sustain? That's the first question. Second question, so about Marathon, I also want to ask.\n\n**Moderator**\nSo it's a title that's attracting a lot of attention, strengthening live service games. So how do you look at the current status of your strategy to strengthen that? So you look at the quality before launch and you make a decision and you're postponing. So I think you're making a flexible decision. I think that's a good thing.\n\n**Moderator**\nBut on the other hand, it's a negative thing that the title doesn't appear. So how do you look at the current situation? And in terms of strengthening live service games, where do you see the issues, please? Thank you for the questions. So I'd like to respond to those questions.\n\n**Moderator**\nFirst, about the game margins. For Q1, mainly what drove the margins was third party software and network service and also decline in acquisition costs and decline in SG and A cost. So the margin as a whole going forward, the factors that will drive the margins, there are two major parts. One is network service and the other is first party studio contents. Structurally, those would those should lead to improvement of margin.\n\n**Moderator**\nFor Network Service, the number of subscribers increasing and ARPU rising and shift to higher tier and the optimization of content acquisition costs. These are things we're working on diligently. So structurally, they should contribute to the margin. The other thing is about the first party contents. And as you point out, not everything is going well.\n\n**Moderator**\nBut this fiscal year, well, compared to fiscal twenty twenty four, first party is seeing higher revenue and profit and that will contribute to higher margins. Our first party portfolio, if that should stabilize, then we think that margin increase will be sustainable. Second question about Marathon and also live service game, the overall status. Last year, Concorde and this year, Marathon was postponed. So somewhat negative news has been coming out.\n\n**Moderator**\nBut if you look at the past five years, five years ago, live service games was almost nonexistent for the PlayStation Studios. We have held Diver two MLD and GT7 and Bungie's Destiny two. So we have these four live services contributing to sales and profit in a stable manner. For Q1, live service ratio was about 40%. For the full year, it's a little less, probably between 20% to 30%.\n\n**Moderator**\nSo in terms of the transformation, it's not entirely going smoothly. But from a longer term perspective, if you look at the changes over five years, you see that there has definitely been a change. Of course, we recognize that there are still issues, many issues. So we should learn the lessons from mistakes and make sure that we introduce live service content where there is less waste and it's more smooth. So that's all for myself.\n\n**Moderator**\nSMBC Nikko Securities, Katsura san, you are up next. Thank you very much for the opportunity. This is Katsura from SMBC Nikko Securities. I do have two questions and tariff related and also your revision to the forecast for this fiscal year. With regards to the first question about the tariff, this is just confirmation.\n\n**Moderator**\nIn 1Q I mean, the quarter one, basically, $110,000,000,000. And then so this has been already factored in by each segment. And so basically, in all segments, I think the negative impact has been reduced. And so I just want to confirm that. And then also the second question is about the full year forecast.\n\n**Moderator**\nAnd the gaming is improving 20,000,000 yen and then also tariff impact has been reduced by 30,000,000,000 yen And I think those are the main changes that you have made. But for game area, and there is an upward performance in Q1, But compared to that, I think the revision is smaller than the outperformance, but maybe that is not limited to Q1 or the full year. But and also for Music Area, FGO and then also Damien Sayer and there are positive profit drivers, but it seems that you seems to be more conservative and cautious in terms of the full year forecast. And then while so can you talk to me about your thinking about the revision from the macro perspective? So the first question, Hori san will take that on.\n\n**Moderator**\nAnd then second question will be answered by me. Thank you very much for your question. So with regards to the tariff, and then your understanding is correct, and in Q1, and basically, the impact was already included in the actual performance on the P and L of each business for the full year, and JPY 70,000,000,000 is basically is viewed at the company level. And as we continue to see a progress in the actual performance, and I think it would be more difficult to really for the head office to really observe that impact. But for the Q1 announcement, and yes, you are right about that and in terms of thinking, and that's all I wanted to say.\n\n**Moderator**\nThe second question for the full year forecast and then thinking behind that. And for Game in Q1, and we see a really outperformance in profit. And for the full year, and basically, we made upward revision by JPY 20,000,000,000. And thinking about the positive drivers, Network Service and then also the positive impact of the ForEx. And also, as was mentioned, the first party game because of the delay of the launch of a marathon, which had a negative impact on the profit and then that is also partially offset, so that's why we made an upward revision by 20,000,000,000 yen in profit.\n\n**Moderator**\nAnd then for Music, and there are a number of hits, fortunately, but again, the impact on the overall business has been rather limited and the blockbuster like Daemon Slayer, basically expect that there will be a huge shift from the beginning of the year. So that's why that is not a factor for the revision this time. And also, in Sony Group overall, from Q2 onward, The U. S. Tariff impact will be felt more pronouncedly and then also there will be more uncertainties.\n\n**Moderator**\nSo in Q1, and we had a really good performance, but from Q2 onward, we need to we are more conservative and we need to be we need to take more cautious approach.\n\n**Moderator**\nWe have a little time remaining. So we would like to accept one question each from two people. Okazaki san from Nomura Securities. Please go ahead. So this is Okazaki from Nomura.\n\n**Moderator**\nI have a question on game. To the revision of production basis to respond to U. S. Tariffs, you said you have completed this within this quarter. So where are the games sold in U.\n\n**Moderator**\nS. Produced now? And also the cost, I think, will influence the sales. So I would like to hear about the pricing strategy of game consoles. Okay.\n\n**Moderator**\nI would like to respond. So about gaming consoles, so we are diversifying our supply chain. As for consoles, we have already transformed the production. And if we include peripherals, so the transfer to outside China, we will be completing that by the end of the first half. Hardware sold in The U.\n\n**Moderator**\nS. Are now sourced outside China. About the pricing strategy of hardware, so that is really pertains to our future competitive strategy. So it's very difficult to comment on this. But the overall thinking is the our annual profit and lifetime value and also the sell in volume and the expected content sales going forward.\n\n**Moderator**\nSo all these factors will be considered as well as the receptiveness of the consumers to prices. So we would like to flexibly decide on the prices.\n\n**Moderator**\nFinal question from JPMorgan Securities. Kaede san, please. Ayada san, do you hear? Ayada from JPMorgan. Can you hear?\n\n**Moderator**\nYes. Thank you. You say one question, so maybe it's a difficult question for you to respond to. And it overlaps with the previous question, but I want to come back to this. For I and SS, for North America, there's this biggest customer.\n\n**Moderator**\nAnd as a part of its effort to increase procurement from The U. S, they've officially made a comment that they're going to procure chips from a Korean supplier. In that context, as a general matter, in enhancing product competitiveness, you're going to try to maintain your positioning. But that context itself may not be valid. Just by your competitiveness, you may not be able to absorb those changes.\n\n**Moderator**\nSo what I want to ask about is inclusive of those things, this kind of situation, has it been considered as a risk? And have you been making preparations or simulations that this could happen as a risk? In terms of timing, it may be somewhat into the future. Maybe you have some preparation period of several years. And during that time, you will be able to come up with countermeasures.\n\n**Moderator**\nSo I think this will relate to capital expenditure plans. So please respond to the extent possible. Thank you for the question. So Hori will respond. Thank you for the question.\n\n**Moderator**\nYes, this situation, had we foreseen this and taken measures? Well, partly, we had considered this and assumed this, but it's not that we have answers to all parts of this. Now it's just this morning that this was reported, so we have to check about the accuracy of the reporting and we'll be debating internally based on that. This is an issue of that kind of nature. So as of now, I'd like to limit my comment to that extent.\n\n**Moderator**\nSo with that, we'd like to conclude Sony Group earnings announcement meeting. Thank you so much for joining us today.",
      "fetched_at": "2026-02-04T15:54:45.983Z"
    },
    {
      "ticker": "6758.T",
      "title": "SONY GROUP CORPORATION (6758.T) Q4 FY2025 earnings call transcript",
      "published_date": "May 14, 2025, 4:00 PM GMT+9",
      "fiscal_year": "2025",
      "quarter": "Q4",
      "url": "https://finance.yahoo.com/quote/6758.T/earnings/6758.T-Q4-2025-earnings_call-314359.html",
      "content": "**Moderator**\nThank you very much for coming to attend our desk meeting despite of your busy schedule. Now we'd like to start Sony Group Corporation's Corporate Strategy and Earnings Announcement Presentation twenty twenty five. I'm going to serve FMC. My name is Yitsi from PR department. Thank you very much.\n\n**Moderator**\nFirst, I'd like to invite President and CEO of Sony Group Corporation, Mr. Todoki. He will be talking about the corporate strategy for Sony Group Corporation. Then I will invite Ms. Tao and Mr. Yamada. They will be talking about FY 'twenty four earnings and results and FY 'twenty five results forecast. And then after that, we are going to entertain questions. Are expecting the total of ninety minutes to complete the entire session. Dorok san, please, the floor is yours.\n\n**Moderator**\nLadies and gentlemen, thank you very much for coming. Today, first, I would like to talk about I'd like to first like to commit to long term look at TALMY Group's business and our overall strategic direction. Over the last several years, our business direction has shifted significantly towards entertainment. The decision to lean more heavily into the space was driven, of course, by the strength and growth of our entertainment businesses. But it also was driven by the power of entertainment to move people and to fill the world with emotion, which is, of course, at the heart of Sunny Group's purpose.\n\n**Moderator**\nIn recent years, we have leaned heavily into expanding content in each category such as games, music, film and TV program. IP expansion across our various businesses, strategic investments in content, music catalogs and growth areas such as anime and the development and use of innovative technologies to support creation. All of which has been transformative for the Sunny Group and it has led to very strong results disclosed today. Looking at those results, it is worth noting that our entertainment business accounts for roughly 61% of our consolidated sales. And we have seen the resilience of entertainment businesses during economic downturn like during the COVID nineteen pandemic.\n\n**Moderator**\nOur efforts in entertainment content and creation technologies are working steadily, and our priorities and commitment to growing these categories remain unchanged. Building on our momentum and results to date and working with a laser like focus to realize our long term creative entertainment vision will be at the core of our corporate strategies moving forward. Launched last year, a long term creative entertainment vision illustrates how we want to deliver Kundle through creativity and technology. A vision of a future that will create infinite realities together with creators, partners and employees and through synergies among our various businesses. Let's take a look at the entertainment businesses that will be integral to making our creative entertainment vision a reality.\n\n**Moderator**\nFirst, the game and network services segment, which is doing extremely well. Expansion of PlayStation five, both in the number of active users and per user spend is expected to continue and drive steady profit. As we look ahead, we will seek to capitalize on our momentum to drive sustainable, profitable growth and invest thoughtfully to create the future of play. We expect to see stable growth in revenue and profits from network businesses due to the growth of monthly active users, corresponding to the further and steady expansion of the installed base. Specifically, we will seek higher revenue and profits from PlayStation Plus and maximize ARPU, average revenue per user of PlayStation Store through the personalization and by pricing optimization.\n\n**Moderator**\nIn this fiscal year, we anticipate further growth in Studio businesses through a broader user base driven by new title launches from narrative based single player titles like Ghost of Yotei and live service games such as Marathon as well as continuing success of already launched catalog contents and ongoing live services titles like Helldivers two and Destiny two. We also plan to focus on stronger profitable peripherals such as PlayStation Portal, where our recently introduced beta cloud streaming feature allows users to enjoy their games on the go more easily. In the Music segment, we remain focused on strengthening our position in the global music market while continuing to improve profitability. Maintaining strong relationships with digital streaming platforms, Sunny Music Group has had great success enhancing its core business value proposition, which includes repertoire centers in major markets around the world, robust label and artist services, tailored service to independent artists and DIY distribution and music publishing. In FY 2024, our music business in Japan notably enjoyed great success in bringing Japanese artists such as Yusobi to the global market and plan to continue to build on this area.\n\n**Moderator**\nAs we look ahead in this segment, we plan to continue to strengthen these important ecosystems and focus on growing organically and via deliberate acquisitions throughout our business and in high growth markets such as Latin America, India and other Asian countries exploring additional strategic investments in key areas of business as well as music catalogs to expand revenue opportunities and increase asset value discovering and nurturing talent as well as building and strengthening relationships with local independent labels and artists to enhance our presence. Servicing fans who passionately support specific artists and content. And expanding IP through biopics and documentaries involving Sony Music artists as well as live events. And finally, we will continue exploring the use of cutting edge technologies such as AI in ways that create value and also protect the rights of our artists. The film industry overall continues to recover from issues such as the COVID nineteen and strike related shutdowns over the last few years, which impacted the number of film and TV productions.\n\n**Moderator**\nOur film business, like the rest of Hollywood, continues to rebuild from these events and has some new titles on the horizon as was presented at the most recent recent Cinemap con event. In 2026, Sony Pictures Entertainment expects to see the release of the latest Spider Man movie, Spider Man Brand New Day, as well as new film adaptation of the Capcom game Resident Evil and the latest Jumanji film. We expect some IP lineups to continue including the final film in the Spider Verse animated trilogy, Spider Man Beyond the Spider Verse in 2027 and The Biggles, a full film cinematic event directed by Sam Mendes with exclusively hit theaters in 2028. Anime is also expected to be a significant growth driver for the Pictures segment as the anime focused streaming service, Crunchyroll steadily expands its paid subscribers and services. But more broadly, as we look ahead, we see SPE as a central hub for many of the synergistic cross company collaborations that are central to our creative entertainment vision.\n\n**Moderator**\nIn recent years, we have seen the value and potential well executed cross business collaborations across the Sony Group companies. Examples include PlayStation productions, adaptation of our outstanding game IP such as Uncharted and The Last of Us to film and television with over 10 titles currently in production. Or the many collaborations among Sony Music artists and our other businesses and among Sony Technologies and many of our creative businesses. As we look ahead, we will lean into broader collaborations in anime. And through our engagement platform initiative, we will aim to create opportunities and synergies by connecting fan communities within and outside Sony across various entertainment sectors and in our location based entertainment efforts.\n\n**Moderator**\nAnime continues to be a major area which leads the growth for the Sony Group across many parts of our business. At the heart of everything is anime's vibrant creator and fan communities, which Crunchyroll will be celebrating later this month at its twenty twenty five Crunchyroll Anime Awards in Tokyo on the twenty fifth. Building on our already successful Aniplex and Crunchyroll businesses, we have moved forward with several initiatives over the last several months to expand our reach in anime and strengthen content development, including an upcoming anime series adaptation of Sony Interactive Entertainment's hit IP, Ghost of TSUCHIMA Legends to be produced in collaboration with PlayStation Productions, Aniplex Crunchyroll and Sony Music Entertainment. The establishment of Hayate Inc, a company jointly funded by Aniplex and Crunchyroll to plan and produce high quality anime works for global anime fans, a strategic capital and business alliance formed with Kadokawa Corporation to promote further media mixes and global expansion of both companies' IP and an establishment of a strategic partnership with brand Bandai Namco Holdings Inc. And Web3 startup Gaudi Inc.\n\n**Moderator**\nAnd as we look ahead, the anime industry's market size is expected to continue growing at a CAGR in the high single digits from 2023 to 02/1930, especially with the anime streaming market, which is Crunchyroll's core business that is expected to grow at a CAGR in the high 10% range by 02/1930. In this market environment, we also plan to further accelerate Crunchyroll's growth by enhancing service offerings and acquiring users. Our strategy is to broaden services offered to anime fans, which include e commerce for anime merchandise, a mobile game library service and manga offerings. To further expand Crunchyroll's user base, which has now grown to over 17,000,000 paid members as of 03/31/2025, we are closely collaborating with PlayStation Network, which has the largest monthly active users in the Sony Group. Specifically, since February, new customers and renewing customers can smoothly register for Crunchyroll's paid services from PS5, which we expect to contribute further increases in paid membership.\n\n**Moderator**\nWe will leverage PlayStation Network monetization capabilities to enhance Crunchyroll service. This back end integration is part of the engagement platform initiative introduced last year, which aims to create business opportunities and synergies by connecting diverse fan communities both within and outside Sony across various entertainment sectors. Based on the robust network infrastructure, PlayStation Network, we will utilize core back end functions such as payment, data infrastructure and security across various network services within the Sony Group aiming to build a new platform that connects users and creators by meeting fans' interests and desires. Alongside strengthening fan engagement, we also plan to enhance the development and operation of a common infrastructure that can be utilized across the Sony Group for better monetization. This will allow each company within the Group to focus resources on enhancing competitiveness and differentiation in their respective businesses, aiming for business growth through expanding and deepening customer engagement.\n\n**Moderator**\nLooking further into the future, we are at early stages in exploring the potentials of LBE to maximize the value of the IP across various entertainment sectors. Aspirational cross business collaborative efforts to date that merge IP and technology to create new experiences have all illustrated a growth potential for future. Up to this point, I have discussed growth and strategies within our entertainment businesses. But our innovative technology is also critically important for realizing our creative entertainment vision. In the Entertainment Technology and Services segment, we have shifted the focus of our business towards those that create content.\n\n**Moderator**\nBuilding on the success of Alpha, we are expanding our imaging ecosystem as a growth driver. This includes broadening offerings of tools and solutions for cinematographers, live streaming and remote workflow for industry leading creators and image authenticity technologies for news agencies. In addition, we also plan continue focus on technologies in growth areas such as sports entertainment. We acquired King Tracks last year to enhance our capabilities to utilize existing sports data like Hawkeye's officiating and play analysis and we plan to continue to expand alternative broadcast through sports data and real time content creation technology that enhance fan engagement and attract new audiences. To support the leap in entertainment, we also plan to continue to revolutionize content creation technology.\n\n**Moderator**\nKey solutions include Spatial Content Creation Support System XYN and real time VFX and three sixty virtual mixing environment, which is now expanding into sound creation for films, games and animation. Furthermore, in the Imaging and Sensing Solutions segment, we expect the image sensor as a key device for capturing the real world to enhance the accuracy of content creation and elevate the reality of entertainment experiences to the next level. For Mobile Image Sensors, which is the pillar of the business, we're expecting the ongoing trend towards larger sensor size to continue for the coming few years. The demand for further evolution in image sensor performance such as resolution, noise reduction, dynamic range and power consumption remains high. We will work to introduce a new generation process in order to accommodate the production of such innovative sensors.\n\n**Moderator**\nCombining this next generation process with sensors such as the two layer transistor pixel stacked Trista, we plan to continue delivering more value added differentiated sensors thereby meeting our customers' expectations. As we aim for further growth of the I and SS business in these ways, a major challenge will be controlling the necessary capital investments at an appropriate level and enhancing investment efficiency. To this end, we plan to explore a range of options. Beyond the Mobile Sensor business, we plan to continue generating stable profit through cameras and sensors for industrial equipment and social infrastructure For businesses with future growth potential such as automotive sensors, we aim for mid to long term growth and optimal development costs and frameworks, while carefully assessing the speed of market growth and business potential. In conclusion, the diversity of our business and our people will be of paramount importance in realizing our creative environment vision.\n\n**Moderator**\nSony has about 110,000 employees actively working in various companies and organizations around the world, creating an environment of diverse and varied viewpoints, ideas and strategies. The synergies generated by organically connecting diverse businesses and people are the source of Sony's unique competitive advantage. As we look ahead, we will continue to evolve, unleash the creativity of creators and strive for a world of infinite realities, entertainment and excitement. Thank you very much.\n\n**Moderator**\nThat was presentation by Hitodaki. And now we'd like to proceed to earnings announcement. Now I'd like to begin the FY 'twenty '4 financial results and FY 'twenty five financial results forecast. Allow me to introduce executives on stage. Sony Group, President and CEO, Hiroki Todoki Executive Officer, CFO, Lin Kao.\n\n**Moderator**\nSenior Vice President, Sattahiko Hayakawa. Sony Financial Group and Corporate Executive Officer, CFO, Kazuhiro Yamada. And first, mister Totoki, please. Now we'd like to proceed to explaining our earnings result and forecast. And from after, Lintel and Kaziro Yamada will be presenting.\n\n**Moderator**\nAnd Lintel has become CFO of our group from April excluding the Financial Services segment for FY 'twenty four were JPY 12,043,900,000,000.0 and operating income was JPY 1,276,600,000,000.0, both record highs. Operating cash flow was JPY 1,009 and 72,400,000,000.0, primarily due to an improvement compared to the previous fiscal year year on year in the working capital of the GNS and I and FS segments. Consolidated sales, including the Financial Services segments, were JPY 12,957,100,000,000.0. Operating income was JPY 1,407,200,000,000.0, and net income was JPY 1,141,600,000,000.0. The results by segment for FY 'twenty four are shown here.\n\n**Moderator**\nToday, at a meeting of our Board of Directors, we approved the plan for execution of the partial spin off of our Financial Services business. Person to disapproval, the financial results of the Financial Services business during the current fiscal year until the execution of the spin off will be classified as discontinued operation in our consolidated financial statements. At the time of execution of the spin off in October, an accounting treatment will be carried out to exclude the Financial Service business from consolidation and the assets and liabilities of the Financial Service business will be separated from the consolidated statements of financial positions. After the execution of the spin off, the profit and loss of the Financial Services business will be recorded as operating income or loss in continuing operations in the accordance with the equity method. In light of this, the results forecast for FY 'twenty '5 will be presented for continuing operations only and results forecast for Sony Financial Group will be disclosed at our earnings announcement before the execution of the spin off and at Sony XG's earnings announcement after the execution of spin off.\n\n**Moderator**\nAs we announced in our disclosure regarding the start of preparation for the spin off in February of last year, at the time of the deconsolidation of the Financial Service business, we plan to carry out an accounting treatment in accordance with the International Financial Reporting Standards to transfer in one lump sum the accumulated other comprehensive income of the Financial Service business, one lump sum the accumulated other comprehensive income of the Financial Service business recorded in the Equity section of the consolidated statements of the Financial Goodition to the profit and loss of the discontinued operation. Accumulated other comprehensive income for the Financial Service business as of the end of the past eight quarters has been trending as shown here. Although it is expected to fluctuate to a certain degree, going forward, an accounting loss is expected to be recorded in the discontinued operation based upon the account recorded at the time of the spin off. This accounting treatment is merely a transfer between line items in the equity section of the consolidated statement of the financial position, does not impair total equity and has no impact on the profit and loss of the continuing operations or our cash flow.\n\n**Moderator**\nMoreover, this transfer is an accounting treatment pertaining to the consolidated Sony that results from the deconsolidation of the Finance Service business and has no impact on to the consolidated financial position of Sony Financial Group. For more details, please refer to the materials regarding the spin off disclosed today. Now I will explain our full year results forecast for the continuing operations for FY 'twenty '5. The full year forecast is sales of JPY 11,700,000,000,000.0, operating income of JPY 1,380,000,000.00 before reflecting the impact of any additional U. S.\n\n**Moderator**\nTariff. Now I will explain the impact of U. S. Tariff policy. The situation surrounding around additional U.\n\n**Moderator**\nS. Tariff is changing daily and the future is uncertain. But GNS, ETNS and INS segments, which are currently expected to be impacted, are responding quickly to the additional tariffs that have already been implemented and are considering responses to multiple possible future scenarios. Under the tariff rate, we assumed we expect to be able to manage the impact on profitability of our continuing operations this fiscal year to approximately JPY 100,000,000,000 or less than 10% of the operating income forecast we just showed by stockpiling strategic inventory in The U. S, adjusting product shipment allocation on the global basis, raising price on certain products with an eye on market trends and other means.\n\n**Moderator**\nAnd we plan to continue to closely monitor the situation and take appropriate measures, and we expect to provide an update on the impact of our financial results at our first quarter earnings announcement in early August. The FY 'twenty five forecast for operating income of continuing operations incorporating this impact is flat year over year at JPY $1,280,000,000,000, while net income is expected to decrease 13% to JPY $930,000,000,000, primarily because the valuation gains on equity securities and the decrease in tax expenses we recorded in the previous fiscal year will not recur. Our forecast for the operating cash flow is JPY $1,240,000,000,000, primarily due to a normalization of the working capital in G and NS resulting from the significant improvement in the previous fiscal year and expected increase in margin picture production costs. The forecast for each segment is shown here. Now I will move to the I'll move on to provide an overview of each business.\n\n**Moderator**\nFirst one is G and NS. FY twenty twenty four sales increased 9% year on year to JPY 670,000,004,000, primarily due to an increase in third party software sales and the impact of foreign exchange rates. The operating income increased 43% year on year to JPY 414,800,000,000.0, a new record for the segment due to increase in all categories except for first party software. User engagement in the FY 'twenty four fourth quarter continued its strong momentum with the number of monthly active users across PlayStation in March, increasing 5% compared to the same month of the previous year to 124,000,000 accounts. And third party software and network service revenue increasing year on year.\n\n**Moderator**\nOur full year forecast for FY 'twenty five is sales of JPY 4,300,000,000.0 and operating income of JPY $480,000,000,000. In addition to the stable profit growth for the platform business from the extended user base, we expect major first party titles scheduled to release this fiscal year to contribute to sales and profit. To respond to the recently adopted U. S. Tariffs, we have been making preparations such as diversifying PS5 hardware production sites and stockpiling inventory in The U.\n\n**Moderator**\nS, and we expect to implement additional measures at the appropriate time after assessing any changes in the situation going forward. Next is the Music segment. FY 'twenty four sales increased 14% year on year to JPY 1,842,600,000,000.0 and operating income increased 18% to JPY 357,300,000,000.0, a new record high for this segment. On a U. S.\n\n**Moderator**\nDollar basis, the growth rate of streaming revenues for FY 'twenty four increased 5% year on year in recorded music and 13% in music publishing. Our full year forecast for FY '20 '20 '5 is sales of JPY $1,850,000,000,000 and operating income of $355,000,000,000, Primarily due to the negative impact of ForEx, we expect operating income for the segment to be essentially flat year on year, but we expect the operating income of Sony Music Group, managing our overseas music business to grow in the high single digits on a U. S. Dollar basis. Next is the Pictures segment.\n\n**Moderator**\nDespite a decrease in sales in television productions, FY 'twenty four sales increased slightly year on year to 1,505,900,000,000.0 yen primarily due to ForEx impact. Operating income was essentially flat year on year at 117,300,000,000.0 yen primarily due to impact of the lower sales as mainly offset by the positive impact of ForEx. Our full year forecast for FY 'twenty five is sales JPY 1,500,000,000.0, operating income JPY 125,000,000,000. We expect operating income to grow approximately 10% year on year on a U. S.\n\n**Moderator**\nDollar basis, excluding impact of ForEx, primarily driven by Crunchyroll. Next is the ET and S segment. FY 'twenty four sales decreased 2% year on year to JPY 2,409,300,000,000.0, primarily due to a decrease in unit sales of televisions and smartphones. Despite the impact of a sales decrease and additional restructuring charges in FY24 Q4, operating income increased 2% year on year to JPY 190,900,000,000.0, primarily due to operational expense reduction. The interchangeable lens camera market performed well in FY24 Q4 mainly in the Chinese market, which benefited from subsidies and grew approximately 9% year on year on a unit basis.\n\n**Moderator**\nOur full year forecast for FY '20 '20 '5 is sales of JPY 280,000,002,000 and operating income This fiscal year, we plan to operate our business conservatively, prioritizing risk mitigation because we anticipate disruptions to markets and supply chains by recently adopted U. S. Tariffs. Next is I and SS segment.\n\n**Moderator**\nFY 'twenty four sales increased 12% year on year to JPY 1,799,000,000,000.000, primarily due to the impact of ForEx and increased sales of mobile sensors. Despite an increase in manufacturing expenses, operating income increased 35 year on year to JPY 261,100,000,000.0, primarily due to favorable impact of ForEx. The benefit of increase in sales and improved manufacturing yields, both sales and operating income were recognized of the segment. Customer demand remained strong in FY 'twenty four Q4 and design ins for 2025 models are progressing smoothly. Our full year FY 2025 forecast is sales of JPY 1,960,000,000.00 and operating income of JPY $280,000,000,000.\n\n**Moderator**\nIn FY 2025, we expect to achieve growth in sales and profit primarily due to an expansion of mobile sensor sizes despite expected appreciation of the yen compared to FY 'twenty four. So far, we have not seen any changes in our customers' order prospects due to additional U. S. Tariff impact.\n\n**Moderator**\nNext is the Financial Services segment. Financial Services revenues for FY 'twenty four decreased JPY 8 and 38,600,000,000.0 year on year to JPY 9 and 31,400,000,000.0, primarily due to a decrease in net gains on investments at Sony Life. Operating income decreased JPY 43,000,000,000 year on year to JPY 130,500,000,000.0, primarily due to the recording of a gain from the transfer of a portion of the shares of Sony Payment Services Inc. In the fiscal year ended 03/31/2024 and a decrease in profit related to minimum guarantees for variable life insurance at Sony Life due to market fluctuations in FY24. Sony Life's new policy amount in FY24 increased 11% year on year continuing its steady growth.\n\n**Moderator**\nNext, I will explain Sony Financial Group's FY 'twenty five forecast. Starting with this announcement, in view of the Financial Services revenue we had before, we are disclosing operating revenue excluding a portion of gains on investments as a sales metric. As for profit metric in lieu of operating income, we are presenting income before income taxes and adjusted net income, which is net income excluding unrealized gains and losses due to market fluctuations, gains and losses on sales of securities and other onetime gains and losses. Of the profit metrics, we have established adjusted net income as the most important key performance indicator because we believe it more appropriately reflects the profitability of our business. For FY 2025, we expect operating revenue to be JPY 1,000,000,000,000 adjusted net income to increase JPY 46,000,000,000 year on year JPY107.5 billion and income before income to decrease JPY70.8 billion year on year to JPY60 billion.\n\n**Moderator**\nDuring the current fiscal year, in order to strengthen Sony Life's financial position, which we have been working on and to delve deeper and make significant progress reducing risks resulting from policy cancellation, we plan to replace yen denominated long term bonds and reinsure a block of our U. S. Dollar denominated whole life insurance policies, which have a high capital load. As a result, we plan to sell surplus U. S.\n\n**Moderator**\nDollar denominated bond assets to cover our declining insurance liabilities and income before income taxes is expected to decrease significantly for the next two years, mainly due to the impact of gains and losses on these sales. This series of measures is expected to significantly improve the ratio of duration matching of yen denominated assets and liabilities, which account for the majority of our balance sheet significantly reduced policy cancellation risk associated with U. S. Dollar denominated insurance and increased our level of ESR to a certain degree. Driven by factors such as an increase in the new policy amount, Sony Life's adjusted net income is growing steadily and distributable amount, which leads to shareholder value expected to remain stable.\n\n**Moderator**\nIn preparation for the spin off and listing, we will hold the Financial Services Investor Day on May 29. In addition to providing more detail on the measures for improving our financial position that we explained today, we plan to discuss Sony FG's strengths, business plan and the listing structure for the spin off, so please watch it. Finally, I would like to explain the progress of our fifth mid range plan. The key performance indicators for the entire group in this MRP, growth rate of operating income of a continuing operation of 10% or more and a three year cumulative operating income margin of continuing operations of 10% or more. In FY 'twenty four, GNNS and I and S segments were the main drivers of profit growth, leading to overall operating income growth of 23% year on year and an operating income margin of 10.6%, giving us a very good start at the first fiscal year of the MRP.\n\n**Moderator**\nThe full year operating income forecast for FY 'twenty five, which incorporates the impact of tariffs as that we presented today shows a two year cumulative average growth rate of 11% and operating income margin of 10.8%. Although the environment remains uncertain, we believe that we are on track to achieve our targets. Regarding capital allocation for the period of the current MRP, we have revised our forecast for cumulative three year operating cash flow, which is our main source of capital from the initial plan of 4,500,000,000,000.0 yen to 4,800,000,000,000.0 yen taking into account the results of the previous fiscal year. We have made strengthening shareholder returns a priority for the MRP, so we intend to use the current increase in allocatable capital for greater shareholder returns. For FY 'twenty five, we have established a $250,000,000,000 yen share buyback facility and aim to increase the pace of our increase in dividends, raising the annual dividend by JPY 5 per share year on year after the stock split to JPY 25 per share.\n\n**Moderator**\nOur strategic investments budget of JPY 1,800,000,000,000.0 and capital expenditures budget of JPY 1,700,000,000,000.0 remain unchanged from the pre original plan. Given that the business environment is uncertain, including the impact of additional U. S. Tariffs and concerns about the global economic slowdown. Going forward, we plan to operate our business this fiscal year under cautious and conservative assumption.\n\n**Moderator**\nIf there are significant changes in the business environment going forward, we plan to swiftly and flexibly revise the capital allocation plan we have presented this time. That is all for now. Thank you.\n\n**Moderator**\nSo that has been the briefing from Tao san and Yamada san. So at 04:45, we'd like to start a Q and A session for Media. And then maybe around 05:10, we are going to solicit questions from the investors and analysts. We are expecting twenty minutes for each section. For Online Distribution, you some of you who have already registered the questions, please click the link to participate on the webinar.\n\n**Moderator**\nAnd regarding how to raise questions and some hosting announcements, please refer to the information which we have already sent to you. So please be patient until we resume. Thank you. It's a bit too early, but we'd like to answer to the questions coming from the media. And if you have questions from this room, please raise your hands physically.\n\n**Moderator**\nAnd in this room, please make sure that you use a microphone. Please give up to two questions maximum. Okay. So if you have any questions, please. Okay.\n\n**Moderator**\nSo from this block, please. I am Yoshida from Nikkei Newspaper. I have two questions. The first question is the question to Totoki san. For entertainment, the fusion of the entertainment businesses have been ongoing and also trying to have the live shooting of the game and also the animation is also booming.\n\n**Moderator**\nWell, for each segment, the speed of the collaboration or alliance amongst the different segments within this entertainment, how do you see that progress? And also goes over to Sima, the first party animation, first party game animation. This is maybe one significant milestone. So yes, for the future, how many animations you are going to expect to produce? And also if you have any business target that will be disclosable, please?\n\n**Moderator**\nAnd next question is to Tao san. JPY one hundred billion is your impact for the additional tariff and semiconductor has not been changed. But those JPY 100,000,000,000, the major segments, what kind of businesses are included in this JPY 100,000,000,000 impact? And also into the future, maybe there are some factors for fluctuations such as ForEx. What kind of valuable factors you are assuming for this impact?\n\n**Moderator**\nYes. Thank you. Thank you very much. To the first question, the synergy of the entertainment businesses. You talk about you asked me about the speed, sense of the speed.\n\n**Moderator**\nWell, think, yes, we have been accelerating the project. Why? This is because, yes, it was a top down direction. So for the entire group direction, we are trying to move with these projects. But now we are making bottom up to produce different projects.\n\n**Moderator**\nSo now we are on this phase, which is the most important element. As business management, what we can do is trying to set up the environment. So synergy is only produced from the bottom up approach. So once we start to see multiple project based upon the bottom up approach, that will be the desirable and that will be the source of competitiveness. Well, yes, in terms of the acceleration, I'm sure that we are going to be able to accelerate.\n\n**Moderator**\nAnd of course, each business has to be strong and each segment has to have good materials or good production projects. So each segment has to be stronger, of course. And regarding the animation, think that this is not just limited to the animation, but right now, over 10 titles, we already made them to the TV programs and also to the movies or films. And through the IPs, we are now producing those art pieces. So the pipeline is going to be bigger and that is really important.\n\n**Moderator**\nTao san, please. Yes. Regarding the tariff, let me answer to the tariff question. JPY 100,000,000,000 impact have been it's assuming the official tariff rate, which has been announced in hardware. Hardware business is included in this. In terms of our portfolio, GNS, Gain and also AT and S and I and SS, semiconductors. So those three segments, we are actually incorporating on par basis from these three businesses. In terms of the tariff, we are not just simply calculating the simple tariff to come up with JPY 100,000,000,000, but thinking about the currently available information and also looking at the market trend, we may pass to the price and also shipment allocation.\n\n**Moderator**\nSo we are taking a different measures in managing to come up to the JPY 100,000,000,000 impact. That's what we are thinking. Thank you very much. Maybe to add, well, the May 12 U. S.\n\n**Moderator**\nHas additional tariff reduction for China. Maybe this JPY 100,000,000,000 is not reflecting that tariff reduction between China and U. S. Next question please. Those are questions.\n\n**Moderator**\nPlease raise your hand. The person in gray, the gray shirt over here please. Yamamoto, a freelance writer. I have two questions to Mr. Todoki.\n\n**Moderator**\nThe first is about LBE, Location Based Entertainment and the outlook. I at the CS, the I have been today and enjoy the immersive entertainment. But the LBE, think they are temporary mostly in the past. But how will this evolve in the future? What is aiming what is Sony aiming to achieve?\n\n**Moderator**\nFor example, entertainment technology and I think this will be a showcase to a contact point with the consumer. And I think it's very important that you promote LBE. So I'm wondering whether you have more permanent LBE instead of one time or temporary. So what is your outlook? If any, please share that with us.\n\n**Moderator**\nAnd the second, if I may, the second question is about creation of new businesses at Sony. There's Sony acceleration platform, which is being promoted for to create new businesses. And what is the outlook of the outputs outcome? And what is your expectation going forward, please? First, about LBE.\n\n**Moderator**\nWell, to be honest, we are still searching for different possibilities, but we are doing a lot of attempts, not just in Japan, but also overseas. Well, we take certain risks in some cases or it could be that as a licensor, we do using the license, the LBE simulator types of experiments. So that is what we're doing right now. However, as for myself, as you say rightly, in order to expand our IP, this LBE will be a very effective tool and it goes beyond generations. I think we can come up with things that people of all generations would love because this going to these events with with family is something that we should be pursuing.\n\n**Moderator**\nBut we cannot leapfrog. And for example, think of something like a theme park, investing and creating a theme park on our own. We're not thinking of any such thing. In order to reach that level, we have to think of which pathway to take. And we have to think about the optimum pathway.\n\n**Moderator**\nWe also are trying to verify this. And together with partners, different partners, we have to work on this. So we are searching for such collaboration right now. And in regards to creating new businesses, well, a recent outcome in 2024 from April, Sony thermal technology, there is this device to cool down your body. And well, it's very hot in the summer these days.\n\n**Moderator**\nSo this device itself is increasing in sales year on year. So as the business is already been established. And well, this week, I received a report that they are growing their sales. So I'm looking forward to the future. SAP, well, rather than doing incubation on its own, they're trying to offer to companies aiming to become a grower and to do incubation provide the hardware or tools to do the incubation. So through such initiatives, both inside and outside Hosoni, we want to create new businesses. If we can do that, that will make us very happy. Thank you.\n\n**Moderator**\nAny other questions? In the central central block, the second from the right, the person in the very front row. Kuraninsaki from Sankake Shimbun. I want to ask about strategy to mister Totoki. So based on Trump tariffs, automobile manufacturers and electronics electricity manufacturers are shifting to manufacturing producing in The US.\n\n**Moderator**\nWell, the business model, I think it's going to change going forward. Sony, I think has already started to started doing this in entertainment segment. Are you thinking of producing in The U. S, for example, locally? Now even though you don't become a platformer, you may have a good IP.\n\n**Moderator**\nSo maybe that might be very beneficial and advantageous to you. Thank you for the question. Yes, producing manufacturing locally. In the entertainment, rather than saying for entertainment segment, I want to look at it from the hardware segment and the software segment. And in entertainment gaming like consoles, these hardwares of course can be produced locally.\n\n**Moderator**\nI think that would be an efficient strategy. But PS5 is being manufactured in many areas, whether it's going to be manufactured in The U. S. Or not, it needs to be considered going forward. We're not in such a critical situation.\n\n**Moderator**\nIn the entertainment segment, especially contents creation, recently in the movies. Well, Mr. Trump is saying that he's going to have a % tariff on films which are not produced, made in The United States that was announced. But that is still pending apparently. So these are some of the movements that we need to consider.\n\n**Moderator**\nRegarding entertainment, if you take films, pictures for example, of course locations are being made in various areas and it is all put together as a story. And there are pictures that are filmed outside of The US because the Hollywood cost has gone up, skyrocketed. So it's not so much a US problem, but rather it's an issue that is specific to the state of California. So as for content, we don't know how it will evolve. So we are paying attention, close attention to the trends.\n\n**Moderator**\nNow whether we're going to become a platformer or not, As I explained today, Crunchyroll itself is a platform. And SIE, PlayStation is a giant platformer for games. So we are general contents. We don't do general contents production, but we do have several platforms. So how can we strengthen that and expand that?\n\n**Moderator**\nI think that will be an important topic going forward.\n\n**Moderator**\nNext question, please. Okay. So the central block, the person on the right hand side, please. Thank you. Tuchiya from Asaki newspaper.\n\n**Moderator**\nI have two questions to Totoki san. The first question is a bit of the ambiguous, a broad question regarding the Trump tariff and also ForEx is getting yen appreciation. So the do you feel any deceleration of the growth right now? That's the first question. And the second question is, yes, you talked about the spin off of the Financial Services business.\n\n**Moderator**\nSo not just linked to the Financial Services, but let's say, the Semiconductors and other segments, do you plan to kind of a spin off of the other segments? Do you have the idea that other segments will be spun off? Those are the two questions. Thank you very much for the question. To the first question regarding the sense of growth or economic situation.\n\n**Moderator**\nYes, we have been watching how things are evolving. But if do we have any major change right now? Well, as far as our business is concerned, we are not really seeing a big change. However, maybe, yes, there is usually a little bit of time lag when we start to see some deceleration. So that's what we have to be watching for.\n\n**Moderator**\nAnd maybe the employment is going to be the first indicator, especially in The U. S, the employment situation is something which we are watching for. That's our first answer. And to your second things about the business portfolio. Well, spin off is tending to attract a lot of attention, but this is just one of the methodologies.\n\n**Moderator**\nAnd what we want to do is most important, more important. Well, yes, the business portfolio is always dynamic, not the static, but it's always dynamic. What we have to think about is as entire Sony and also its business segments, how each segment is able to grow to the maximum level. That's something which we have to think about. In the Financial Services business, the solution, we decided to spin off that business.\n\n**Moderator**\nOther business segments, do we have any plans? We do not have the plans to spin off the other segments. But as necessary, we have to think about the different options. Maybe one of the options on the table. So that's what I can say.\n\n**Moderator**\nBut as of now, for the short term, are we going to think about any spin off? No, that's the question. Thank you. And time is limited. So the next will be the last question.\n\n**Moderator**\nThe person in the center, the front row, this person is from second from the left, my left. Toyo Kezai Umegaki is my name. I have two questions. Think it will be mainly Takatsu san, but the anime business, Aniplex and Crunchyroll, they are crossing over two segments. And how much contribution are they making to your profitability?\n\n**Moderator**\nIt's hard to see as an outsider. You spend a lot of time explaining about this today as well. So what is the size of the profit? How much growth you're expecting? Can you quantify to the best means possible?\n\n**Moderator**\nAnd well, it might be that it'd be better to make it into one business segment because the person like me who's looking into the business performance is easier for me to understand. Yes. Thank you for your question and comment. Yes. Well, Annie Plex is in the music segment and Crunchyroll is in the film segment.\n\n**Moderator**\nBut we are not disclosing the performance of each company. I and but the debt to the best means possible, in our explanation of the different business segments, we try to convey this to you, communicate this to you. Once it reaches a certain size, yes, I took your comment that it might be better to reorganize. Well, yes, that is one way of thinking. But not just for the sake of people understanding our business forecast that should we do such things.\n\n**Moderator**\nInstead, we have to think about the motivation of the organization and the expertise of the people working there. We always have to think about the optimum way. And we will keep in mind such options. But at this point in time, we do not have any plans to make any changes to the organization. And the second is about INSS.\n\n**Moderator**\nWell, the profit has increased this year, but you talked about reviewing investment. So are there any thoughts on this plus? And also the automobile sensor, the mid- to long term growth, I think that you've included this. So what is your outlook of the market growth and the overall outlook? Thank you.\n\n**Moderator**\nWell, about the investment, we are always thinking about this. But in my speech, I did touch on this briefly. But we have to think of the long run and think about the sensitive evolution from in the long run because we have to invest in manufacturing. And this investment, how should we implement the investment is something of importance to us. And are we going to do it 100% alone or are we going to invite an investment partner or like Hublight.\n\n**Moderator**\nSo there are different options. So at what time we execute is something that we are always thinking about. We have to think about investment and also our capability. So this is also the positioning of the market. So we have to think about the optimum option.\n\n**Moderator**\nAnd about the automobile sensors, automobile sensors as the market is growing. But, yes, growth is significant in, as you know, Chinese OEM EVs, electric vehicles. But the Chinese OEM electric vehicles, there's fierce competition. And it's only after surviving that competition, if they have extra capacity, they go overseas. And therefore, they are very strict about pricing.\n\n**Moderator**\nThe automobile sensor market is growing in size, but we have to keep an eye on these developments because it's not a business necessarily where you can expect a large margin and large profitability. Having said so, rather than saying our outlook has changed, we are updating the market trend and think about our business alliance and make adjustments in our strategy. That is the way we look at it. Thank you.\n\n**Moderator**\nThis concludes the questions from the media. The questions from the investors and analysts will start at 05:10, five eight, excuse me. Next, we'd like to move on to the question and answer session with investors and analysts. This is Kondo from the IR Group. I'll be the moderator.\n\n**Moderator**\nFor those of you participating online, please click the raise hand button on your Webex screen. If you have any questions in this room, please raise your hand and we will bring a microphone. Two questions limited to each person. Anyone would like to ask a question? The second row on the right hand side from the MCs and moderators side.\n\n**Moderator**\nHiya Kawawa from Innovation Investment. First about the gains. The first question, in the strategic presentation, I think you are trying to increase the monthly users and this is increasing quarter by quarter. This monthly active users, why is it increasing? And how do you plan to continue increasing that going forward?\n\n**Moderator**\nCan you please elaborate on that point? Especially in 2026 and 2027, I think the sales of the consoles are going to go down. Therefore, I want to know about this. And may I answer each one of your questions? So on the Game and Network Service, I'd like to ask Tao san to respond to that question. MAU, during the past fourteen quarters, it's always has been positive year on year. The generation evolving from PS4 to PS5, we've seen some changes. Rather than changing from one generation to the next generation, PS4 continues to be used actively. I think that is one of the most conspicuous differences. So going forward, every year, PS5 sales will continue to increase and transition from PS4 to PS5 may happen.\n\n**Moderator**\nHowever, many of the users are new users. So in the future MAU, I believe will continue to increase. I have that confidence. Thank you very much. The second question about the console sales.\n\n**Moderator**\nIn the Q4, the sales was 2,800,000.0 yen which was slightly less than Q3. But Q4, if you think about the tariff, think maybe you should have brought it forward. But this Q4, point 8,000,000 units, when you compare that to your domestic plans and also the 2026 console sales, what kind of plans do you have for the 2026 console sales? Yes, the Q4 unit sales, it was as expected. Q3, as you know, was the holiday season.\n\n**Moderator**\nSo of course the sales was very high. Including promotion, we had new titles and it was the most active season. Q4 in terms of the season, I think it was more composed. So the numbers, the units, it was as expected. Now about this year sales, This is a domestic image.\n\n**Moderator**\nIt's 15,000,000 unit sales is what we are anticipating. So it's not that we have a very strong intention because there are a lot of tariffs and uncertain issues around the environment. So rather than looking for the unit sales, we want to look at the entire market and try to have a flexible approach to the shipment. Thank you.\n\n**Moderator**\nNext question, please. If you have a question, please raise your hands. Now the third row from the front on the right hand side block. I am Ayato from JPMorgan Securities. I have two questions.\n\n**Moderator**\nThe first question is regarding the impact of the tariff JPY 100,000,000,000. Well, yes, assumption, let's say, if the assumption continues for the next fiscal year, this JPY 100,000,000,000 impact is expected for the next fiscal year. So yes, it will be pushing down by JPY 100,000,000,000 for the next year or by implementing some of the actions, you may be able to reduce this impact or maybe gain agendas, I understand, yes, I'm sure those are the segments which are impacted by the tariff. But maybe thinking about time line of the actions, maybe there are some segments which have more difficulties in taking those measures and having a less impact. Would you please talk about that?\n\n**Moderator**\nOkay. To that question, let me answer to the question. Well, we do not have a specific simulation, but the measures which we are already implementing on top of the measures, we may have to implement other measures so that we can minimize the impact. That could be the reality. So how we are going to take those actions or measures?\n\n**Moderator**\nWell, usually, we have to reduce the fixed cost. And yes, trying to be competitive. This is leading to the more competitiveness. So maybe we have to do it. Of course, we have to do it.\n\n**Moderator**\nAnd of course, the shipment from where we are going to make the shipment, that is also a huge impact factor. So thinking about the flexibility of supply chain, we have to refine and adjust the supply chain. And also in terms of so many SKUs for certain segment, if it's not profitable, then maybe we may have to think about discontinuing or terminating the business. So it's not profitable or maybe we may have to switch to the next different model or maybe we have to pass the additional cost on to the price. So yes, some segments are difficult to take measures.\n\n**Moderator**\nBut in terms of taking measures, I understand, well, the price, this is not the business model, which we can control the price. So maybe this is a little bit more indirect influence. However, in that case, the level of the investment has to be reviewed. So that could be one option. Well, the assumptions change within really short time short term right now?\n\n**Moderator**\nAnd if this is going to continue for the next year, I think we have to think about a lot more measures. Thank you. The second question is for G and NS. The operating income the assumption for the operating income for this fiscal year, the reason for the increase, the first party increase of the profit and also add on contents, not the first party, but third party game contents. Well, regarding the first party, yes, maybe the major titles are based upon the previous titles and also regarding that third party, including add on, I think in the past, you don't really have a huge numbers on to the forecast at the beginning of the year.\n\n**Moderator**\nWell, what's the difference in terms of the expectation to that segment? Thank you. Regarding the first party titles for this year fiscal year, Ghost of Yotei, Best Finding two and Marathon, so those have been already announced. So we have major multiple titles in this fiscal year. So in this regard, Stranding two and Ghost of Yotei, we have the sequels.\n\n**Moderator**\nSo yes, we can expect to a certain extent of the fans are going to also enjoy the new titles. Regarding the Marathon, this is a new genre relatively speaking. So maybe we see a little bit of the risk. However, this is kind of a reasonable forecast to be incorporated. Regarding the third party titles, we also have quite promising lineups of the third party titles.\n\n**Moderator**\nSo yes, the installed base of the console and MAU, we are expecting the solid numbers in terms of the consumption. So we believe this is reasonable. And also GTA six is not included in our forecast. Thank you. Next question please.\n\n**Moderator**\nOnline, Nakane san from Mizuho Securities, please. Can you hear me? Yes. Nakane from Mizuho Securities. Thank you.\n\n**Moderator**\nI have a question to Tao Lin san. You become CFO and what issues do you have in mind? What do you want to do? What is your ambition going forward? For example, Pictures and Games.\n\n**Moderator**\nFor Pictures, ROIC is 6%, so it's the lowest. And questionable. I can it's quite visible. But the filmmaking, television production, I think it's quite tough in various ways. So Tao san, how would you like to boost the ROIC?\n\n**Moderator**\nWhat policies are you thinking of? How will you address this issue? Is the first about gain. Well, under the new organization, PL cash flow has improved significantly. But tell us, Tan, you were the CFO there.\n\n**Moderator**\nAnd the top line is increasing. I do understand that. But operation wise, what changes have taken place in generating this profit and cash flow? Please talk about the changes made yet. I think, well, you're spending the SG and A to a certain extent.\n\n**Moderator**\nSo operation wise, I think there's room to make it more efficient so as to improve profitability. So what are the measures you have in mind for that purpose? Thank you. What I want to do? Well, my top mission is to ensure the healthiness of financial performance and work together with Mr. Totoki to achieve his goals. The funny pictures about the structure. Yes, I do understand that. And so we have Country Road, which is visiting anime and it's a very important strategic company for us. And as Suzuki CEO explained, SIE and PlayStation Network know how will be leveraged as to create synergy.\n\n**Moderator**\nSo I want to support the business in such a way. And second, about SIE, what has changed? Well, I think there are two major changes. One, sell in units was the focus, but now they are focused on MAU. The management approach has changed.\n\n**Moderator**\nSo I think there's a major change in policy. So it's NISCHO CEO's strong leadership. And I think that the management is focusing on engagement and MAU. And this is leading to profitability. The second change, the first party studio.\n\n**Moderator**\nIn the past, there were various issues and Doctor. Kissane was temporarily the CEO And Carrie talked about various structural reforms. And compared to a few years ago, the financial discipline is in place. But we're still halfway and but there's still upside opportunity here. But I think the mindset has changed significantly. That is all. Thank you.\n\n**Moderator**\nThank you. So let's move on to the next question. There's a person in the middle of the room raising his hand. Okataki from Nomura Securities. I want to ask about Game and INSS, one question each.\n\n**Moderator**\nPlayStation five, the production in The U. S, what kind of plans do you have? I think the ratio of production in China is higher, but if you're trying to diversify, please let us know. I think you have some inventory in The U. S.\n\n**Moderator**\nSo how much have you been able to consolidate that? And the next one is INSS. I think the manufacturing process needs to change. Well, what will that be? Is it the mobile manufacturing or could it be some kind of automotive equipment?\n\n**Moderator**\nI think you have made investments in the past. So compared to that past, how much investment are you planning when? On games, I'd like to answer your question. PlayStation and the peripherals is being produced in four countries. China has high ratio.\n\n**Moderator**\nYes, that's true. But the supply chain has been diversified and it's not just China, but there are other countries in which it's being going to be produced, manufactured. As for inventory, of course, the details change from day to day, but it's the inventory for three months distribution that is the image. INSS, the manufacturing process review, new process is going to be introduced. The sensor needs to evolve.\n\n**Moderator**\nIt becomes much more we need a much more mobile type of image sensors, which will need a much more higher precision. So it's not in the current MRP, but the next one and the following mid range plan will incorporate that. In 02/1930, it will gradually start to incorporate these changes. The details will be announced when we update our MRP every three years. So at that time, we can announce or give you the details.\n\n**Moderator**\nThe investment size, it's very difficult to compare to the past. This MRP, I think, yes, it went down. But if you look at the one before this one, I think we are probably getting closer to the two MRPs back. So the it depends on the fab that is going to start operation in Kumamoto. Of course, we're not going to do the investment without any plans.\n\n**Moderator**\nIt depends on the demand. We have to have an optimal type of gradual investment that we'll take into account the demand.\n\n**Moderator**\nOur time is limited. So next question is going to be the last question. SMBC Nikko Securities, Katsura san, please. Two questions. The first is regarding tariff JPY 100,000,000,001 third for each segment.\n\n**Moderator**\nAnd Game is a little bit smaller and Semiconductor is a bit higher than what I expected. In case of Games, allocations are changing. That's what you explained. But should we understand this as an indirect impact? That's our first question.\n\n**Moderator**\nThe next is your operating cash flow. So the additional part will be returned on Slide 29. And that was what I heard. And yes, regarding the strategic investment, so yes, those will be on the shareholders' return. But JPY 1,800,000,000,000.0, which is the strategic investment.\n\n**Moderator**\nSo as a first initial year, what will be the level and also the future thinking? Thank you. Well, thank you very much. To your first question, I understand as you expected, it's indirectly influenced. So the end products demand decrease is reflected on to the simulations.\n\n**Moderator**\nAnd in terms of the capital allocation, Harakasan, please. Yes, let me answer to the question. Regarding the capital allocation, the strategic investment progress, yes, the capital allocation, well, last fiscal year, the execution cash out already and also made decisions and that is counted as capital allocation progress. From the previous year, it's about JPY 500,000,000,000 or maybe $510,000,000,000 that's being progressed. And the cumulative for the three year, as was explained by Tao san, JPY one point eight trillion, which has not changed.\n\n**Moderator**\nBut the growth investment, we always try to see the opportunities for growth investment and that is going to continue and that is what we are going to invest. The operating cash flow, yes, we are going to create that to the shareholder return. So we have to have a good balance in terms of the capital allocation. So we are better at capital allocation. Thank you.\n\n**Moderator**\nOkay. So with that, we would like to close this Sony Group Financial Group, the Corporate Strategy and Earnings Announcement Presentation twenty twenty five. Once again, thank you very much for your participation. So now all the speakers are going to this stage. Thank you.",
      "fetched_at": "2026-02-04T15:54:51.235Z"
    },
    {
      "ticker": "6758.T",
      "title": "SONY GROUP CORPORATION (6758.T) Q3 FY2025 earnings call transcript",
      "published_date": "Feb 13, 2025, 4:00 PM GMT+9",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/6758.T/earnings/6758.T-Q3-2025-earnings_call-224192.html",
      "content": "**Operator**\nThank you very much for taking time out of your busy schedules to join us today. As it is a scheduled time to begin, we will now start the Sony Group Corporation fiscal year twenty twenty four third quarter earnings announcement. I'll be serving as MC. I'm Ishii from PR.\n\n**Operator**\nFirst, I'd like to introduce the speakers. Representative Corporate Executive Officer, Chairman and CEO, who is to become Representative Corporate Executive Officer and Chairman effective April 1, Kenichiro Yoshida. Current Representative, Corporate Executive Officer, President, COO and CFO to become Representative, Corporate Executive Officer, President and CEO on April 1, Hiroki Totoki Senior Vice President, Corporate Planning and Control, lead of group Diversity, Equity and Inclusion Support for Financial Services, Business and Entertainment Area, Naomi Matsuoka Senior Vice President in Charge of Finance and IR, Sadahiko Hayakawa Corporate Executive Officer and CFO, Sony Financial Group, Kazuhiro Yamada. First, Mr. Yoshida will say a few words, followed by an explanation of the earnings results for the third quarter of the fiscal year ending 03/31/2025 and the full year forecast by Mr. Totoki, Mr. Hayako, Ms. Matsuoka, Mr. Yamada. And then we'll move on to the Q and A session.\n\n**Operator**\nAfter the Q and A session, there will be a photo session for the media with Mr. Yoshida and Mr. Totoki. The entire event is scheduled to last about eighty minutes. Mr. Yoshida, please.\n\n**Moderator**\nHello, everyone. We recently announced our new management structure effective April. Hiroki Totoki will be appointed CEO of Sony Group Corporation. Based on his achievements until now and from the perspective of future long term growth, I'm convinced that Totoki is ideally equipped to be the next CEO, and the board is in unanimous agreement. Today, I wanted to take this opportunity to join you and share a few words.\n\n**Moderator**\nTaking a brief look back since returning to Sony from the ISP SONNET together with Totoki in December 2013, I served as CFO for four years and then CEO for seven years. I would like to once again express my gratitude to you all for your feedback, including your encouragement and critical analysis throughout this period. I believe that Sony was nurtured by the capital markets. During my time as CFO, I often spoke within the company about moving from internal negotiation to external accountability. The aim was to verify the effectiveness of our management initiatives by asking ourselves whether they are explainable.\n\n**Moderator**\nThere is a great deal that business leaders can learn from dialogue with the media analysts and investors, and I myself have learned much. If I were to mention one thing from my seven years as CEO, it would be our purpose that I defined in my first year. The keyword within this is kando inherited from my predecessor, Kazuo Hirai. I think of our purpose as a promise. It is a promise that we make to each and every employee.\n\n**Moderator**\nIt is based on the belief that you are the driving force behind Kando. I trust that most Sony Group employees think that it is not Yoshida who achieved something, but rather we are the ones that did it, and we are the ones that will continue to do it. I believe that this kind of intrinsic strength is vital for connecting our purpose to profit. Going forward, I myself, alongside our employees, intend to be part of the driving force behind Kando and offer my support to Totoki and the new management team. That is all from myself.\n\n**Moderator**\nWith that, I would like to hand over to Totoki.\n\n**Moderator**\nThank you very much. I am Todoroki. I am now assigned as the President, CEO, and I look forward to taking over the company, which Hirai and Yoshida have greatly added value to CEOs and to working to create new value by realizing our creative entertainment vision and driving Sony's evolution and further growth. Now I will explain the contents shown here, and then I will give a general summary at the end. First speaker, Hayakawa san, please.\n\n**Moderator**\nThank you. The consolidated sales excluding the Financial Services segment for the quarter increased 7% compared to the same quarter of the previous fiscal year year on year to JPY 3,695,700,000,000.0 and operating income increased 10% to JPY $423,000,000,000. Consolidated sales, including the Financial Services segment, increased 18% year on year to JPY 4,409,600,000,000.0. Operating income increased 1% to JPY 469,300,000,000.0, a record high for the third quarter. And net income increased 3% to JPY 373,700,000,000.0.\n\n**Moderator**\nThe results by segment for the quarter are shown here. Next, I will explain our consolidated results forecast for FY '20 '20 '4. Consolidated sales, excluding the Financial Services segment, have been upwardly revised slightly from the previous forecast to JPY 11,900,000,000,000. Operating income has been upwardly revised 2% to JPY $1,390,000,000,000, and operating cash flow has been upwardly revised 15% mainly due to the improvements in working capital to JPY 1,660,000,000.00. Consolidated sales including the Financial Services segment have been upwardly revised 4% from the previous forecast to JPY 200,000,013,000.\n\n**Moderator**\nOperating income has been upwardly revised 2% to JPY $1,335,000,000,000. Net income has been upwardly revised 10% to JPY 380,000,001,000. The full year forecast by segment is shown here. Now I will move on to an explanation of the state of each business. The first is Games and Network Services.\n\n**Moderator**\nSales for the quarter increased 16% year on year to JPY 1,682,300,000,000.0, primarily due to the increased sales of hardware and third party software. Although we had a big hit of Marvel's Spider Man two in the same quarter of the previous fiscal year, operating income increased 37% year on year to JPY 118,100,000,000.0, a record high for the third quarter in the segment, primarily due to the impact of higher revenue from network services and third party software as well as improved profitability of hardware. Promotion expenses per unit of PlayStation five, on which the promotion was implemented in the current quarter, decreased approximately 20% year on year. And we think that we are implementing an optimal sales program given the market environment. We are managing PS5 inventory at an appropriate level with inventory at the December decreasing 46% compared to the same month of the previous year, significantly contributing to an improvement in cash flow.\n\n**Moderator**\nTaking into account the result of the quarter, we have revised our board our full year forecast for sales by 3% to JPY 4,610,000,000.00 and operating income by 7% to JPY $380,000,000,000 compared with our previous forecast. The number of monthly active users, MAUs across PlayStation platforms in December increased 5% compared to the same month of the previous year, reaching 129,000,000 accounts, the highest number in PS history. Total playtime also increased 2% year on year, marking the seventh consecutive quarter year on year growth. More than 40% of users who purchased a PS5 during the quarter were new users, Combined with a moderation in the decrease in the number of PS4 active users, this has contributed substantially to the increase of MAUs. Cumulative unit sales of PS5 from launch until the December are essentially the same level as the cumulative unit sales of PS4 for the same period of time since launch, even though PS5 had a higher price.\n\n**Moderator**\nFurthermore, MAUs after the same amount of time has passed since launch have increased significantly by approximately 1.4 times. This shows that the user base for the PS platform has significantly expanded from PS4 generation due to the PS5's backward compatibility in various user engagement initiatives. As for PlayStation Plus, revenue in the quarter increased 20% year on year on a U. S. Dollar basis, primarily due to an increase in average revenue per user, APRU, mainly due to a shift to higher tiers of service and the impact of price revisions.\n\n**Moderator**\nIn this way, in the momentum of the platform business is currently strong, and we expect to see stable earnings growth going forward. Last November, we released a beta version of a cloud streaming feature on the PS portal remote player. This means that PS Plus premium subscribers can now play over 120 PS five game titles on the PS portal streamed directly from cloud service without going through a PS five console. By leveraging the lessons from the beta test, we aim to further improve the streaming and gaming user experience so users can enjoy PS games anytime, anywhere, and even more easily. At the Game Awards twenty twenty four, held on December 2024, our first party title, Astrobot, won four categories, including Game of the Year and Best Family Game, the most of any title.\n\n**Moderator**\nIn addition, the live service game, Hell Driver Divers two, released in February, won the best ongoing game and best multiplayer game awards. The fact that titles in general we are aiming to expand in the future, including titles for families and live service games, have received these awards, is a major stride towards building a broader title portfolio. In addition to the awards, it received held diverse to large update Omens of Tyranny released in December 2024, has been well received and user engagement has once again increased significantly. Next fiscal year, we plan to release games such as the major title Ghost of Yotei and the sequel to the popular title Death trending, and we expect even further expansion in earnings from first party software.\n\n**Operator**\nNext is the Music segment. Sales for the quarter increased 14% year on year to JPY 481,700,000,000.0, primarily due to higher streaming revenue and the impact of the consolidation of E plus Inc. In Visual, Media and Platform. Operating income increased 28% year on year to JPY 97,400,000,000.0, mainly due to the impact of the increased sales. On a U.\n\n**Operator**\nS. Dollar basis, streaming revenues for the quarter increased 9% year on year, including a onetime factor in Recorded Music and 8% year on year in Music Publishing. We have revised upward our full year forecast for sales by 3% to JPY 790,000,001,000 and operating income by 3% to JPY $340,000,000,000. During the quarter, new albums from artists such as Tyler, the Creator and 80s became hits. Recently, Bad Bunny's new album released from Remus Entertainment on 01/05/2025, has become a huge hit, capturing number one on the Billboard two hundred and making him the fastest male artist to reach 1,000,000,000 streams on Spotify.\n\n**Operator**\nAt the sixty seventh Grammy Awards held on 02/02/2025, Beyonce's Cowboy Carter won the award for Album of the Year. Beyonce, who has been nominated for 99 Grammys over the course of her career, the most of any artist, was nominated in 11 categories this time, and she won three categories, including album of the year. The rise of streaming is creating more opportunities for music from local artists to become global hits. The Sony Music Group is working to enhance local repertoire by discovering and nurturing artists and songwriters at its locations in emerging markets as well as by building and strengthening relationships with independent labels and artists in various regions through the Orchard and AWOL. In addition, in rapidly growing Latin America and India, we have further solidified our leading positions through strategic investments in leading labels and music catalogs in each region such as Sonlibre in Brazil, Rimas in Puerto Rico and Eros in India.\n\n**Operator**\nFurthermore, in countries and territories that are expected to grow over the midterm, we have acquired leading local labels in Greece and in The Czech Republic, and Sony Music Publishing has established a base in Thailand. Next is the Pictures segment. Sales for the quarter increased 9% year on year to JPY 398,200,000,000.0, primarily due to higher revenue from theatrical releases such as The Last Dance and the impact of foreign exchange rates. Operating income decreased 18 year on year to JPY 34,000,000,000, primarily due to an increase in marketing costs for theatrical releases. The full year forecast is unchanged from the previous forecast.\n\n**Operator**\nAt this point in time, we expect the impact on the results of the segment from the wildfires in California, in The U. S. To be minor. In Motion Pictures, there is still some impact of the strikes such as postponement to the fiscal year ending 03/31/2027, of the theatrical releases of the next Spider Man and Jumanji movies. However, production activity is recovering.\n\n**Operator**\nIn television productions, the production of new shows, which was impacted by the strikes, has almost stabilized. At Crunchyroll, streaming of the second season of the anime series Solo Leveling produced by Aniplex began last month, and it has become a huge hit in many countries and territories. Additionally, going forward, we aim to further strengthen our engagement with anime fans around the world, including through the scheduled release of Crunchyroll manga, a digital comic service for paid subscribers in North America. Now I'd like to explain our strategic collaboration with Kadokawa, which spans our three entertainment businesses. We have collaborated with Kadokawa on various projects in the past, but following the conclusion of a Capital and Business Alliance agreement in December and the assumption of a third party allotment of new shares in January, we have become its largest shareholder.\n\n**Operator**\nThrough this alliance, the leadership of both companies are even more committed to promoting collaboration, and we aim to create new value in various entertainment fields by combining Kadokawa's strengths in creating original IP with our technologies and global expansion capabilities. Next is the ET and S segment. Sales for the quarter decreased 4% year on year to JPY 704,500,000,000.0, primarily due to a decrease in unit sales of televisions, while operating income remained essentially flat at JPY 77,100,000,000.0. The full year forecast is unchanged from the previous forecast. The year end selling season trended generally as expected across the segment.\n\n**Operator**\nCompared to the year end selling season of the previous fiscal year, sales of televisions and smartphones, which are not pursuing scale and are focused on high value added products decreased, but sales in other categories were essentially flat. Even the imaging market where there were concerns of a slowdown, particularly in China, remained relatively stable and the market scale on a unit basis for the quarter increased slightly year on year as was the case in the second quarter. The sales and profit in our Imaging business decreased slightly year on year. We think this was mainly due to our launching two new products in the volume zone of full frame cameras, including the Alpha 7C Mark II in the same quarter of the previous fiscal year. Inventory as of the December for the entire segment increased slightly from the same month of the previous year to JPY $350,000,000,000.\n\n**Operator**\nIt is being controlled at an appropriate level. Assuming that the operating environment in this segment will remain severe into next fiscal year and beyond, we intend to implement further fixed cost reduction measures in the fourth quarter in order to increase resilience and strengthen our profit structure. Expenses for this are reflected in the current forecast. Since 2012, the market for interchangeable lens digital cameras has seen the single lens reflex camera market shrink at a faster rate than the growth of the mirrorless camera market, which is driven by Sony. As a result, the market as a whole continued its trend towards shrinkage until 2020, when the COVID-nineteen pandemic was also a factor.\n\n**Operator**\nHowever, since 2020, the market has entered a stable re expansion phase. And by 2024, it recovered to a level approaching the peak in 2012 on sales amount basis. In addition, the interchangeable lens market is continuing to grow steadily with the combined market size for cameras and lenses exceeding JPY 1,200,000,000.0 in 2024. Since the imaging market has a limited number of players because of it requires the integration of multiple advanced technologies such as optics, mechatronics and image processing. And since we have image sensors and five gs communications technology, we expect to generate high market share and profitability by continuing to offer products that meet the needs of creators.\n\n**Operator**\nIn addition to the stable sales growth of camera bodies, the creation of new markets and a business where recurring revenue can be expected are steadily expanding with the launch of a variety of lenses that expand the possibilities for creators' expression and solutions and services that add value through software.\n\n**Moderator**\nNext is INSS segment. Sales for the quarter were essentially flat year on year at JPY 500,900,000,000.0, primarily due to a decrease in sales of mobile image sensors offsetting the impact of foreign exchange rates. Despite the positive impact of foreign exchange rates, operating incomes income decreased 2% year on year to JPY 97,500,000,000.0, primarily due to increased manufacturing cost and the impact of the decreased sales. We have slightly increased the full year sales forecast from the previous forecast to JPY 1,790,000,000,000, while the forecast for operating income is unchanged. The global smartphone market continued to slowly recover during the quarter, and mobile sensor sales were essentially in line with our expectations.\n\n**Moderator**\nSales for the current quarter decreased year on year, primarily due to a shift in sales from the second to the third quarter in the previous fiscal year resulting from the production yield issue on new mobile sensor products. However, cumulative sales for the nine months through the third quarter increased a significant 15% compared to the same period of the previous fiscal year. Furthermore, the production yields on the same production product during the current quarter improved beyond the initial plan in the forecast as of November, reaching nearly normal levels. The average annual growth rate for the mobile sensor sales from the fiscal year ended 03/31/2022 to the fiscal year ending 03/31/2025 is expected to be 23% on yen basis and 11% on a US dollar basis. This steady growth is mainly due to rising unit prices resulting from larger sensorizes and higher value added mobiles.\n\n**Moderator**\nAnd we believe that we can achieve similar level of self growth on a US dollar basis in the fiscal year ending 03/31/2026. Regarding automotive sensors, a slowdown in the growth of the electric vehicle market, especially in The US and Europe, has had impact. But our expansion of our customer base and improvement in our product performance to date have been successful. And the strong demand for EV manufacturing in China, as well as shift towards higher pixel count sensors have expanded our business. Although the proportion of automotive sensor sales to our overall segment sales is small, we expect high growth going forward.\n\n**Moderator**\nNow I would like to explain our response to its tariff policy. In order to respond, the various geographical risk in our GNSS, ETNS, and INSS segment, which handle hardware over the past few years, we have been working to duplicate our supply chains and increase their flexibility. Furthermore, we have been preparing recently by doing such things as stockpiling a certain level of strategic inventory in The US, and we expel expect the impact on our, the financial performance this year of, the additional US import tariffs that have been implemented or whose considerations has been announced in at this point in time is minor to be minor. We intend to continue to respond flexibly and promptly to change in circumstances and implement at appropriate time additional the measures that we are preparing in order to be minimize the impact of our business in the earnings. Last is the financial service segment.\n\n**Moderator**\nFinancial service revenue for the quarter is increased 406,700,000,000.0 yen year on year to 718,500,000,000.0 yen, primarily due to an increase in gains or investment at Sony Life. Operating income decreased 30,900,000,000 year on year to JPY 46,400,000,000.0, primarily due to the absence of significant gains related to market fluctuation recorded in the same quarter of the previous fiscal year at Sony Life. Insurance service results, which indicate the earliest potential of Sony Life, decreased 11% year on year during the current quarter to JPY 41,300,000,000.0. But they trended in a stable the manner for the nine months through the third quarter, decreasing 4% compared to the same period of the previous fiscal year. Moreover, Saudi Life's new policy amount for the current fiscal year is increasing smoothly at 12% year on year on a cumulative basis through the third quarter.\n\n**Moderator**\nTaking into account the results of the quarter, we have increased the full fiscal year forecast for financial services revenue $390,000,000,000 yen to 1,300,000,000,000. The operating income forecast remains unchanged from the previous forecast. I will now speak about the financial initiatives at Sony Life. Assets such as bonds held on the balance sheet, they exceed insurance liabilities resulting in an overhead situation. This situation means that rising interest rate will result in a decrease in net assets, so we are working to mitigate the situation this fiscal year.\n\n**Moderator**\nSpecifically, we began selling a portion of the bonds we hold and trading derivatives through the third quarter, and we are considering selling additional bonds in the fourth quarter. The full year results forecast incorporates the offsetting the losses from these bond sales on the upside to profit from the market fluctuations through the time the current forecast was determined. Through those these efforts, we intend to continue to steadily improve our financial position while closely monitoring the balance with the profitability, preparing for the partial the spin off and listing of Soli Financial Group Inc, scheduled for October year, are progressing smoothly, and we plan to explain our business strategy and listing structure in late May. In closing, I will make some remarks. Having completed the third quarter of the fiscal year ending 03/31/2025, the first year of our fifth mid range plan, we believe we are making steady progress toward achieving our key performance indicators for the Sony Group set out in the plant in our plant.\n\n**Moderator**\nIn particular, we view it as positively that GNNS and INSS, which are driving the profit growth, have both been able to significantly increase the profit since last fiscal year. Furthermore, in regard to the enhancement of shareholder returns, which we are pursuing in our fifth mid range plan, we complete, completed the repurchase of the maximum JPY $250,000,000,000 of our own share decided in May of last year, by November. So today, we have established a new facility to repurchase maximum 50,000,000,000 yen with a deadline of May of this year. We intend to continue to implement repurchase opportunities, taking into account the state of such things as share price level and investment opportunities. That's all for me. So the four speakers have given the financial results.\n\n**Moderator**\nNow we'd like to entertain questions from the media and then followed by the Q and A by the analysts and investors. And twenty minutes for each the Q and A session. There are some people who registered online to ask questions. The first, please click the button for the webinar participation so you are ready to participate online. And as to the way of questions, we have given you some the information beforehand.\n\n**Moderator**\nThe first, we'd like to entertain questions from the media members. Some people are participating online. And then of course, the person in charge of microphone bring that to you. And we'd like to ask kindly that you would ask only two questions per capita. So now the floor is open to enter 10 questions.\n\n**Moderator**\nThe person in the front row of the Central Block, please start asking the question. I'm Sato, Bonkei Zai Shimbun. I have two questions. First question is about the fact that Yoshitensan and it's one for Yoshida san Gata and for TOTOXA. Yoshida san has assumed the position of CEO seven years ago and many M and As were implemented by Mr. Yoshida and financial service was decided to be split to a certain extent. So how do you evaluate the progress state of this business portfolio structure? And the second one is the future for Yoshida san to Tokusan each. As a chairman that in Sony, what kind of role we like to play within Sony? And maybe your future career plan or ideas in the future?\n\n**Moderator**\nTo Tokusan, I have a sort of abstract question. That is to say, as a CEO of the company, what do you like to achieve in the mid range plan? There are the numbers of targets. But beyond that, what kind of company that you would like to nurture the Sony to become? So your ambition sort of about the future of Sony.\n\n**Moderator**\nThank you for your two parts of questions. As to the first part of the question, of course, you told us about portfolio, how specifically I evaluate and assess that. Thanks for the question. As to the portfolio, the management, of 2021, the Sony Group company, it was launched. And then so that was a key point.\n\n**Moderator**\nAnd there are two purposes for that. One is group synergy has to be promoted further. And second purpose is that portfolio management should be done more carefully and perfectly and well thought, and there's a progress achieved. But Totoksan will play the central role, including other members, the leaders, to consider and polish this further. My future role as a chairperson, of course, that I would like to support the top ten's team.\n\n**Moderator**\nThat's all from me. Thank you. My future aim and ambition in the future. Yes. At the CES, the the about the entertainment division, I already told you about this.\n\n**Moderator**\nBut the way the ideal state that we like to achieve ten years from now, that is ideal state we like to achieve. Against vision, to what extent can we make progress? And that's a challenging thing that I would like to aim at to get as close as possible to the vision. What are the most important driver? Of course, the human resource diversity we have and business diversity we have.\n\n**Moderator**\nWe have diverse human resources and human business sectors. And then by merging that, we can create something brand new. I believe in that. And I would like to really try that and and then achieve this, the vision. So that is strongest wish I would like to achieve. Thank you.\n\n**Operator**\nLet's move on to the next question. The first row in this block. I have two questions as well. So based on Totoki san's answer, well, there's also some overlap with that. But in 2018, when you assumed the post in Yoshida san, we have diverse people and diverse business.\n\n**Operator**\nAnd you said the issue is, can you make best use of that? So selection focus is something that many companies have pursued, but in management, aiming for diversity, what does that mean? What's the significance of that and significance of what you have achieved? That's That's my first question. So second question goes to Mr. Totoki. So President, CEO and CFO to President, CEO, CFO to President, CEO. So now I think you are moving from execution to management. So what do you think is going to you have now the business CEO or a chief officer. What's the significance of that new post that you're going to establish?\n\n**Operator**\nSo making use of diversity, well, in the twentieth century already, we think that we have generated two major businesses that we capitalize on diversity. One is PlayStation game business, so music and electronics synergy was what led to that. And then the other one, anime, in the middle of 1990s, the current Aniplex. So Sony Pictures Japan and Sony Music, there was synergy between those two that led to that. And so under Totoki's leadership, anime and games, I mean, they're very close.\n\n**Operator**\nSo that will be the engagement platform. So the diversity that we have, we're going to try to convert that more to value. That's the action that he's taking. That's how I see it. So for myself, so to become CEO, my thoughts on that, So I'm going to be the Chief Executive Officer, so person irresponsible of management of the company.\n\n**Operator**\nSo I feel that a big responsibility, Hiroe san and Mr. Yoshida. They have created this value. I want to further expand on that, make it bigger. So I have that strong determination to achieve that.\n\n**Operator**\nThat's what I'd like to tell you. And the significance of having chief officer. So at the head office, as much as possible, we want to simplify the layers. So we want to do de layering. So we have a transparent and open and efficient and lean head office.\n\n**Operator**\nSo that's what we intend. And so for that, we did this reorganization. And also, one more thing about the name. Well, as much as possible, we wanted something that is easy to understand, not just in Japan but globally because we have a lot of business overseas. It's much it's larger than Japan.\n\n**Operator**\nSo we wanted a title that's easy to understand globally. So that's why we changed the name. And in terms of business CEO, the current business, what drives that is CEO and each business segment. And so for the business segments, we wanted to show the respect and support from head office, and we wanted to show how we're going to provide that support and how we're going to behave. So that is why we established this business CEO.\n\n**Moderator**\nSo now we would like to move on to the next question. So in this, the middle, the white jacket, the person in white jacket, please. Nishigata from NHK. And my question is to two questions to Totoki san from April. You will become CEO.\n\n**Moderator**\nAnd under such circumstances, your company has grown significantly over the last years. But what do you think is a challenge still ahead of you? And how you would like to take that challenge? And so in MLP, JPY 1,800,000,000,000.0 for the growth, the investment. So as a CEO, what is your policy for investment to the extent that you can disclose to us?\n\n**Moderator**\nThank you. So let me answer two questions. What is still lacking? What is a challenge? There are many, as a matter of fact.\n\n**Moderator**\nAnd of course, there is no company organization where there is no challenge. And but roughly speaking, on our part, we have played the game globally. That is the nature of our company. So for that compared to top notch player globally in terms of scale or in terms of profitability, we have not reached the top level yet. And therefore, whether we are in a top position globally, there are still many things which need to be improved.\n\n**Moderator**\nOur headquarters in Japan and there are many Japanese in headquarters. And so in order to make it truly global, I believe that is very important for us to the change. And the second point is with regard to the strategic investment during the mid range plan and how we should proceed with that. And the policy of investment has not will not be significantly different from what we have had. And for the company, for asset, whether we have a capability to boost the value.\n\n**Moderator**\nAnd of course, we have the great companies or we have a great asset. And it is important, the strategy, to acquire them. But the point is whether we are able to further add value through those acquisitions. And the second point is whether we are able to set the price properly and whether we have the capability to evaluate the capability and set the price based on that, I think those are very important two points.\n\n**Moderator**\nWe'd like to entertain next question. Central block in the second row and the person wearing the brown jacket, please. Nishida, the Freelancer Reporter. I have two questions. First point, the questions and request to Mr. Yoshida, so far, your investment plan was presented, and Totoku san also covered that. As a CEO of the company, you have prepared the investment plan. Which one did you evaluate high? And then the second question is to Mr. Totoki.\n\n**Moderator**\nAs of now, that in your management portfolio, there are some things which are going well, but some things were negative areas. In some cases, some you must decide to divest or you might make a big change of restructuring. You might have to make that difficult decision as well. But by when do you make such a bold decision? And in which way you intend to do that?\n\n**Moderator**\nAt present, I'd like to hear that what you think about those. Thank you. Thank you for your question. About the investment plan, I highly appreciate the certain area. Well, the most impressive investment for me was for me well, for Sony's management is that was that in 2018, EMI Music Publishing, the acquisition, that acquisition was most impressive to me.\n\n**Moderator**\nDollars 4,000,000,000 investment was made. But anyway, the negotiation was mostly done by Mr. Tottoki personally. But music, of course, is the original starting point for Sony company. Name Sony came from the Latin word Sonos, featuring sound, and tape recorder, and workman, and CD.\n\n**Moderator**\nThose were the products we developed. Sound was the basis origin to deliver sound. That's how we developed our products. On the other hand, CBS Sony created in 1968. And then that is where we got closer to artists, how to get closer to artists.\n\n**Moderator**\nAnd we learned that in 2018, EMI Music Publishing, the acquisition, and that was like M and A based upon our origin. And then from then on, of course, for creation shift or entertainment focused activity was involved. And we made a big bold decision from that time on, I think. And to respond to your second question, how I do I evaluate the current portfolio? Well, for me, for some time, when I look at the portfolio, it's not static, it's more dynamic.\n\n**Moderator**\nThat's how I perceive the portfolio structure. It's not something you implement something suddenly on one day. It's a continuous effort continuously monitor. So for the entire portfolio, some area might not be doing well in certain segment. You might need to make a bold change.\n\n**Moderator**\nThen without hesitation, I implement that change. But as to the bold Restructural portfolio in October, we make a decision on the spin of the financial segment. And when we announced that thing on Financial Sector, I explained the person who will be spin off or who would spin off, the both sides understand that it's necessary spin off for the future growth. As to the portfolio, as to the major restructuring might be the basic criteria for decision making. In other words, if we should keep holding that, that nurture more growth or maybe the other people should manage and then the that segment might grow better, then we have to revise drastically.\n\n**Moderator**\nSo to that kind of goals or criteria, if we do nothing, then investors might scrutinize and they might come to some critical comments as well if we do nothing. So if possible, we ourselves, of course, would like to make decision and to take an action in advance and take a proactive action, which is more ideal. So that kind of revision restructuring continues to be considered and implemented.\n\n**Operator**\nNext question. To the far right. Second from the front, the person in black, please. Thank you. Furukawa from Bloomberg.\n\n**Operator**\nQuestion to Totoki san, two questions. So about responding to additional tariffs, you said you have strategic inventory that you're building up. Any other measures? In November, you talked about how to do the shipment. You might change where things are produced and you might have a price pass through.\n\n**Operator**\nYou have to organize those ideas, you said. Any products where you actually implemented those ideas? That's one question. Then the other, so this is something I wanted to ask based on what you said. So in order to compete globally, headquarter, shift that to someplace else other than Japan.\n\n**Operator**\nDo you have such an idea? So first question, in terms of responding to tariffs, as I said the other day, so I think we have those choices that I explained. So we are making preparations. We haven't made drastic changes in terms of how we respond. Second, about placing the headquarters outside of Japan.\n\n**Operator**\nThat possibility is nil. We have no such idea. Tokyo is a really nice place, so we don't feel any inconvenience. So I think it will stay the same.\n\n**Moderator**\nTime becomes short. So the next question will be the last question. The person in gray at the suit, please. Tanaka from Asahi. And my question is to Yoshida san, two questions.\n\n**Moderator**\nAnd Mr. Yoshida, in 2013, when you returned from SONNET to Sony and when you returned to Sony, there was a deficit and the management was not necessarily very healthy. And so as a CFO, for instance, the sale of VAIO, and you have to reduce number of employees. I think you were involved in restructuring of Sony then. And as at that point, what was your thought to make those decisions?\n\n**Moderator**\nAnd the restructuring, I'm sure that that has led to the current the growth phase. So when you look back at the situation then, how do you reflect your action of restructuring then? And the second is when you were CEO, you tried to put emphasis on entertainment area. So looking from outside, Sony has changed significantly. So as CEO, what is your impression about what you have achieved?\n\n**Moderator**\nThank you. Since I'm appointed, let me answer. When I returned from SONET, it was December 2013. I returned to Sony with Totoki San in early phase after I returned. I decided to withdraw from PCVIO and also decided to spin off TV, to separate business of TV.\n\n**Moderator**\nAnd I made proposal to both together with Totoki san. And I think it is common, between us that the basic mindset then was that. And we are not happy to be M8 by Sony, but of course, the Sony took care of us. So we wanted to contribute to Sony. We are indebted to Sony very much.\n\n**Moderator**\nSo after impeachment, there was a lot of efforts for that. And so the Todoki Esan was in charge of mobile business, And he was involved in restructuring. And that improvement has led to the current growth. When I was CEO, of course, entertainment was emphasized and Sony has changed. Thank you very much for your comment.\n\n**Moderator**\nAnd the focusing on entertainment itself is related to Kondo. That was, the put forth by, the horizon, my predecessor in 2012. And I fully agree with him. It was old story 02/2005 when I became the president of SONNET. Sony Communication Network was original name, but I changed it to SONNET Entertainment.\n\n**Moderator**\nAnd my thinking then was in twenty first century, that was the era of entertainment. And the major bearer, of that trend, is net worth network. So So I took challenge together with Totoki san for that purpose. So the focus on entertainment, I fully agree with Horizon. And then that was the background.\n\n**Moderator**\nWhether I have fully achieved my purpose, of course, there are still challenges, the left, and we have to continue to take. So I would like to continue to support Totoki San, who will take leadership in doing so.\n\n**Moderator**\nSo, we'd like to end this part of this QA session by media. Thank you. We'd like to entertain questions from the analysts and investors. I would like to serve as the MC, I'm Kondo of IR Group. Thank you very much in advance.\n\n**Moderator**\nAnd then online participant, if you have any questions, first, please click the bottom for hand raising on WebEx. And then if you are in the room and would like to ask a question, please raise your hand and we will bring a microphone to you. So we'd like to ask you to ask two questions per capita. Thank you very much in advance. So please raise your hand to the right hand side on second row, please.\n\n**Moderator**\nThat person is now designated. Thank you very much. And of the JPMorgan, I have two parts of questions. I have a question about the financial result in the third quarter, the game and network businesses, and let us reflect upon that. Of course, active users made a record high increase.\n\n**Moderator**\nSo marketing this quarter, what's the driving force for such an increase of these users? Hardware console is selling well and third party software titles are selling well and add on also increasing. So everything is growing. But especially in this fourth quarter, what was the major driving force? And is this a sustainable growth?\n\n**Moderator**\nWhat do you think of that? That's my first part of the question. My second part of the question is to Mr. Yoshida. That Sony management human capital, human resources is my question.\n\n**Moderator**\nIn the last decade, you have went through the major reform, Mr. Hirai, Mr. Yoshio, Mr. Totoki, and each played a role. And maybe they reflected just about business environment and era as well.\n\n**Moderator**\nBut the three of you played a certain role. But in one word, what was the role of each top management in the capital market in the future, in ten years from now on that in order to create a further better Sony? Those three CEOs have maybe nurtured and developed the future generation, the management, human resources. What do you think of that? Have you developed and trained the future CEOs?\n\n**Moderator**\nI'd like to answer the first question first. That is as to the third quarter, as you're aware, that there's a seasonality influence. So that the figure should go up most of that season. So at that timing, we are fortunate that the consoles really sold well. There was a major interest of good sales of consoles more than we had expected, much stronger momentum was felt.\n\n**Moderator**\nIn addition to that good news, high quality third party softwares titles were available, launched during the third quarter. There was a synergy in MAU, was achieved the highest in record. So there's a seasonal fluctuation. So in the fourth quarter, it might come down again, but still, overall speaking, it's a continuous growth that is ideal state of growth. So we like to continue this momentum.\n\n**Moderator**\nAs to the hardware, we have achieved a high level penetration. For the next fiscal year, they are very strong. The titles, including first party and third party titles, are likely to be launched. So the better momentum could be created for us to boost our sales for the next fiscal term. Thank you.\n\n**Moderator**\nSo let me respond. In the last ten years, through the major reform, mister Hirai, myself, and Toksna, he played a certain role for, during each term. Of course, mister Hirai launched the world, Kando. That is entertainment focused approach, I think. And I worked together with mister Totoki.\n\n**Moderator**\nSo in the last seven years, especially, the the creation shift was focus of mine, which is shift to creation. Contents creation is one area. However, hardware wise, camera, the capturing should be also focused. And also component and parts, battery, where this is where we exited already, but semiconductor is related to capturing creation. So we should focus on semiconductor as well.\n\n**Moderator**\nSo we shifted to creation. And there's a committee of interest used that internal. We'd like to close get closer to the certain motivation of the users so that the core gamers, we should get closer to them. And anime, we should focus on anime as well. And that, I think, was a focus over this present management.\n\n**Moderator**\nBut what about the future? There are many ways to describe it. Mr. Totoki, last year in May, represented that Creative Entertainment Vision was launched by him last year in May, which exemplifies that technology should be continuously treasured, especially computing and sensing should be emphasized, continue to be emphasized. So I expect that to be the focus.\n\n**Moderator**\nAs to the human resource training, as Mr. Hirai and Totoki, we had lots of experiences in Sony. One point I'd like to raise an example. I personally, as the PlayStation, it linked the twentieth century of twenty first century with Sony. In other words, it was a packet measure of the last century, but now it shifted to and self transformed to the this network.\n\n**Moderator**\nSo I often say internally that how did you achieve this self the change? That is network was split. Sony and network entertainment was created in 2010, and network system separated. And then again in 2016, again, they were remerged, integrated. Then Sony Computer Entertainment became a Sony Interactive Entertainment, so the name was changed.\n\n**Moderator**\nSo people are now connected by networking. And in addition and the people in the earlier organization, the three people, Cordera, Nishino and these three, Nitto, these three people are the members. Those three had a Tanduva experience, and they became a supporter of the same team, Totoki. They are the major members supporting Mr. Totoki.\n\n**Moderator**\nSo it's one of the good examples I could quote.\n\n**Operator**\nMoving on to the next question. From the stage to the left, third row from the front, wearing a black jacket, please. Nakane from Nissuho Securities. Sorry for my voice. So question same question to Yostasan and Totoki san.\n\n**Operator**\nSo before it became the group, you had split the TV subsidiary. So between group headquarters and the business, you have separated. So I think that's been your management style. So in terms of business management and decision making, your involvement in each of the business, what would that be? So Director of the business and as shareholder, as a group CEO, I mean, you have various positions.\n\n**Operator**\nAnd so there is a centrifugal and centripetal power. So how do you strike a balance between the two? I mean, it's easier said than done. So inclusive of the message to the future, what were the difficulties that you had? What thought process went through?\n\n**Operator**\nSo sorry for the abstract question. So, Floreksan, you worked on mobile and games and you went into the businesses. I think you're that type of manager, but now you're group CEO. And so how to engage in each businesses? How How is that going to be different from Yoshida san?\n\n**Operator**\nIs there going to be a difference? Please tell me. So first question, let me talk about that. So in terms of group management, as you rightly pointed out, so I think you need both, so this centrifugal and centripetal force, you need both. And I think the crux of that, both of for both is purpose, I think.\n\n**Operator**\nSo it's not I said that it's not that Yoshida did something. I want the employees to think that we did it, and they actually feel that way. And of course, management's responsibility is to connect the purpose to profit. But in doing that, I think that is quite important. And so there's a purpose, which is our promise.\n\n**Operator**\nAnd so centrifugal and centripetal force striking a balance between the two is what I have been working on. So maybe a little bit abstract response, but even now, myself as an individual, I enjoyed working on business hands on. Even if it's difficult, I enjoyed that process. So what so in more cases, I recall those hands on experiences. But having experienced both, what I feel is that, I mean, we're going to have to decide how and what do we support in the businesses.\n\n**Operator**\nSo some things you have to do and some things are unnecessary things you not do. Both are important. And so that is all about creating the balance between central fuel and central diesel power. And so I want to provide this thorough care from the management. So I want to think what is the best way to do that.\n\n**Operator**\nSo when things are going well, I try not to interfere. That is the style I would like to adopt.\n\n**Moderator**\nSo now we'd like to move on to the next question. SMBC Nikko Katsura san, who joined online, please. Katsura from SMBC Securities. I have two questions. And the first is the business related.\n\n**Moderator**\nAnd the GNNS and INSS have made a very good start this fiscal year. And on the other hand, at the market, we are worried about sustainability. So the many, the response is what will happen to the next fiscal year. So since this fiscal year is very good, there will be dip next year. That is a concern.\n\n**Moderator**\nSo you said there are many things about upside, but GNNS and INSS, the FY, the '25, what's our upsides and the downsides? And the second, the question is to lead the mid to long range. The plan, so for the new organization, you have already shared that with us. And with regard to the personnel, you have already covered it. And you mentioned the diversity and the returning to the younger generation.\n\n**Moderator**\nAnd so next generation, the talents to take care of the management, what is your expectation to them? And at the very beginning, Yoshida san said that Sony has been nurtured by capital market. And what is your expectation toward vis a vis capital market, if there are any? Please share them with us. Thank you.\n\n**Moderator**\nSo answering your first question, let me answer your first question. So you talked about sustainability of the profit for the GAME and INSS. And what will happen to the next fiscal year. And as for game area, rather than a sell through of console now, the MAU has been accumulated network service plays a main role. So even though there is a higher profit, there will not be the rapid dip.\n\n**Moderator**\nAnd as for the next fiscal year, first party, third party, we expect very good titles coming out. So that is a good year. So we have a high expectation for the performance of the next fiscal year. So we would like to take advantage of those opportunities without missing them. And as for INSS, through the larger size, the sensor, we will continue to have the high sales.\n\n**Moderator**\nAnd by the end of this fiscal year, we'll solve the issues related to yield. So there will not be the major, the concerns for the next, the fiscal year. But smartphone, the market itself, what will evolve in that market? So that is a market which has been reaching maturity, but there is AI, a feature, newly incorporated. And whether that will vitalize the smartphone market, I think that is a very important point affecting our business.\n\n**Moderator**\nThat's all. Thank you. So the new management team under the leadership of Todoroki Kisan, I expect a great deal. And what we expect vis a vis the capital market was your question. So I have had opportunities, the stakeholders, the clients, partners, shareholders, clients.\n\n**Moderator**\nSo with those contacts, that has made me think that for our customers and employees, They have focused on the certain area as their expectations for employees. Now of course, they would like to improve the carriers and compensation. And when you face the capital market, I feel strongly the wide widths of dynamic range of the expectation. You talked about the diversity, but the of course, investors have different time frame. And so whether they wish to focus or they accept the portfolio offered by management, there is a difference.\n\n**Moderator**\nSo there is a wide dynamic range of the requests and expectations of the market that we can learn, from them. So may I answer that question? The next, the generation, the management, in terms of talents, what I expect from them. So we have come to Internet native generation gradually. And so they have been exposed to the Internet since their younger days.\n\n**Moderator**\nSo they will be the main the the people to support Sony's management. So the sense of, the speed and the capability to find something new and limited and very little, the resistance to technology, I believe those mindset and attitude will generate something new. AI will be widely, penetrated, and the next generation is able to handle them very easily. And I have very high expectation, not only the service and products, the way of, the working and the management style will change. And that is how I sense, the sign of change.\n\n**Moderator**\nAnd I would like to support and I would like to support those changes actively. Thank you.\n\n**Moderator**\nTime is running short. So we'd like to ask just one question per person from now on. Thank you for your kind understanding. Please raise your hand. Just one question per person, please.\n\n**Moderator**\nOnline participant from Citigroup Securities, Isawa san, please. I have just one question. As Totoki san mentioned about the mid range plan and then 10 profit increase is planned in the scenario in the last nine months. The growth rate you super achieved, overachieved, like 23% increase of profit achieved already. So you overachieved.\n\n**Moderator**\nSo after the revised annual plan, in the fourth quarter, there might be some expense to be made, like 10% increase might be in the scenario. But clearly, you are overachieving the original target, 10% growth scenario and versus now. You might have a maybe different actual performance than the original plan. Is that something that just happened incidentally? Or you already knew and expected that you overachieved.\n\n**Moderator**\nThat's why you may come up you might have come up with a more conservative, the forecast outlook. Could you please reflect upon that? And if the current growth was not coincidence, but it was a continuous sustainable growth, high growth that you are really continuously achieving. Then your mid range plan needs to be maybe updated more frequently or quickly. What do you think of that?\n\n**Moderator**\nThank you. Thank you for your question. As you're aware, the it's a mid range business plan. It just span is three years. So this is just the first year.\n\n**Moderator**\nAnd so updating or maybe it's premature in terms of timing to update. Can we scrutinize outside the environment? There are lots of factors of uncertainty. So in three years, we would like to achieve something we had promised to do. Every year, there is maybe fluctuation, maybe the speed of implementation might be expedited or slowed down.\n\n**Moderator**\nIt's inevitable because Forex is also one impact. So tailwind is something we have to make use of against the risks we should be sensitively and quickly cope with. So as much as possible, we'd like to achieve the stable growth. Thank you.\n\n**Operator**\nThis will be the final question. Third row from the front, from the stage to the left hand side. Person with a beige jacket, please. Thank you for this opportunity, Nishimura. And one question from Okasan Securities.\n\n**Operator**\nWe talked about competing on the global stage. That's what you want to do, and you're going to make an effort for that. And so going forward, what about M and A? So is it going to be bigger than before? Are you going to be more aggressive than before about M and A?\n\n**Operator**\nAnd also internally, you said that there are various issues. So to resolve those issues and to enhance profitability in each business, what potential do you have for growth? And how are you seeing the progress? Well, to compete at a global level, well, it's it doesn't lead to bigger M and A. It's not synonymous.\n\n**Operator**\nSo we have to find the appropriate opportunity. And as I said, it has to meet our criteria. If there are those that meet our criteria, we like to study them and act on them. And in terms of solving internal issues, how much room do you have for growth based on solving those issues? What my focus in management would be?\n\n**Operator**\nHow much growth and profitability can we expect in each business? And so in terms of our competitive positioning, the trends of the competitors and market growth, so based on that, we can set a goal of this is how far we should be able to go. And if we short if we fall short of that, we should discuss what is it that's lacking. We should find that out and then try to bring reality closer to ideal. I think it's just an iterative process of that.\n\n**Operator**\nSo for all of the segments, there's not going to be uniform profitability or growth expectations. For each business, there's an ideal situation, and we want to think together how we can approach that, come closer to that. That's all. With that, we'd like to close the Sony Group Corporation consolidated financial results presentation. And the photo session to follow will be for the media.\n\n**Operator**\nSo investors, analysts, please leave the room. Thank you so much for joining us today.",
      "fetched_at": "2026-02-04T15:54:56.406Z"
    },
    {
      "ticker": "6758.T",
      "title": "SONY GROUP CORPORATION (6758.T) Q2 FY2025 earnings call transcript",
      "published_date": "Nov 8, 2024, 4:00 PM GMT+9",
      "fiscal_year": "2025",
      "quarter": "Q2",
      "url": "https://finance.yahoo.com/quote/6758.T/earnings/6758.T-Q2-2025-earnings_call-194139.html",
      "content": "**Speaker 4** (Company Representative)\nOkay, it is time to start Sony Group Corporation's consolidated financial results announcement session. And my name is Okada. I'm with the Sony Group Corporate Communications. First, let me introduce the people on the stage. First, we have President, COO and CFO Mr. Hiroki Totoki. And we have Senior Vice President in charge of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business and entertainment area, Ms. Naomi Matsuoka. And the Senior Vice President in Charge of Finance and IR Mr. Sadahiko Hayakawa. And also Sony Financial Group Inc. Corporate executive officer and CFO Mr. Kazuhiro Yamada. These four will be presenting the second 2024 second quarter actual end full year forecast and then have the Q and A session in of 70 minutes. Mr. Totoki, please. Okay, thank you.\n\n**Hiroki Totoki** (President, COO, and CFO)\nToday, Matsuoka san, Hayakawa san and Yamada san will explain the contents shown here and I will give a general summary at the end. Hayakawa san, please.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nOkay, thank you. Consolidated sales excluding the financial services segment for the quarter increased 9% compared to the same quarter of the previous fiscal year to JPY 2,973.4 billion. Operating income increased 57% to JPY 389.3 billion, a record high for the second quarter and the first half of the fiscal year. Consolidated sales including the financial services segment increased 3% year on year to JPY 2,905.6 billion. Operating income increased 73% to JPY 451.1 billion, a record high for the second quarter. Net income increased 69% to JPY 338.5 billion. The results by segment for the quarter are shown on the slide. Next, I will explain our consolidated results forecast for FY24 full year.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nConsolidated sales excluding the financial services segment have been increased slightly from the previous forecast to 11,800 billion yen. Operating income is unchanged at 1,165 billion yen. Operating cash flow has been increased 40 billion yen to 1,440 billion yen. Consolidated sales including the financial services segment have been increased slightly from the previous forecast to 12,710 billion yen. Operating income and net income unchanged at 1,310 billion yen and 980 billion yen respectively. The full year forecast by segment is shown here. Now I will move on to the explanation of the state of each business. The first is the G&NS segment. Sales for the quarter increased 12% year on year to 1,071.5 billion yen, primarily due to an increase in third party software sales. Despite a decrease in hardware sales, operating income increased 184% year on year to 138.8 billion yen, a new record high for this segment. In the second quarter.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nDue to an increase in the profit of hardware, third party software and network services, we have increased the full year forecast for sales by 4% from the previous forecast to JPY 4,490,000,000,000. Taking into account the results of the quarter, we expect operating income to increase 11% to 355 billion JPY, a new record high for profit for this segment. Now I will discuss the state of the business starting from our platform business. The number of monthly active users across all PlayStation platforms in September increased 8% compared to the same month last year to 118 million accounts, making the eighth consecutive quarter of growth compared to the same period of the previous year.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nThe total playtime also increased 14% compared to the same month last year and 11% on a cumulative basis since the beginning of the current fiscal year compared to the same period of the previous fiscal year, demonstrating steady growth for the platform. PS Plus is providing a stable base of earnings as sales on a US dollar basis increased 18% year on year. This is due to an increase in ARPU, primarily resulting from the shift to higher tiers of service and the impact of price revisions. As for third-party software, sales significantly grew due to contributions from solid franchise titles as well as hit new IP including a new sports title and an action RPG title from China. Next is the studio business. Astro Bot, released on September 6, has received a Metacritic score of 94 and has garnered high praise from the gamer community.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nIt is a hit which has sold over 1.5 million copies in the nine weeks since its release. 37% of the users who purchased Astro Bot had not purchased a first-party title from us in the last two years. The percentage of younger age groups and families purchasing the title was much higher than other titles and the title is contributing significantly to a widening of the user base. Through the acquisition of new users and expansion of our title portfolio, we launched two new live service games this year. Helldivers 2 was a huge hit while Concord ended up being shut down. We gained a lot of experience and learned a lot from both.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nWe intend to share the lessons learned from our successes and failures across our studios, including in the areas of title development, management, as well as the process of continually adding expanded content and scaling the service after its release. So, to strengthen our development management system, we intend to build an optimum title portfolio during the current Mid-Range Plan period that combines single-player games, which are our strengths and which have a higher predictability of becoming hits due to our proven IP, with live service games that pursue upside while taking on a certain amount of risk upon release. As the quarterly results show, the platform business has strong momentum, and we expect to see stable expansion of user engagement and associated revenue growth in the second half and beyond.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nIn the studio business, we expect sales and profits to decline in the second half of the fiscal year compared to the same period of the last fiscal year when Marvel's Spider-Man 2 and Helldivers 2 were huge hits. However, we are making steady progress in the development of new titles and improving our live service game process starting with Ghost of Ytei, which is a sequel to the smash hit Ghost of Tsushima. We plan to continue releasing major single-player game titles every year from next fiscal year onwards.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nNext is the music segment. Sales for the quarter increased 10% year on year to JPY 448.2 billion and operating income increased 12% to JPY 90.4 billion, primarily due to an increase in live performance, merch, merchandising and license and streaming revenues. Streaming revenue for the quarter increased 9% year on year for both recorded music and music publishing, a 5% and 6% increase respectively on a US dollar base. The FY24 forecast remains unchanged from the previous forecast. We are expanding our business globally in markets where streaming is fast growing, such as emerging market, including through digital music distributions and artist services provided by The Orchard and AWAL. On the other hand, in countries and territories where streaming is more widespread, consumption of catalog music is increasing.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nFor example, the share of consumption of the catalog music released more than 18 months ago reached 73% in the recorded music market in the United States. Additionally, in the Spotify Global Top 200, the share of songs released more than 10 years ago has increased significantly from less than 5% in the calendar year 2020 to more than 20% through the end of July 2024. This is primarily due to a shift in the age demographic of users to more mature age group in those countries and territories as well as younger listeners having more opportunity to consume major hit songs from the past. Due to discovery on social media platform, we have carefully selected and acquired evergreen music catalogs through investment or the signing of a licensing agreement.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nThese music catalog assets serve as a stable earnings foundation for the long term, not only from the consumption of streaming but also from the use in the media such as movies and advertisement. Additionally, by also acquiring names and image and likeness rights related to the music artist for some catalogs, we are pursuing additional monetization opportunities like merchandising and experiential live events that use these rights. Next is the Pictures segment. The sales in the quarter decreased 11% year on year to JPY 355.8 billion, primarily due to a decrease in the number of television programs deliveries, in part due to the impact of the strikes in the previous years. Operating income decreased 37% year on year to JPY 18.5 billion, mainly due to the decline in sales.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nFor FY24, we forecast sales to decrease slightly from the previous forecast to JPY 1,510,000,000,000 and operating income to decrease 8% to JPY 115 billion. We have revised downward forecast for the operating income from the previous forecast, primarily due to a revision in the results forecast of our India business in the media networks in motion pictures. It Ends with Us, a film adaptation of the best-selling novel released on August 9th, generated box office revenue significantly exceeding our expectations and contributed to the result of the quarter. We are still recovering from the impact of the strikes, but the number of major films released after the end of the strikes has been increasing such as Bad Boys: Ride or Die released in June and the Last Dance released last month.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nWe expect the television and video streaming services licensing revenues to recover from the second half of this fiscal year through the next fiscal year. Crunchyroll is actively expanding its global user base, including partnering with the Amazon Prime Video channels and then signing a distribution agreement with the YouTube Primetime Channels where the service is scheduled to launch towards the end of the year. Moreover, we have begun streaming many new anime titles from the second half of this fiscal year and aim to further increase engagement with anime fans around the world. Regarding our business in India, the operating environment is challenged primarily due to a softness in the ad market and a decrease in viewers over paid television.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nHowever, under the new local management team that started in August, we are strengthening our operations and rebuilding our strategies to grow the business over the mid to long term, including continuing to improve viewership through restrengthening of our programming. Next is the ET&S segment. Sales for the quarter were 619.8 billion JPY, essentially flat year on year. Operating income increased 15% year on year to 70.2 billion JPY, mainly due to the favorable impact of foreign exchange rates and cost reduction effects. The FY24 forecast remains unchanged from the previous forecast.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nMajor markets such as North America, Europe, China and Japan remain generally stable during the quarter and solid business operations enable us to achieve operating income exceeding the same quarter of the previous fiscal year. We continue to pay close attention to inventory control and while overall segment sales remained essentially the same as in the same period of the previous fiscal year, we were able to reduce inventory by approximately 10% at the end of the quarter. On the other hand, the imaging business which significantly grew year on year in the first quarter ended June 30, 2024 mainly in China, was essentially flat year on year in the current quarter.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nAs a result, we have incorporated into our forecast a proactive change to a more cautious production inventory plan in preparation for the year-end selling season in the sports business which is a growth area. We are working to further expand our business opportunity by collaborating with the partners in incorporating new technologies centered on Hawk-Eye which provides referee decision support solution based on the video data. On August 1st we announced technology partnership with NFL in the United States. Through this collaboration we aim to advance the practical application of a cutting-edge sports-related technology such as using Hawk-Eye to assist referee decision, improving the accuracy of measuring key game metrics such as yards gain through the video data analysis.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nAlso on October 15th we completed the acquisition of KinaTrax, a U.S. company that uses high precision motion capture technology and data analysis to provide support services such as those aimed at improving athlete performance. The company has a strong affinity with Hawk-Eye in terms of technology for acquiring highly reliable sports data. We expect great synergy in terms of maximization of data accumulation and use. Although the sports business is not large in scale, we expect it to generate stable and high profits and aim to continue to focus on expanding it.\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nNext is the INS segment. Sales for the quarter increased 32% year on year to JPY 535.6 billion primarily due to increased sales of image sensors of mobile products and the impact of foreign exchange rates. Operating income approximately doubled year on year to JPY 92.4 billion primarily due to the benefit of the increased sales and the favorable impact of foreign exchange rates. For FY24, we forecast sales to decrease 4% from the previous forecast to JPY 1,770,000,000,000 and operating income to decrease 9% to JPY 250,000,000. The global smartphone market continued its gradual recovery trend with positive YoY growth continuing in China and Europe and signs of recovery in the North America market. Mobile sensor sales during the quarter significantly increased due to an increase in unit prices resulting from larger die sizes and steady shipment of image sensors for new products to a major customer.\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nThis led to the segment overall recording its highest ever second quarter sales. On the other hand, with regard to the second half, we have downwardly revised our sales and profit forecast for mobile sensors to reflect revision in the production plan of our major customer. The introduction of AI functionality and services into smartphones which is currently underway, may bring short term volatility to the high end market depending on the speed of rollout and initial reception. However, in the mid to long term we expect that convenience brought by AI will make smartphone functionality more attractive, revitalizing the market and encouraging a shift to high end products. On the production side, improvement in yields for mobile sensors are progressing as planned since the beginning of the fiscal year and we expect to achieve normal run rate in the fourth quarter ending March 31, 2025.\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nLast is the financial services segment. Financial services revenue for the quarter decreased JPY 167.2 billion year on year to negative JPY 63.3 billion primarily due to the impact of market fluctuations at Sony Life. This was due to the significant appreciation of the yen during the quarter which led to a significant decrease in the yen-based valuation of the asset under management for the foreign currency denominated insurance. However, since the valuation of liabilities declined in a similar manner, this did not have a significant impact on profitability. Operating income increased JPY 50.1 billion year on year to JPY 65.7 billion primarily due to the impact of interest rate fluctuations at Sony Life Insurance. Results at Sony Life, which are the baseload of profitability for the business, continued their stable trend at JPY 49 billion. FY24 forecast remains unchanged from the previous forecast.\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nSony Life's new policy amount continues to be strong with the cumulative first half growth of 14% compared to the same period of the previous fiscal year. Preparations for the partial spin-off and the listing of Sony Financial Group Inc., planned for October next year, are progressing smoothly. As a part of those preparations and in order to strengthen its governance and accelerate its decision-making, SFGI transitioned to a company with three committees corporate governance structure as of October 1st. Next, I will explain efforts to improve and stabilize our economic value-based solvency ratio, which is an important issue ahead of the listing. ESR is an indicator of financial soundness of financial services business. It shows the level of capital relative to amount of risk calculated based on conservative assumptions after assets and liabilities evaluated on economic value basis.\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nAs shown on this slide, the ESR of SFG on a consolidated basis is within the target range. However, the high sensitivity of ESR to interest rate fluctuations is an issue for the life insurance business and we are implementing measures to reduce sensitivity in terms of both capital and risk amount with regard to capital which is the numerator of ESR. The assets held on the balance sheet such as JGBs and our bonds exceeded insurance liabilities, resulting in an over-hedged situation and a structure in which net assets decrease when interest rates rise. In order to correct this, we sold the portion of our yen-denominated bonds so as to mitigate over-hedging and we are currently undertaking transactions designed to curb capital fluctuations. The amount of risk which is the denominator also increases as interest rates rise.\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nWe are working to refine our risk measurement methods and further improve our risk management. We have created a two- to three-year roadmap improving and stabilizing ESR and we will continue to report on our progress and results. Finally, I would like to give you an overall summary. The key performance indicators for the entire Sony Group in the first five-year Mid-Range Plan are the growth rate of the operating income of 10% or more and a three-year cumulative operating income margin of 10% or more, both on a consolidated basis excluding the Financial Services segment. The consolidated result forecast for this fiscal year announced today predicts a new record high operating income, a year-on-year growth rate of operating income of more than 10%. An operating income margin of 10%.\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nWe believe that we have gotten off to a good start in the first year of this Mid-Range Plan. In the second half there will be no major first-party software title releases in G&NS and there will be an adjustment in demand from major customers in I&SS. As a result of these and other factors, consolidated operating income excluding the Financial Services segment is expected to be slightly lower than the same period of the previous fiscal year. However, business momentum is currently good, particularly in the G&NS and Music segment. We aim to produce solid results in order to achieve the targets of our Mid-Range Plan. Moreover, under the Mid-Range Plan we aim to strengthen shareholders' return and the cumulative amount of shares repurchased through the end of October out of JPY 250 billion authorized this fiscal year was JPY 237.1 billion.\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nAmid a rapidly changing business environment, we will continue to manage our business in a way that will enable us to achieve sustainable growth across the entire group and while addressing the various challenges that each business face. That's all for my explanation.\n\n**Operator**\nSo that was a presentation by Mr. Totoki, Ms. Matsuoka, Mr. Hayakawa and Mr. Yamada. After this, from 4:25 P.M. we'll have Q and A session with media persons and the Q and A with investors. Analysts will start at 4:50 P.M. and each session will last for 20 minutes and those of you who have already registered to ask questions, please connect the designated telephone number and the method to ask questions and the other notes associated with that that has been informed to you by a separate invitation. Thank you for waiting. Now we'd like to start the Q and A. We'd like to respond to the questions from media people and as was the case with the presentations, we have these four people who have made the presentations responding to your questions. Now I would like to start the Q and A.\n\n**Operator**\nWe ask you to limit your questions to just two questions and if you have a question please press on your phone * then number 1 and first we have Umegaki-san, Toyo Keizai.\n\n**Hayato Umegaki** (Reporter)\nThis is Umegaki of Toyo Keizai. I have two questions. First, I&SS downward revision: the overall market is recovering but the I&SS is revising downward. What is the outlook for the next fiscal year and smartphone has been getting image sensor becoming larger and larger but isn't there any risk having a consolidated business with a large maker? And the next question is about the game business. Two years ago in 2022 Totoki-san mentioned about the issues and then you have became risk management and then the of the personnel and some studio closure as well and how much of the reform has progressed as of now?\n\n**Hiroki Totoki** (President, COO, and CFO)\nThank you for your questions.\n\n**Hiroki Totoki** (President, COO, and CFO)\nThe first question about the I&SS. Second question was about game and network services. I will answer both questions. First, about I&SS, the market is said to be recovering, but it's very slow, so I think it is just provisional, and for this particular quarter, our customer has revised their production plan, and we followed our outlook revision downward, but there are different reasons for production adjustment, and so it is part of the business as you know, and so it is not to impact next fiscal year, so we have not changed any forecast for the, and also your comment about the risk of having a concentrated customer base, and that is not a new-found challenge, and we hope to continue to work on expanding our customer base, and about the gaming, and we are reforming. We are not only changing the business structure but also game development approach.\n\n**Hiroki Totoki** (President, COO, and CFO)\nWe are taking a new look and also portfolio concept to be introduced and regardless of the personnel we have different cost cut in different areas and also optimization of investment in sales and marketing we are doing all these and as a combination I think we got very good results. Now the question of to what extent this reform has progressed and this is kind of a Kaizen improvement we need to continue to do which we surely intend to.\n\n**Operator**\nSo let's move on to the next questions, Iwato-san from Nikkei Business. Please go ahead.\n\n**Hisashi Iwato** (Reporter)\nThis is Iwato from Nikkei Business. I hope you can hear me.\n\n**Operator**\nYes, I can hear you fine.\n\n**Hisashi Iwato** (Reporter)\nSo I have one question with regards to G&NS in live service game, the current status. What do you make of that? And you have the huge hit and also you discontinue certain services and basically how are you managing the portfolio in terms of development?\n\n**Hiroki Totoki** (President, COO, and CFO)\nThank you very much for your questions, but currently we are still in the process of learning and basically with regards to new IP. Of course you don't know the result until you actually try it. So for.\n\n**Hiroki Totoki** (President, COO, and CFO)\nFor us, for our reflection, probably we need to have a lot of gates including user testing or internal evaluation and the timing of such gates, and then we need to bring them forward and we should have done those gates much earlier than we did, and also we have a siloed organization so going beyond the boundaries of those organization in terms of development and also sales and I think that could have been much more smoother, and then going forward in our own titles and third party titles we do have many different windows and we want to be able to select the right and optimal window and so that we can deploy them our own platform without cannibalization so that we can maximize our performance in terms of title launches. That's all I have.\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nNow, next we move on to the next question from Nikkei Omichi-san. Please,\n\n**Kyoka Omichi** (Staff Writer and Correspondent)\nOmichi from Nikkei, and can you hear me?\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nWell, can you just speak more loudly?\n\n**Kyoka Omichi** (Staff Writer and Correspondent)\nOh, Omichi from Nikkei, can you hear me?\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nYes, we can hear you.\n\n**Hisashi Iwato** (Reporter)\nThank you. I have two questions, and the first question is that in the U.S. the election, Trump had a victory so for foreign exchange or the tariff there will be change. How do you perceive the impact of his election on your business? And this year you actually acquired Pink Floyd and Queen the rights and for the Michael Jackson the IP of his music has been acquired by you and so for those the music what is the role the long-term stable, the revenue or synergy effect on other businesses, what is your expectation about those new business?\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nFirst, the impact of the U.S. presidential election on our business. Second, with regard to music, Matsuoka-san will answer your question. And as regards the impact of the U.S. presidential election on our part, we respect the choice of the U.S. public so that means that election results how it impacts on the global economy or geopolitical situation. I'm not expert on that and there are many experts on those areas so we'd like to just depend on their analysis. But when it comes to the impact on our own business. The United States has a very broad impact on the global economy and also has a very large geopolitical impact. And so of course that will directly impact on our business. Therefore, we would like to observe the facts of the matter and make analysis about them.\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nWe would like to look at the future and do what we are able to do. When it comes to the tariff issue that has been very often discussed recently, but that is just a general discussion. We have to have a very accurate prediction and we have to think about the optimum level of shipment, which country becomes a producer and in what way we conduct shipment and how we are able to optimize a plan and how we are able to look at the pricing for that. Of course we have been doing that. We have to once again look at this and study this carefully. The second question is about music. Matsuoka-san will answer your question.\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nThank you for your question. Which catalog?\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nWe haven't identified particular catalogs but those catalogs and our plan to acquire them will contribute to the stable source of recurring income, and so that may generate the stable return, and so we have many use opportunities and so we are able to create opportunities upside and for IP value of Sony as a whole. For instance, there is a likeness or image, right? So those are peripheral, the NIL, the rights, and by acquiring those catalogs across the Sony Group, we are able to expand the usage of catalogs. Therefore, in that sense of course we should have always disciplined approach and to look at the opportunities for acquisition of catalogs. Thank you.\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nIf I may supplement in my speech, as I mentioned recently, in the market, particularly in the streaming market, the service users and listeners their age the group has become more of a mature age group. In other words, Evergreen Music has been more often listened to by those groups. So for us, I believe that that is a very important asset. And the fact that we have evergreen catalogs that also shows our attitude of commitment to the artists and therefore through a and all activities. And so we would like to use it as the asset to give a very good spin off.\n\n**Operator**\nOkay, let's move to the next question. Horikawa-san, Bloomberg please.\n\n**Operator**\nThank you. This is Horikawa from Bloomberg. Can you hear me? Yes, please go ahead. I have two questions. First, about the game business this quarter PS5 hardware is the target 18 million units it's unchanged and PlayStation 5 Pro is released so it will be. Some people say it will be difficult to have a wide user base with JPY 120,000. What is the plan for sales of PlayStation 5 Pro as well and the second additional investment to Rapidus and have you made the additional investment? If yes and what is the reason for the additional investment?\n\n**Hiroki Totoki** (President, COO, and CFO)\nOkay, thank you for the question and the first question about the PS5 sales 18 million units is that unchanged? Answer short answer is yes, will remain.\n\n**Hiroki Totoki** (President, COO, and CFO)\nFirst quarter was slightly weaker than planned, and second quarter pretty much a target, and that has been the actuals in the first half. For the second half of this fiscal year, we will have some sales promotion in our plan, and in the first half of the year we did not introduce a price reduction which we had for PlayStation 4 in the past, so we have been able to sell through without the discount.\n\n**Hiroki Totoki** (President, COO, and CFO)\nNow, PS5 Pro unit numbers are included in this. PS5 Pro is rather high-end; core hardcore users are the target of this hardware, so we don't have a large contribution in volume and compared with the PS5. I think it is in fact stronger, and in terms of the pricing, many people made different comments on that, but pricing for PS5 Pro has not had a negative impact, I don't think. And second question about Rapidus additional investment, and we, I apologize, we do not make comments on individual specific projects like this, but our basic thinking is that the semiconductor industry is needed for the growth of the economy and also for the economic security. As such is very important, as we are one of the members of that industry. If the semiconductor industry is to be enhanced and we believe that will strengthen the infrastructure and the technology personnel base and that's good for industry, so we want to make a due contribution to that. it.\n\n**Operator**\nWe are running out of time so we have time for two more persons for questions and please press asterisk and then number if you wish to ask a question. Suzuki-san from Weekly Diamond.\n\n**Operator**\nMy name is Suzuki from the Weekly Diamond. I hope you can hear me and please limit your question to only one. In the interest of time I'd like to ask you a question about game business in live service business and then you fail the Concord and also you gain a success and you have two different experiences and I'm sure that will have given you a lot of learning and that's what you explained. Can you talk a little bit more about that and what didn't work and then what really work? Can you elaborate on that?\n\n**Hiroki Totoki** (President, COO, and CFO)\nThank you very much for your question. I might be repeating myself.\n\n**Hiroki Totoki** (President, COO, and CFO)\nBut. In terms of what didn't work, we need to have more detailed confirmation or validation, and we should have done those more. And then we need to have more detailed gates to make sure that we check the user test, or we need to repeat those gates more so that we could have caught it earlier to determine whether that will be accepted by the users or not.\n\n**Hiroki Totoki** (President, COO, and CFO)\nWe need to have more information that will enable us to make more sound decisions. I think that's the overall reflection. In terms of what worked and looking back on what worked, we usually don't do that, but if things are really working, and then of course like in all the things that I have said work really well to really produce a great result, and looking back on the past, so I think we need to go back to the basics and then make it really stronger.\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nThe next question will be the last question. Sato-san from Nikkei, please.\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nSato from Nikkei, can you hear me? Yes. Please just confine your question to one regarding Concord. I have a question. Actually, it's not easy to pay attention to that. And for Sony Group anime films and games, well, you have diverse contents so you have produced diverse content and so how you are going to combine them from Concord the lessons how you are able to take advantage of the lessons from Concord. Regarding that matter, as lessons we have learned a lot, but the way to face the issues regarding PC for instance, the PlayStation accounts that we have offered and well, actually by offering them for instance sometimes that tends to invite pushback but for the live service games.\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nSo in order to maintain order of the gaming so that anybody can enjoy the game safely and we need to create environment conducive to that. Of course, enjoying the game freely and having some restrictions may not call it rule but to ask the users and gamers to follow the manner and those balance is very important. We have to continue to seek the best way to achieve this. So the time runs out. So now we would like to bring an end to the question answer from media and from 4:52 we would like to start question answer for the investors and analysts. So please wait for a while. We'd like to begin the session for the analysts and investors. Please wait until the session is.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nThank you for your patience. Now we'd like to start the Q and A session for investors and analysts. My name is Kondo, I'm with the IR group of Sony Group Corporation and as is the case with the media session, we have these four persons responding to your questions. And when you ask questions, we have sent you the instruction included in the invitation. We ask you to limit your questions to just two questions at the most. So we'd like to start. So if you have a question, please press * and number one on your phone. So SMBC Nikko Securities Katsura-san please.\n\n**Ryosuke Katsura** (Analyst)\nOkay, thank you very much. SMBC Nikko Securities Katsura and I would like to talk about I&SS and ET&S each for I&SS in the additional documents page.\n\n**Ryosuke Katsura** (Analyst)\nWafer production capacity is now at full and you will continue we will start adjusting that and what will be the period you will be adjusting making adjustment and also on page eight there is an inventory level. So with the addition of the impact from the Forex, has there been any change in the outlook? That's the first question. And the second question about ET&S is about the digital camera. You have become more cautious about your outlook for digital cameras market. Now that revision is limited to that only or ET&S as a whole. You are taking another look and as a result we have flat unchanged as a whole. But the plus and minuses we could expand on.\n\n**Hiroki Totoki** (President, COO, and CFO)\nThank you for your question.\n\n**Hiroki Totoki** (President, COO, and CFO)\nRegarding I&SS utilization rate, currently as you know, full production capability is utilized for the third quarter. We plan to have the same shift of full operation. And as of now we have regarding the inventory, I think as of late end of March we have a little bit more production at the inventory. I talked about the production control adjustment so we will cut back the inventory a little bit as such and so we do not consider is needed to adjust the production much.\n\n**Hiroki Totoki** (President, COO, and CFO)\nAnd as for ET&S as a whole, there is some change. ET&S as a whole, that. Is.In China, the market, the TV market is softening and worldwide not much change though. So that's how we view the TV market. And for the increased cost for logistics, that is now included as a risk in the October assumption and in imaging because of a competitive condition there is an increase in the sales promotion cost and also Chinese market risk is also incorporated. But in the initial plan we had overall risk as a whole as well. So we did not change the full-year forecast for operating income this time. Thank you. Katsura-san,\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nmoving on to J.P. Morgan's Ayada-san, over to you.\n\n**Junya Ayada** (Analyst)\nThis is Ayada from J.P. Morgan, and I have two questions with regards to game. The first one is in the second quarter there was a huge jump so I like you to take a note. And then there was an increase in profit by JPY 8.85 billion because of the foreign exchange and then also the hardware and third-party network, what was the profit contribution of each? And in terms of hardware, I think you turned a profit in the second quarter and do you think. And then also you mentioned this profit improvement of the hardware in the second quarter. In all, what was the driver behind that?\n\n**Junya Ayada** (Analyst)\nThat was the first question, and then the second question is looking at the game, especially hardware in the second half and the third party software lineup in the second half not compatible with PS4 but some titles are only compatible with the PS5 and there has been an increase in the number of that. And what's the thinking behind that and upgrade? Are you sort of expecting the accelerated transition from PS4 to PS5? Because we are talking third parties and those users with the PC and PS4, they might be able to purchase it for PC and there might be such a risk. And how do you view such risks and opportunities? I know that you overdelivered in the second quarter, so maybe you might have decided to increase the marketing promotional costs in the second half.\n\n**Hiroki Totoki** (President, COO, and CFO)\nSo, with regards to gain in the second quarter and in terms of operating income growth, you have given us your analysis, and in our view it's very clear, close to what you have said, and also the sequence that you mentioned. You are correct. So, in terms of profit growth, we haven't disclosed that. But, speaking about the reason for the improved profitability of hardware in last year's second quarter as compared to the current second quarter of last year, we made a switch to the new models, which means that the cost structure improved, and then that also generated a positive contribution to the profit. And then also we launched new models in the third quarter of last year. So, basically, the cost structure remains unchanged compared to the second half of last year.\n\n**Hiroki Totoki** (President, COO, and CFO)\nBut the average selling price has improved, which is expected to generate the profit improvement year on year. With regards to third quarter, as you know, which is the volume-driving quarter end of the year. Yes, we have included a marketing promotional expense increase, and not drastic increase. If you look at and focus on only that, you might see that there would be a slight deterioration of the profitability. But that's also. Thank you very much, and sorry I forgot to address one more question with regards to upgrades. The third-party lineup only for PS5, and then you said that there might be an increase in the number of the titles, but because of the timing and because of the late stage of the console cycle, and naturally we have more titles for PS5.\n\n**Hiroki Totoki** (President, COO, and CFO)\nBut if the transition from PS4 to PS5 will continue, we believe that transition is happening and as we expect. So if you upgrade to PS5 basically and of course there would be upside in the software purchases and then we see that as a possible opportunity. And then as for the risk for third-party software for PC and we don't, we don't see that as a risk and we haven't seen that as a trend emerging. That's all I have.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nThank you. The next question is Citigroup Ezawa-san, please, is from Citigroup.\n\n**Kota Ezawa** (Analyst)\nI have two questions, and regarding hardware and the results of the game, the relation between this, and also another question pertains to music, as for game. Operating income forecast the JPY 34 billion upward, the revision, and the first half and the second quarter results are better than your plan.\n\n**Kota Ezawa** (Analyst)\nSo is that just a mere addition of that increase on the second quarter just in terms of numbers because hardware profitability improvement seems to be the major factor to increase the results of second quarter and the cost structure has improved and the profit has increased so that may increase the profit of the second quarter but that is not reflected so I just wonder whether that is reflected in the second quarter results or forecast? And the second question pertains to music. In Evergreen the music has been more often listened to by users and until a few years ago the hit chart of new songs Sony Music artists the portion share was the largest and you put a lot of the emphasis on that and Latin America and indies you have made a lot of the emphasis in order to increase the hit songs of the new artist or new songs.\n\n**Kota Ezawa** (Analyst)\nThe fact that the change happens reflects the change of your position of the music business or generally in the music industry. This is a general trend of music industry that people listen to the older music more often than just the new songs. Thank you.\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nRegarding the game, answering your question, during the Q2, the reason the sales was so solid, that is also reflected in the second half. And hardware, the profitability magnitude is larger during the first half, and because a new model was introduced during the first half, the timing was important. And during the second half, sales and marketing, we have to spend more money, and so that is the reason for this difference. And as for Q4, the fourth quarter, there will be slightly more upside, and I expect a great deal, but I should not have any predetermined forecast for that, so we actually follow the forecast as is presented now. And regarding your question on music, I ask Matsuoka-san to speak, and then I will supplement her comment. Now, in my presentation, as I mentioned earlier, for the DSPs, the maturity of the market, in other words, in the developed countries, the age group has become older, and also in the SNS, some of the old songs have been listened to more often than before.\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nWhat is called Evergreen, the music or songs, the share and also frequency of that music being listened to has been increasing. That is a general trend of the music industry. In emerging markets where the gross market potential is expected, like Latin America or India, there are many pieces of music which have been listened to. And we also pay attention to that to acquire the new label, etc. In terms rather than the preference of users, the composition of the market itself has changed. I think that is a way you should interpret the music market right now. To supplement on our part, the Evergreen catalogs that, the results of our investment, they have been listened to more than we expected. That leads to upside our profitability. That we welcome very much.\n\n**Naomi Matsuoka** (SVP of Corporate Planning and Control, Lead of Group Diversity, Equity and Innovation Portal, Financial Services, Business, and Entertainment)\nAnd in addition to that, say, new songs in Latin America, that does not mean that they compromise the new songs from Latin America. So we would like to put emphasis on the Bose so that we can enjoy the upside of the profitability from the Bose.\n\n**Kota Ezawa** (Analyst)\nThank you.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nOkay, let us move to the next questions. We have Yasui of UBS Securities.\n\n**Kenji Yasui** (Analyst)\nThank you. Once again, my name is Yasi. I like to ask two questions. In terms of the music streaming business, since summer, the streaming growth is slowing down. That's what the competitors are saying, and that's getting some attention. It used to be double-digit growth, but now single-digit. Also, your performance in DSPs was 5% growth only. So it is temporarily slowing down. Or is that kind of structural? If you could comment on that. The second is about semiconductor second-quarter profitability. About 17%-18% profitability. In the past second quarter, it was like 20% and above. So 17%-18% is rather slow with better yield, full production. I would imagine the better profitability.\n\n**Kenji Yasui** (Analyst)\nAnd the wafer input is increasing in dollar base as well. And the wafer cost with the change of forex rate. And if you could comment on that situation.\n\n**Hiroki Totoki** (President, COO, and CFO)\nThank you for the question. First question about the music. Matsuoka san will respond. And on ISS second question, I will respond. Matsuoka san, please. Regarding streaming, which has two aspects, publishing and production, and streaming growth trend is pretty much in line and still stable growth. But compared with the past, like first quarter of 2023 and before, there are multiple DSP which raised their price and that kind of made it look like they are growing rapidly. But in terms of production of the streaming, the audio portion has grown from quarter one to quarter two. As for video streaming service growth is slowing down. That's true.\n\n**Hiroki Totoki** (President, COO, and CFO)\nAs a whole, that is kind of bringing down the growth rate. So that's where current Xperia is. But the overall structure has not changed. So the DSP price hike timing and so on may change the streaming growth rate and DSP paid subscribers are still increasing and I think there is a room for price raise in the future. And so those are some of the factors at work in the background. Okay, let me talk about I&SS which was the second question. And OP margin was 11.4% and this year 17.3% operating profit margins last year and this year and last year was slow because of the yield issue we had. And also so Q2 did not have a full shipment as we expected.\n\n**Hiroki Totoki** (President, COO, and CFO)\nLast year's second quarter was not a good quarter, but this year, as far as the shipping is concerned, shipment and that has recovered and brought us to the 70.3% of the profitability. Now, can we expect higher? That's for high-end sensor development as well. We are making investment in that and also increasing its capacity. The capital investment depreciation will have to be accounted, and we are not 100% successful in terms of investing and still getting enough profitability. We intend to continue to improve.That profitability.\n\n**Sadahiko Hayakawa** (SVP in Charge of Finance and Investor Relations)\nSo we are running out of time. So the next person will be the last person who asks a question and please limit your question to only one. Nakane-san from Mizuho Securities. Please go ahead.\n\n**Yasuo Nakane** (Analyst)\nThank you. My name is Nakane from Mizuho Securities and operating cash flow and that's I like to ask you about and the Financial Services and operating cash flow JPY 40 billion and has been revised to JPY 1.44 trillion. And what's the upside and downside from this and we can forecast their profit. But what are the other aspects especially inventory and then also at this point in time and I know the network business is doing really well so what about the operating capital and there might be some impact.\n\n**Yasuo Nakane** (Analyst)\nThen, towards the end of the year, apart from the profit, are there any factors that will affect the operating cash flow? And can you at least talk about the factors that will impact the operating cash flow?\n\n**Hiroki Totoki** (President, COO, and CFO)\nThank you very much for your question. So, operating cash flow excluding financial has been upward revised by JPY 40 billion. Thank you very much for that question. As you pointed out, an upward revision by JPY 40 billion yen that is driven by the improved profitability of the game business and as you said, compared to last year, operating cash flow has increased significantly. That is driven by the improvement in the working capital in the game business. With regards to inventory situation, compared to last year, each business has a better control of the inventory and we are tightly controlling the inventory.\n\n**Hiroki Totoki** (President, COO, and CFO)\nAs we gear up for the year and selling season, the gaming and ET&S businesses, of course we need to watch closely the market development so that we can accurately forecast the operating cash flow. Thank you very much. With regards to the question as to other key factors that you pay attention to. I don't think there are any notable upside downsides apart from the working capital. For us, as we get closer to the year end selling season, what sort of inventory level that we need to have and of course we need to have a process improve in place to normalize that and then we need to do that in timely manner and then that will have an impact on the cash flow.\n\n**Hiroki Totoki** (President, COO, and CFO)\nSo, how diligent and how detailed and granular we will be able to do that, and I think that will have an impact on the operating cash flow and working capital. With that, we would like to conclude the Sony Group consolidated financial results announcement session. Thank you.",
      "fetched_at": "2026-02-04T15:55:00.968Z"
    }
  ]
}