{
  "ticker": "8035.T",
  "last_updated": "2026-02-04T15:54:36.672Z",
  "total_transcripts": 5,
  "transcripts": [
    {
      "ticker": "8035.T",
      "title": "TOKYO ELECTRON (8035.T) Q2 FY2026 earnings call transcript",
      "published_date": "Oct 31, 2025, 4:00 PM GMT+9",
      "fiscal_year": "2026",
      "quarter": "Q2",
      "url": "https://finance.yahoo.com/quote/8035.T/earnings/8035.T-Q2-2026-earnings_call-369057.html",
      "content": "**Operator**\nIt's time for us to start Tokyo Electron Financial announcement for the second quarter of fiscal year ending March 2026. Thank you very much for joining us today despite your busy schedule. I am Yatsuda of IR Department, serving as the moderator for today's session. Let me introduce today's attendees. Toshiki Kawai, Representative Director, President and CEO. I am Kawai. Thank you very much. Hiroshi Kawamoto, Senior Vice President, General Manager, Division Officer of Finance Department. I am Kawamoto. Thank you very much for joining us today. Before starting the presentations, let me explain the flow of today's session. First of all, Kawamoto and Kawai will make presentations. After that. Until 6:00 P.M. Japan time, we will have a question-and-answer session where we entertain questions from the audience. This meeting uses two channels of Webex for the simultaneous interpretation between Japanese and English.\n\n**Operator**\nAs we explained in our email, you are kindly requested to use apps on PCs and mobile terminals if you wish to ask questions, but if you're not going to ask questions, you can use telephones. Since this conference is intended for institutional investors and analysts, we would appreciate your understanding that we receive questions only from institutional investors and analysts as usual. We will post the audio contents of this conference in Japanese and English on our website within a couple of days. It would be appreciated if you could also visit our website. First of all, Mr. Kawamoto will present the Consolidated Financial Summary. Once again, good afternoon. I am Kawamoto, Finance Division. I'd like to present the Consolidated Financial Summary of the second quarter of the fiscal year ending March 2026. This slide shows the quarterly financial summary.\n\n**Operator**\nI will mainly refer to the figures in the blue box. In the second quarter, we generated net sales of JPY 630.0 billion, which is in line with our guidance, a 14.6% increase quarter over quarter. Gross profit was JPY 284.8 billion, a 12.12% increase from the previous quarter. Gross profit margin was 45.2%, a 1.0 percentage point drop quarter over quarter due to the increased ratio of fixed costs. Operating income was JPY 158.4 billion, a 9.5% increase from the previous quarter. Operating profit margin was 25.1%. Declined by 1.2 percentage points quarter over quarter, mainly due to the impact of increased development expenses. Income taxes increased by 6.0% to JPY 161.0 billion. Net income attributable to owners or parents was JPY 123.8 billion, a 5.1% increase quarter over quarter.\n\n**Operator**\nCapital expenditures in the second quarter were JPY 991.2 billion, consisting mainly of the payment made at the start of construction of the production building at Tokyo Electron Miyagi and development building of Tokyo Electron Kyushu. This is a graphic representation of the financial summary shown on the previous page on the chronological basis for your reference. This shows the financial summary on the semi-annual basis. The figures in the blue box are financial results in the first half of this fiscal year. The far right column shows the financial estimate for the first half of this fiscal year we announced on July 31. As you can see, our results, in most cases, exceeded our guidance. This slide shows net sales by region. As for the composition in the second quarter, the proportion of Korea rose by 5 percentage points quarter over quarter to 21.1%.\n\n**Operator**\nThe proportion of sales in China was 40.3%. In the second quarter, reflecting the trend of pulling forward from the second half of this fiscal year. This shows SBE new equipment sales by application. In the second quarter, from the bottom of this chart, sales to non-memory customers accounted for 59%. Non-volatile memory accounted for 14%, and DRAM accounted for 27%. In the first half of this fiscal year, the composition of SBE new equipment sales by application was mostly in line with our estimates. This shows the field solution sales. In the second quarter, field solution sales were JPY 160.3 billion, thanks to the high utilization rate of the customers' fabs in the second quarter. Sales of services were strong, and modifications increased as well. As a result, field solution sales grew by JPY 19.1 billion quarter over quarter. This slide shows the balance sheet.\n\n**Operator**\nThe total assets were JPY 2 trillion 667.0 billion. Cash and cash equivalents were JPY 455.2 billion, increasing by JPY 87.7 billion from the previous quarter. Notes and accounts receivable were JPY 411.4 billion, increasing by JPY 18.1 billion quarter over quarter. Inventories were JPY 720.4 billion, declining by JPY 36.6 billion from the previous quarter, partly because of a drop in inventory at the factories. Tangible assets were JPY 561.2 billion, increasing by JPY 80.9 billion from the previous quarter, primarily due to the capital expenditures that I mentioned earlier. For the liabilities and net assets shown on the right-hand side, liabilities were JPY 662.3 billion, increasing by JPY 25.8 billion from the previous quarter. Net assets were JPY 2 trillion 4.6 billion, rising by JPY 131.8 billion quarter over quarter. The equity ratio was 74.4%, just for your information. This slide shows the cash flow.\n\n**Operator**\nThe cash inflow from operating activities in the second quarter was JPY 175.8 billion. The cash outflow from investing activities was JPY 86.7 billion, mainly due to the acquisition of fixed assets. Cash outflow from financing activities was JPY 1 billion. Free cash flow was plus JPY 89.1 billion. This concludes my presentation. Thank you very much. Now, Kawai-san will make a presentation regarding business environment and financial estimates. Kawai-san, go ahead, please. This is Kawai. Once again, thank you very much for joining us today. I will present business environment and financial estimates. Let me start with the business environment. CY 2025 WFE market is expected to be $115 billion in size as projected in July. Investment in the mature nodes is soft in general, while investment in NAND is now picking up after being soft over the past few years.\n\n**Operator**\nIn particular, advanced logic and DRAM for AI applications are driving investment. The era of AI shows here. The strong AI server demand and technology innovation of semiconductors, essential for AI servers, will act as powerful drivers to continually lead a dramatic growth of investment for leading-edge semiconductors. For DRAM, investment not only for HBM but also for commodity DRAM is growing sharply. Double-digit growth is expected to continue next year and beyond. For NAND, along with the growing demand of SSD for data centers, namely enterprise SSD, utilization rate is improving at our customers' fabs. For logic, along with device scaling to 2 nanometer and 1.4 nanometer, further investment growth is expected in the future. The need for advanced packaging and testing is growing day by day. They become more and more important. For mature nodes, investment is expected to continue at the current level.\n\n**Operator**\nDriven by those factors, CY 2026 WFE market size is expected to hit a record high. We expect expansion of demand for high-value-added, cutting-edge equipment in coming years. In the growing semiconductor production equipment market, Tokyo Electron has established an advantage to strategically capitalize on diversified business opportunities, as we offer not only front-end process tools for device scaling and device stacking, but also 3D heterogeneous integration tools and testers. There is a consensus that in the year 2030, the semiconductor market will reach $1 trillion in size. Among various technology innovations for 2030, Tokyo Electron has a lot of business opportunities. For example, for etching, due to growing investment in HBM featuring numerous interconnect layers, we expect the sales of JPY 500 billion in total for DRAM interconnect process by year 2030.\n\n**Operator**\nFor bonder and other 3D integration tools, we generated sales of about JPY 30 billion in the previous fiscal 2025. From now on, however, drastic expansion is expected in applications of advanced logic, DRAM, and NAND, and accordingly, we expect to generate sales of more than JPY 500 billion by year 2030. Tester demand is growing more than expected. Looking back at Tokyo Electron's history, there was a time when prober business made up bulk of our sales. The current tester momentum is just like that time. In the case of advanced probers for AI and HPC, where Tokyo Electron has a high market share, along with the increase of test time and test process, as well as the introduction of new test methods such as live prober, a high growth rate of CAGR of more than 15% is expected between 2025 and 2030.\n\n**Operator**\nWe are also focusing our efforts on penetration to new business areas and SAM creation. For die probers, whose market size is expected to account for 10%-15% of total prober market, we have achieved agreement with customers to initiate evaluation for development. For logic of future generations, single-wafer plasma-enhanced CVD is expected to boost business opportunities for void-free gap fill. The market size of plasma-enhanced CVD is currently about JPY 1 trillion. The gap fill business is expected to grow to about 10% of this market. Tokyo Electron has succeeded to develop damage-free gap fill deposition technology, and we have started evaluation with leading-edge customers to expand the application of this technology. There are more projects going on very well. For low-resistant metal film deposition, evaluation is going smoothly at multiple DRAM and NAND customers, and we won POR from one customer.\n\n**Operator**\nFor cleaning equipment, we are making good progress in SPM vapor cleaning and system to clean both sides of wafers simultaneously, which leads to our market share enhancement. For etching, in addition to the business growth of DRAM capacity, for which we are in a dominant POR position, customers will start investment in mass production of NAND with 400 layers at the end of next year. Accordingly, our cryogenic etching system will be deployed into high-volume manufacturing lines, driven by market growth and our share increase. Gross potential expanding significantly will actively promote customer engagement activities and forward-looking R&D activities and strive to continually enhance our corporate value. Next, I will present the financial estimates. Reflecting the result of the first half of this fiscal year, we have revised our financial estimates.\n\n**Operator**\nFor the full year fiscal 2026, we expect net sales of JPY 2 trillion 380 billion, gross profit margin of 45.3%, and operating profit margin of 24.6%, as shown here. In the ongoing third quarter, we sold some of the shares we own and recorded extraordinary income. Taking these factors into account, we have revised fiscal 2026 net income upward by JPY 44 billion to JPY 488 billion. Now, this slide shows fiscal 2026 SBE new equipment sales focused. The SBE new equipment sales in the second half of this fiscal year remained unchanged from three months ago, as expected grow slightly from the first half to JPY 880 billion. The breakdown by application is shown on this slide. This shows our plan for R&D expenses and CapEx.\n\n**Operator**\nIn this fiscal year, following completion of Miyagi New Development Building in April, construction of a new development building in Kumamoto was completed this month, October. A production and logistics center in Iwate is also planned to be completed next month. In Miyagi, we also started construction of a new production building in June, which adopts the next-generation smart manufacturing concept. R&D expenses in fiscal 2026 are slightly revised to JPY 290 billion. The plan for CapEx and depreciation remains unchanged, expected to be JPY 240 billion and JPY 86 billion, respectively. This is my last slide showing the dividend focus. Reflecting the revised financial estimates and selling of some shares we own, the full-year dividend per share is expected to be JPY 533.\n\n**Operator**\nIn this fiscal year, while taking account of balance between status of cash on hand and capital efficiency during this fiscal year, we will flexibly consider the possibility of share repurchase. This concludes my presentation. Thank you very much for your kind attention. Now, we'd like to start the question-and-answer session till 6:00 P.M. Japan time. You can ask questions either in English or Japanese, but our speakers are on the Japanese channel. Please allow us to take audio questions only in Japanese. If you ask a question in Japanese, please click the raise-hand button on the Webex. For details, please refer to the instructions attached to the invitation email. I will call the name of the person one by one. Our secretariat will contact you in advance, so please check the Webex chat box. When asking a question, you are kindly requested to unmute your microphone for yourself.\n\n**Operator**\nWhen your question is answered by our attendees, please hit the raise-hand button again to remove the raise-hand signal. For questions in English, please use the Webex chat box and give your affiliation, name, and question in text, and send it to our secretariat. We will refrain from answering questions if your name or affiliations are not given. We will translate your English question, and on the Japanese channel, we will read it out in Japanese, and speakers will answer in Japanese. On the English channel, the question and answer will be simultaneously interpreted into English on a real-time basis. As we'd like to take questions from as many participants as possible, we will take one question per person. If time allows, we will take additional questions. The first question. Yoshida-san from CLSA Securities. Thank you very much. WFE Market Focused.\n\n**Operator**\nNext year, for DRAM, you made some comments, but once again, as a whole, WFE market, how do you view next year's WFE market? Also, by application, could you share your image of the growth rate? In the first half of next year, your competitors say the sales will be the market should be flat and recovery starting in the second half of next fiscal year. What should it be? What is your view? Thank you. WFE Market Focused or Outlook. At present, we are now scrutinizing the WFE market trend. You can see quite strong inquiries, especially for the leading-edge nodes for AI server. We have rather strong inquiries. In particular, DRAM is expected to grow double-digit. That's how I view for next year. The strong, very strong demand for AI server is now coming. However, there is one thing I want to note.\n\n**Operator**\nAlthough demand is rather strong, the customers' fab space is limited against the very, very strong demand. So, fab space of customers might have some limitation. We have strong inquiries, but in the second half, recovery is expected because once the open space is available in the customers' fab, they will have process tools moving to the new open space in their fab. For this year, logic and memory proportion should be 35% for memory. Out of memory, 80% is from leading-edge memory and 20% from non-advanced memory. Out of 65% logic, non-memory, 25% is leading-edge, and 75% is non-leading-edge. In the breakdown next year, the memory and non-memory proportion should be 40% to 60%. Maybe in the future, and memory, 85% is from the leading-edge memory. As for logic, for this year, 25% is from leading-edge, but next year, about 40% of total logic are leading-edge logic next year.\n\n**Operator**\nThank you very much. I have one short follow-up question. Next year, this past half of next year, if the market remains flat, now you have the January to March, you can see some drop expected. If there is no change, April to June, you can see drastic recovery in next fiscal year. My view is correct, or as you said earlier, we need to wait for the second half because there is no open space. I think inquiries are rather strong for next fiscal year, so delivery adjustment is now being conducted. AI server demand is growing, so now we can see the timing of recovery. The market is now moving as we expected, so we can have a great expectation for next year. Thank you very much. Yoshida-san, thank you very much for your question. Next question is from Mr. Nakamura of Goldman Sachs Japan.\n\n**Operator**\nThank you very much. I am Nakamura from Goldman Sachs Japan. Thank you very much. Can you hear me? Yes. Three months ago, the calendar 2026 WFE market was drastically revised, and after that, various open AI news and memory market has been booming. There were the drastic changes over the past three months. You said there are strong inquiries, and once again, three months ago, when you made downward revision, there are some factors for that downward revision. How do you view those factors right now? In particular, in some memory customers, you said the yield has been improved, and because of that, you declined the WFE market outlook in the first half of next calendar year. How do you view the current situation? Initially, we had expected early recovery.\n\n**Operator**\nThat's the reason why we need to make the revision, but three months later, you can see some momentum gaining now. We landed the first half of this fiscal year with the results in line with our focus. We received the orders and had fixed the production plan. I think we can fulfill the plan. Initially, we had the expectation for early recovery. That's the reason why we need to make the downward revision three months ago, but now we can see some symptoms for recovery. Initially, we expected early recovery both for logic and NAND market. Currently, you can see some growing trend of PC and smartphone demand. Initially, we expected a bit too early recovery, and the demand for the mature node has been desecrated. Because of that, we came up with downward revision three months ago.\n\n**Operator**\nFor mature node market, also in the future, maybe the investment remains unchanged. For leading-edge AI server-related area, the market will be growing. Therefore, a portion of the mature node will be declining gradually. Did I answer to your question? Thank you very much. Calendar 2026 WFE market trend. When you say your current comment, six months ago, you said you expect double-digit growth, and three months ago, you retreated that comment. What is your view for WFE market 2026 calendar year? WFE market is expected to hit the record high in calendar 2026. For memory demand, it is really big, drastically big. Against that big demand, we may not be able to fill the demand, so we may see memory shortage. In that sense, long-term super cycle might start. Also, customer production plan should be closely watched.\n\n**Operator**\nIn that sense, when customers' FAF capacity is ready, in the second half of next year, you can see another jump in the business. This is one of the ways to view the next year, and I feel comfortable about that kind of outlook. Demand is growing, definitely. Deliveries have started. Even that, the supply cannot catch up with the demand, so we need to carefully watch the capacity enhancement. Thank you very much, Nakamura-san, for your question. Next question is from Mr. Wataki of Morgan Stanley MUFG Research Japan. I'm sorry, I was not able to connect rightly. I think the atmosphere in the market is improving. Next market, it may be difficult. Maybe 20% growth can be achieved, excluding China. How do you view the market growth next year, Kawai-san? Rather high growth rate can be expected.\n\n**Operator**\nActually, my expectation is not so accurate, so I think I feel a very good condition. Even if 20% grow outside of China, depending on Chinese market, overall situation might be rather difficult. ASML is not so good in China next year. How do you think about the outlook of China? In principle, certain levels of semiconductor devices, including commodity devices, are required. Therefore, certain levels can be maintained. However, I cannot hear any bright news. My concern is the restriction, risks of regulations. How do you view the risks of regulations? Compared with the previous period, there are quite a few considerations. As far as our company is concerned, we haven't identified anything additional. We must closely watch the situation of regulations. When we ship equipment from Japan, there are quite a few equipment shipped from Japan. We must abide by the Japanese regulations continuously.\n\n**Operator**\nThis is how I view the trend. However, the portion of the Chinese market is different from the geopolitical viewpoint. The AI server proportion goes up, the leading-edge area portion is increasing. Therefore, the general proportion of the China market will be declining. Thank you very much. That was very helpful. Wataki-san, thank you very much for your question. Next question is from Shimamoto-san of Okasan Securities. Shimamoto-san, please go ahead. Thank you very much. I'm Shimamoto from Okasan Securities. Thank you very much. My question is a bit different from other questions so far. Next fiscal year is the final year of the midterm management plan, and sales target is JPY 3 trillion. You haven't removed this target, but the market has been improving so far. Your milestone target, how do you view this midterm management plan target? As for the growth rate, growth rate is expected rather high.\n\n**Operator**\nHow do you view the trend? For our midterm management plan, ever since its announcement, there have been various changes in macroeconomy, geopolitical situation between America, China, regulations, inflation, Russia-Ukraine war. There are quite a few things happening over the past three years. There are some differences from our original assumption. For some equipment, in the beginning, there are some regulations imposed on some of the equipment. Those changes or differences have some impact on our performance of the achievement of financial model. Having said that, high value-added leading-edge equipment, the evaluation is going on track. By providing high value-added equipment, we do have the strong earning power. Excluding macroeconomic impacts as well as our strategy is concerned, I think we are now fulfilling our strategy smoothly. 40% gross profit margin five years ago has been increasing to 45% along with the provision of high value-added products.\n\n**Operator**\nIn the future, in the leading-edge area, our technology is provided to more and more opportunities. As I said earlier, there are various factors, but we try to offset those impacts because of the strong demand for AI servers. Therefore, if the WFE market grows to a certain expected level, I think we may get close to our midterm management plan. We should closely watch various factors to pursue the possibilities. Thank you very much. I have one follow-up question. For memories, there are some big fluctuations in memory. I think that is the critical issue, especially NAND. For the time being, there has been no investment for NAND, but customers' utilization goes up and NAND price goes up as well. Appetite for investment on page 13. Now you have increased. There is no increasing inquiries, but do you have a high expectation next year for inquiry for NAND? Right.\n\n**Operator**\nYes, definitely. I think next year is a good year for NAND. Strong year. Thank you. Thank you very much. Shimamoto-san, thank you very much for your question. Next question is from Mr. Hirakawa of BofA. I am Hirakawa from BofA. Thank you very much. The field solution business, now we have JPY 160 billion, one step higher. That's what you showed us. Over here, it's not green field, but brown field. That's the reason why it goes to JPY 160 billion toward next fiscal year. I wonder WFE market growth, that figure will be declining, or do you think JPY 160 billion should be a new standard? For customers, utilization rate is increasing. Therefore, field solution is growing accordingly. That's one thing. Leading-edge node, the customer assets should be upgraded. CIP continuous improvement project. It's a kind of upgrade or modifications. Will be rather high in volume.\n\n**Operator**\nWe do have demand for CIP. Etching system, for example. In our company, customers asking for upgrade from RK4 to RK7. These are the drivers. Thank you very much. I have one follow-up question. If that is the case, second half of this fiscal year or the next fiscal year, the field solution. Is JPY 160 billion, should be a kind of standard. Is that correct understanding? In the future, increasingly, the install base creates the new value. Field solution modifications and uptime improvement of the equipment. Also yield enhancement, which is really critical. Therefore, how can we support our customers to enhance the yield? Or how can we provide the services and technology to support customers to improve yield, which has become more and more critical? Therefore, the field solution sales is expected to grow along with the increase of the install base growth. Thank you very much. Mr.\n\n**Operator**\nHirakawa, thank you very much for your question. Next question is from Yamamoto-san from Mizuho Securities. Yamamoto-san, go ahead, please. I am Yamamoto from Mizuho Securities. Thank you very much. Cost control. I have a question regarding cost control. Tokyo Electron is working hard to grow. That's your direction. You have the company-wide power to promote the growth. I know your driving power is very strong. In some cases, your focus is not correct upward or downward, but for the growth, you have very strong. When your performance is in downturn phase, why don't you think about streamlining your structure rather than bloating? This could be a good opportunity to stop and look back. That's how I view your company's trend. Even under the leadership of Kawai-san, the cost cut is not so much.\n\n**Operator**\nInitially committed gross profit margin of 47%, and gross profit margin in the midterm management plan is higher than that. I thought you couldn't reduce costs in the previous guidance cut, including SG&A ratio. Three months later, you could only reduce costs this much. There is a wide gap in profit margin against what is committed to the capital market. Even under the leadership of Kawai-san, you are not able to change the corporate culture. I don't think in that way. I want to say that. For one thing, our employees are a source of value creation. Actually, investment for human resources is equal to the investment for further growth. That's our management policy. For the future, the semiconductor market is growing based on that growth, $1 trillion. We want to have the steady preparation. To prepare for the $1 trillion semiconductor market.\n\n**Operator**\nShort-term, midterm, and long-term strategy for growth should be considered carefully. Ever since cancellation of integration with Applied Materials over the past 10 years, our sales have been increased more than four times, about four times. Our profit has been increased by eight times. From now onward, $1 trillion market or more than that. That is the new era. Therefore, we are now working on the R&D investment, CapEx, and human resource investment. We do have plans for that to prepare for $1 trillion semiconductor market. We are now preparing for that. Based on such assets, we want to make the best use of our assets so that we can enhance our capability for the device market, which is to be doubled for a short time. We have the performance-based bonus to have the downside flexibility. Now we have the huge market next year and two years from now.\n\n**Operator**\nWe must follow. Otherwise, we are not able to address customers' requirements. On the other hand, when it comes to efficiency, digital transformation should be utilized. For example, robotics. DX manufacturing with AI and robotics. Using the current assets, we should be prepared for the sales to be doubled in the future. We would like to exceed the midterm management plan in terms of the operating profit margin. This is the growing industry, and this growing industry is security quality. The financial crisis or IT bubbles or cloud, COVID-19. There have been many events in the past. We should be capable of a dynamic capability to cope with various changes or events in the market so that we can achieve world-class profit margin. Competitors are now working on various initiatives. We are aware of that. Under such strategy, we try to further enhance our profit margin.\n\n**Operator**\nYour target or ultimate goal is rather high, so you do not have to worry about short-term turbulences, right? Three-year or four-year, five-year ahead, we should closely look at the future. We also need to think about our employees' work-life balance and work-life balance of supply chain as well. If the market is flat, things are different. Actually, our industry is a growing industry. Short-term, midterm, long-term perspectives should be respected when we run the operation of our company. Thank you very much, Mr. Yamamoto, for your question. Next question is from Mr. Nakanomyo of Jefferies Japan. I am Nakanomyo of Jefferies Japan. Can you hear me? Yes. Thank you very much. I have two questions. Number one, on slide 14. Now you are talking about the Bonder laser. You said JPY 300 billion. You said JPY 500 billion by year 2030.\n\n**Operator**\nThat means JPY 100 billion per year is achieved somewhere in the future, maybe 2026. Mainly driven by NAND wafer bonding, according to my understanding. Could you elaborate. JPY 500 billion for Bonder laser? Could you give me some breakdown, please? At present, the momentum is rather strong. HBM, high bandwidth memory, is now coming. And logic, backside PDN, for example. Quite a few applications are now expanding for bonding. Bonder, the bonder, temporary bonder, the bonder. Laser trimming, extreme laser liftoff, their applications are expanding. Wafer to wafer stacking is also coming. Next fiscal year, we can expect the drastic growth in this area. When it comes to applications, not only expansion of applications. HBM, we do have the strong position as a company. That is expected to expand other companies. Maybe we can enhance the share.\n\n**Operator**\nApplication expansion, market expansion, and share increase, by those three factors, we can see the drastic growth in this area. Of course, step-by-step, growth will be followed. By year 2030, quite large market will become one of our pillars. You do not have any figure for next year's sales. You cannot say that today. I want to say, but I am sorry, let me refrain from saying any figures. Another question, very similar question, I am sorry, for NAND. To DRAM, it is expected to have double-digit growth, but what is the NAND growth rate? For this year, last year's market was rather low. Actually, your sales for NAND customers should be growing considerably. Next year, the investment for NAND with 400 layers will start, maybe with high confidence level, maybe double-digit, maybe high teens growth is expected for NAND.\n\n**Operator**\nThrough the penetration of generative AI, storage of servers require NAND, and NAND demand will be going up, I think. In 2022, we hit the record high of JPY 340 billion. Can you see very similar? I want to see the growth rate of NAND in year 2026. Figures will have been increasing gradually. Next fiscal year, we can have a high expectation for NAND. NAND with 400 layers, the NAND WFE is expected to grow drastically. From the second half of next calendar year, investment for mass production of NAND with 400 layers will be growing gradually. I think NAND market is better than this year, and we can have high expectation in 2026. Mr. Yatsuda, do you have any comment? At present, for inquiries, the data center, the nearline demand is now growing. PC and smartphones, that is the major market of NAND.\n\n**Operator**\nActually, the PC and smartphones market is rather soft, but migration investment will continue next year as well. Investment for 400 layer NAND is highly expected. When the demand for PC and smartphone increases, you can see the capacity enhancement investment for NAND. For the time being, there is no symptom of the increase of the demand for NAND in the smartphone or PCs. Therefore, we cannot give you any specific numbers now. Thank you very much, Mr. Nakanomyo, for your question. Next question is from Mr. Yoshio Oka of Nomura Securities. Thank you very much. I am Yoshio Oka of Nomura Securities. Thank you very much. Thank you very much for your presentations. Again, on page 14, I have a question regarding page 14. This is just the clarification. So ECHA. JPY 500 billion more in total by 2030. What is your accumulative sales so far?\n\n**Operator**\nI want to get the number for that. And the same line for Prober. You are expecting to grow the Prober, but your competition, competitor is rather strong for HBM. Your company, in order to achieve the K-goal of 15% or more, the market is expected to grow furthermore, or do you improve the share? Are there any factors for you to increase your share? I want to see how the Prober business grows. For etching system, the DRAM interconnect process. Along for HBM, investment increase is expected. Not only HBM, for DRAM, there is the investment growth, but interconnect process, in the case of HBM, will be four times more. Therefore, rather stable, strong growth is expected. That is the reason why JPY 500 billion or more. That is what we want to say. Simply calculating about JPY 100 billion per year.\n\n**Operator**\nSimply calculating, but getting closer to 2030, the sales will be growing gradually. In addition, for capacity edge, we are in the dominant positions for major customers. Therefore, that will bring us the big business opportunities. As for Prober, when it comes to Prober, in particular, cutting-edge logic, our position there is rather strong. The leading-edge logic, in the area of leading-edge, we are a dominant position. Our share is increasing steadily. That application, the test, for that application, the test time and test volume are increasing steadily. That has a strong momentum. AI server demand increases accordingly. The Prober business grows rapidly with the K-goal of 15% or more. K-goal 15% or more increase by Prober. By Prober, for the future, it is expected to grow, accounts for 10-15% of the entire Prober market. We agreed with our customers on the evaluation for development.\n\n**Operator**\nIf they are in progress, we may have some opportunity to make some announcement. We have consensus with customer, agreement with customer to conduct evaluation for development. We can expect the good growth. Thank you very much for your answer. Thank you very much, Mr. Yoshioka, for your question. Next question. In text. Let me read it out. The first question is from Mr. Rolfe Balk of New Street Research. You mentioned in your prepared remarks, mature node WFE spending is expected to remain roughly flat at current levels. Does this include or exclude Chinese investment? What do you expect for Chinese WFE spending growth next year? What is your level of confidence or visibility on this? Thank you very much for the question. For mature node, yes, China is included. China is included. We need to take account of various things.\n\n**Operator**\nWhen it comes to future outlook, maybe flat, including China. Mature node market remains flat, including China. That should be the appropriate way to view the future. WFE market is driven by AI servers. The cutting-edge technology, that is the major driver. That is where we must provide high-value added products with good strategy. Stable and continual growth is expected. Thank you very much. Thank you very much, Mr. Balk, for your question. Next question is from Lie Ping Huang of Huatai Securities. Management highlighted advanced packaging as a key growth driver in the past. Could you introduce what is the progress in this area and quantify current revenue contribution from equipment sold into advanced packaging applications and the future target? For the advanced packaging, the Bonder and the Bonder and Prober related products are rather important.\n\n**Operator**\nBonder, the Bonder, and Prober is, the two years, our sales have been tripled, and we achieved about JPY 30 billion last year of the sales. When you refer to page 14, as I said on page 14, the Bonder, the Bonder, five years to come, we are going to achieve the cumulative sales more than JPY 500 billion. That is our plan. This plan really reflects the high potential. Advanced packaging or integration or heterogeneous integration is expected to grow furthermore on page 14. I already talked about that, including our expectations. Thank you very much, Mr. Huang, for your question. Next question is Tommy Key from Brandenburg Securities. Let me read it out. You mentioned the leading-edge logic country investment will accelerate. Will leading-edge country logic grow significantly next year, year over year? Driven by which node, 3 nanometer or 2 nanometer node?\n\n**Operator**\nWhich node will drive the growth? Will all the foundry and logic players CapEx up year over year, or only one or two players will invest? Where China bottoms back to 20% issue of your revenue at some point? Thank you very much for your question. Currently, it is flat and mature node, and that covers China market. That is what I said earlier. In the future, high-end nodes for AI server will drive WFE market growth. Let me answer to your last question. I am sorry. 30% or less, that is rather high. Highly likely that the China proportion will go below 30%. Talking about your earlier questions, the logic or leading-edge node is expected to grow. Yes, we need to scrutinize the figures of percentage, but we do receive the strong inquiries. Therefore, we expect the growth, strong growth. Any other questions I should answer?\n\n**Operator**\nThe general ID nodes. It depends on customer's situation. We are suppliers, so we are not able to give you any comments because we are suppliers. We need to be ready to fulfill the customer's demands and make some contribution. Thank you very much, Akisan, for your question. No more questions. Since there seems to be no more questions, we would like to conclude or close the financial announcement. Lastly, we'd like to continually improve our IR activities based on your precious feedback. We'd appreciate your kind cooperation in filling out the questionnaire before you exit the Webex. Thank you very much for taking time to join this conference despite your busy schedule today. Thank you very much.",
      "fetched_at": "2026-02-04T15:54:14.219Z"
    },
    {
      "ticker": "8035.T",
      "title": "TOKYO ELECTRON (8035.T) Q1 FY2026 earnings call transcript",
      "published_date": "Jul 31, 2025, 4:30 PM GMT+9",
      "fiscal_year": "2026",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/8035.T/earnings/8035.T-Q1-2026-earnings_call-339677.html",
      "content": "**Moderator**\nIt's time for us to start Tokyo Drone financial announcement for the first quarter of fiscal year ending March 2026. Thank you very much for joining us today despite your busy schedule. I'm Yatsuda of IR Department, serving as a moderator for today's session. Let me introduce today's attendees: Toshiki Kawaii, Representative Director, President and CEO. I am Kawaii.\n\n**Moderator**\nThank you very much. Next, Hiroshi Kawamoto, Senior Vice President, General Manager, Division Officer of Finance Division. I am Kawamoto. Thank you very much for joining us today. Before starting the presentations, let me explain the flow of today's session.\n\n**Moderator**\nFirst of all, Kawamoto and Kawaii will make presentations. After that, until 06:30 p. M. Japan time, we will have a question and answer session where we entertain questions from the audience. This meeting uses two channels of Webex for the simultaneous interpretation between Japanese and English.\n\n**Moderator**\nAs we explained in our e mail, you are kindly requested to use apps on PCs or mobile terminals if you plan to ask questions. But if you are not going to ask questions, you can use telephones. Since this conference is intended for institutional investors and analysts, we'd like to appreciate your understanding that we receive questions only from institutional investors and analysts as usual. We will post the audio contents of this conference in Japanese and English on our website within a couple of days. It would be appreciated if you could also visit our website.\n\n**Moderator**\nNow Mr. Kawamoto will present the consolidated financial summary. Kawamoto san, please. Good afternoon. I am Kawamoto Finance Division.\n\n**Moderator**\nI'd like to present the consolidated financial summary of the first quarter of the fiscal year ending March 2026. This slide shows the quarterly financial summary. I will mainly refer to the figures in the blue box. In the first quarter, we generated net sales of JPY 5 and 49,500,000,000.0, 16.1% decrease from the previous quarter, partially because of temporary pause of customers' capital investments. Gross profit was JPY 2 and 53,900,000,000.0, 18.2% decline from the previous quarter.\n\n**Moderator**\nGross profit margin was 46.2%, 1.2 percentage point drop quarter over quarter due to the increased ratio of fixed cost along with the decrease of net sales. Operating income was JPY 144,600,000,000.0, 21.3% drop from the previous quarter. Operating profit margin was 26.3%, declined by 1.7 percentage point quarter over quarter, mainly due to the decrease of gross profit margin mentioned before. Income before income taxes decreased by 17.9% to JPY 151,900,000,000.0. Net income attributable to owners of parent was JPY 117,800,000,000.0, 17.6% decline from the previous quarter.\n\n**Moderator**\nCapital expenditures in the first quarter were JPY 52,800,000,000.0, consisting mainly of the new development building of Tokyo Electron Miyagi, whose construction was completed in April. This is a graphic representation of the financial summary shown on the previous slide on the chronological basis for your reference. This slide shows net sales by region. As for composition in the first quarter, proportion of Japan rose by 3.6 percentage point to 11.7% quarter over quarter, while proportion of Korea dropped by 6.3 percentage point to 16.1% from the previous quarter. Proportion sales in China in the first quarter was 38.6%, remaining below 40% following the previous quarter.\n\n**Moderator**\nThis shows SPE new equipment sales by application. In the first quarter, from the bottom of this chart, sales to nonmemory customers accounted for 64%, nonflat type memory accounted for 10% and DRAM accounted for 26%. Sales to nonmemory customers were flat from the previous quarter, while proportion of sales to DRAM customers declined by 11 percentage point quarter over quarter, partly because of their intensive spendings in previous quarter. This slide shows the Field Solutions sales. In the first quarter, Field Solutions sales were JPY 141,200,000,000.0, growing by JPY 2,200,000,000.0 quarter over quarter, Thanks to high utilization rate mainly for the advanced nodes of the customer's fab, sales, parts, service and modifications were all strong.\n\n**Moderator**\nThis slide shows balance sheet. The total assets were JPY 2,509,300,000,000.0. Cash and cash equivalents were JPY 367,500,000,000.0, declining by JPY 128,700,000,000.0 from the previous quarter, primarily due to dividend payment to shareholders and payment of income taxes. Notes and accounts receivable were 393,200,000,000.0 yen decreasing by JPY 92,300,000,000.0 quarter over quarter. Inventories were JPY 7 and 57,100,000,000.0, increasing by JPY 7,900,000,000.0 from the previous quarter.\n\n**Moderator**\nInvestment and other assets were JPY 400,200,000,000.0, increasing by JPY 52,500,000,000.0 from the previous quarter, mainly because of the increased share price. For the liabilities and net assets shown on the right hand side, liabilities were JPY636.5 billion, decreasing by JPY134.1 billion from the previous quarter. This is mainly because of the decrease of income tax payable along with the payment in income taxes, as I mentioned earlier. Net assets were JPY 1,872,700,000,000.0, rising by JPY 17,500,000,000.0 quarter over quarter. The equity ratio was 74%.\n\n**Moderator**\nThis shows cash flow. Cash inflow from operating activities in the first quarter was JPY74.9 billion. The cash outflow from the investment activities was JPY54.1 billion, mainly due to acquisition of fixed assets. The cash outflow from financing activities was JPY151.1 billion, primarily because of dividend payment. As a result, free cash flow was positive JPY 20,700,000,000.0.\n\n**Moderator**\nThis concludes my presentation. Thank you very much for your kind attention. Now the Kawaii. Mr. Kawaii will talk about business environment and financial estimates.\n\n**Moderator**\nKawaii san, please. Go ahead. This is Kawaii. Once again, thank you very much for joining us today. I will present business environment and financial estimates.\n\n**Moderator**\nAs some changes were observed in the business environment, we have revised WFE market outlook and our financial estimates. So let me start the revisions made and business progress as well. In the 2026, both net sales and profit were almost in line with guidance. Progress of strategic product sales and development evaluation activities toward PO acquisition proceeded smoothly. For film deposition to handling the new material, namely low resistant metal, many NAND customers are working on evaluation with our batch furnaces.\n\n**Moderator**\nFor a series of three d integration tools, including the extreme laser lifter tool released in December 2024, we are currently having business discussion with advanced logic customers and NAND customers. In April, construction of the new development building in Miyagi was completed, in which we will enhance development of Echaz, one of our main products. Our financial estimate for the 2026 remain unchanged. Specifically, we expect net sales of JPY $1,150,000,000,000, operating income of JPY $288,000,000,000 and operating profit margin of 25%. Calendar 2025, WFE market proceeds almost as expected, although there are some shifts in investments.\n\n**Moderator**\nFactoring the impacts of exchange rate fluctuation, the revenue market is expected to grow slightly from the previous year to 115,000,000,000 The outlook of semiconductor demand remains unchanged. The WFE market in the 2026, however, is expected to be affected by changes of customers' investment trends. Specifically, customer now seek for higher productivity through yield enhancement, optimization of supplydemand balance to raise profitability and shift from proactive to solid investment. Accordingly, we have revised the outlook of WFE market growth in the fiscal year ending March 2026 to negative 5% year over year. Changes in e segment are shown in this slide.\n\n**Moderator**\nAlong with the downward revision of the fiscal year based WFE market outlook, we have revised our FY twenty twenty six full year financial estimate to net sales of JPY 2,350,000,000.00 and operating profit margin of 24.3%. Despite the downward revision, our gross profit is expected to exceed JPY 1,000,000,000,000 for two years in a row. Despite the changes of the WFE market outlook from January to June 2026, there is no change at all in powerful growing trend of the semiconductor demand supported by technology driver of AI server applications. Therefore, we plan to invest JPY $295,000,000,000 to R and D almost as announced three months ago. This shows the revised SPE new equipment sales forecast.\n\n**Moderator**\nThe SPE new equipment sales in the second half of this fiscal year are expected to grow slightly from the first half to JPY $880,000,000,000. Here is the breakdown by application. Please note that this revision is attributed mainly to the customers' manufacturing technology enhancement and their investment strategy changes, and therefore, it does not necessarily link with the semiconductor demand. As I said before, due to the changes in customers' investment trend, we are currently scrutinizing CI 2026 WFE market. Having said that, however, there is no change in our outlook of semiconductor market, which keeps expanding, driven by the growing demand of cutting edge semiconductor plant to be released in calendar twenty twenty seven for AI servers.\n\n**Moderator**\nAI servers require high computing power to process massive data at high speed. Currently, two of the four nanometer node GPU are used. But in calendar twenty twenty seven, four of three nanometer node GPU will be used. And in calendar twenty twenty seven, each GPU will have 500,000,000,000 transistors, about 2.5x more than the current GPU. The number of HBM will also increase.\n\n**Moderator**\nMemory capacity of HBM will increase by about 4x, driven by device scaling of each DRAM and increase of number of DRAMs to be stacked. So we are finally shift from the gigabyte to terabyte era. Investment to realize the next generation AI computing platform is expected to start growing from the 2026. With device scaling, advanced packaging, our business opportunities will be expanding more and more. This shows our plan for R and D expenses and CapEx.\n\n**Moderator**\nIn this fiscal year, following the new development building in Miyagi, whose construction was completed in April, construction of a new development building production and logistics center in Uate is planned to be completed in this coming fall in Miyagi. We have also started construction of new production building in June, which adopts next generation smart manufacturing concept. R and D expenses in fiscal twenty twenty six are expected to be JPY $295,000,000,000, as I said before. The plan for CapEx and depreciation remains unchanged, expected to be JPY240 billion and JPY86 billion, respectively. This is my last slide showing the dividend forecast.\n\n**Moderator**\nReflecting the revised financial estimate for the second half of this fiscal year, full year dividend per share is expected to JPY $4.85 in this fiscal year. While taking account of state of cash on hand and capital efficiency during this fiscal year, we will flexibly consider implementation of share repurchase. This concludes my presentation. Thank you very much for your kind attention. Now we will have question and answer session till 06:30 p.\n\n**Moderator**\nM. Japan time. If you ask a question in Japanese, please click the Raise Hand button on Webex. For details, please refer to the instructions attached to the invitation e mail. I will invite you one by one.\n\n**Moderator**\nOur secretariat will contact you in advance, so please check Webex chat box. When asking a question, please you are kindly requested to unmute your microphone for yourself. When your question is answered by our attendees, please hit the raise button raise hand button again to remove the raise hand signal. For questions English, please use Webex chat box and give your affiliation, name and question in text and send it to our secretariat. We will refrain from answering questions if your name and affiliation are not given.\n\n**Moderator**\nOn the Japanese channel, we will translate your English question, and I will read it out in Japanese, and our speakers will speak answer in Japanese. On English channel, the question and answer will be simultaneously interpreted into English on real time basis. As we would like to take questions from as many participants as possible, we'd like to take one question per person. If time allows, we will take additional questions. So the first question from Yoshida san from CLSA Securities.\n\n**Moderator**\nI am Yoshida from CLSA Securities. I have a question. 2025, you have revised WFE market outlook. I want to see some information by application. So now you are now conservative for the 2026.\n\n**Moderator**\nSo based on the peripheral situation, I think the advanced foundry and DRAM might be increasing, so I was a bit surprised. So once again, so first half, you said rather weak, but throughout the year for 2026, I think you said double digit growth. So what happens in the full year forecast by application and the full marketplace? By application, changes are made for Logic and Foundry, the advanced Logic. Some of the customers have revised their investment plan for Logic and Foundry.\n\n**Moderator**\nThat's the reason why we have revised our outlook partially. For others, there have been no major changes. However, NAND investment gets a bit weaker than expected. However, the NAND investment will double. That's what I said before, but original amount is not so much.\n\n**Moderator**\nTherefore, the changes in NAND investment does not have big impact. This is Kawaii. Let me add some more comments. The customers now technology is enhanced, and they try to review the supplydemand balance when they prepare the investment plan. And also, they are shifting from the aggressive proactive investment to the steady, solid investment to enhance the yield.\n\n**Moderator**\nSo there are several aspects. So from the first quarter, we thought there is some upward trend. However, there have been some deceleration in the customer spendings. So this trend, the demand for semiconductor does not decrease. Therefore, you can see recovery sometime in the future.\n\n**Moderator**\nFrom maybe the first six months, next fiscal next calendar year, might be some correction period. However, as I said earlier, now new technologies for AI server will be released in the 2027. Therefore, from the 2026 to the early twenty twenty seven, we think the customers' CapEx will be increasing. That's how we view the market trend. In that sense, I thought double digit growth is expected, but the first half of next year, we'll see some deceleration, but we have a lot of expectation for the increasing trend in the second half of next year, but we are now scrutinizing the situation.\n\n**Moderator**\nBut we think the positive growth is expected. So the advanced logic and logic, the proportion is about 50% to 50% for this year. The next year should be 60% to 40%. That's how we view the proportion. Let me get some clarification.\n\n**Moderator**\n2026, calendar year 2026, although this is positive growth, but you are now revising the figure, scrutinizing figures, therefore, you will give us more. When you said proportion between the advanced and logic, are you talking about the proportion between the advanced and mature node? This year, percent to 50%, but next year, that proportion will become 60% to 40%. That's correct. 2027, we can see new technology for AI server.\n\n**Moderator**\nAs I said earlier in my presentation, that would be a driver. That's one thing. Also, now DDR4 and DDR5 price has been reversed because of that there are some corrections in the market. DDR5 will become a driver to further grow the WFEI markets. For HAI technology, NPU will be introduced and die size will be increased by 30% as well.\n\n**Moderator**\nSo these are the technology drivers, which will have the big impact from late twenty twenty six to the early twenty twenty seven. So customers' enhancement of technology for production, and they are focusing on profitability. So they do have now healthy growth plan. Because of that, there are some deceleration in the investment plan. But by and large, there might be the delay of six months, and that six months delay REPRESENTATIVE:] has been incorporated.\n\n**Moderator**\nAnd there have been no changes in device market. I think device market will be growing as expected. Very clear. Mr. Yoshida, thank you very much for your question.\n\n**Moderator**\nNext question is from Mr. Wajaki, Morgan Stanley, MUFG Securities Research Japan. First of all, about the downward revision, I think it's a kind of plateau, so I understand the downward revision. I have a question regarding China. In general, in your company, so the companies on entity list will not be conducted at all?\n\n**Moderator**\nOr as for you don't sell HL some product, but you are selling other product to the customers, Chinese customers on entity list. Could you explain the situation, please? Our company is not affected by the entity list. We are shipping the tools approved by the Japanese government, Meiti. So we are following the Meiti's policy.\n\n**Moderator**\nSo your company products, for example, the products on the entity list, roughly how much percentage of your products are related to the entity list? And how much percentage are not related entity? More critical equipment are to be regulated. That's the natural trend. Therefore, it's not the volume based or month based.\n\n**Moderator**\nIt's a bit difficult to say. But to some extent, there are some equipment we are not allowed to ship over the past few years. But clear figures or numbers cannot be disclosed in this meeting. So we are following Metis policy and Metis rule. So now the revision of financial estimate is not attributed to the export control.\n\n**Moderator**\nSo what about more than 50% or less than 50%? The way below 50%. So more than 10% of your product affected by deregulations. We haven't calculated the percentage. I'm sorry for that.\n\n**Moderator**\nMr. Wadakhi, thank you very much for your question. Next question is from Mr. Nakamura of Goldman Sachs Japan. Mr. Nakamura, please. Thank you very much. This is Nakamura. Thank you. So the second half of your this fiscal year, now you have made the downward revision.\n\n**Moderator**\nI want to know more about that downward revision. WFE market for calendar twenty twenty five, so there have been no major changes, but you have revised your outlook downward. That means in the market, your market share has been declining. Is that what you mean? Or there have been drastic change for the outlook of January to March 2026 over the past three months?\n\n**Moderator**\nOn Page 13, you can see several factors related to the downward revision. So when you quantify those factors, which factor plays the major role? If the customers' productivity goes up, even if the semiconductor market will grow, I'm afraid the SP industry cannot enjoy good business. Could you explain those things, please? First of all, could you repeat the first question once again, please?\n\n**Moderator**\nOkay. The calendar 2025, the WFE market does not change so much while your financial estimate has been revised downward. Why does it happen? This time, WFE market on the calendar year basis should be $115,000,000,000 So the WFE market outlook has increased. But because of the exchange rate, the equipment produced in Japan, when they are calculated on the dollar basis, actually increased by $3,000,000,000 The remaining $2,000,000,000 is coming from the leading edge logic, pulled in investment together with other reasons.\n\n**Moderator**\nThat's the reason why we have increased the WFE market outlook by $5,000,000,000 As for your second question, what you say is correct. So the fourth quarter, we think so from March to from January to March next fiscal next year, we can we thought we can see increasing growth from the January to March 2026. That's our previous focus. However, because of the changes in the customer strategy, where they are trying to improve productivity and they try to focus on productivity now, that actually, our outlook has been revised downward. So impacts are shown on Page 13.\n\n**Moderator**\nAnd you asked me quantify those factors. That's what you said in your question. There are five factors on Page 13. The customer's investment revision for advanced logic. The reduction of the legacy investment by the emerging customer Chinese customers and investment plan change because of the focusing on the profitability and DDR4 and DDR5.\n\n**Moderator**\nSo this is the order from the top towards the bottom. I think this is the order of the impact, especially the top three has the major impacts. When it comes to China, the emerging semiconductor manufacturers in China, that is about JPY 2,000,000,000. On the basis of fiscal year, the impact is about JPY 2,000,000,000. So the Chinese emerging customers, maybe there are about 150 chipmakers in China, and that 150 Chinese chipmakers are getting more and a little bit conservative.\n\n**Moderator**\nAnd when we accumulate the figures, that is amounted to $2,000,000,000 So five factors, and the top one is a major one. The major primarily, there are three major reasons on the top for our downward revision. Next question is from Shimamoto san from Okasan Securities. I am Shimamoto from Okasan Securities. I have some questions for figures.\n\n**Moderator**\nThe very simple question. CY calendar year, WFE. Calendar 2025, WFE market, you said $115,000,000,000 This is the upward revision. On the FY basis, also on the dollar basis, the minus or negative 5% is expected. Compared with previous year, 5% increase on this calendar year basis, but minus 5% on the fiscal year basis.\n\n**Moderator**\nSo three months difference makes that big difference. That's correct. So that's because of the outlook from January to March next year has been directly changes. Yes, we thought you can see some increasing trend from January to March, and we thought we need to do some preparation because in the technology driver, we were expecting increasing trend from January to March. However, that increase that was there is only actually the decreasing trend from January to March.\n\n**Moderator**\nThis the fourth quarter, our fiscal year or calendar year, January to March, WFE market trend has been shifted or pushed out. We thought the WP market will increase, but actually, now it's revised downward. When it comes to share, our share in the SAM has been secured. Therefore, this is not negative or downward division because of the declining share. Each company made their own announcement.\n\n**Moderator**\nThe timing of delivery or product mix are the reasons. Therefore, our share is not declined. I want to add this comment. I'm sorry, I answered to the previous question as well. I have one follow-up question.\n\n**Moderator**\nWhen you look at full year basis, there is the possibility for positive growth. That's what you said. But some projects have been pushed out. Is that how you view the market trend? Or some projects or some investment are canceled.\n\n**Moderator**\nHow do you view the market situation? The semiconductor demand is expected to grow toward next year. And that outlook hasn't changed at all. We have revised downward revision. So one of the reason is the customers' approach to enhance productivity by improving yield.\n\n**Moderator**\nAnd customers are more aware of profitability by balancing supplydemand more effectively, and they try to shift from the proactive, aggressive investment to the solid investment, especially among logic customers. So these are the major changes from our original previous outlook. When it comes to investments project, there have been no cancellation at all. So maybe the delay should be six months at maximum. Thank you very much for your question, Mr. Shimamoto. Next question is Mr. Yamamoto of Mizuho Securities. I am Yamamoto from Mizuho Securities. Can you hear me?\n\n**Moderator**\nYes. Thank you. I have very similar question. I'm sorry for that. So six months delay you referred to.\n\n**Moderator**\nBut as for your company, the first half and second half sales by application, could you give us some more information regarding the sales in the first and second half by application DRAM? You can see some declining figures. But actually, DRAM sales, from the first and second half, your sales will be increasing. And NAND sales, you expect it to a drastic increase from the first and second half, but actually, it declined. Normally, you saw there is some increase from the first to second half, but actually, the non memory sales remain flat.\n\n**Moderator**\nSo maybe for NAND, deceleration is a major factor. You said on Page 13, you said the first three are the major factors, and I think the NAND is the three factor. But actually, when you look at figures, the amount is almost the same, but the change rate for NAND is rather big or significant. So could you explain those figures, please? I think there are some specific issues for Tokyo Electron.\n\n**Moderator**\nSo could you refer to Page 15, please? Could you refer to Page 15? On the left, you can see the sales by application for the second half of this fiscal year. The JPY $880,000,000,000. On the right, you can see our announcement in April.\n\n**Moderator**\nThe estimate announced April 1,100,000,000,000. And the height of the bar chart, the change of the height of bar chart represents the changes or revision of our outlook. The green portion back in the April, the height of green bars. When you refer to the left hand side, the second half of this fiscal year, there is no change in proportion. However, height of the green bar is decreased because of the changes of the strategy by some logic customers.\n\n**Moderator**\nDenamed, you can see reduction of par proportion, 15% back in April. However, now we expect an 11 percentage. So you can see height of the purple portion. That represent the amount. You can see the data of the previous fiscal year.\n\n**Moderator**\nAs you can see, the height of purple is more than last year when you look at this fiscal year's purple portion. So supplydemand balance for NAND is well closely watched by NAND customer, and NAND customer conducted some adjustment, and we have incorporated that adjustment made by the NAND customers. The first half of next year is a kind of correction period. So there is some difference in between calendar year and fiscal year, but your company's new equipment application sales might be reduced in this first half of next fiscal year. Is that correct understanding?\n\n**Moderator**\nActually, toward two nanometer node, the customer's investment plan, not only one company, I think more customers will present their investment plan towards two nanometer node. So we want to closely watch the situation. It's so difficult to find that right timing. Thank you very much. Mr. Yamamoto, thank you very much for your question. Next question is from Kamisaki san from Tokyo Intelligence Laboratory. I am Kamisaki from Tokyo, Tokyo. I have a question regarding emerging Chinese chipmakers. WFE market assumption on 2025, I think their investment is getting weaker.\n\n**Moderator**\nSo for the 2026, do you think the further reduction is expected in the '6 among the Chinese emerging chipmakers? So annually, that's about JPY 45,000,000,000 to 46,000,000,000. I think that's the trend toward 2026. The legacy node market and the number of chipmakers in China is rather big. There are so many emerging Chinese chipmakers.\n\n**Moderator**\nI don't know the average. It's a bit difficult for me to give you the answer. But the WFE in China, this year, 45,000,000,000 or 6,000,000,000 I think the size of the revenue market remain unchanged. However, the entire WFE market is going up. Therefore, the proportion of legacy will be declining next calendar year.\n\n**Moderator**\nSo for the new foundries, their yield has been improving. And now you can see more and more new foundries. Do you think so? Or you don't see any new emerging foundries? So far, there is no such trend.\n\n**Moderator**\nIf the emerging chipmaker's yield is improving, so the parts and service sales are expected to increase because their utilization rate goes up. However, so far, we haven't seen such kind of trend. The next question is given in English text, so let me read it out. The question is from Tami Kisan of Berenberg Asset Management. The question is, what's the growth driver for second half twenty twenty six regarding acceleration, please?\n\n**Moderator**\nThen is your 2026 WFE estimation still unchanged? Also on China, has China spending bottomed after scaling back you have been seeing? Or can it go down further? REPRESENTATIVE:] The three questions. As for your first question, the growth driver is AI server applications, the leading edge logic for AI server and HBM.\n\n**Moderator**\nWhen you refer to Page 16 of the slide, as I said on Page 16 of the slide, at present, the current device for AI server, four nanometer two of the four nanometer node GPU are mounted right now. But in the future, three nanometer node GPU, four of them actually will be mounted in the future in calendar 2027. Now there are 200,000,000,000 transistors right now. However, in 2027, two years from now, 500,000,000,000 transistors will be mounted. As for HBM at present, there are eight HBMs for two GPU to generate the memory capacity of two eighty eight gigabyte.\n\n**Moderator**\nBut in year 2027, the memory capacity will increase to one terabyte, the 16 DRAM dies to be stacked and the number of layers will be increasing from 12 to 16. So these are the major driver. What was the second question? Yes, the second question is, is your 2026 WFE estimation still unchanged? So 2026 WFE market outlook is under investigation right now.\n\n**Moderator**\nThere is some delay from January to March 2026, but second quarter from April to June 2026, when we can see some recovery trend. So we are now scrutinizing WFE market trend. In calendar twenty twenty six, and we are now scrutinizing the situation. But anyway, 2027, you can see the steady increasing investment for AI server. And I think the preparation for such new innovation will start from the 2026.\n\n**Moderator**\nWFE market is expected to grow in later 2026. We want to analyze the situation more to come up with something more clear. The third question is regarding China. From last year to this year, so WFE market in China has been shrinking. Do you think the Chinese WFE market bottomed out?\n\n**Moderator**\nOr do you see some more decline in WFE market for DX and GX semiconductor demand for digital transformation and green transportation will be increasing steadily? And the Chinese customers' self sufficiency in China is not yet fulfilled in Chinese market. And at present, there are some struggle in power semiconductors. I think China proportion is about 30% in the middle of the 30% level. When WFE goes up, when it comes to amount, Chinese market is also expected to grow.\n\n**Moderator**\nSo we don't see the further declining Chinese WFE market in the future. Thank you very much for your question. Next question is from Yoshioka san from Nomura Securities. Thank you very much. I am Yoshioka from Nomura Securities.\n\n**Moderator**\nCan you hear me? Yes, I can hear you. So WFE market and TEL growth potential, this is what we I want to ask. First of all, FY 'twenty six or fiscal year ending March 2026, now you have made the downward revision minus 5%. What was the figure three months ago announcement?\n\n**Moderator**\nAnd after that, after you tell me, what about this fiscal year? You said that Tokyo Electron sales will decrease by 3%. That means your company outperformed the WFE market. But when it comes to the fiscal twenty twenty seven, do you think you can outperform WFE market? Are there any difference between Tao's potential for growth and WFE market trend?\n\n**Moderator**\nSo our midterm management plan, 2027 is a target year of our midterm management plan and product mix and timing of delivery. So there is not consistent trend. But when it comes to our earning power, our company's earning power is getting stronger and stronger. So Gartner made announcement April for the share. When it comes to WFE market, the calendar year, the growth rate is 5.6%, and our company's growth rate was 23%.\n\n**Moderator**\nTherefore, especially our etch sales increased and quota developer share is increased from 90% and further higher. And three d integration bonda de bonda, actually, our sales of bonda de bonda has been increased by 3x over the past two years. So our earning power is getting stronger steadily. Because of that, five years ago, our gross profit margin was 40%, but recently, our gross profit margin has increased by about five percentage point. So the gross profit is exceeding JPY 1,000,000,000,000 for two years in a row.\n\n**Moderator**\nNeedless to say, regulations have some impact. High value added product cannot be delivered to Chinese market, as Wadak san said in his question. And geopolitical impacts and inflation impacts are also observed, but our gross profit exceed JPY 1,000,000,000,000 for two years in a row, and our gross profit margin has increased by five percentage point over the past five years, and our share has been increasing. So our share and profit growth, both of those two factors, are improving steadily despite of the geopolitical factors. Maybe next fiscal year, we don't we will closely see whether we can achieve those figures, but it is clear that our earning power is improving steady.\n\n**Moderator**\nAlso, ROE, 30% or more. Last year, we achieved 30.3% ROE. So we achieved our midterm management goal two years ahead of the target year. So if the sales come back, we are able to achieve the figures or targets of mid term management plan sometime in the future. And mid term management plan is not the final goal.\n\n**Moderator**\nIt's a kind of interim goal for us. So on the FY basis, we haven't disclosed information of the WFE market on FY fiscal year basis. So thank you very much. So FY 2027, WFE market growth and Tokyo Electron's sales are almost comparable. Yes, of course, we won't be below the WFE market growth in fiscal twenty twenty seven.\n\n**Moderator**\nI think we can outperform WFE market also in the fiscal twenty twenty seven. Next question is Mr. Nakano Mio of Jefferies Japan Limited. Thank you very much. On Page 13, I'm sorry, repeat the same question once again.\n\n**Moderator**\nI try to improve my understanding. So some leading edge logic customers are revising their CapEx plan. So you may not be able to talk about specific customer, but you have three major customers. Originally, two logic customers didn't change their investment so much. In that sense, the active investment made by only one Logic customer and that particular Logic customer has changed their investment plan for January to March 2027?\n\n**Moderator**\nOr do you think, too, the other two Logic customers' investment plan will be deferred furthermore? It's a bit difficult to make that comment. I think that your second option is more likely. So the capital efficiency improves for the one major logic customer and your business is rather getting smaller. No, that doesn't happen.\n\n**Moderator**\nAnd January to March next year, it's six months ahead. And now you have revised your outlook. That means the changes in January to March is rather clear or realistic. So now various customers and some top management have been changed. The new top management issued a new policy or direction.\n\n**Moderator**\nAnd some customers' financial announcement are made, and we have incorporated all those factors. And number four, HBM. HBM investment. And again, the investment efficiency gets better and investment for HBM is not increasing so much. While scaling of DDR5 improves investment efficiency or only the matter of timing of investment.\n\n**Moderator**\nSo semiconductor demand itself is growing. And toward year 02/1930, the semiconductor market is expected to grow to $1,000,000,000,000 There is no major no change at all for this measured trend. For 2027, the new device for server will be spreading furthermore. So there is no change in the growing trend of semiconductor market or demand. So in that sense, there have been no changes compared with the previous guide outlook, but customers' technology production technology is improved.\n\n**Moderator**\nBecause of that, some revision were made. Our short term financial estimate has been revised downward, and that portion is has the negative impacts. However, on the other hand, the investment Actually, closely watch supply demand balance and customers are more focusing on profitability, and they try to improve productivity, and they are improving their yield so they can produce chips with low cost. So now for midterm, long term perspective, these factors have positive impact to further drive the growth in mid- and longer term perspective because of the technology innovation. So as for the financial estimates, maybe we might have some impact for six months, and there are some symptoms, and we try to address to the capital market properly.\n\n**Moderator**\nAnd because we are we become aware of this kind of trend, we decided to make this announcement. You very much for your question, Mr. Nagano. And next question is Mr. Shibano of Citigroup Global Markets Japan.\n\n**Moderator**\nUNIDENTIFIED Thank you very much for your presentation. I am Shibano of Citigroup Global Markets Japan. For the quarterly performance improvement or momentum for the further improvement of your financial performance, so the quarterly sales, the fourth quarter should be the bottom. Is that correct understanding? And when it comes there is no quantitative disclosure.\n\n**Moderator**\nI understand that. When it comes to qualitative manner, in terms of orders, do you see some decreasing trend in orders? Let's say, the July, September period should be the bottom period. Is that correct understanding? So the bottom period, we should investigate to scrutinize furthermore.\n\n**Moderator**\nI think January, March period is very close to the bottom. We should study more to see what happens in what will happen in April to June. There might be some delay by three months or six months. But in the 2027, we will see a new device for AI server. When you think about that new device, there is a possibility to have the sudden increase or growth in the market.\n\n**Moderator**\nSo we also need to watch the enhancement of customers' yield. You talked about midterm management plan when you answered to the question of Mr. Yoshioka. I have one follow-up question. For FY twenty twenty seven is the target year of midterm management plan.\n\n**Moderator**\nSo six months ago, so maybe you said you can achieve the net sales of JPY 3,000,000,000,000. And do you think there are some changes in that prospect or external environment has been changed over the past three years? And not only the recent most recent changes, but I think overall trend has been changed. So would you like to refresh your ground targets? Or you don't think there is no need to revise the midterm management plan?\n\n**Moderator**\nWhen it comes I think the approach to the fixed cost and investment has been changed. How do you view the current midterm management plan? As I said a little bit earlier, so now you can see improvement of the gross profit margin, and our share has been improving. And new products, process of record, POR, or qualification by the customer has been acquired. So there are quite a few good positive factors because of that.\n\n**Moderator**\nSo now there is a kind of delay by six months, and we try to find out the magnitude of impacts. But for midterm management plan, maybe fiscal twenty twenty seven or 2028, ever since the announcement of our current midterm management plan, there have been many changes in terms of geopolitics. But we are making steady progress in our business, and we are keeping the investment for further growth in the future. And there is high expectation further technology innovation. Therefore, we have no intention to revise our midterm management plan.\n\n**Moderator**\nThe only thing is the timing for achievement of midterm management plan, which will be affected by WFE market trend to some extent. But when WFE market reaches a certain level, we are sure to achieve the targets. Thank you very much, Mr. Your question actually, one more question. The question is from Varun Rajawansi from Lazard Asset Management.\n\n**Moderator**\nThe question is, can you please make a comment on your market share excluding China? Are there areas where Tokyo Electron is losing share? Your sales outlook for this fiscal year is much worse versus what peers are suggesting. First of all, among different applications, the leading edge area, we don't lose shares in the advanced areas. Partially, in China, the general purpose were legacy node devices.\n\n**Moderator**\nBecause of the Chinese government policy, the Chinese tool vendors are improving their share. That's true. Last year, WFE market analysis announced by Gartner, the WFE market grew by 5.7% on average. Tokyo Electron grew by more than 23%. Despite weak yen, the growth rate of 23% or more is very outstanding.\n\n**Moderator**\nAnd actually, three Chinese companies among the top 20, and some of their sales growth rate is more than 40%. In the Chinese legacy market, our share in that Chinese legacy market has been declining slightly. However, when it comes to the volume zone for our further growth, that is cutting edge technology area, we keep our share. Compared with our peers, there might be some strong negative impacts. Some companies may have stronger figures for share in this year.\n\n**Moderator**\nThat is because of product mix and the timing of delivery. But in our existing markets, we don't lose our market share at all in the leading edge area. So we it is time for us to close today's conference. Before closing, however, I'd like to make an announcement. SEMICON West will be held in Phoenix and Arizona for three days from October 2025.\n\n**Moderator**\nOn day one, October 7, Tokyo Electron will organize fireside chat from one joined by Mr. Kawaii, Mr. Kiyama, Mr. Ishida and Mr. Sekiguchi.\n\n**Moderator**\nIn this event, we plan to discuss our midterm and long term business opportunities and growth potential. If you go to Semicon West, please join us in this event. We will send you the details later. And lastly, we'd like to continue to improve our IRR activities based on your precious feedback. So we would like to appreciate your kind cooperation in filling out questionnaire before you exit the website WebEx.\n\n**Moderator**\nThank you very much for taking time to join this conference despite your busy schedule today. Thank you very much.",
      "fetched_at": "2026-02-04T15:54:19.196Z"
    },
    {
      "ticker": "8035.T",
      "title": "TOKYO ELECTRON (8035.T) Q4 FY2025 earnings call transcript",
      "published_date": "Apr 30, 2025, 3:30 PM GMT+9",
      "fiscal_year": "2025",
      "quarter": "Q4",
      "url": "https://finance.yahoo.com/quote/8035.T/earnings/8035.T-Q4-2025-earnings_call-313348.html",
      "content": "**Moderator**\nIt's time for us to start Tokyo Electron financial announcement for fiscal year ended March 2025. Thank you very much for joining us today despite your busy schedule. I am Yatsuda of IR Department serving as a moderator of today's session. I'd like to introduce today's attendees, Toshiki Kawaii, Representative Director, President and CEO. I am Kawaii.\n\n**Moderator**\nNice to meet you. Next, Hiroshi Kawamoto, Senior Vice President, General Manager, Division Officer, Finance Division. Before starting the presentations, let me explain the flow of today's session. First of all, Kawamoto and Kawaii will make presentations. After that, until 06:30 p.\n\n**Moderator**\nM. Japan time, we will have a question and answer session where we will entertain questions from the audience. This meeting uses two channel of WebEx for the simultaneous interpretation between Japanese and English. As we explained in our e mail, you are currently requested to use apps on PCs or mobile terminals if you plan to ask questions. But if you are not going to ask questions, you can use telephones.\n\n**Moderator**\nSince this conference is intended for institutional investors and analysts, we would appreciate your kind understanding that we receive questions only from institutional investors and analysts. We will post the audio contents of this conference in Japanese and English on our website within couple of days for your reference. So now Kawamoto will present the outline of consolidated financial summary. Kawamoto san, please. Good afternoon.\n\n**Moderator**\nI am Kawamoto Finance Division. I'd like to present the consolidated financial summary of fiscal year ended March 2025. This slide shows the financial summary of the fiscal year ended March 2025. First of all, I'd like to highlight that results beat our previously announced guidance in net sales, income and profit margin. Please mainly look at figures in blue box.\n\n**Moderator**\nDriven by the customers' active spendings both for advanced and mature nodes, our net sales reached JPY 2,431,500,000,000.0, 30 2 point 8 percent increase year over year. Gross profit was JPY 1,146,200,000,000.0, exceeding the JPY 1,000,000,000,000 level for the first time. Gross profit margin rose to 47.1%, contributed by high value added and high profit margin products. Operating income was JPY 697,300,000,000.0, 50 2 point 8 percent increase year over year. Operating profit margin was 28.7%, three point eight percentage point wise year over year as gross profit margin hit record high, while we kept active R and D investment for the future growth.\n\n**Moderator**\nNet income attributable to owners of parent was JPY 544,100,000,000.0, 40 9 point 5 percent increase year over year. R and D expenses were JPY 250,000,000,000, 20 3 point 2 percent increase from the previous fiscal year since we continued investing for our growth, as I said before. Capital expenditures were 162,100,000,000.0 yen mainly due to construction projects in various sites such as development buildings in Tokyo Electron Kyushu and Tokyo Electron Miyagi as well as procurement of equipment used for evaluation. Depreciation was 62,100,000,000.0 yen 18 point 7 percent increase year over year. This shows financial trend.\n\n**Moderator**\nIn the fiscal year ended March 2025, net sales, gross profit, operating income and net income hit all time high. Also, profit margin and net profit margin reached record high. ROE on the bottom was 30.3%. This slide shows quarterly financial summary. I will mainly refer to the figures in the blue box.\n\n**Moderator**\nIn the fourth quarter, we generated net sales of JPY 6 and 55,400,000,000.0, slightly higher than net sales in the third quarter. Gross profit was JPY 310,500,000,000.0, 0 point 4 percent decline from the previous quarter. Gross profit margin was 47.4%, zero point two percentage point drop from the previous quarter. Operating income was JPY $183700000000.0.7.9 percent drop from the previous quarter due to increase of SG and A expenses, mainly including R and D expenses. Operating profit margin was 28%, two point five percentage point decline from the third quarter.\n\n**Moderator**\nNet income attributable to owners of parent was JPY 142,900,000,000.0, 9 point 1 percent decrease from the previous quarter. Capital expenditures in the fourth quarter were 34,600,000,000.0 yen This slide shows net sales by region. As for net sales composition in the fourth quarter, proportion of Korea and Taiwan rose by four point nine percent and two point four percentage points to reach 22.4% and respectively quarter over quarter. The proportion of sales to China on the bottom remains above 40% previously, but in the fourth quarter due to some shipment pulled forward to the third quarter and peak out of capital investment by emerging customers, the China proportion declined by 8.4 percentage point from the previous quarter to 34.3%. This shows SPE new equipment sales by application.\n\n**Moderator**\nIn fiscal year ended March 2025, from the bottom of this chart, sales to non memory customers accounted for 62%, non volatile memory accounted for 7% and DRAM accounted for 31%. For DRAM, active investment for advanced technologies such as HPM significantly contributed to the increase of sales to DRAM customers and the rise of its proportion. The proportion of sales to non broader memory customers remained flat year over year, but as customer investment gradually started picking up, our sales showed an increase. Sales to non memory customers rose significantly from the previous fiscal year, driven by strong demand for mature nodes as well as active capital investment for advanced nodes. Now this shows the Field Solutions sales.\n\n**Moderator**\nIn fiscal twenty twenty five, Field Solutions sales were JPY 5 and 38,300,000,000.0, growing by 25.6% year over year. Along with improving utilization rate of customers' fabs, we enjoyed strong sales for parts, service, used equipment and modifications. This slide shows balance sheet. Total assets were JPY 2,625,900,000,000.0. Cash and cash equivalents were JPY 490,000,000,000, increasing by JPY200.7 billion from the previous quarter.\n\n**Moderator**\nNotes and accounts receivables were JPY485.6 billion, declining by JPY25.2 billion from the previous quarter. Inventories were JPY 749,100,000,000.0, 15 point 9 billion decline from the previous quarter. Investment and other assets were JPY 3 and 47,600,000,000.0, declining by JPY 42,000,000,000 from the previous quarter due to such a factor as market capitalization decrease. For the liabilities and net assets shown on the right hand side, liabilities were JPY 7 and 70,700,000,000.0, decreasing by JPY 66,900,000,000.0 from the previous quarter, mainly due to posting of income taxes payable. Net assets were JPY 1,855,200,000,000.0, rising by JPY 57,000,000,000 quarter over quarter.\n\n**Moderator**\nThe equity ratio was 70.1%. This shows the cash flow. The cash inflow from operating activities in the fourth quarter was JPY 264,800,000,000.0. The cash outflow from investing activities was JPY 38,900,000,000.0 due to acquisition of fixed asset, mainly including equipment used for evaluation. The cash outflow from financing activities was JPY 23,500,000,000.0, primarily because of share repurchase.\n\n**Moderator**\nAs a result, free cash inflow was JPY 225,800,000,000.0. Free cash flow recorded all time high both on the quarterly and fiscal year basis. This concludes my presentation. Thank you very much for your kind attention. Next, Kawaii will present business environment and financial estimates.\n\n**Moderator**\nKawai san, please. This is Kawaii. Once again, thank you very much for joining us today. I will present business environment and financial estimates. Let me start with fiscal twenty twenty five full year business highlights.\n\n**Moderator**\nIn fiscal twenty twenty five, due to a drastic increase of investment in advanced logic for AI service and in HBM as well as put forward investment by Chinese customers. We generated net sales of JPY 2,431,500,000,000.0, gross profit of JPY 1,146,200,000,000.0, operating income of JPY 6 and 97,300,000,000.0 and net income of JPY 5 and 44,100,000,000.0 on a full year basis, all of which hit all time high. Driven by sales growth of high value added product to support technology innovations such as device scaling, higher stacking and three d integration, gross profit exceeded JPY 1,000,000,000,000 for the first time and gross profit margin reached 47.1%. Sales growth rate was 33%. In particular, sales to DRAM customers increased by 59% year over year as a broad range of our tools were adopted for HBM.\n\n**Moderator**\nOur market share also increased significantly. For H Systems in particular, we succeeded in raising our shares by six percentage point year over year as we won 100% mass production PORs in major customers for the capacity etching process, which is the most difficult process in DRAM production. One customer adopted our cryogenic etching system in non channel etching process, which contributed to our sales. Also, we won new PORs in non SiC etching process, which drove sales growth and demand for etch system grew in interconnect process of advanced packaging for logic and HBM. Sales of wafer bonders increased driven by growing demand for HBM, while sales of wafer provers expanded capitalizing on growing momentum of advanced logic investment.\n\n**Moderator**\nShare of wafer bonders and wafer probers showed drastic increase. In particular, bonder sales reached about JPY 30,000,000,000, growing by three times over the past two years. To further expand our future profit, we made steady progress in penetrating into new technology domains. Specifically, we released multiple new outstanding products contributing to semiconductors technology innovation. For example, penetration to untapped segments such as single wafer plasma, CVD and PVD, gas cluster beam system, which improves efficiency of leading edge lithography and laser lift off system to drastically decrease environmental footprint of processing.\n\n**Moderator**\nIn fiscal twenty twenty five, we conducted share repurchase of about JPY 150,000,000,000 in total. Next, I will talk about business environment. As we announced three months ago, we expect calendar year 2025 WFE market size will be about $110,000,000,000 remaining flat year over year despite the low investment to automotive semiconductors and power semiconductors as well as a mature node investment in Chinese emerging chip makers, thanks to continuing expansion of AI semiconductor demand, investment for advanced logic and HVM will be expected. Accordingly, WP Netket is expected to keep growing to record high level. Also in calendar twenty twenty six, growth of AI related investment will drive WFE market.\n\n**Moderator**\nGPU for AI server will shift to the three nanometer node from current four nanometer node. HBM to be used will evolve from the current eight chip stacking to twelve and sixteen chip stacking while proceeding with device scaling. In addition, full swing introduction of AI to edge such as smartphone and PC will start, which will trigger demand growth of two nanometer node logic and DDR5. Due to these drivers, WFE market is expected to show a double digit growth. For AI applications, touching edge semiconductor technologies are essential toward the realization of semiconductor devices featuring auto high speed, large capacity, high reliability and low power consumption.\n\n**Moderator**\nTechnology innovation is moving forward supported by two primary drivers. One is device scaling, which is well known intrinsic nature of semiconductor innovation and the other is a new driver heterogeneous integration. Along with the evolution of such technologies as GAA, backside PDN, next generation DRAM, higher stacking NAND and packaging processes, our business opportunity will expand more and more. Together with our customers developing cutting edge technologies, Tokyo Electron works on concurrent development of four generations looking ten years ahead. And this slide shows some examples of focused technologies.\n\n**Moderator**\nWe are addressing for next generation and the generation after. To capture these business opportunities for sure, we actively investing in R and D so as to improve our future corporate value. Next, I will present financial estimate for fiscal twenty twenty six. In the ongoing fiscal twenty twenty six, we expect full year net sales of JPY 2,600,000,000,000.0, positive growth of 6.9% year over year. The details are shown in this table.\n\n**Moderator**\nWe expect record high net sales and operating income again in this fiscal year. We will keep on investing for further growth, planning to invest JPY 300,000,000,000 for R and D. This slide shows SPE new equipment sales forecast. As the investment advance nodes for AI server and investment by Chinese chip makers were pulled forward to the second half of fiscal twenty twenty five, there is a sense of low in the first half of fiscal twenty twenty six. But in the second half, we expect situation will improve and investment by customers preparing for calendar twenty twenty six market growth will be activated.\n\n**Moderator**\nBased on this forecast, the SPE new equipment sales in the second half of this fiscal year are expected to be JPY 1,100,000,000,000.0, which is record high half year sales. This shows our plan for R and D expenses and CapEx. Following new development building in Miyagi, whose construction was completed the other day, construction of a new building in Kumamoto and production logistics center in Iwate is planned to be completed during this fiscal year. In Miyagi, we will start construction of a new production building in June, which adopts next generation smart manufacturing concept. In fiscal twenty twenty six, we expect R and D expenses of JPY 300,000,000,000, CapEx of JPY $240,000,000,000 and depreciation of JPY 86,000,000,000.\n\n**Moderator**\nThis is my last slide showing the dividend forecast. In fiscal twenty twenty six, the full year dividend per share is expected to be JPY618, surpassing the previous record. This concludes my presentation. Thank you very much for your kind attention. We will have Q and A session until 06:30 p.\n\n**Moderator**\nM. Japan time. You can ask questions either in Japanese or English, but as our speakers on the Japanese channel, please allow us to take audio question only in Japanese. If you ask a question in Japanese, please click the raise hand button on the WebEx. For details, please refer to the instructions attached to the invitation e mail.\n\n**Moderator**\nI will call the name of person one by one. Our Secretariat will contact you in advance. So please check the Webex chat box. When asking a question, you are kindly requested to unmute your microphone for yourself. When your question is answered or by our attendees, please hit the raise hand button once again to remove the raise hand signal.\n\n**Moderator**\nFor questions in English, please use the WebEx chat box and give your affiliation name and question in text and send it to our secretariat. We will refrain from answering question if your name and affiliations are not given. On the Japanese channel, we will translate your English question and I will read it out in Japanese and our speakers will answer in Japanese. On the English channel, the question and answer will be simultaneously interpreted into English on the real time basis. As we'd like to take questions from as many participants as possible, we'll take one question per person.\n\n**Moderator**\nIf time allows, we will take additional questions. So the first question is from Mr. Yoshida from CLSA Securities. I am Yoshida from CLSA Securities. Regarding WFE market forecast 2025 and '26, you said there is no change from the previous announcement by application.\n\n**Moderator**\nWhat is your view for the WFE market? If you have figures, please let us know what sort of growth rate do you expect in China for WFE market? Thank you. The breakdown by device, CY 2020 for last year and this year. We do have some forecast.\n\n**Moderator**\nSo as far as our analysis is concerned, 2024 high end logic, 20% DRAM accounts for 17% NAND accounts for about 5% others including CMOS image sensor, fab automation devices accounts for 13%. The China accounts for 45%, around 45% out of 45% of China, Seventy Percent are for commodity logics. That's how we view the photography market by application. This year CY 2025, the high end logic accounts for 20%, the same as last year DRAM, HBM, 20%, three percentage point increase NAND accounts for 10% last year 5%, so slight increase. And commodities and factory automation related devices as well as CMOS image sensor, wafer level packaging accounts for 15%.\n\n**Moderator**\nChina accounts for about 35%, out of which 80% is logic. So the proportion of China, last year was more than 40%. However, in WFE market, that should be about 35% by lunch declined by about 10 percentage point from previous year. That's our expectation. Thank you very much.\n\n**Moderator**\nOne more follow-up question. Compared with the figures you announced three months ago, are there any changes? And now Trump administration announced a tariff quite recently, are there any changes in the customer's attitude toward investment? For example, in China, ASML says that their sales is expected to grow. So those figures compared with three month prospect, are there any changes?\n\n**Moderator**\nAnd are there any changes in customers' attitude for investment? Right. By and large, there have been no changes over the past three months. In reality, last fiscal year results have been revised upward a little bit because of that there are some figures pulled forward. However, there have been no major changes over the past three months.\n\n**Moderator**\nThank you very much for your answer. Thank you very much. Mr. Yoshida, thank you very much for your question. Next question is from Mr. Wadakki from Morgan Stanley MUFG Research Japan. Wadakki san, please. I have a question regarding China. So two vendors know that, but actually quite big investment for memory was made. Lam and AMAT do have become more aggressive.\n\n**Moderator**\nHowever, because of the following regulations, the market situation might become much strong difficult. But the changes in China now, how do you view that? And what sort of impact do you expect for the future deregulations to be imposed? Thank you. Yes?\n\n**Moderator**\nSo at present, the regulations or tariffs, those things are discussed quite often nowadays. But about your question that changes in Chinese market because of the regulations, I don't see any significant changes. No, I don't think there is a major change. The information we already knew have been incorporated in our figures announced today, but there have been no major changes happening right now. That's how I view the Chinese market.\n\n**Moderator**\nThe middle of 40% will be declining to in the middle of 30% level. And I don't think there is major change in the Chinese market forecast. I don't have any impression. Okay. So I have one follow-up question.\n\n**Moderator**\nSo competition in China, how do you see? Actually, in the past, you are increasing your market share in China. But the local Chinese vendors and American vendors, are there any competition landscape change? So for example, Chinese tool vendors are growing rapidly right now. The Chinese government promote the industry, especially in the field of commodities, but in the field of commodities, there are only limited differentiation factors such as environmental performance like net zero or productivity.\n\n**Moderator**\nTherefore there is some limitation in differentiation. In that sense, within China, the Chinese two vendors are now growing in share? That's how I view the competitors in China. For American tool vendors, there is no change in the competitive landscape with or against American tool vendors. I don't we don't have any intention to capitalize on the regulations imposed by American government.\n\n**Moderator**\nWe are working on the fair basis and we don't have we don't see any particular impact. But in the future, the global when it comes to global share, we should promote technology innovation furthermore. So our company try to provide values to the global market and the opportunity is growing. China is growing, but other all of other areas are growing now and we try we think we can improve our share. So the share in the global market, I think we have a plan to further increase our share on the global market.\n\n**Moderator**\nBut because of the regulations, our share in Chinese market, When you think about regulations, and also Chinese two vendors expected to grow their sales. Thank you very much. That's very clear. Mr. Waraki, thank you very much for your question.\n\n**Moderator**\nNext question is from Mr. Nakamura of Goldman Sachs Japan. Mr. Nakamura, please. Thank you very much.\n\n**Moderator**\nThis is Nakamura. I have a question regarding 2026, the new fiscal year. I want to understand more about your business plan for this fiscal year. So by six months, for the first half, the gross profit margin will decline a little bit according to your plan. So could you let me know more details about that trend?\n\n**Moderator**\nYou can see the acceleration of the sales toward the second half of this year compared with three months ago, your the forecast from your customers have been changed or no changes in the forecast from the customers? This is Kawamoto. Let me answer to your question regarding the profit margin. Profit margin declines a little bit in the first half of your fiscal year. As you pointed out, as I said before, in the first half of this fiscal year, you can see some low in the sales that has a great impact and we continue our investment for further growth.\n\n**Moderator**\nWe are investing in R and D continuously and you can see some increase in labor cost as well. So when you think about overall picture for the first half of this year, profit margin declined from the second half of previous fiscal year also because of the decline in sales. For the second half of this fiscal year, the sales is expected to recover or improve. And toward next fiscal year, the investment for leading edge node will be increasing. Therefore, you can see increasing trend of the profit margin.\n\n**Moderator**\nThat's all from me. Thank you very much. So, let me add some more comments. The first half of this fiscal year, there is still sense of law. However, toward the second half of this fiscal year, the AI server inquiries are very strong.\n\n**Moderator**\nIn addition, next fiscal year, PC smartphones demand are expected to increase to some extent that is additional factor to drive the market. So AI server technology innovation is also having some impact. For PCs and smartphone, food market used to be large during COVID-nineteen. Ever since that time, number of PCs in smartphones has been declining. However, quite recently, you can see some picking up trend.\n\n**Moderator**\nAnd Windows 10 support will discontinue during this year. Because of the battery life, the number of PC and smartphones will be increasing. On top of that, can see function of on device AI and semiconductor content will increase, and we can see increase in investment last year. That's the reason why we expect double digit growth next fiscal year. That's the reason why second half of this fiscal year see some growing trend.\n\n**Moderator**\nAnd fixed cost to the sales will be declining because sales will be growing and the gross profit margin is expected to grow as well. Thank you very much. In March, the American government announced tariffs. And are there any change in customer's reaction? No.\n\n**Moderator**\nThere is no change in customer's forecast. Thank you very much. Mr. Nakamura, thank you very much for your question. Next question is from Mr. Yasui of UBS Securities. Mr. Yasui, please. Thank you very much. I am Yasui from UBS.\n\n**Moderator**\nHave a question regarding the demand difference between the first and half second half of this year. Now you can see low in the first half of this fiscal year according to my understanding, and that's what Kawaii san said earlier. However, having said that, when you look at the situation, the Chinese players try to place orders as soon as possible. I think that's the trend and that trend remain unchanged. Therefore, the first half of this fiscal year, so China and others, if there is any difference, please let us know.\n\n**Moderator**\nActually, so the Japanese supply chain is well established. So we are very flexible and agile to meet the short delivery lead time requirement. So we have very strong and resilient supply chain here in Japan. So even if there are some inquiries or orders pulling forward for AI server in China, we have been addressing those inquiries and demands. In that sense, the confidence level of the figures for the first half of this year is rather good because we do have orders, what we already signed get the LOI from our customers.\n\n**Moderator**\nTherefore, the confidence level for the figures in the first half is rather high. For the second half of this fiscal year, we do have demand, but we should see the qualification by customers and yield enhancement in customers, we need to closely watch the situation in the customer's fab. And when it comes to tariffs, there have been no changes so far. About 8% for America, even if there is some impact, that is the impact. So we must closely watch the situation, then we can further increase the confidence level of our forecast.\n\n**Moderator**\nAnd let me just give some comments for tariff. So, of course, we must be closely watch the situation from now on. And if something is decided, then we must address the situation to come up with best solution together with customers through the discussion with customers. And now there are various regulations and changes and we did have experience in the past many times actually. So tariff, so we try to come up with new products, which feature higher productivity to overcome negative impacts of tariff.\n\n**Moderator**\nThat is the mission of Tokyo Electron. Therefore, our mission is to promote semiconductor technology innovation and productivity enhancement. That's our mission. This is the purpose of the semiconductor production equipment manufacturers that remain unchanged, and this is what we are going to do. And this is a core of our business, and we need to take appropriate action.\n\n**Moderator**\nThank you very much. I have one follow-up question. There are some overlaps, I'm sorry for that. So now here's a guidance. So first half is rather conservative guidance, but second half of this fiscal year, So you are trying to watch the impact of tariff and you think this is the figure you can maybe achieve.\n\n**Moderator**\nBut as for the possibility, first half and second half, are there any possibility that the result become much stronger in the first half of this fiscal year? When the budgets are finalized, we need to be prepared. So we should if customer place us some orders earlier than expected and there is a possibility and we are making announcement those figures, I think this is most likely figures for the first half and second half of this fiscal year. Thank you very much. Mr. Yasu, thank you very much for your question. Next question is from Mr. Hirakawa of BOV Securities. This is Hirakawa from BOV. Thank you very much.\n\n**Moderator**\nI have a question regarding application. According to your presentation, HBM toward 2026 AI mounted PC and smartphone will be appearing. On the other hand, the DRAM proportion. So for the fiscal year ending in March 2026, you can see some decline. So if I maybe the difference between fiscal year and calendar year or are there any low somewhere or there are some changes in legacy nodes, could you elaborate this portion, please?\n\n**Moderator**\nYes. For DRAM, there are very strong inquiries. Last fiscal year, the sales to DRAM customers increased by 50% or more. And for months, in this fiscal year, you can see additional 10% to 20% growth expected. That's how we view the market trend.\n\n**Moderator**\nSo there is no sense of lag in that sense total amount and the device scaling in both cases, the number of HBMs and device scaling in both aspects, there is a very strong inquiry for DRAM. Therefore, can see some additional increase by 10 to 20% in DRAM sales. Let me add one more comment. In the fiscal year basis, it is true our guidance says that DRAM sales decline. However, on the calendar year basis, we think the DRAM sales growth will slightly outperform WFE market.\n\n**Moderator**\nAnd investment in China for DRAM declined this year, Kawaii san said earlier, actually it is true that DRAM demand increased outside of China. However, the DRAM demand in China is declined. So there is some offset between the two. I have one follow-up question. So the decline even if there is a decline in China for DRAM, you can see about 20% or 10% increase on the calendar year basis.\n\n**Moderator**\nIs that the correct way to see the DRAM market? The total, we don't see a 10% increase, but the DRAM other than excluding China, you can see the growth expected about 10% for DRAM. This year about 10% to 20% excluding China, yes that's right. I'm sorry. I made a mistake in the year date chronological figures.\n\n**Moderator**\nThank you very much, Mr. Hirokawa for your answer. Next question is Nakano Myo san from Jefferies Japan. Am Nakano Myo from Jefferies Japan. Can you hear me?\n\n**Moderator**\nYes. I'm sorry, this is a kind of repetitive question. So now Trump administration will announce the tariff and global economy will face the recession. I think that's risk case. But even under such situation, this forecast for your business outlook or WFE market will not be impacted so much.\n\n**Moderator**\nIs that how you view? This is Kawaii. As I said earlier, we must look at the market situation very carefully. As of today, our sales to North America, which is subject to the impact of tariff, accounts for about 8% out of the total sales. So it's very limited impact.\n\n**Moderator**\nAnd WFE market, actually there is nothing decided yet, but there have been no changes in WFE market situation. When it comes to macro economy as a whole, however, according to the tariff introduction, we must closely watch the situation of the macro economy dynamics. In that sense, for example, the semiconductor or electronic equipment will be subject to the tariff given by the American administration and they are saying that, but tariff is not actually imposed yet. But even if tariff is imposed, we should wait and watch what happens to that. For short term perspective, as I said earlier, 8% and we will see what happens to that 8% and we must closely watch the situation regarding that 8% impact in the North America.\n\n**Moderator**\nAnd if there are any burden on the customer because of the tariff, we should take appropriate action. And also for midterm, long term perspective, actually new model tool is launched every eighteen to twenty four months and we must introduce new product with high productivity to cancel the negative impacts of the tariff. This is how we can provide value to the customer properly by proposing new product. This is our business core mission and we need to take appropriate action in the mid term, long term perspective. So short term, we must be closely watching the situation.\n\n**Moderator**\nMr. Nakanomio, is everything clear for you? Thank you. Thank you very much for your question. Next question is from Mr. Shimamoto of Oka San Securities. I am Shimamoto. Thank you very much. I have a question regarding WFE market. For this fiscal year, you already talked a lot about this year, but when it comes to next year, 2026, high end logic, DRAM and NAND as well as China market.\n\n**Moderator**\nSo do you have any picture? So about the two digit, double digit growth, Could you elaborate your outlook? So for composition, I said in the beginning, let me just repeat. So high end logic, 20% DRAM accounts for 20% NAND accounts for 10%. And factory automation, CMOS image sensor, wafer level packaging and others accounts for about 15%.\n\n**Moderator**\nAnd China accounts for about 35%, out of which 80% accounts for logic. That's how I view the situation. And from the viewpoint of market, AI server demand continuously strong and two nanometer mass production investment will be accelerated. One foundry is now promoting this that will become multiple chip makers. That's what we can expect.\n\n**Moderator**\nIn addition, PC and smartphone will be increasing in unit and semiconductor content of PC and smartphone will be growing furthermore. So these are the drivers for the double digit growth. Thank you very much. So you said that's about calendar '20 '20 '6, those the 30% I'm sorry, I'm sorry. Calendar 2026, that's the question you asked about.\n\n**Moderator**\nI'm sorry for that. Calendar 2026, almost the same as 2025. Yatsuda san, do you have any additional comments? Maybe increase in logic area next year, but we expect NAND investment is almost comparable, but DRAM investment is expected to grow in 2026. As I said earlier, the leading edge customers excluding China will increase, but the investment in China will decline.\n\n**Moderator**\nTherefore, we can see increase in the advanced DRAM investment, but the major driver is advanced logic. The advanced logic proportion will increase furthermore. Thank you very much. That means DRAM increases and the China hit the bottom this year and leading edge logic is also a driver. Actually, we don't have any prospect that China will grow drastically.\n\n**Moderator**\nActually, major driver are the investment outside of China. The China market remained almost flat between this year and next year according to our understanding. So advanced logic will show a drastic increase and DRAM will further increase. Thank you very much. For example, the advanced node and mature node.\n\n**Moderator**\nLast year, for example, that proportion is four to six, we have more mature node. This year, five to five between mature and advanced nodes. And next year, the leading edge note accounts for 60%, commodity accounts for 40%. So this kind of trend will continue for few years or the advanced nodes will increase in proportion further more. Thank you very much.\n\n**Moderator**\nShimamoto san, thank you very much for your question. Next question is from Mr. Kamisaki from Tokyo Intelligent Laboratory. I am Kamisaki from Tokyo, Tokyo. I have a question regarding China.\n\n**Moderator**\nI'm sorry, I'm so persistent. So it's the fourth quarter, the China sales decreased, but after that, regionally, the first half, the business is rather strong and second half, the business goes down. That's how you view the CY 2025. However, when it comes to China, there is no difference or changes in this forecast. So the emerging foundry investment declined according to my memory.\n\n**Moderator**\nAre there any changes in your outlook? There have been no changes at present. Yetsudasan, do you have any additional comments? So three months ago, we announced the figures and there have been no changes over the past three months. As I said, the fourth quarter, the China proportion goes down and absolute amount goes down as well.\n\n**Moderator**\nSo the actual reality is in line with our forecast. So is it correct if I understand that there is no difference between the fourth quarter and first quarter and we can expect additional decline in the second half of this year from the first half of the year. Is this correct understanding? So in the future, so now we can see drastic decline in the emerging customers. On the other hand, existing customer continue their investment.\n\n**Moderator**\nWe don't see any ups and downs in the future. Thank you very much. It was very clear. Kamisa Akisan, thank you very much for your question. Next question is from Tonsan from Macquarie Capital Securities.\n\n**Moderator**\nAnd Damian Tong from Macquarie Capital Securities. Earlier, for HBM, bonder and debonder, the about JPY 30,000,000,000 is the sales volume. And this fiscal year and next fiscal year, how do you view the outlook in drywall etching? Earlier NAND flash in next fiscal year should be flat, but there is some demand I mean, those circumstances, next fiscal year, NAND flash tool, how much growth do you expect for NAND flash customers? So bonder and debonder.\n\n**Moderator**\nFor DHBM, the drastic growth has been recorded. Actually, the sales has increased by three times over the past two years, thirty billion yen and we have big expectation in this area. We thought it was doubled, actually increased by three times and now we achieved 30,000,000,000 yen maybe next year you can see another drastic growth according to our forecast. So it has been increasing steadily. Maybe that's how we can see the trend of this market.\n\n**Moderator**\nIn addition, temporary bond not only temporary bonder, but also backside for logic or three d NAND. The variation in those area is now going on. So bonder de bonder growth, de bonder sales growth is expected to be very huge. This year, we can see another step of increase compared with last year. And next, the cryogenic etching.\n\n**Moderator**\nAgain, the full swing introduction of 400 layers and 10 micrometer depth profile application. Those application will be introduced in 2026, but this year and not next year. Next year will be the big year for the growth of this market. We have won the mass production POA from one customer and two other customers are now evaluating the technology. The other day, we held IR Day.\n\n**Moderator**\nFor the high aspect ratio profile. So we use the the wavelength of the current and voltage and also the pulse width will be enhanced and ion vertical penetration should be enhanced. That's how we can differentiate our machines from our competitions. So this is how we further enhance the performance of the cryogenic etching system. And we are now working on the release of the new products.\n\n**Moderator**\nThank you very much. May I ask one more follow-up question? Yes, please. So the Etcher, that's dielectric Etcher, you did have the share of 60% last year and you have increased the share, but now you are winning PORs. And when you look at the customer engagement for year 2026, along with the growth of DRAM market, can you expect further growth in market share?\n\n**Moderator**\nWhen it comes to share, for this year, our share is about increased by six percentage point. But as I said earlier, we will see more exciting situation in Etching. There you can see opportunity of the drastic growth at the cutting edge technology DRAM capacitor etch that is one area for high potential growth. And we are taking some advantage because of pulse and iron angle incident angle adjustment. Those two are this advantage that we have.\n\n**Moderator**\nWhen it comes to cryogenic edge, so we have direct rectangular waveform and also pulse, and this is how we can further enhance our business opportunity for slit, non slit. We won we beat against the competitor and also HBM interconnect process, especially in Korea, the market is now growing rapidly. So now there are four key areas and for few years to come, you can see further growth in those four key area. This is really exciting and it's your business can see another step of growth for three years to come. So all the investors have very high expectation.\n\n**Moderator**\nThank you very much, Mr. Dong for your question. So maybe we have two more questions before closing today's session. Next question is from Yoshioka san from Nomura Securities. Yoshioka san, please.\n\n**Moderator**\nThank you. I have a question regarding NAND. So second half last year, NAND sales has been sales for NAND customers have been increasing. So do you think the investment for NAND is increasing generally, but is that because of the increase of your share? Or do you see some new emerging investment for NAND in China?\n\n**Moderator**\nSo could you let me know why NAND sales has been sales for NAND customer has been increasing in second half? Compared with this first half of this year, you can see the drastic increase of the sales to NAND customers. And could you let me know the factors for the growth of the NAND sales in the second half of this year? So now we can see increasing volume. The NAND market has been growing, that's one thing.\n\n**Moderator**\nAnd we have been increasing our share in the growing market. And for China market, the China market doesn't grow. Therefore, the market the inquiries are increasing in leading edge NAND market and we succeeded in increasing our share. That's the current status. For next year, this trend is expected to continue.\n\n**Moderator**\nMr. Yatsuda, do you have any additional comments? So now you can see drastic increase in sales, but actually over the past two years, the NAND investment was very small. So because of the recovery, you can see drastic recovery, but actually, when it comes to the proportion of the NAND, it's not so big. At present, this is a brownfield investment rather than greenfield investment and we receive increasing inquiries for brownfield investment.\n\n**Moderator**\nThank you very much for your answer. That was very clear. Mr. Yoshio Oka, thank you very much for your question. The next question this is last question.\n\n**Moderator**\nMr. Shibano from Citigroup Securities. I have Shibano from Citigroup Global Markets Japan. So for this fiscal year, the CapEx and R and D budget, when I look at your figures, the drastic increase is expected for this fiscal year. So in this fiscal year, so now I understand the assumption, but for next fiscal year or fiscal twenty twenty eight, when you come when you look at the situation in the midterm perspective, how do you view the fluctuation of R and D investment and CapEx?\n\n**Moderator**\nFor R and D, I think you are planning to increase R and D gradually, but when it comes to CapEx, so do you think do you increase CapEx in '27 and 2028 as well? Or do you see are you going to hit the plateau somewhere in the future for CapEx? Mr. Kawamoto will give you the answer. Mr. Kawamoto will answer the question. Mr. Shibano, thank you very much for your question. So yes, we are maintaining high level for this fiscal year. So Tokyo Miyagi and Tokyo Restroom Kyushu, as we announced before, we do have the new development buildings in those two sites.\n\n**Moderator**\nAnd that investment is rather huge to increase our CapEx. And after that, we will make a decision in the future So things are not decisive, but as for Miyagi production building require about 100,000,000,000 yen investment. That impact will be appearing next fiscal year, increasing CapEx. And afterward, we will see what we are going to do in the next midterm management plan. We do have some plan, So we are going to continue certain level of investment for the future.\n\n**Moderator**\nMr. Shibano, JPY one point five trillion investment for R and D for five years and CapEx of at least 700,000,000,000 yen So these are minimum value of investment actually. So when you look at the market growth potential and our growth potential, we don't have any plan to stop this kind of investment. So R and D building. Actually, this year, quite a few development building construction will be completed.\n\n**Moderator**\nSo next year, I I think the number of building to be constructed will be decreasing. But two years from now, so we need to enhance research activities furthermore because of the new business opportunity where we'll see the macro economy dynamics and also semiconductor environment as well to make a decision what to do. But I think this year, our capital investment is rather big, as I said in our presentation. Thank you very much. In that sense, compared with five years in the past, you are making quite big R and D investment and capital investment last year and this year.\n\n**Moderator**\nAnd now you have the fiscal year ending March 2027 and you are going to pursue the OPM of 35% or more, ROE of 30% or more, operating income of 1,000,000,000,000 yen or more. And when it comes to the midterm management plan target and when you can get the recovery of the huge investment and when you say 35% or more OPM, when can you able to achieve this kind of target? And if possible, WFE market, that's about 100,000,000,000 or more. But when it comes to China market, so the access by the Western two vendors in Chinese market will become more and more difficult and also presence of the China local two vendors will increase their presence. So in midterm, there is no need to reduce your focus.\n\n**Moderator**\nBecause of the growth of the leading edge logic, you can compensate the decline in China market. Thank you very much for your question. When it comes to sales, what are the fixed cost ratio against sales? Every six months, we incorporate it to look at the market trend. We are making every effort to improve the profit margin and we are trying to invest in the R and D and we also do the CapEx, but we always watch and review the financial finance model while we are making decision for investment, JPY 1,450,000,000,000.00 in the second half of this year, we do have such plan and 30% or higher operating profit margin is now being planned.\n\n**Moderator**\nSo when we double it, the top line is getting very close to our midterm management plan target. What is very good for us is the value added for AI servers, PCs and smartphones, high value added product. Proportion of the high value added product will be increasing furthermore in the future. In that sense, that's the reason why gross profit margin has been increasing so far. I think that's where we can have high expectations.\n\n**Moderator**\nSo we should pursue to double digit sales increase in the double digit market growth. When you think about that, thirty five percent or higher operating profit margin. We know this is challenging goal, but it's challengeable target. So next fiscal year as planned or two years from now, so we need to watch the macro economy trend and also impact of the tariff. But we are on the growth trajectory.\n\n**Moderator**\nThank you very much. Thank you very much, Mr. Shibana, for your question. So this concludes the today's conference. And we'd like to continuously improve our IR activities based on your precious feedback.\n\n**Moderator**\nSo we'd like to appreciate your kind cooperation in filling out the questionnaire before you exit the Webex. Thank you very much for taking time to join us in this conference despite your busy schedule today. Thank you very much.",
      "fetched_at": "2026-02-04T15:54:23.707Z"
    },
    {
      "ticker": "8035.T",
      "title": "TOKYO ELECTRON (8035.T) Q3 FY2025 earnings call transcript",
      "published_date": "Feb 6, 2025, 3:30 PM GMT+9",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/8035.T/earnings/8035.T-Q3-2025-earnings_call-254758.html",
      "content": "**Koichi Yatsuda** (Head of Investor Relations)\nIt's time for us to start Tokyo Electron financial announcement for the third quarter of fiscal year ending March 2025. Thank you very much for joining us today despite your busy schedule. I am Yatsuda of IR Department, serving as a moderator for today's session. I'd like to introduce today's attendees: Toshiki Kawai, Representative Director, President and CEO. Thank you very much. Hiroshi Kawamoto, Senior Vice President, General Manager of Finance Division. Kawamoto. Thank you very much for joining us today. Before starting the presentations, let me explain the flow of today's session. First of all, Kawamoto and Kawai will make presentations. After that, until 7:00 P.M. Japan time, we'll have a question-and-answer session where we'll entertain questions from the audience. This meeting uses two channels of WebEx for simultaneous interpretation between Japanese and English.\n\n**Koichi Yatsuda** (Head of Investor Relations)\nAs we explained in our email, you are kindly requested to use apps on PC or mobile terminals if you plan to ask questions, but if you are not going to ask questions, you can use telephones. Since this conference is intended for institutional investors and analysts, we would appreciate your understanding that we receive questions only from institutional investors and analysts. We will post the full contents of this conference in Japanese and English on our website within a couple of days. It would be appreciated if you could also visit our website. Now, Mr. Kawamoto will present the consolidated financial summary. Kawamoto-san, please.\n\n**Hiroshi Kawamoto** (SVP and General Manager of Finance Division)\nOnce again, good afternoon. I am Kawamoto, Finance Division. I'd like to present the consolidated financial summary of the third quarter of fiscal year ending March 2025. This slide shows the quarterly financial summary. I will mainly refer to the figures in the blue box. In the third quarter, we generated net sales of JPY 654.5 billion, a 15.5% increase from the previous quarter. This was the second highest quarterly net sales. Gross profit was JPY 311.7 billion, a 19.9% increase from the previous quarter. Gross profit margin was 47.6%, a 1.7 percentage point increase due to the rise of net sales. Operating income was JPY 199.6 billion, a 34.7% increase from the previous quarter. Operating profit margin was 30.5%, raised by 4.3 percentage points from the previous quarter due to the increase of gross profit margin that I mentioned before.\n\n**Hiroshi Kawamoto** (SVP and General Manager of Finance Division)\nIncome before income taxes increased by 30.3% to JPY 200.1 billion. Net income attributable to owners or parents was JPY 157.2 billion, a 33.6% increase from the previous quarter. Capital expenditures in the third quarter were JPY 50.2 billion. Mainly focusing on evaluation tools with development, we keep investing for future growth. This is a graphic representation of the financial summary shown on the previous slide on a chronological basis, just for your reference. This slide shows net sales by region. As for the net sales composition in the third quarter, the proportion of Taiwan and Korea rose by 5.0 and 3.4 percentage points, respectively, quarter over quarter. The proportion of China fluctuated in the low 40% level as in the second quarter. This shows SBE new equipment sales by application.\n\n**Hiroshi Kawamoto** (SVP and General Manager of Finance Division)\nIn the third quarter, from the bottom of this chart, sales to non-memory customers accounted for 57%, non-volatile memory accounted for 8%, and DRAM accounted for 35%. Sales to DRAM customers increased, and its proportion rose by 9 percentage points from the previous quarter. This slide shows the field solution sales. In the third quarter, field solution sales were JPY 141.5 billion, growing by JPY 1.9 billion. Sales of parts and services rose, along with the improvement of the utilization rate in the customer as well. Modification sales were also strong. This slide shows the balance sheet. Total assets on the top are JPY 2 trillion 501.9 billion. Cash and cash equivalents were JPY 295.5 billion, declining by JPY 230.0 billion from the previous quarter due to the dividend payment to shareholders, share repurchase, tax payment, and so on.\n\n**Hiroshi Kawamoto** (SVP and General Manager of Finance Division)\nNotes and accounts receivables were JPY 510.9 billion, increasing by JPY 139.2 billion quarter over quarter, partly because sales were concentrated in November and December due to recovery of investment among our major customers. Inventories were JPY 765.0 billion, increasing by JPY 22.7 billion quarter over quarter. Investment and other assets were JPY 389.6 billion, increasing by JPY 3.1 billion from the previous quarter. For the liabilities and net assets shown on the right-hand side, liabilities were JPY 703.8 billion, decreasing by JPY 15.6 billion from the previous quarter. Net assets were JPY 1 trillion 798.1 billion, declining by JPY 0.2 billion quarter over quarter. Equity ratio was 71.2%. This slide shows the cash flow. The cash outflow from operating activities in the third quarter was JPY 15.0 billion because of such factors as transient increase of notes and accounts receivable and interim tax payment that I said before.\n\n**Hiroshi Kawamoto** (SVP and General Manager of Finance Division)\nThe cash outflow from investing activities was JPY 49.0 billion due to acquisition of fixed assets, mainly including evaluation tools for development. Cash outflow from financing activities was JPY 117.1 billion, primarily because of dividend payment and share repurchase, as described in the balance sheet. As a result, free cash outflow was JPY 64.1 billion. Free cash flow is expected to improve to post significant positive figures in the fourth quarter. Finally, I will present the status of share repurchase. As of December 31, 2024, we acquired 2,024,200 shares, spending JPY 46.9 billion in total. As presented in the timely disclosure on February 3, this share repurchase program was completed in January 2025. This concludes my presentation of the consolidated financial summary of the third quarter of fiscal year ending March 2025. Now, we'd like to move on. Kawai will give you business environment and financial estimates. Kawai-san, please.\n\n**Toshiki Kawai** (CEO)\nOnce again, good afternoon, everybody. I'm Kawai. I will present business environment and financial estimates. Let me start with the business environment. We believe WFE market landed last year, calendar 2024, at $110 billion in size, exceeding the original expectation by about $10 billion because leading-edge technology investment to AI servers was very active, and delivery to Chinese customers were pulled forward. Calendar 2025 WFE market size is expected to be comparable with last year, around $110 billion, due to the pulled-forward delivery and low in investment to automotive semiconductors and power semiconductors, as well as in mature node investment by emerging Chinese IC vendors. Though current focus is slightly lower than that of three months ago, very strong demand for AI semiconductor keeps growing, and along with technology evolution driven by advanced logic and HBM, WFE market size will continuously achieve record high level.\n\n**Toshiki Kawai** (CEO)\nAlso, in 2026, calendar 2026, growth of AI-related investment will drive WFE market. GPU ASIC for AI server will shift to the 3-nanometer node from the current 4-nanometer node. HBM to be used will evolve from the current 8-layer stackings to 12- and 16-layer stacking while proceeding with device scaling. In addition, full-scale introduction of AI to the edge site, such as smartphone and PC, will start, which will trigger demand growth for 2-nanometer node logic and DDR5. Due to these drivers, the WFE market is expected to show a double-digit growth. For AI applications, cutting-edge semiconductor technologies are essential. Toward the realization of semiconductor devices featuring large capacity, ultra high speed, high reliability, and low power consumption, technology innovation is moving forward, supported by two primary drivers. The one is device scaling, which is well-known intrinsic nature of performance enhancement semiconductor, and the other is new driver heterogeneous integration.\n\n**Toshiki Kawai** (CEO)\nAlong with the evolution of such technologies as GAA backside PDN, high stacking memories, and test processes, our business opportunities will expand furthermore. This shows business progress in the third quarter of fiscal year ending March 2025. Regarding the financial performance, as Mr. Kawamoto presented earlier, net sales, profit, and all other indicators achieved our guidance. Our sales growth rate on the calendar year basis recorded 26%, significantly outperforming the market growth. In addition to expansion of Chinese market, AI-related investment drives the market growth. Toward full implementation of investment for high-volume production leading-edge semiconductors, we are receiving an increasing number of inquiries for advanced logic, DRAM for HBM application, and advanced packaging, which pushes up the proportion of our new product sales. This trend is expected to raise our full-year net sales and profit to the record high.\n\n**Toshiki Kawai** (CEO)\nIn this ongoing quarter, we are steadily winning PORs with our high-value-added strategic products. For cryogenic etching, which attracts attention in the market, one customer has decided to adopt it for their high-volume manufacturing line, while variation is steadily in progress on multiple customers. For Episode 1, the single wafer film deposition system we announced in July 2024, we have won PORs for logic backside PDN high-volume manufacturing from all major customers. Episode 1 was highly valued because of its lower contact resistance achieved by high interface controllability and its superior productivity. In December 2024, we released the two new models shown in this slide. They feature enhanced productivity and environmental performance and are expected to contribute to our SAM expansion. We are on track toward the achievement of the mid-term management plan, winning PORs and introducing new products.\n\n**Toshiki Kawai** (CEO)\nAs shown here, our company has a broad range of product portfolios to support device scaling, which is well-known intrinsic nature of semiconductor evolution. In addition to product for wafer process, we will actively provide solutions for advanced packaging, which will become increasingly important in the future. In the IR Day event to be held on February 26, the head of each business unit will present our future growth strategy. We would really appreciate your participation. In the growing WFE market, we will pursue number one share in each product group to further enhance our corporate value. In the WFE market, which will grow in the future, our dry etcher business is expected to grow drastically as the number of etching processes will increase along with technology innovation, and our share is growing.\n\n**Toshiki Kawai** (CEO)\nIn order to capture such growth opportunity as much as possible, we have decided to construct a new production building in Tokyo Electron Miyagi. Based on the Smart Production initiative to realize next-generation manufacturing concept, the new production building will adopt automation of logistic function and manufacturing process. We will aim to increase labor productivity by four times, double space efficiency, and reduce production lead time by a factor of three compared with the current condition. Next, I will present the financial estimates for fiscal 2025. Three months ago, we revised the financial estimate upward by JPY 100 billion. Our current estimate remained unchanged. Fiscal 2025 full-year net sales estimate out JPY 2 trillion 400 billion, which represents 31% positive growth year over year. We expect to significantly outperform market growth. The details are shown in the table.\n\n**Toshiki Kawai** (CEO)\nNet sales, gross profit, gross profit margin, operating income, net income, and EPS are planned to hit record high. This slide shows SB New Equipment Sales Forecast. Driven by progress in the third quarter, net sales in the second half of this fiscal year are expected to achieve all-time high of 985.0 billion JPY. This shows our plan for R&D expenses and CapEx. In fiscal 2025, we expect R&D expenses of 254 billion JPY, CapEx of 170 billion JPY, and depreciation of 63 billion JPY. This slide shows dividend focus. In fiscal 2025, the full-year dividend per share is expected to be 571 JPY, surpassing the record posted in fiscal year ended March 2023. This is my last slide showing total return amount over the past few years.\n\n**Toshiki Kawai** (CEO)\nThe total return amount in this fiscal year, totaling the dividend per share and additional share repurchase that I presented earlier, is expected to be JPY 413.3 billion, establishing a new record, surpassing the record in the previous fiscal year ended March 2024 by more than JPY 100 billion. This concludes my presentation. Thank you very much for your kind attention. Now we will have a question-and-answer session until 7:00 P.M. Japan time. You can ask questions either in Japanese or English, but our speakers are on the Japanese channel. Please allow us to take audio questions only in Japanese. If you ask a question in Japanese, please click the raise hand button on the Webex. For details, please refer to the instructions attached to the invitation email. I will call the name of the person who asked a question one by one.\n\n**Toshiki Kawai** (CEO)\nOur secretariat will contact you in advance, so please check the Webex chat box. When asking a question, you are kindly requested to unmute your microphone for yourself. When your question is answered by our attendees, please hit the raise hand button once again to remove the raise hand signal. For questions in English, please use the Webex chat box and give your affiliation, name, and question in text and send it to our secretariat. We will refrain from answering questions if your name and affiliations are not given. On the Japanese channel, we will translate your English question, and we will read it out in Japanese, and speakers will answer in Japanese. On the English channel, the question and answer will be simultaneously interpreted into English on a real-time basis. As we'd like to take questions from as many participants as possible, we will take one question per person.\n\n**Toshiki Kawai** (CEO)\nIf time allows, however, we'll take additional questions.\n\n**Toshiki Kawai** (CEO)\nThe first question is from Yoshida-san from CLSA Securities Japan. Thank you very much. I am Yoshida from CLSA Securities. On page 13, WFE Market Forecast, I have a question. So 2024 results and 2025 forecast by application. Do you have any growth rate idea? Could you share that with us, please? And the growth rate in China, especially for 2025, what is your view on that? And WFE market forecast is updated for your next fiscal year. You may have more than flat expectation. Any positive factors? And could you let me know your idea for next fiscal year? Thank you very much.\n\n**Toshiki Kawai** (CEO)\nThank you very much. This is Kawai. Let me answer your question. First of all, for next year, forecast by application that you asked for DRAM, plus 10%-20% increase.\n\n**Toshiki Kawai** (CEO)\nFor NAND, by and large, the proportion of NAND is about 10% in the market. I think the figure will be doubled compared with the figure in 2024. For logic, 10%-20% decline is expected. The leading-edge logic, advanced logic remains flat. However, China will show some negative trend. Therefore, DRAM is expected to increase or memory is expected to increase, while logic, the high-end logic, remains flat, but the negative is expected for China market. So by and large, the market is expected to be flat. DRAM growth is driven by HBM, followed by DDR5 for AI. For next year, AI server, the GPU and ASIC for AI server are now shifting to 3-nanometer node. Each AI device for 2-nanometer investment will start next year. HBM, so number of layers will be increasing, and further device scaling is also expected for HBM, PC, and smartphones.\n\n**Toshiki Kawai** (CEO)\nHAI and Windows 10 service support will be completed at the end of this year. Therefore, HAI high-end penetration will be expanding where semiconductor contents get higher. So that cutting area is expected to grow furthermore. When we look at fiscal year, we can see the sort of trend from January to March period in fiscal year already. We are now scrutinizing ourselves at this moment. Maybe double-digit growth in calendar 2026 can slightly be incorporated in fiscal year 2026 so that we can further increase or grow furthermore. And we are now scrutinizing details. Maybe we can share the idea with you in the next quarterly financial announcement. So CY 2025 WFE market, how do you like to see China in calendar 2025? We will expect the decline in Chinese market for non-memory areas. 10%-20% decline is expected in China.\n\n**Toshiki Kawai** (CEO)\nFor leading edge, there is no difference from previous year, but non-memory, 10%-20% decline is expected. Mainly due to the Chinese customers, especially the emerging Chinese chip makers, will suspend their investment. I think you can see more accurate figures. So Yatsuda-san, do you have any figures for that?\n\n**Koichi Yatsuda** (Head of Investor Relations)\nAs Kawai said earlier, so according to our market focus, actually, we think the market is flat while memory increases, while logic will decline. So the entire market remains flat, but memory increase can offset the decline in Chinese market. That's how we can see the entire market. Thank you very much. Yoshida-san, thank you very much for your question. Next question is from Mr. Nakamura of Goldman Sachs Japan. Nakamura-san, please.\n\n**Shuhei Nakamura** (Analyst)\nThank you very much. This is Nakamura. I have a question regarding the progress of financial performance.\n\n**Shuhei Nakamura** (Analyst)\nThe third quarter looks very good in terms of financial performance, but your full-year focus remains unchanged. That means it looks like the performance of finance will be going down from the third quarter to the fourth quarter. Are there any risk factors visible? That's my question. In addition, for calendar 2025 and beyond, so in order for you to outperform WFE market, there might be some drivers. You talked about several POR for manufacturing cryo-etcher and film deposition systems. For those two systems, how much contribution do you expect? At which timing? Could you share your idea, please?\n\n**Toshiki Kawai** (CEO)\nThank you very much for your question. So let me give you some figures. I think you have to do some calculation based on our figures.\n\n**Toshiki Kawai** (CEO)\nSo after the financial settlement, you may see some upward revision to some extent, but this is the current focus that we have at this stage. We don't have any factors for decline. That's not what we meant. There is no need to change things precisely, so you should watch the big trend and the timing of delivery for each month. We will look at those figures, and we don't have any major factor which forces us to change our financial estimates. But for inquiries from April, inquiries may be pulled forward to March. So that's what we can report to you today. Also, for next year, we do have our growth plan. As for the specific figures, maybe in the next financial announcement, we can give you more details.\n\n**Toshiki Kawai** (CEO)\nSo one thing I can highlight today is last year, WFE market $100 billion in size, and Tokyo Electron growth positive 26%. So on a fiscal year basis, more than 30% growth is expected. So because of AI in our company, the AI investment helps us to improve our financial performance. That's the position we are in. Advanced logic, DRAM for HBM applications, advanced packaging, the inquiries in those three areas are increasing. And next fiscal year, those three are the major drivers, and we expect a lot for further increase. For example, for DRAM, capacitor etching, supercritical dry, logic, GAA, gas chemical etching, and contact deposition. So these are the areas that TEL has a core competence. And we have acquired some PORs, and that will help us to make good financial results. And we are in a very dominant position for advanced logic and HBM bond.\n\n**Toshiki Kawai** (CEO)\nOur share is 60%-70%. So that's also the reason why we can outperform the market growth. So in particular, for testing and packaging processes, the probes and the bonder, also the film deposition, coater, and cleaning are also part of this area. For testing and packaging equipment in total, sales is doubled this fiscal year, about from JPY 100 billion-JPY 200 billion. So this kind of investment will continue or to be accelerated furthermore next fiscal year. Therefore, we can expect the growth next year. Specific figures or money basis, we are now scrutinizing figures. This is the big framework of our estimate for the future. Your question, that contribution of POR, this time, we talked about NAND channel hole. The investment for this is only for pilot line for this year. So the contribution to next fiscal year sales is not so big.\n\n**Toshiki Kawai** (CEO)\nAnother area, logic backside PDN. Customers, for the first time, are fixing their PORs. Therefore, maybe the investment for mass production line should be next year and beyond. Nakamura-san, thank you very much for your question. Next question is from Morgan Stanley MUFG Research Japan.\n\n**Tetsuya Wadaki** (Analyst)\nI am Wadaki from Morgan Stanley. Can you hear me? So I have one question regarding China. This fiscal year, so what is the proportion of China market sales and what is the decline you expect for next fiscal year? I think there is a decline for next fiscal year, but actually, China market brings you huge money. And if that proportion of China goes down, I wonder you may have some difficulty further increasing your sales. What do you think about that?\n\n**Toshiki Kawai** (CEO)\nFor the first half of this year, the China market accounted for the high 40% level, but in the second half of this fiscal year, China market proportion is the high 30% level. Therefore, 40% plus is the condition for this year. Next fiscal year, the midpoint of 30% level is the proportion of China market, China sales, so for profitability, high value-added leading-edge products are pursued by our company. Also, productivity should be high so that we can provide high value to the customers. We are proposing those things to our customers, so GPM has been increasing steadily right now. Just for this fiscal year, when you compare the first half and second half of this year, although China proportion goes down, when you look at gross profit margin, there is no change. Rather, gross profit margin can be increased.\n\n**Toshiki Kawai** (CEO)\nSo along this trend, by country, how can I put it? Along with the China proportion changes, the impact of the gross profit margin, we don't have so much concern.\n\n**Tetsuya Wadaki** (Analyst)\nYes. It's very clear. Thank you very much for your answer. That's all for me. Thank you very much.\n\n**Toshiki Kawai** (CEO)\nWadaki-san, thank you very much for your question. Next question is from Hirakawa-san from BofA. Hirakawa-san, could you unmute your microphone, please?\n\n**Mikio Hirakawa** (Analyst)\nFor WFE, we got the very detailed focus. So CY 2026, you said double-digit growth is expected. I think 2026 is far away, but which application will contribute to the double-digit growth? And are there any visible inquiries coming in? Could you let me know your feeling about calendar 2026? Thank you.\n\n**Toshiki Kawai** (CEO)\nSo when you look at the big framework, DRAM remains strong, HBM, and DDR5. HBM is for AI servers.\n\n**Toshiki Kawai** (CEO)\nFor HAI device, including PC and smartphones, DDR5 is expected high next year. For logic, it is expected to grow furthermore next year and onward. GPU and ASIC, three-nanometer node devices is one thing. For HAI, two-nanometer node devices. Two-nanometer, there is one customer, but toward next year, multiple customers are expected to start investment to the two-nanometer node. Therefore, for DRAM, rather than this year, you can see more sales for DRAM more than this year, next year, and logic is expected to further grow. For NAND, compared with last year, this year, NAND is doubled. That's what I said. Next year, I think this kind of trend will continue next year. As for the proportion of NAND, it is about 10% next year as well.\n\n**Toshiki Kawai** (CEO)\nBut when you think about those issues, by taking account of those factors, we said double-digit growth is expected, especially emerging customers in China are now starting up tools. And for mass production, they try to confirm their capability to start the mass production. So the proportion of China is about the midpoint of 30% level. That remains unchanged, but volume-wise, I think that China volume will keep growing as well. Thank you very much. Hirakawa-san, thank you very much for your question. Next question is from Shimamoto-san from Okasan Securities.\n\n**Takashi Shimamoto** (Analyst)\nI am Shimamoto from Okasan Securities. Can you hear me?\n\n**Toshiki Kawai** (CEO)\nYes.\n\n**Takashi Shimamoto** (Analyst)\nThank you very much. Now, my question is about next fiscal year sales. I want to understand your view. So the current fiscal year, you drastically outperformed WFE market because of the China investment is pulled forward.\n\n**Takashi Shimamoto** (Analyst)\nSo if my idea is not correct, please let me know if my assumption is correct. So next year, when China declines a little bit, next fiscal year, your sales might underperform WFE market. How do you think about this kind of potential risk for next fiscal year?\n\n**Toshiki Kawai** (CEO)\nYes. About your question, so we have outperformed the WFE market partly because of the pulled-forward sales in China, but also the advanced logic, HBM, and advanced DRAM. As I said earlier, they are the major drivers for us to outperform the WFE market. So we were ready to address those two factors. That's how we analyze the situation. From that viewpoint, for next fiscal year, we can meet the market expectations. That's how we view next year. We are now scrutinizing detailed figures. I'm sorry for that. We can share the information in the next financial announcement meeting.\n\n**Takashi Shimamoto** (Analyst)\nThank you very much. I have one follow-up question for advanced logic. So advanced logic, so this year and last year, when you compare those two years, I think advanced logic remains fraught. The customer in Taiwan did a very huge investment, but is it correct if I understand advanced logic remained fraught from last year to this year? Or did you receive any pulled-forward inquiries for advanced logic as well?\n\n**Toshiki Kawai** (CEO)\nFor advanced logic, the big customer will continue their investment. However, I said the advanced logic remains fraught, maybe because of the drastic drop of the North America customer. Is that a correct understanding? Well, at present, we are now trying to factor in the investment plan of all customers. As you know, many IC vendors are making financial announcements, so we incorporate those factors. So Taiwan investment gets larger for the advanced area.\n\n**Toshiki Kawai** (CEO)\nFor memory, this year and next year, as far as Tokyo Electron is concerned, for memory, like HBM or DDR5, our products have been adopted by our customer. This is one of the drivers of our growth. DRAM is expected to grow significantly. There is a way to think: is it calendar year or fiscal year, but everything, we are now winning PORs steadily. This will help us to further improve our performance in next fiscal year.\n\n**Takashi Shimamoto** (Analyst)\nThank you very much.\n\n**Koichi Yatsuda** (Head of Investor Relations)\nMr. Shimamoto, thank you very much for your question. Next question is from Yu Okazaki-san from Nomura Securities.\n\n**Yu Okazaki** (Analyst)\nThank you very much. I am Yu Okazaki from Nomura Securities. Thank you very much. So I have a question regarding China. The inquiries from China or your focus for 2025, compared with three months ago, have there been any changes?\n\n**Yu Okazaki** (Analyst)\nThere are some trends of getting stronger because your Japanese competitors said there might be a very similar investment level for next year as this year. So are there any changes in China trend? And I have one additional question. The impact of regulations in December last year, the American government issued the export control. And the end of January, public comments started from the METI Japan. So I wonder what sort of impact does it have on your customer's demand?\n\n**Toshiki Kawai** (CEO)\nThank you for your question. Needless to say, we have the broad product portfolio. Therefore, the American government regulations and additional public comment, as you mentioned earlier, we are being affected by those factors to some extent. It's inevitable. As I said before, we need to closely watch those impacts. So now we should be very careful and alert to monitor what's going on.\n\n**Toshiki Kawai** (CEO)\nBased on that observation, we can expect some regulations to come. And if there is no big difference between our expectation and actual regulations, and our plan for growth is not significantly affected over the past three months, the only minor impact is detected for our growth plan and our performance.\n\n**Yu Okazaki** (Analyst)\nThank you very much. I have one follow-up question. So compared with three months ago, are there any demands coming from China which is pulled forward?\n\n**Toshiki Kawai** (CEO)\nFor some tools, we have received a request for the pulled-forward deliveries. So now public comment is being started already. So we don't think any request is being pulled forward under the current regulations.\n\n**Yu Okazaki** (Analyst)\nThank you very much for your answer. That was very clear.\n\n**Toshiki Kawai** (CEO)\nYu Okazaki-san, thank you very much for your question. We have about 15 minutes to go, but actually, we received quite a few questions.\n\n**Toshiki Kawai** (CEO)\nCould you limit your question to one? Next question is from Kamiya-sama from Tokai Tokyo Intelligence Laboratory.\n\n**Shoichiro Kamisaki** (Analyst)\nI am Kamiya from Tokai Tokyo Intelligence Laboratory. So I have the cryo-etching. I have a question for cryo-etching. You want one POR from one company. I think there are some potential customers more. And how many more PORs do you expect for cryogenic etching? And I think there are several channel hole processes. And how much PORs have you obtained so far? So calendar year 2027, $2 billion market size was expected. Are there any changes for your focus for 2027? Do you have any comments, if any, regarding the competitors? Are there any differences between your product and your competitors?\n\n**Toshiki Kawai** (CEO)\nSo let me answer to your question as much as possible. For one customer, we want the high-volume production POR from one customer.\n\n**Toshiki Kawai** (CEO)\nMain portion is the investment for next year. We can see a drastic contribution next year. Other NAND customers, they are evaluating the technology as planned. I think we are able to demonstrate the benefits and the advantage of our product to the customers. In our company, the edge rate is rather high. On top of that, we do have the coating process, and we are trying to improve productivity, including combining coating and edge rate and coating itself. As far as productivity is concerned, there are some positive or negative impacts for coating, but when we have more stacking layers, and if there are more etching processes, we can get the advantage of high throughput of our technology. The technology for the future, I think we can provide high value to the customers.\n\n**Toshiki Kawai** (CEO)\nThe benefit of coating, the cost of consumables, COC, the operating cost, the customer can enjoy some benefits. So edge rate, the profile, and operating cost, or COC. These are the areas that we try to provide customers with the high values with our technology. Now we have one customer which adopted our technology. We are going to increase the number of customers who adopt it for mass production. Let me answer to you about the mass market size. $2 billion next year. That's our expectation, and there have been no changes. But customers try to improve investment efficiency, so there might be some decline. But as far as we are concerned at present, we haven't changed our focus. $2 billion. Mr. Kamiya, thank you very much for your question. Next question is from Mr. Yamamoto of Mizuho Securities.\n\n**Yoshitsugu Yamamoto** (Analyst)\nI am Yamamoto from Mizuho Securities. Can you hear me?\n\n**Toshiki Kawai** (CEO)\nYes.\n\n**Yoshitsugu Yamamoto** (Analyst)\nOn page 16, you talked about new production building in Miyagi. I misheard, but Kawai-san said lead time is to be reduced by a factor of three. If that's true, so TEL's etching cost goes down, how much reduction you can enjoy for cost? Do you have any idea for that?\n\n**Toshiki Kawai** (CEO)\nNow we are scrutinizing that sort of information. Production lead time, that's the lead time in our factory. That's what we mean by production lead time. We can reduce it by a factor of three. That's our target for lead time reduction. Production capability, FY 2029. This year is fiscal 2025. By 2029, production capability should be increased by 1.8 times, and capacity should be tripled for the future. Labor efficiency increased by four times, double the space efficiency, and reduce the production lead time by a factor of three.\n\n**Toshiki Kawai** (CEO)\nhighly efficient production line will be established in Miyagi, new production building. By doing this, maybe we try to increase the automation of our production line through the commonization of the parts and the standardization of the parts. Also, chamber-to-chamber matching can be improved when we have higher automation rate in our factory. Then on-site process maintenance can be reduced, and incidents can be reduced. Also, post-shipment costs can be reduced. We can enjoy quite a few benefits. We are now studying how much numerical benefits we can enjoy quantitatively. These are the factors for us to reduce the cost furthermore. More than 1,000 people will be working there, according to our current plan. On the other hand, automation rate will be increased furthermore. The market grows, and that will help us to hire more people.\n\n**Toshiki Kawai** (CEO)\nHowever, the cost per tool or fixed cost per tool can be reduced. That's the concept of the new production building. The quantitative cost reduction is being now studied. So I'm sorry, I cannot give you any specific answer for quantitative value. Kawai-san talked about the drastic change. The construction is to be completed summer 2027. You have only two years to go. So this kind of drastic change is just attributed to the difference in assembling. By including suppliers, I want to change many things, including suppliers. I'm sure you have reformed a lot. Is that kind of extension of the previous practices, or do you try to increase some destructive changes, which is totally different from what you have done so far?\n\n**Toshiki Kawai** (CEO)\nSo our major idea is, as you know, the semiconductor market is reaching $1 trillion, and according to IBS, $1.3 trillion is the size of market in the future. Year 2050, quantum computing or 6G, 7G communications will be introduced, and Industry 5.0, Society 5.0 will be emerging. We have a lot of expectations. Robotics will be implemented. Amid those circumstances, the semiconductor market is expected to grow drastically. So what is important for Tokyo Electron is pursuing growth rather than bloating, and we should improve the efficiency in our operations. So manufacturing digital transformation with AI and robotics, this is the concept that we should work on as a leader in this industry. Tokyo Electron alone cannot come up with high-efficient factory lines. Therefore, we need to make supply chain-wide effort to establish high-efficiency manufacturing line.\n\n**Toshiki Kawai** (CEO)\nSo the supplier cluster or fab cluster, we have quite a few partners located very close to our factories. They have their own operation centers very close to Tokyo Electron's factory. So this is a supply chain-wide effort to work on the smart manufacturing. And I hope the production building in Miyagi can present some model case. That's the backdrop of the decision made this time. So to your question, my answer is yes. I expect a lot.\n\n**Koichi Yatsuda** (Head of Investor Relations)\nThank you very much for your question. Yamamoto-san, thank you very much for your question. Next question is from. It's text in English. Let me read it out. This is a question from GAM Investment Management. Mr. Ernest Glanzman, the question is, historically, operating margins have not exceeded 30% on the sustained basis. Under what circumstances could they possibly rise to 40%?\n\n**Koichi Yatsuda** (Head of Investor Relations)\nIf not, what factors would prevent them from reaching such a level? Please provide argument to support both possibilities.\n\n**Toshiki Kawai** (CEO)\nThank you very much for your question. In our mid-term management plan, 35% or more OPM is our target toward FY 2027 by working on the mid-term management plan. 40% is mentioned in this question. That means we should further increase the OPM by 5% on top of the 30% or more target. Our target mid-term target is just a target. This is not the goal, so we should pursue further higher OPM to promote the growth, and we should invest more under the high profit margin, so 5% more than 35%. For one thing, Tokyo Electron is a manufacturer. Therefore, we should provide high-value-added next-generation products on a continuous basis to satisfy customers' demands. The gross profit margin has been growing by 7% over the past few years.\n\n**Toshiki Kawai** (CEO)\nSo we provide value to the customer by machine from the viewpoint of the GPM or marginal profit ratio. So 2%-3% enhancement is to be achieved for GPM or MPR, marginal profit ratio. And I said manufacturing DX with AI and robotics. That's what I said earlier. And also the business innovation by introducing AI and digital capability. So under those trends, we are now working on the business innovation project by incorporating IT unit. So we should reduce fixed cost ratio against sales so that we can pursue the further efficiency. Now we have more growth, and we can increase further share. At the same time, we should reduce fixed cost per sales, and we should pursue higher GPM and marginal profit ratio by several percentage points.\n\n**Toshiki Kawai** (CEO)\nSo this is how we can add 5% more to the OPM target of 35% or more in our mid-term management plan. So you talked about 40%. That's a very specific question we received. Therefore, I just gave you our way of thinking to answer your question. So our company, first of all, we must achieve our mid-term management plan. At the same time, we are now studying the possible plan, build the mid-term management plan for further growth.\n\n**Koichi Yatsuda** (Head of Investor Relations)\nMr. Glanzman, thank you very much for your question. Next question is also in English. Let me read it out. So this is a question from Paul Schwerda from Baillie Gifford. The question is as follows. What is your view on dry versus wet cleaning? In reference, how much will the industry move toward dry cleaning?\n\n**Toshiki Kawai** (CEO)\nSo let me answer to your question.\n\n**Toshiki Kawai** (CEO)\nSo by and large, the wet cleaning market is rather big. Partially, for critical processes, dry cleaning is also introduced. So our products, for example, aerosol-based, the physical cleaning, this is not liquid. So aerosol is used in our technology. But compared with wet cleaning, the dry cleaning market is rather small right now. So pattern collapse prevention, the supercritical dry technology is also advantageous. We have very high technology and high market share. So by combining those technologies, we want to increase our sales and share for wet cleaning. Thank you very much. That's all from us.\n\n**Koichi Yatsuda** (Head of Investor Relations)\nThank you very much for your question. Next question is from Yasui-san from UBS Securities. Yasui-san, please.\n\n**Kenji Yasui** (Analyst)\nI am Yasu from UBS Securities. My question might sound strange. So the other day, SoftBank announced the Crystal Intelligence AI, that is, AI agent of OpenAI used.\n\n**Kenji Yasui** (Analyst)\nAnd SoftBank is going to promote the sales of the software using AI. I think you have quite a few engineers. So software innovation is to be advanced drastically this year. Process using AI, there are many possibilities for that, but the company-wide introduction of AI for the total optimization. So have you started discussing the possibility to introduce AI on the company-wide basis, or are you just thinking about AI? So what is the stage of the introduction of AI in your company? Do you have any mid-term plan?\n\n**Toshiki Kawai** (CEO)\nThis year, I attended CES in the United States in January. So AI evolution, AI acceleration. It is true that there is an amazing situation going on now. Various applications will be emerging, and in many areas, efficiency can be enhanced by introducing AI. That's what we expect.\n\n**Toshiki Kawai** (CEO)\nIn our company, every year in January, we hold an internal technology forum where the engineers from different sites, including Japan, United States, make presentations on their technology innovation, and we share the technology innovation idea within the group. That's the purpose of the internal technology forum in January, and we select a champion in this forum, so IT utilized idea or development using IT or material selection by using IT. Those ideas are coming out one after another, and the volume of IT proposals is really huge, and I think IT has a huge potential, and now we have more and more sites, and from the viewpoint of the governance and security enhancement, and in order to ensure the compliance to various regulations, we must make the best use of AI. AI might detect things which might be overlooked by the people, so AI spreads furthermore.\n\n**Toshiki Kawai** (CEO)\nI'm sorry, my answer is rather abstract, but AI, we must work on AI actively, and we want to do investment for that end. One of the ways of thinking is, as a part of our business innovation project, the DX project, we have incorporated an IT unit in our digital transformation activities within the business innovation project. Mr. Yasui, thank you very much for your question. We have two more questions. I want to receive those two questions before closing today's session. Now we have a Damian Thong from Macquarie Capital Securities.\n\n**Damian Thong** (Analyst)\nI am Damian Thong from Macquarie Capital. Question. One question. This fiscal year, now you can see a drastic increase. And what is your expectation for next fiscal year? In particular, you talked about utilization rate is going up, and parts and consumable sales will be increasing. Do you think this continues next fiscal year?\n\n**Damian Thong** (Analyst)\nWFE market remains flat. That's your focus for next year. But field solution, how do you see the prospect of the field solution sales in next year?\n\n**Toshiki Kawai** (CEO)\nFirst of all, let me answer to your question. And Yatsuda-san, please add if any. As you just said, the utilization rate has been improving for DDR4, which is not sold a lot now. The DDR4 inventory is expected to reduce at the end of this year. And also, non-HBM inventory is expected to be declined. So it is true that customers' fab utilization rate goes up. So we can have a huge expectation for field solution business. And for on-device AI is another trend emerging now. And investment for on-device AI is also expected. So based on fiscal year, field solution business is expected to grow. Yatsuda-san, do you have any addition?\n\n**Koichi Yatsuda** (Head of Investor Relations)\nFor field solution sales, so we can see an increasing trend.\n\n**Koichi Yatsuda** (Head of Investor Relations)\nSo by quarter, we don't have any announcement, but parts service sales has been increasing over the past four quarters consecutively because of the utilization rate increase of the customers' fab. And our install base is increased by 4,000-6,000 units every year. So these factors help us to further increase the sales of Field Solutions. Thank you very much.\n\n**Toshiki Kawai** (CEO)\nThank you very much. Damian-san, thank you very much for your question. The last question. Hanaya-san from SMBC Nikko Securities.\n\n**Takeru Hanaya** (Analyst)\nI am Hanaya-san from SMBC Nikko Securities. I'll try to make my question briefly. So for NAND, calendar year 2025, that is doubled. So your focus remains unchanged from three months ago. I think it's a kind of surprise because why? Investment is necessary for them. I want to ask you.\n\n**Takeru Hanaya** (Analyst)\nSo now there are some vendors who said reducing the manufacturing volume, and some other companies may reduce manufacturing. The absolute volume gets smaller, but why do they need investment?\n\n**Takeru Hanaya** (Analyst)\nSo because they are reducing the manufacturing volume, so the supply-demand recovery might come earlier. But I think maybe we can see some flat situation in 2026. NAND market is the correct understanding.\n\n**Toshiki Kawai** (CEO)\nSo let me answer to your question. For this year, the customer investment, as for growth rate, is to be almost doubled according to our focus. As for the context, the greenfield, we don't expect any greenfield investment. So this year's investment is the brownfield investment for the purpose of migration. Why do customers want to invest more to reduce cost? According to our understanding, through migration, they try to reduce unit price. This is how customers can improve their profit margin.\n\n**Toshiki Kawai** (CEO)\nThis is the idea the customer must have according to our understanding. It's a bit early for us to say something decisive for next year. We don't have so much declining focus. I think the current investment level will continue. That's our tentative assumption for next year. Thank you very much. Thank you very much for your questions. As for image, the cutting-edge area, NAND customer, for this rather than this year, next year, the investment will increase for cutting-edge NAND customers. The other areas, as Yatsuda-san said now, are almost flat for NAND investment. So now it's time for us to close today's financial conference. Before closing, however, I'd like to make one announcement. As we informed you in the second quarter finance announcement, and also Kawai-san said earlier, we will hold IR Day event from 3:30 P.M. to 6:00 P.M. on February 26, Wednesday, 2025.\n\n**Toshiki Kawai** (CEO)\nIn this event, we plan to present our business opportunities expanding along with the growth of WF and test assembly to market, a new products and technology that we work on to embrace opportunities as much as possible. So we'd like very much to appreciate your participation in this event. We will inform you of the details of this event later. Finally, we'd like to continually improve our IR activities based on your precious feedback. So we appreciate your kind cooperation in filling out the questionnaire before you exit the WebEx. Thank you very much for joining us despite your busy schedule today.",
      "fetched_at": "2026-02-04T15:54:28.556Z"
    },
    {
      "ticker": "8035.T",
      "title": "TOKYO ELECTRON (8035.T) Q2 FY2025 earnings call transcript",
      "published_date": "Nov 12, 2024, 4:30 PM GMT+9",
      "fiscal_year": "2025",
      "quarter": "Q2",
      "url": "https://finance.yahoo.com/quote/8035.T/earnings/8035.T-Q2-2025-earnings_call-219868.html",
      "content": "**Koichi Yatsuda** (Head of Investor Relations)\nIt's time for us to start Tokyo Electron's financial announcement for the second quarter of fiscal year ending March 2025. Thank you very much for joining us today despite your busy schedule. I am Yatsuda of our department, serving as a moderator for today's session. I'd like to introduce today's attendees: Mr. Toshiki Kawai, Representative Director, President, and CEO. I am Kawai, nice to meet you. Next, Mr. Hiroshi Kawamoto, Senior Vice President, General Manager, Division Officer, Finance Division. Before starting the presentations, let me explain the flow of today's session. First of all, Kawamoto and Kawai will make presentations. After that, until 6:30 P.M. Japan time, we will have a question-and-answer session where we entertain questions from the audience. This meeting uses two channels of WebEx for the simultaneous interpretation between Japanese and English.\n\n**Koichi Yatsuda** (Head of Investor Relations)\nAs we explained in our email, you are kindly requested to use apps on PCs or mobile terminals if you plan to ask questions, but if you are not going to ask questions, you can use telephones. Since this conference is intended for institutional investors and analysts, we appreciate your understanding that we receive questions only from institutional investors and analysts as usual. We will post the audio contents of this conference in Japanese and English on our website within a couple of days. It will be appreciated if you also visit our website. Now, Mr. Kawamoto will present the consolidated financial summary. Mr. Kawamoto, please.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nOnce again, good afternoon. I am Kawamoto, Finance Division. I'd like to present the consolidated financial summary of the second quarter of fiscal year ending March 2025. This slide shows the quarterly financial summary. I will mainly refer to the figures in the blue box. In the second quarter, we generated net sales of JPY 566.5 billion, 2.1% increase from the previous quarter. Gross profit was JPY 259.9 billion, 1.5% decline from the previous quarter. Gross profit margin was 45.9%, dropping by 1.7 percentage points due to runoff, inventory disposal, and changes in product mix. Operating income was JPY 148.1 billion, 10.6% decline from the previous quarter. Operating margin was 26.2%, dropping by 3.7 percentage points from the previous quarter due to the decrease of the gross profit margin that I mentioned earlier and increase of SG&A to sales ratio, mainly including R&D expenses.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nIncome before income taxes decreased by 8.2% to JPY 153.6 billion. Net income attributable to owners of parent was JPY 117.7 billion, 6.7% decline from the previous quarter. The CapEx in the second quarter mainly comprises development buildings both in Tokyo Electron, Miyagi, and Tokyo Electron, Kyushu, which are under construction right now. This is a graphic representation of the financial summary shown on the previous page on the chronological basis. As shown here, net sales have been recovering after hitting bottom in the first half of the previous fiscal year. This shows the financial summary on the semi-annual basis. The figures in the blue box are the financial results in the first half of this fiscal year. The far right column shows the financial estimates for the first half of this fiscal year we announced on August 8th.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nAs you can see here, in every item, we have achieved the guidance we announced on August 8th. In comparison with the second half of the previous fiscal year, we generated more net sales and profit driven by strong customer demands. Compared with the first half of the previous year, our financial performance has grown significantly along with the recovery of our customers' WFE spending. Net sales in the first half of this fiscal year hit the second highest level on the half-year basis. This shows SPE new equipment sales by application. In the second quarter, from the bottom of this chart, sales to non-memory customers accounted for 71%, NAND accounted for 3%, and DRAM accounted for 26%. The composition is comparable with that in the previous quarter.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nThe new equipment sales slightly dropped in this quarter, partly because recognition of some sales was pulled forward to the previous quarter. Inquiries from our customers, however, remain strong. This slide shows the field solution sales. In the second quarter, field solution sales were JPY 139.5 billion, increasing by JPY 21.4 billion, driven by modifications. Also, sales of parts and services rose along with the recovery of utilization rate in the customer's fabs. This slide shows net sales by region. In the second quarter, proportion of China dropped by 8.6 percentage points to 41.3%. Proportions of the other regions generally showed an increase. Proportion of China is expected to decline from the first half to the second half of this fiscal year. This slide shows balance sheet. The total assets were JPY 2 trillion 517.8 billion.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nCash and cash equivalents were JPY 525.5 billion, rising by JPY 87.0 billion from the previous quarter. Notes and accounts receivable were JPY 371.7 billion, increasing by JPY 12.8 billion quarter over quarter. Inventories were JPY 742.2 billion, declining by JPY 22.5 billion from the previous quarter. Investment and other assets were JPY 386.5 billion, declining by JPY 84.9 billion from the previous quarter because of such factors as decreased market value of shares we own. For liabilities and net assets shown on the right-hand side, liabilities were JPY 719.4 billion, decreasing by JPY 3.0 billion from the previous quarter. Net assets were JPY 1 trillion, 798.3 billion, increasing by JPY 25.3 billion from the previous quarter. This change is primarily attributed to increase of asset due to recognition of net sales and decrease of asset due to decline of other securities valuation difference.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nThe equity ratio was 70.8% for your information. This slide shows the cash flow. The cash flow from operating activities in the second quarter was JPY 148.6 billion. The cash outflow from investing activities was JPY 54.4 billion, mainly due to acquisition of fixed assets. The cash outflow from financing activities was JPY 600 million. The free cash flow was JPY 94.1 billion. This concludes my presentation on the consolidated financial summary of the second quarter of the fiscal year ending March 2025. Now, Mr. Kawai will present the business environment and financial estimates. Mr. Kawai, please.\n\n**Toshiki Kawai** (CEO)\nThis is Kawai. I will present business environment and financial estimates. Thank you so much for joining us despite your very busy schedule. I will present business environment and financial estimates. Let me start with business environment.\n\n**Toshiki Kawai** (CEO)\nWe expect calendar 2024 WFE market will be $100 billion plus in size, just what we expected in August 2024. Though partially, customers' investment for advanced logic has been slow. Thanks to the support of more overwhelming strong AI demand, WFE market is gaining momentum, surpassing the original guidance. At present, customers continue active investment for AI servers. Capital spending for AI servers accounts for about 15% in the entire WFE spending, growing as much as 1.5 times year over year. About half of that is for HBM applications. In parallel, customers are activating advanced investment to prepare for full-fledged spread of AI-mounted PCs and smartphones, which also accounts for about 15% in WFE market investment. Driven by extremely robust AI demand, investment for DRAM, in particular for HBM, is very, very active.\n\n**Toshiki Kawai** (CEO)\nIn advanced logic foundry, in addition to investment for scaling to 4 nanometer, 3 nanometer, and 2 nanometer nodes and investment for their mass production, advanced packaging and testing needs are growing rapidly. In calendar 2025, in addition to strong demand for AI servers, AI content in PCs and smartphones is expected to grow. All in all, proportion of tools for AI semiconductors will go up to 40% in the WFE market. When research companies say proportion of AI semiconductors in the semiconductor devices will grow to 70%, and accordingly, AI presence will also rise gradually in the WFE market. Following the recovery of investment for DRAM, investment for NAND is also expected to resume as the inventory adjustments proceed. A further recovery of WFE spending in advanced logic foundry is expected to offset the low investment for mature nodes.\n\n**Toshiki Kawai** (CEO)\nWe expect that these factors will drive double-digit growth in calendar 2025 WFE market. For AI applications, cutting-edge semiconductor technologies are essential. Toward the realization of semiconductor devices featuring noise capacity, auto high-speed, and low power consumption, technology innovation is moving forward. Along with the evolution of such technologies as GAA, BACSAC, PDM, and high-stacking memories, our business opportunity will expand more and more. This shows business progress in the second quarter of fiscal year ending March 2025. Regarding financial performance, as Mr. Kawamoto presented earlier, net sales, profit, and all other indicators achieved our guidance. Toward full implementation of investment for high-volume manufacturing advanced devices, we are receiving increasing inquiries for tools for advanced logic, DRAM for HBM, and advanced packaging, which pushes up the proportion of our new products. This trend is expected to raise our full-year net sales and profit to a record high.\n\n**Toshiki Kawai** (CEO)\nI will show you an entire picture later. We are steadily winning PORs with our high-value-added strategic products in this fiscal year as well. We have won PORs with high-k gate film deposition system for DRAM capacitor and also single-wafer cleaning system with 24 chambers for NAND featuring high controllability and productivity. For bonders, which are expected to grow more in the future, we have won POR from new customers with temporary bonder for HBM, for which we have already gained high market share among the major customers. Another highlight is that we have won POR with fusion bonder for backside PDN used in advanced logic and development POR for SoC in advanced packaging. For the probers, we have an overwhelming share in advanced logic customers, and our prober sales in fiscal year is growing rapidly, likely to be doubled year over year.\n\n**Toshiki Kawai** (CEO)\nWe have won high-volume manufacturing POR with Prober for DRAM as well because of its advantage in temperature controllability from a major customer in this fiscal year. For cryo-etching, which attracts attention in the market, we have confirmed significant progress toward high-volume manufacturing POR at multiple customers. This diagram shows forecast data presented by TechInsights, which represents size of the WFE market and test and assembly market. As shown here, both WFE and test assembly markets are expected to grow strongly, and it is AI and advanced devices that drive this growth. Various development items shown on the right-hand side are currently underway, leading-edge wafer process tools to be delivered in massive volume and tools for advanced packaging and testing, which are rapidly growing.\n\n**Toshiki Kawai** (CEO)\nIn both of these two fields, we have won a significant number of high-volume manufacturing PORs and development PORs, all of which will provide us with growth potential for the future. In this fiscal year, AI-related sales alone will be more than JPY 600 billion. By leveraging our broad product portfolio, we will embrace growth potential as much as possible in both scaling and packaging. Toward the achievement of the mid-term management plan, our business is advancing steadily right now. In next fiscal year, we expect the application shown on the table will account for about 70% of our sales. We will hold IR Day on February 26, 2025, where we'd like to talk about Tokyo Electron's growth potential. We will announce more details about this event. Please join us in this event. Next, I will present the financial estimates for fiscal 2025.\n\n**Toshiki Kawai** (CEO)\nAs I described earlier, driven by the strong demand for AI-related devices, the WFE market is currently in recovery. Toward calendar 2025, full-fledged WFE spending is expected to start for advanced memory and advanced logic. We have revised the financial estimate upward by reflecting first-half results and latest market trend. Fiscal 2025 full-year net sales estimates are JPY 2 trillion 400 billion, which represent 31% positive growth year over year. We expect to considerably outperform the market growth. We estimate JPY 1 trillion 129 billion for gross profit, JPY 680 billion for operating income, and JPY 526 billion for net income attributable to owners or parents. In order to capture future growth opportunities as much as possible, we plan to invest JPY 254 billion for R&D. Net sales, gross profit, gross profit margin, operating income, net income, and EPS are expected to hit record high.\n\n**Toshiki Kawai** (CEO)\nThis slide shows SBE new equipment sales focused in fiscal 2025. As shown here, sales are recovering after bottoming out in the first half of the previous fiscal year. For the second half of this fiscal year, we expect record high half-year sales. This shows our plan for R&D expenses and CapEx. In fiscal 2025, as presented before, we expect R&D expenses of JPY 254 billion, CapEx of JPY 170 billion, and depreciation of JPY 63 billion, all of which are expected to hit record high. This slide shows the dividend focus. Based on revision of fiscal 2025 financial estimate, the full-year dividend per share is expected to be 571 JPY, surpassing the record posted in the fiscal year ended March 2023. In the Board of Directors meeting held today, we decided to implement share repurchase of up to JPY 70 billion.\n\n**Toshiki Kawai** (CEO)\nBack in February 2024, we announced our plan to spend R&D expenses for JPY 1.5 trillion and CapEx of JPY 700 billion for five years to come, starting from this fiscal year. This share repurchase has been decided by comprehensively taking into account various factors, including investment for our expected growth beyond next fiscal year, enhancement of our cash generation ability, and our cash position, as well as improvement of capital efficiency. Looking ahead toward our expanding business opportunities, cash generation ability, and cash efficiency improvement, we are going to manage balance sheet flexibly. This is my last slide showing total return amount over the past few years.\n\n**Toshiki Kawai** (CEO)\nThe total return amount in this fiscal year, totaling the dividend per share and additional share repurchase that I presented earlier, is expected to be JPY 413.9 billion, establishing a new record, beating the record in the previous fiscal year ended March 2024 by more than JPY 100 billion. We are planning to essentially cancel the shares we plan to repurchase during this fiscal year. Thank you very much. This concludes my presentation. We will have question-and-answer session until 6:30 P.M. Japan time. You can ask questions either in Japanese or English, but our speakers are on the Japanese channel. Please allow us to take audio questions only in Japanese. If you ask a question in Japanese, please click the raise hand button on the Webex. For details, please refer to the instructions attached to the invitation email.\n\n**Toshiki Kawai** (CEO)\nI will call the name of the person who asked the question one by one. Our secretariat will contact you in advance, so please check the Webex chat box. When asking a question, you are kindly requested to unmute your microphone for yourself. When your question is answered by our attendees, please hit the raise hand button again to remove the raise hand signal. For questions in English, please use the Webex chat box and give your affiliation and name as well as your question in text and send it to our secretariat. We will refrain from answering questions if your name or affiliation are not given. On the Japanese channel, we will translate your English question, and I will read it out in Japanese, and speakers will answer in Japanese. On the English channel, question and answer will be simultaneously interpreted into English on a real-time basis.\n\n**Toshiki Kawai** (CEO)\nAs we'd like to take questions from as many participants as possible, we'll take one question per person. If time allows, we'll take additional questions. Now, the first question is from Mr. Yoshioka from Nomura Securities.\n\n**Toshiki Kawai** (CEO)\nThank you very much. So I have one question. One question per person. Is that correct?\n\n**Toshiki Kawai** (CEO)\nYes.\n\n**Toshiki Kawai** (CEO)\nThank you. Could you let us know about the WFE market in 2025? You said double-digit growth is expected on page 13. So I think there have been no changes from the previous financial announcement in terms of the statement given. However, over the past three months, there have been many changes, I believe. Are there any changes in the degree of double-digit growth? What's the nuance in the growth potential in the WFE market?\n\n**Toshiki Kawai** (CEO)\nThank you. In principle, double-digit growth is expected, and we haven't changed our idea for calendar 2025 WFE market.\n\n**Toshiki Kawai** (CEO)\nLogic is very strong. At present, the investment for memories, especially for HBM, has been growing significantly, so leading-edge logic, almost the same level of the investment is expected as this year, and for DRAM memory area, the investment is expected to grow furthermore. For HBM, the investment is expected to grow. NAND investment is also recovering, because of those factors, double-digit growth is expected. This year, the proportion between the logic and memory is 7 to 3, but next year, the proportion should be 6 to 4, so memory proportion will go up next year, so logic WFE is almost comparable to this year, but WFE spending for memory increases. As a result, the proportion between logic and memory will become 6 to 4 next year. That's the reason why I expect double-digit growth next year.Thank you very much.\n\n**Toshiki Kawai** (CEO)\nBy applications, I understand your point, but what about China? How do you view the China market next year? The proportion of China will be changing. How do you think about that? For WFE as a whole, the China proportion is expected to decline to a 30% level. So in the second half of this fiscal year, it's below 40%. But next fiscal year, the China proportion should be about 30%, going back to the previous level. There are two reasons. Number one, the leading-edge investment is increasing. That's one thing. Number two, many new emerging customers in China are now focusing on enhancement of yield rather than investing for capacity enhancement. Because of those two reasons, China proportion will be declining. I think competitors are having a very similar view on China. So maybe the proportion of China will become about 30% next year. Thank you very much.\n\n**Toshiki Kawai** (CEO)\nThank you very much for your answer.\n\n**Toshiki Kawai** (CEO)\nMr. Yoshioka, thank you very much for your question. Next question is from Mr. Yoshida of CLSA Securities. Mr. Yoshida, please.\n\n**Toshiki Kawai** (CEO)\nI am Yoshida from CLSA Securities. Thank you very much. For SPE new equipment sales, your company is outgrowing the WFE market. Which product is driving your good performance? And next month, you said you are winning POR, and application mix will be shifting to memory. So by product, what is the driver? I wonder there might be some changes in driver by product. So I want you to give us the information about driver for this year and next year in terms of product. Fortunately, the scaling and patterning and packaging and testing in those areas, our company's product portfolio is rather growing. On page, the slide showing the data from TechInsights.\n\n**Toshiki Kawai** (CEO)\nBy application shown over here, the coater/developer, etching systems, film deposition systems, and cleaning systems. These areas are to be delivered in massive volume, and they are growing, especially for HBM applications. This is a high-volume zone, including HBM and AI-related advanced logic for DRAM, DDR5. These areas are showing the growth. Testing and assembly market, on the other hand, compared with WFE market, the size of the testing assembly market is smaller in size. The blue squares in the right table, they are representing testers and assembly. The purple squares are for WFE market-related equipment. Testing and assembly process, you can see significantly increasing the bonding and probing alone. Compared with previous year, we can see the increase of more than JPY 100 billion. Actually, the growth is almost doubled in this fiscal year, contributing to record high results.\n\n**Toshiki Kawai** (CEO)\nSo probably the progress and bonds compared with the exposure to the entire market are rather small. Therefore, etching system, coater/developer, and film deposition system. In those three applications, which product is growing most next year? Are there any changes in terms of driver? So it depends on the market size. For etching, this is a big portion. GAA nanosheet investment is expected to grow next year, already started this year. So you can expect the investment more. And maybe two years from now, the full flex investment will start for two nanometers. And etching grows furthermore, coater/developer, based on the high market share. I think you can see strong growing and for film deposition system. We are winning POR steadily. So these are the current conditions.\n\n**Toshiki Kawai** (CEO)\nSo for those applications shown on this page, the dots and blue portion, they are representative examples, and they are related to our application. And we have started evaluation of those applications together with our customers. These areas will become, by 2025, it accounts for 70% or more than 70%. So the product portfolio over here drives our growth potential. This is how we'd like you to understand the situation. As you can see, the diversified major products are delivered by our company. And for packaging, bonding, testing, in other words, progress are growing steadily as well. Thank you very much. Thank you very much for your question. Mr. Yoshida, thank you very much for your question. Next question is from Mr. Nakamura from Goldman Sachs Japan. Mr. Nakamura, please. Thank you very much. This is Nakamura. Can you hear me? Yes, I can hear you well. So earlier, Mr.\n\n**Toshiki Kawai** (CEO)\nKawamoto said your sales to China will be declining in proportion from the first half to the second half of this fiscal year. 6% should be the actual proportion of China in the first half of this fiscal year. What is the percentage or proportion of China in the second half of this year and next year? So how about this absolute value of sales to China for next fiscal year? Could you share your idea with us, please?\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nSo this is Kawamoto. Let me answer to your question. The first half of your question, in the first quarter, we had a very high proportion of sales to China, but the second quarter maybe declined. So 45% should be the proportion of China in the first half of this fiscal year, as you said earlier.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nFor the second half of this fiscal year, as Kawai said earlier, the proportion of China will go down to the 30% level. For next fiscal year, again, as Kawai said earlier, the leading-edge or advanced node will increase, so proportionally, there is a kind of low for the China customers. Therefore, the proportion of China sales will go down to 30% the previous figures. For the first half of this fiscal year, the China proportion should be 45%. The second half will decline by nearly 10%, and next fiscal year, further decline is expected, so the China proportion will go down to the 30% level in next fiscal year. The investment for advanced node, including investment for 2 nanometers, and the investment for 2 nanometers will start in a full-fledged manner two years from now. Therefore, the China proportion will go down to the 30% level.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nThank you very much. I have one follow-up question for this fiscal year. Now, you have revised your sales forecast by JPY 100 billion. So what is the proportion between China, sales to China, and sales to other regions in your upward revision? The advanced logic area, we have additional inquiries in the field of advanced logic. On the other hand, so there is some revision of the customers for advanced devices. The proportion between advanced node and mature node should be 50-50. These are the factors which made us to revise our estimate downward. Thank you very much, Mr. Nakamura. Next question is from Mr. Yasui of UBS Securities. Mr. Yasui, please. I am Yasui of UBS Securities. Once again, I have one question. For the second half of this year, you have a 47.3% of the gross profit margin. On the other hand, China proportion goes down.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nI think the China sales feature high profitability. So why the gross profit margin goes up, although the China proportion goes down in the second half of this fiscal year?\n\n**Toshiki Kawai** (CEO)\nSo as I said earlier in my presentation, the leading-edge area, the high-value added area business are growing steadily, as I said earlier in my presentation. So we have some advantage in that area. And that advantage is recognized by the customer, and we can provide high-value added to the customer. That's the reason why the gross profit margin goes up. In other words, HBM, logic, and packaging and testing, in these areas, the technology advancement is going on. And accordingly, our technology advantage is recognized. And that leads to high-value added products of our products.\n\n**Toshiki Kawai** (CEO)\nAnd the main drivers, because of high value, we can provide, although the proportion of China goes down, we are able to increase gross profit margin in the second half of this fiscal year. I have one additional comment. From the first quarter to second quarter, the gross profit margin goes down because of the product mix. So we have high market share product whose gross profit margin is rather high. That proportion goes down. Another one is one-off inventory disposal. Because of that, the gross profit margin goes down from the first quarter to second quarter. So this is a major reason. We are just talking about the second half of this year. The question is about second, yes, I wanted to know both for the second half of this year and the difference between first quarter and second quarter.\n\n**Toshiki Kawai** (CEO)\nSo the regional mix changes, but because of product mix, you can see some improvement. Therefore, for this fiscal year, if the gross profit margin is as planned, next year, you may see further increase in gross profit margin. Or do you think there is no change in gross profit margin next year? So I think if we can keep balanced business, and we are doing business in a balanced manner, so 2027 fiscal year, there's 3 trillion yen or more is to be achieved in fiscal year ending March 2027, the OPM of 35% or more, and ROE of 30% or more. That's part of our midterm management plan. And our new product progress in this fiscal year will help us to improve our business performance so we can add more PORs for high volume production in addition to 70% that I mentioned earlier.\n\n**Toshiki Kawai** (CEO)\nWe have a steady progress toward the achievement of the midterm management plan. So this is how our business is going on in a balanced manner. The semiconductor manufacturing industry is characterized by the very rapid changes, but very fast technology innovation. So we need to continuously have the world-leading technology innovation. That's the reason why we are investing more than JPY 1.5 trillion for R&D and JPY 700 billion or more for CapEx for five years to come. We are going to implement those five-year plans steadily for R&D expenses and CapEx. Thank you very much. Thank you very much, Mr. Yasui, for your question. Next question is from Mr. Wadaki of Morgan Stanley MUFG Research Japan. For next fiscal year, so it depends on China. We don't know what happens next year depending on China's situation.\n\n**Toshiki Kawai** (CEO)\nBut 2025, the China WFE market growth, what is your assumption for memory and non-memory, especially for memory? I think I saw the similar thing in Kokusai Electric. Many of the customers are pulling forward their orders. So they have some concern for next fiscal year's performance. So China as a whole, what sort of growth do you expect in the China WFE market? And what is the breakdown between memory and non-memory? There are numerous customers in China. Therefore, in my mind, there is no breakdown between memory and non-memory. But when it comes to China sales or WFE market in China, the China WFE market is expected to decline. You said earlier WFE market shows double-digit growth, while the proportion of China will go down by 40%. That means Chinese market size will decline by 20%. Is that correct?\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nI don't think 20%.\n\n**Toshiki Kawai** (CEO)\nSo, I think decrease by double digit. That's our expectation for China market. So, I have one follow-up question. This focus is based on the export control by the American government. How do you factor in the export control? So, geopolitical issues and regulations are to be watched closely. That's what I always say. Already, there are various information coming in. So, regulations will be imposed. And even after regulations are imposed, we need to get the permit from METI. There are some products which we may get permit, and there are some other products which we may not be able to get permit from METI. Based on that assumption, we report those figures. Thank you very much. That was very clear. Mr. Wadaki, thank you very much for your question. Next question is from Mr. Hirakawa of BofA Securities. Mr. Hirakawa, please. I am Hirakawa of BofA Securities.\n\n**Toshiki Kawai** (CEO)\nMy question is very similar to the previous question. Second half of this fiscal year. So when you see the composition by application, I got information for the first quarter results. I think there have been no changes. So I think DRAM, non-volatile memory, non-memory, all of them are growing generally. But by region, which region is a major driver to make you revise your forecast upward? The primary driver is Taiwan. So in terms of upward revision of our estimates, the mature node customers in China are added. There are additions in the mature node customers in China, but the major driver is the leading-edge foundries. By region, Taiwan, followed by Korea and China, partially United States, including memory area, advanced memory, and advanced logic, as well as the mature node in China are the major drivers. Thank you very much.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nThat's very clear. Mr.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nHirakawa, thank you very much for your question. Next question is from Mr. Damian Thong of Macquarie Capital Securities. Damian Thong, please.\n\n**Toshiki Kawai** (CEO)\nCan you hear me? Yes. On page eight, now you can see the Field Solutions sales for the second quarter. You hit the record high. And Q over Q, quarter over quarter, and year over year, you can see drastic increase. What is the reason for this drastic increase? And what will happen in this third quarter, fourth quarter, and next fiscal year? Are there any special factors to raise the Field Solutions sales? Or now utilization rate is increasing right now for advanced nodes. So can you see some tailwind next year as well? So as you pointed out in your question, the customer's fab's higher utilization rate. Accordingly, the parts sales has been growing steadily. Installed base is growing.\n\n**Toshiki Kawai** (CEO)\nThe customer fab utilization rate is also increasing because of these factors. Service and parts sales, as well as the sales, are increased because of the growing installed base. These are major reasons for the increase of the Field Solutions sales. Thank you very much. This level of Field Solutions sales, you said double-digit growth is expected next fiscal year, including products and service. But when you just look at the service, what sort of growth rate do you expect for next fiscal year? Our department will answer to your question. As of today, we don't work on next fiscal year's budget, but customer's utilization ratio is improving, especially for NAND. The first half of this fiscal year, the utilization ratio of NAND process is rather low, but it's growing. Maybe the investment for NAND will be doubled next year.\n\n**Toshiki Kawai** (CEO)\nTherefore, you can see growing installed base. Accordingly, the utilization rate is increasing. DRAM is also active, and logic is also very active. But when it comes to mature node, there are some weak utilization rate for mature node. I hope this answers your question. So you can see strong inquiries for the advanced logic and advanced memory. But when it comes to mature node, you can see some slowing trend. So the growth rate expected for next year, actually, we haven't calculated the expected growth ratio for next year. I have one follow-up question. For next fiscal year, Chinese WFE market is declining. However, when it comes to service or field solution service in China, the utilization ratio is expected to grow further more by improving the yield rather than capacity enhancement.\n\n**Toshiki Kawai** (CEO)\nField Solutions sales in China, although WFE market declines slightly, is there any possibility that Field Solutions sales in China increase next year? This year, China gets stronger because of the active investment by the emerging customers in China. They are working on the yield enhancement. Utilization ratio is not so high. When the yield is enhanced, we can expect a further increase in utilization ratio. However, we don't see such kind of trend yet among the Chinese emerging customers. Thank you very much.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nThank you very much, Damian Thong, for your question. Next question is from Mr. Shimamoto of Okasan Securities.\n\n**Toshiki Kawai** (CEO)\nI am Shimamoto of Okasan Securities. For WFE for 2025, the memory should be the swing factor. In the previous meeting, DRAM increases by 20%-30%, and NAND will be increasing two times.\n\n**Toshiki Kawai** (CEO)\nDo you have the same idea for DRAM and NAND still now? For NAND, compared with DRAM, the NAND market is rather small, but NAND market is to be doubled. And DRAM growth is expected as well. So as you said, we haven't changed our idea for the market trend for DRAM and market. You can give us some qualitative comment. Are there any enhancing trend or declining trend for NAND? I think the recovery might be delayed next fiscal year. Do you see such kind of trend in NAND market? So far, we haven't seen any significant changes. I have one follow-up question. For cryogenic etching, POR. So significant progress is achieved. I want to know specifically. It's so difficult for us to imagine what happens. Maybe you can tell something. What sort of progress has been achieved for cryogenic etching?\n\n**Toshiki Kawai** (CEO)\nAnd how much sales do you expect for next year if some sales are recognized for cryo-etching? Could you let us know whatever you can say now? So multiple customers and the applications of cryo-etching have been increasing slightly. So the characteristics are now being evaluated and verified right now. So if the customer can enjoy the desired characteristics, maybe we can have a negotiation with the customer for the mass production POR. 10 micron depth can be etched without bowing or tilt. At the same time, environmental performance, which is very important, is really good. We don't use carbon gas. So 400 layers will be introduced in the future. Then we will see more and more applications for this cryo-etching. The etching is rather big in area. The volume zone etching should be around 2026.\n\n**Toshiki Kawai** (CEO)\n2025, the cryo-etching will have some contribution to our sales, but volume zone will come in 2026. Do you have any specific amount for the size of the market? Too early to say? I reported some figures in the past, I believe. The size of the market? No, we haven't publicly announced any size of the potential market of cryo-etching. I'm sorry. I'm sorry. As for the market size, we haven't presented any report. So maybe you can see the drastic increase or sudden increase of the application of cryo-etching will observe in the future. But one thing, maybe two years from now, cryo-etching will start contributing to our sales 2027. The market size is up to a billion. That's what we said earlier. But that's two years from now. So far, we haven't changed this prospect drastically. Thank you very much.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nMr.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nShimamoto, thank you very much for your question. Actually, we have four more questions. Four more people raising hand. I'd like you to limit your question to one per person. Next question is from Mr. Yamamoto from Mizuho Securities.\n\n**Toshiki Kawai** (CEO)\nI have a question regarding share repurchase, so JPY 80 billion, and now we have additional JPY 70 billion. You said you have the flexible implementation of the share repurchase, and I think that's true, so I don't think that there's no major change in the policy for share repurchase, but are there any particular reason or trigger that you have decided to do some additional share repurchase? And are there any indicator to do another share repurchase next fiscal year, if any? So now we are going to do the appropriate balance sheet management. That's what we always say.\n\n**Toshiki Kawai** (CEO)\nIn particular, in terms of ROE, around 30% level of ROE is our constant target. So that's part of our consideration to decide the additional repurchase of shares. Of course, we are watching the market trend, our cash position, as well as ROE of about 30%. So we are doing the share repurchase so that we can achieve the ROE of about 30%. Thank you very much. Mr.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nYamamoto, thank you very much for your question. Next question is from Mr. Hanaya of SMBC Nikko Securities. Can you hear me? Thank you. I am Hanaya. The Taiwan is really strong. I know that. But other advanced logic manufacturers are not doing so well. I mean, those circumstances, ASML has revised their focus for next year downward. You have 100% market share for EUV.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nDoes the downward revision of ASML sales for next fiscal year have some negative impact on your financial estimate for your next year?\n\n**Toshiki Kawai** (CEO)\nAs far as we are concerned, our orders are increasing steadily. Therefore, in terms of coater/developer, there have been no major changes in coater/developer business. And there is no big volatility in our business of coater/developer. That business is growing. Mr. Yasui, do you have additional comments? For next fiscal year, DRAM and NAND are driver, especially DRAM for scaling. So not only EUV, but also the existing emerging lithography demand is increasing. So not only EUV, but also the emerging lithography, we do have high market share. In accordance with the market growth, our sales are expected to grow next year steadily. Mr.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nHanaya, thank you very much for your question. Thank you very much. The last question is from Mr.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nShibano of Citigroup Global Markets Japan. Mr. Shibano, I have a simple question, just clarification. And a very simple follow-up. For 2024 and 2025 WFE market forecast, you use the same sentence as the previous financial announcement. But how about reality? Are there any changes? You can just give me one word answer. Should you correct to reflect insightful information? And strong growth is expected for the future. According to Mr. Kawai's understanding, earlier this year, you presented R&D expenses, headcount enhancement, and CapEx enhancement. You are going to increase it by 1.5 times. But do you need further enhanced budget for the future, or do you just follow the initial plan for R&D headcount and CapEx?\n\n**Toshiki Kawai** (CEO)\nThe business opportunities are expanding. The served available market is growing right now. So we are given great opportunities. Industry is USD 1.5 trillion or more, or USD 700 billion or more expenses.\n\n**Toshiki Kawai** (CEO)\nSo we cannot give you any quantitative additional expenses for R&D expenses and CapEx as of today. But we may need more expenses for R&D and CapEx. And we are now preparing the plan for the future. For WFE market focus, double digit growth is expected for next year. Page 13 shows some information. So AI servers investment, the proportion of that for next year accounts for 20% in total WFE. And AI mounted PCs and smartphones also accounts for 20% within WFE market. And conventional PCs and conventional smartphones accounts for 30%. So these are the major drivers for this year: 15%, 15%, and 35%. Therefore, 65% are driven from the leading edge node. But next year, that 65% will be increased to 70%, especially driven by AI-related demand. So market itself is expected to grow on the double-digit basis.\n\n**Toshiki Kawai** (CEO)\nBut AI-related servers and PCs and smartphones are expected to grow furthermore. In the future, AI area is expected to grow furthermore. According to our prospect, there have been no major changes in our idea for the future market trend. So there have been no major changes from the previous financial announcement. Yes, that's correct. Thank you very much. And so new area, we are winning POR. Also, we have started some evaluation. Therefore, we are making steady progress toward the midterm management plan.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nMr. Shibano, thank you very much for your question. So now it's time for us to close the financial announcement. Before closing, however, I'd like to make one announcement. As Kawai announced in his presentation, we will hold IR Day at 4:00 P.M. of February 26, Wednesday, 2025.\n\n**Hiroshi Kawamoto** (SVP and General Manager)\nIn this event, we plan to present our business opportunities expanding along with the growth of WFE and test assembly to market our initiative to embrace opportunities as much as possible. So we'd like very much to appreciate your participation. We will inform you of the details of this event later. We'd like to continuously improve our R&D activities, IR activities based on your precious feedback. So we would appreciate your kind cooperation in filling out the questionnaire before you accept the WebEx. Thank you very much for taking time to join this conference despite your busy schedule.\n\n**Toshiki Kawai** (CEO)\nThank you very much.",
      "fetched_at": "2026-02-04T15:54:33.657Z"
    }
  ]
}