{
  "ticker": "AAPL",
  "last_updated": "2026-02-03T14:51:38.292Z",
  "total_transcripts": 5,
  "transcripts": [
    {
      "ticker": "AAPL",
      "title": "Apple Inc. (AAPL) Q1 FY2025 earnings call transcript",
      "published_date": "2026-02-03T14:51:36.271Z",
      "fiscal_year": "2025",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/AAPL/earnings/AAPL-Q1-2025-earnings_call-251672.html",
      "content": "Oops, something went wrong\n\nSkip to navigation Skip to main content Skip to right column US English US y LATAM Español Australia English Canada English Canada Français Deutschland Deutsch France Français 香港 繁中 Malaysia English New Zealand English Singapore English 台灣 繁中 UK English News Finance Sports News Today's news US Politics 2025 Election World Weather Climate change Health Science Originals Newsletters Games Life Health Parenting Style and beauty Horoscopes Shopping Food Travel Autos Gift ideas Buying guides Valentine's Day gifts Entertainment Celebrity TV Movies Music How to Watch Interviews Videos Finance My portfolio Watchlists Markets News Videos Screeners Personal finance Crypto Sectors Industries Sports Fantasy Daily fantasy NFL NBA MLB NHL College football College basketball Soccer NFL Draft Yahoo Sports AM Show all New on Yahoo Creators Tech Local services Selected edition Mail Sign in Back to quote Apple Inc. (AAPL) Q1 FY2025 earnings call transcript Powered by Quartr Jan 30, 2025, 5:00 PM EST Earnings call Apple reported Q1 FY25 revenue of $124.3B, up 4% YoY, and record EPS of $2.40, up 10% YoY. Services revenue grew 14% to $26.3B, and Mac and iPad posted double-digit growth. Management guided for low to mid-single digit revenue growth in Q2 despite FX headwinds. Apple reported Q1 FY25 revenue of $124.3B, up 4% YoY, and record EPS of $2.40, up 10% YoY. Services revenue grew 14% to $26.3B, and Mac and iPad posted double-digit growth. Management guided for low to mid-single digit revenue growth in Q2 despite FX headwinds.\n\n0:00:00\n\nGood afternoon and welcome to the Apple Q1 FY 2025 earnings conference call. My name is Suhasini Chandramouli, Director of Investor Relations. Today's call is being recorded. Speaking first today are Apple CEO Tim Cook, and he'll be followed by CFO Kevan Parekh. After that, we'll open the call to questions from analysts. Please note that some of the information you'll hear during our discussion today will consist of forward-looking statements, including, without limitation, those regarding revenue, gross margin, operating expenses, other income and expense, taxes, capital allocation, and future business outlook, including the potential impact of macroeconomic conditions on the company's business and results of operations. These statements involve risks and uncertainties that may cause actual results or trends to differ materially from our forecast.\n\n0:01:06\n\nFor more information, please refer to the risk factors discussed in Apple's most recently filed annual report on Form 10-K and the Form 8-K filed with the SEC today, along with the associated press release. Apple assumes no obligation to update any forward-looking statements, which speak only as of the date they are made. I'd now like to turn the call over to Tim for introductory remarks.\n\n0:01:36\n\nThank you, Suhasini. Good afternoon, everyone, and thanks for joining the call. Before I talk about our results, I'd like to take a moment to acknowledge the devastating wildfires that impacted the Los Angeles area this month. From our retail teams to Apple TV+, Apple Music, Fitness+, Beats, and more, LA is home to many of our team members. Our thoughts are with everyone who is beginning the road to recovery. For our part, we are contributing to the relief efforts, and we will continue to support our teams and the local community. Now, turning to the quarter. Today, Apple is reporting revenue of $124.3 billion for the December quarter, up 4% from a year ago and an all-time record. EPS also set an all-time record of $2.40, 10% higher year over year.\n\n0:02:36\n\nWe achieved all-time revenue records across the majority of the countries and regions we track, including the Americas, Europe, Japan, and the rest of Asia-Pacific. We also continue to see momentum in emerging markets, setting all-time revenue records in a number of markets, including Latin America, the Middle East, and South Asia, among others. In services, we achieved an all-time revenue record, and in the past year, we've seen nearly $100 billion in revenue from our services business. I'm also pleased to announce that we reached a new record for our installed base, with over 2.35 billion active devices. In October, we released the first set of Apple Intelligence features in U.S. English for iPhone, iPad, and Mac, and we rolled out more features and expanded to more countries in December. Now, users can discover the benefits of these new features in the things they do every day.\n\n0:03:38\n\nThey can use Writing Tools to help find just the right words, create fun and unique images with Image Playground and Genmoji, handle daily tasks and seek out information with a more natural and conversational Siri, create movies of their memories with a simple prompt, and touch up their photos with Clean Up. We introduced Visual Intelligence with Camera Control to help users instantly learn about their surroundings. Users can also seamlessly access ChatGPT across iOS, iPadOS, and macOS, and we were excited to recently begin our international expansion, with Apple Intelligence now available in Australia, Canada, New Zealand, South Africa, and the UK. We're working hard to take Apple Intelligence even further. In April, we're bringing Apple Intelligence to more languages, including French, German, Italian, Portuguese, Spanish, Japanese, Korean, and simplified Chinese, as well as localized English to Singapore and India.\n\n0:04:44\n\nAnd we'll continue to roll out more features in the future, including an even more capable Siri. Apple Intelligence builds on years of innovations we've made across hardware and software to transform how users experience our products. Apple Intelligence also empowers users by delivering personal context that's relevant to them. And importantly, Apple Intelligence is a breakthrough for privacy and AI with innovations like Private Cloud Compute, which extends the industry-leading security and privacy of Apple devices into the cloud. Apple Intelligence opens up an exciting new frontier and is already elevating experiences across iPhone, iPad, and Mac. We're going to keep investing in innovation and in transformative tools that help users in their everyday lives. Let me now turn to our results for the quarter, starting with iPhone. iPhone revenue came in at $69.1 billion, reaching all-time iPhone revenue records in dozens of markets and regions.\n\n0:05:51\n\nOur iPhone 16 lineup takes the smartphone experience to the next level in so many ways, and Apple Intelligence is one of many reasons why customers are excited. With the A18-powered iPhone 16 and iPhone 16 Plus, users are getting a big boost in battery life and incredible camera experiences with camera control. Our amazingly powerful iPhone 16 Pro models go even further, with larger-than-ever displays and a Pro Camera system so advanced it can turn moments into masterpieces. In Mac, revenue was $9 billion for the December quarter, 16% higher year over year, driven by significant excitement around the world for our latest Mac lineup. The Mac is more than just a powerful tool. It's a launchpad to enable users to bring their best ideas and boldest creations to life.\n\n0:06:49\n\nAnd there are so many reasons to choose Mac, from the breathtaking performance of the M4 family of chips to the groundbreaking and growing capabilities of Apple Intelligence. Every product in the Mac lineup offers something extraordinary, whether that's the super-portable MacBook Air, the powerhouse MacBook Pro, the world's best all-in-one iMac, or the small wonder that is the Mac mini, which is not only stunningly capable but is our first carbon-neutral Mac. All of this is enabled by the unparalleled power of Apple Silicon. iPad revenue was $8.1 billion, up 15% from a year ago, driven by strong interest for our latest products. We love hearing from customers who are discovering for the first time the versatility of iPad, from the ultra-portable iPad mini built from the ground up for Apple Intelligence to the powerful M4 iPad Pro in a stunningly thin and light design.\n\n0:07:55\n\niPad is there for our users whenever they need it and wherever they go, and we are pleased to see so much excitement and enthusiasm for our lineup. Wearables, home, and accessories revenue came in at $11.7 billion. With its most advanced display yet and a thinner, more comfortable design, the all-new Apple Watch Series 10 is the perfect companion to help users pursue their health and fitness goals this year. From the powerful Vitals app to more customizable activity rings, users have an ever-increasing set of innovative health tools at their fingertips and watchOS 11. Health innovation has long been a focus for us, and we're committed to continuing to advance this work because we know how much it matters to our users.\n\n0:08:46\n\nWe've introduced new hearing health features on AirPods Pro 2, and new sleep apnea notifications on Apple Watch are also helping users learn of a potentially serious condition that's thought to affect up to a billion people worldwide. During the quarter, we also brought Apple Vision Pro to even more countries, enabling more customers to discover the magic of spatial computing. Users are enjoying incredible immersive entertainment experiences and powerful new features and enhancements to Mac virtual display. Vision Pro is also supercharging the creative process, and the incredibly talented director, John M. Chu, recently shared how its extraordinary capabilities helped him bring the movie Wicked to life. Turning to services, we set an all-time revenue record of $26.3 billion for the December quarter, growing 14% from a year ago. We set all-time records in the Americas, Europe, and rest of Asia-Pacific, and a December quarter record in Japan.\n\n0:09:59\n\nFive years since launch, Apple TV+ continues to be home to incredible storytelling that viewers love. There's nothing quite like the anticipation that comes when a fan favorite returns, and we were thrilled to debut the second season of Severance earlier this month. We have so much in store for our subscribers this year, with new shows like The Studio and Your Friends and Neighbors. And we can't wait for the premiere of Formula 1, starring Brad Pitt on June 27, which will take viewers inside the sport in a truly unprecedented way. We're excited that Apple TV+ continues to draw attention and accolades. To date, Apple TV+ productions have earned more than 2,500 nominations and 538 wins. During the quarter, we were also excited to launch a new Find My service that can help our users when they lose their luggage.\n\n0:10:58\n\nFor the first time, if you put an AirTag in your suitcase, you'll be able to share its location information with many major airlines so they can quickly track down your bags if they get lost. Turning to retail, our teams went above and beyond to help customers find the perfect gift throughout the holiday season. We also celebrated openings of new stores in China, Spain, and the U.S. We were excited to announce plans to connect with even more customers this year by adding a fifth store in the UAE and bringing our online store to Saudi Arabia this summer. We can't wait to welcome customers to the first of several flagship store locations in Saudi Arabia that we're opening beginning in 2026. I just had the chance to visit both countries last month, and I had a great time meeting with customers and team members.\n\n0:11:56\n\nThere's an incredible energy and passion for technology in these growing markets. Every day, I get deeply moving notes about the many ways our technology is enriching our users' lives. I recently got a note from a customer who put his watch on his father's wrist when he feared something was wrong with him. The watch alerted them that the father was in AFib, and they were able to get him to the hospital for potentially lifesaving treatment. Another user put his new watch on for the first time and within 15 minutes was notified of a low heart rate that led to a necessary pacemaker, and there are so many touching notes around the profound impact of our new hearing health feature, like a recent user who told me it had changed her life, allowing her to take part in conversations with her children and grandchildren.\n\n0:12:53\n\nThese are the kind of stories that remind us of how profoundly important our work is, and it drives us to innovate each and every day. At Apple, the future is full of promise and potential. We're always searching across a world of possibilities, finding those places where we can do the most good and putting all of our energy and ingenuity into making something special. With that, I'll turn it over to Kevin.\n\n0:13:22\n\nThanks, Tim, and good afternoon, everyone. I'm going to cover the results for the first quarter of our fiscal year. We are very pleased to report an all-time high for revenue, with December quarter revenue of $124.3 billion, up 4% year over year. We achieved all-time revenue records in the Americas, Europe, Japan, and rest of Asia-Pacific, and grew in the vast majority of markets we track.\n\n0:13:50\n\nProducts revenue was $98 billion, up 2% year over year, driven by growth from iPad and Mac. Thanks to our incredible customer satisfaction and strong loyalty, our install base of active devices reached an all-time high across all products and geographic segments and is now over 2.35 billion active devices. Services revenue reached an all-time record of $26.3 billion, up 14% year over year. We grew in every geographic segment and achieved all-time records in both developed and emerging markets. Company gross margin was 46.9% at the high end of our guidance range and up 70 basis points sequentially, primarily driven by favorable mix. Products gross margin was 39.3%, up 300 basis points sequentially, primarily driven by favorable mix and leverage. Services gross margin was 75%, up 100 basis points sequentially, primarily driven by mix.\n\n0:14:58\n\nOperating expenses of $15.4 billion landed at the midpoint of our guidance range and up 7% year over year. This strong business performance resulted in all-time records for both net income at $36.3 billion and diluted earnings per share of $2.40, up 10% year over year. Operating cash flow was also strong at $29.9 billion, which included the impact of the $11.9 billion we paid during the quarter in connection with the state aid decision. Now I'm going to provide some more details for each of our revenue categories. iPhone revenue was $69.1 billion, roughly flat to the prior year. We grew in the majority of markets we track and reached all-time revenue records in several developed markets, including Canada, Western Europe, and Japan, and in emerging markets like Latin America, the Middle East, and South Asia.\n\n0:15:56\n\nThe iPhone active install base grew to an all-time high in total and in every geographic segment. We also set an all-time record for upgraders. According to a recent survey from Kantar, during the December quarter, iPhone was a top-selling model in the U.S., urban China, India, the U.K., France, Australia, and Japan. We continue to see high levels of customer satisfaction in the U.S. at 96%, as measured by 451 Research. Mac generated $9 billion in revenue, up 16% year over year. We saw strength across our lineup, from the new Mac mini to the latest MacBook Air and MacBook Pro models. This incredible performance was broad-based, with double-digit growth in every geographic segment. With our latest advances in Apple Silicon and our fastest Neural Engine ever, customers are able to take advantage of the full capabilities of AI on Mac.\n\n0:16:55\n\nThe Mac install base reached an all-time high, and we saw double-digit growth for both upgraders and customers new to the Mac. Additionally, customer satisfaction in the U.S. was recently measured at 94%. iPad revenue was $8.1 billion, up 15% year over year, driven by the new iPad mini and latest iPad Air. The iPad install base reached another all-time high, and over half of the customers who purchased an iPad during the quarter were new to the product. Customer satisfaction was at 96% in the U.S., based on the latest reports from 451 Research. Wearables, home, and accessories revenue was $11.7 billion, down 2% year over year. Customers are excited about the new AirPods 4 and the latest hearing health features in AirPods Pro 2.\n\n0:17:45\n\nOn Watch, although we face a difficult compare against the Watch Ultra 2 launch last year, the Apple Watch install base reached a new all-time high, with over half of customers purchasing an Apple Watch during the quarter being new to the product. Customer satisfaction for Watch in the U.S. was reported at 94%. Our services revenue reached an all-time high of $26.3 billion, up 14% year over year. Services continues to see strong momentum, and the growth of our install base of active devices gives us great opportunities for the future. We also see increased customer engagement with our services offerings. Both transacting and paid accounts reached new all-time highs, with paid accounts growing double digits year over year. Paid subscriptions also grew double digits. We have well over a billion paid subscriptions across the services on our platform.\n\n0:18:36\n\nWe remain focused on improving the breadth and quality of our services offerings, from new games on Apple Arcade to exciting new programming on Fitness+, and the continued expansion of features like tap-to-pay, now live in 20 markets. Turning to enterprise, we have seen businesses continue to expand their deployments of our products and services. Deutsche Bank launched its Mac as Choice program for their developers and also issued the latest MacBook Air as a standard computer for their entire mortgage lending division, and we're excited to see leading enterprises such as SAP leverage Apple Intelligence in the U.S., with features like writing tools, summarize, and priority notifications to enhance both their employee and customer experiences. We also see strong demand in our emerging markets. For example, Zomato, a leading food ordering and delivery company in India, has deployed thousands of Macs across their workforce to foster innovation.\n\n0:19:30\n\nVision Pro continues to see more use cases in enterprise, with Cisco's new spatial meetings delivering a fully immersive video conferencing experience for remote collaboration and learning. Let me quickly summarize our cash position and capital return program. We ended the quarter with $141 billion in cash and marketable securities. We repaid $1 billion in maturing debt and decreased commercial paper by $8 billion, resulting in $97 billion in total debt. Therefore, net cash at the end of the quarter was $45 billion. During the quarter, we returned over $30 billion to shareholders. This included $3.9 billion in dividends and equivalents and $23.3 billion through open market repurchases of 100 million Apple shares. As usual, we will provide an update to our capital return program when we report results for the March quarter.\n\n0:20:27\n\nAs we move ahead into the March quarter, I'd like to review our outlook, which includes the types of forward-looking information that Suhasini referred to at the beginning of the call. The color we're providing today assumes that the macroeconomic outlook doesn't worsen from what we were projecting today for the current quarter. As the dollar has strengthened significantly, we expect foreign exchange to be a headwind and to have a negative impact on revenue of about 2.5 percentage points on a year-over-year basis. Despite that headwind, we expect our March quarter total company revenue to grow low to mid-single digits year over year. We expect services revenue to grow low double digits year over year. When you remove the negative impact of the foreign exchange headwinds I described earlier, the year-over-year growth rate would be comparable to that of the December quarter.\n\n0:21:16\n\nWe expect gross margin to be between 46.5% and 47.5%. We expect operating expenses to be between $15.1 billion and $15.3 billion. We expect OINE to be around negative $300 million, excluding any potential impact from the mark-to-market of minority investments, and our tax rate to be around 16%. Finally, today, our board of directors has declared a cash dividend of $0.25 per share of common stock payable on February 13, 2025, to shareholders of record as of February 10, 2025. With that, let's open the call to questions.\n\n0:21:58\n\nThank you, Kevan. We ask that you limit yourself to two questions. Operator, may we have the first question, please?\n\n0:22:06\n\nCertainly. We will go ahead and take our first question from Eric Woodring with Morgan Stanley. Please go ahead.\n\n0:22:13\n\nGreat, guys. Thanks so much for taking my questions.\n\n0:22:19\n\nTim, in your prepared remarks, you had noted that iPhone 16 models are selling better in markets where Apple Intelligence is available. And I'm just wondering if you could double-click on that comment a bit and share any other details you believe could better help us understand how Apple Intelligence is really impacting iPhone demand and/or what features you find that users are using most often already. And then I just have a quick follow-up. Thank you.\n\n0:22:45\n\nYeah, Eric. Hi, it's Tim. We did see that the markets where we had rolled out Apple Intelligence, that the year-over-year performance on the iPhone 16 family was stronger than those where Apple Intelligence was not available. In terms of the features that people are using, they're using all of the ones that I referenced in my opening comments, from writing tools to Image Playground and Genmoji to Visual Intelligence and more.\n\n0:23:21\n\nAnd so we see all of those being used. The Clean Up is another one that is popular, and people love seeing that one demoed in the stores as well. We only had two, two and a half weeks or so during the December quarter of the second release of 18.2, and then only had the U.K. and the other English-language countries for the two and a half weeks. And so we've got just the early indications at the moment. But we were going to.\n\n0:24:06\n\nOkay. That's really helpful.\n\n0:24:07\n\nYeah.\n\n0:24:07\n\nOkay. Okay. Thank you for that color, Tim. It's helpful. And then if we just touch on China, obviously, in the news fairly frequently.\n\n0:24:19\n\nIf we set aside China macro, which I understand is still challenging, can you maybe talk about the headwinds that Apple faces, whether that's shifting preferences for Western technology brands in favor of domestic vendors, or is this just a function of not necessarily having Apple Intelligence available with the iPhone 16, which is not necessarily helping replacement cycles? Just maybe double-clicking on what you think and what you're hearing in China as it relates to the iPhone. Thanks so much.\n\n0:24:50\n\nYeah, sure. If you look at our Greater China revenue for the quarter, we were down 11% year over year. And over half of the decline that we experienced was driven by change in channel inventory from the beginning to the end of the quarter. And of course, on the Apple Intelligence side, we have not rolled out in China.\n\n0:25:19\n\nAnd as we just talked about, we did see better results in the markets that we had rolled out in than markets we hadn't rolled out in. And of course, it's the most competitive market in the world. And so all of those things are true. In terms of the macro situation, there was a fiscal stimulus or subsidy announced very recently in January that did not affect the December quarter. There were some provincial subsidies in the December quarter, but the national program was announced, I believe, on January 20. And it does cover the categories that we have products in, from smartphones to tablets and PCs and smartwatches, up to a maximum price point. And so we do see fiscal stimulus occurring, and we'll be glad to talk about what that looks like on the next call.\n\n0:26:29\n\nGreat. Thanks so much, Tim. Good luck.\n\n0:26:33\n\nThank you.\n\n0:26:34\n\nThank you, Eric. Operator, can we have the next question, please?\n\n0:26:37\n\nOur next question is from Ben Reitzes with Melius Research. Please go ahead.\n\n0:26:44\n\nHey, guys. Thanks a lot for the question. And hey, Tim, wanted to ask you who you knew this one was coming, but there's a perception that you're a big beneficiary of lower cost of compute. And I was wondering if you could give your worldly perspective here on the DeepSeek situation and if you are going to, if anything's happened to change your views in terms of a tailwind to margins and your ability to execute even due to the potential for cost to come down due to that development and probably what was going to happen anyway. But I'd love your perspective on that and then have a quick follow-up. Thanks.\n\n0:27:27\n\nSure. In general, I think innovation that drives efficiency is a good thing.\n\n0:27:36\n\nThat's what you see in that model. Our tight integration of silicon and software, I think, will continue to serve us very well. As you know, we do things on the device, and we do things in the private cloud, which mimics from an architectural point of view what happens on device. From a CapEx point of view, we've always taken a very prudent and deliberate approach to our expenditure, and we continue to leverage a hybrid model, which I think continues to serve us well.\n\n0:28:14\n\nOh, great. All right. Thanks, Tim.\n\n0:28:18\n\nAnd then just with regard to the iPhone trajectory, do you feel like, I guess, you obviously don't talk about new products and stuff like that, but do you feel that there's a lot of room for form factor innovation in the future, or do you feel that the current lineup kind of shows where you're going? I guess, without pulling punches, wondering if you thought, in terms of the phone innovation, if there's a lot more to come and you could see the kind of current market changing a bit over the next two to three years. Thanks.\n\n0:29:03\n\nI think, Ben, I think there's a lot more to come, and I could not feel more optimistic about our product pipeline. So I think there's a lot of innovation left on the smartphone.\n\n0:29:17\n\nThanks a lot, Tim.\n\n0:29:21\n\nYeah. Thank you.\n\n0:29:21\n\nThank you, Ben.\n\n0:29:24\n\nOperator, could we have the next question, please?\n\n0:29:26\n\nOur next question is from Michael Ng with Goldman Sachs. Please go ahead.\n\n0:29:32\n\nGood afternoon. Thank you for the question. I have two as well. First, it was encouraging to hear about the record for iPhone upgraders, which I think is something you haven't said for about a year now. I was wondering if you could talk a little bit about what you would attribute this upgrade strength to. Has Apple Intelligence played a role in helping upgrades in the markets that you've launched in? Thanks.\n\n0:29:58\n\nYeah. Thank you for the question. If you look at iPhone, we did set an all-time record for upgraders, so we've never seen a higher level of upgraders before. The install base hit a new all-time high as well.\n\n0:30:16\n\nAnd if you look at the 16 compared to the 15 from launch, which occurred, as you know, in September, so this is across now two quarters, from September to the end of the December fiscal quarter, the 16 outperformed the 15. And so I think you can conclude from that that there are compelling reasons to upgrade. And in the markets where we had launched Apple Intelligence, they outperformed the markets that we did not.\n\n0:30:49\n\nGreat. Thank you, Tim.\n\n0:30:52\n\nYeah. Lots of good color there.\n\n0:30:54\n\nThat's very clear. And then I had one about the iPad Pro M4, the thinner version. I was just wondering if you could talk about that thin form factor for the iPad Pro.\n\n0:31:11\n\nHow did it help iPad sales overall, and what did your kind of market and consumer research tell you about how consumers valued that thin product form factor? Thank you.\n\n0:31:22\n\nIt's a good question. iPad overall grew 15% for the quarter, and it was more driven by iPad Air and the entry-level iPad than it was the top-level iPad. But overall, we could not be more pleased with the iPad category growing 15%. It's a great achievement for the quarter. And probably what is most important is that over half of the sales in the December quarter went to customers who were new to the iPad. So that tells us that there's a good amount of customers there to attract.\n\n0:32:12\n\nThank you very much, Tim.\n\n0:32:15\n\nYeah. Thank you.\n\n0:32:16\n\nThanks, Mike. Operator, could we have the next question, please?\n\n0:32:20\n\nOur next question is from Amit Daryanani from Evercore ISI. Please go ahead.\n\n0:32:29\n\nYep. Good afternoon, everyone. I'm happy as well. Maybe to start with, you folks are seeing some very robust growth trends in emerging markets right now for Apple products. Can you just, at a high level, just talk about the durability of growth that you see in emerging markets? And then do you think the summation of these emerging markets are starting to get big enough or perhaps starting to grow fast enough that they can actually offset some of the China headwinds you're going through?\n\n0:32:52\n\nWe have great results in a number of emerging markets. And as you know from past calls, I'm particularly keen on India. India set a December quarter record during the quarter, and we're opening more stores there. We've announced that we're going to open four new stores there. The iPhone was the top-selling model in India for the quarter.\n\n0:33:27\n\nIt's the second largest smartphone market in the world and the third largest for PCs and tablets. And so there's a huge market, and we have a very modest share in these markets. And so I think there's lots of upside there. And that's just one of the emerging markets.\n\n0:33:46\n\nYeah. Tim, then maybe I'll add, Amit, that in emerging markets, we're also seeing double-digit growth on the install base, both in total and for the iPhone as well. So that's also an encouraging sign.\n\n0:33:57\n\nPerfect. Thank you. And then just a question on gross margins for the March quarter. You folks are guiding gross margins to be flatish on a sequential basis. Typically, I think it tends to be guided up a little bit, 50 basis points or sequentially. Can we just touch on what are the offsets of the puts and takes you see on gross margins?\n\n0:34:15\n\nAnd Kevan, maybe you can just talk about its effects having an outsized impact on your margin profile as well in March.\n\n0:34:21\n\nYes. Let me take that one. As we mentioned in my remarks, we're guiding to 46.5%-47.5%. So we think we're very pleased with that level of guidance. As you mentioned, there's always puts and takes. We do think there's going to be some FX headwinds, which we talked about. That's going to affect our revenue growth as well, have an impact here on the margin, a sequential impact on margins. But we think that's going to be offset by favorable costs and the relative mix of services. We also, as you know, when we move from Q1 to Q2, especially on the product side, because Q1 is such a large quarter for our products business, we do have a loss of leverage.\n\n0:35:01\n\nSo there are some puts and takes, and I think we feel good about the range. We think it's a very, very strong guide for gross margin.\n\n0:35:07\n\nAll right. Thanks, Amit. Operator, could we get the next question, please?\n\n0:35:17\n\nOur next question is from Wamsi Mohan with Bank of America. Please go ahead.\n\n0:35:24\n\nYes. Thank you so much. Tim, I want to follow up on your comment about channel inventory in China. I was wondering if you could maybe address more broadly if channel inventory across your different product lines and regions, do you feel they're elevated or out of range in any other regions? And given the clearing event that kind of happened in China, I guess, in the quarter, should we think of a more normal progression quarter on quarter into the March quarter in China in particular? And I will follow.\n\n0:35:54\n\nYeah.\n\n0:35:56\n\nI don't want to project sales for the current quarter by region, but if you look at the channel inventory and look at iPhone in the aggregate, so on a worldwide basis, we're very comfortable with our channel inventory position. In China, my point was that our channel inventory reduced from the beginning of the quarter to the end of the quarter, and that was over half of the reduction in the reported results. And so if you look, part of the reason for that is that our sales were a bit higher than we forecasted them to be toward the end of the quarter. And so we ended a little leaner than we had expected to.\n\n0:36:46\n\nOkay. That's very clear. Thank you.\n\n0:36:51\n\nYeah. Thank you.\n\n0:36:52\n\nAnd then maybe as my follow-up, your services growth has been very strong, and I know you've kind of been navigating some pretty challenging regulatory burdens on the business globally. So how should investors think about maybe either a top-line or margin headwind that, let's say, you're currently absorbing in your results that could potentially maybe reverse in a more balanced regulatory environment? Thank you so much.\n\n0:37:21\n\nYeah. So I think one, I just wanted to kind of reiterate the fact that our services business set an all-time record for December quarter of 14%. And that was one strength that we saw across all geographic segments, and also it was a very broad base across all of our services. So we have, as you know, a very broad services portfolio. And so we do see good momentum across the board.\n\n0:37:45\n\nAnd as well, we continue to see increasing engagement across the customer base, across all of the service offerings, both transacting and paid accounts. We talked about reaching all-time highs, and we have over now a billion paid subscriptions across the services platform.\n\n0:38:00\n\nAll right. Thanks, Wamsi. Operator, could we get the next question, please?\n\n0:38:14\n\nOur next question is from Samik Chatterjee with JPMorgan. Please go ahead.\n\n0:38:21\n\nHi. Thanks for taking my questions. I guess for the first one, I mean, you had a great quarter on Macs and iPads both, and I'm just curious in terms of if you can help us think about the sustainability of this double-digit growth that you saw in both the product lines. And more interested are also here.\n\n0:38:40\n\nWe're talking about Apple Intelligence sort of influencing volumes on iPhones, but any thoughts on sort of what does that influence look like in terms of volumes for Macs, for example, where I think there's a lot of conversation on AI PCs? How are you thinking about the impact there? And I have a quick follow-up. Thank you.\n\n0:38:56\n\nYeah. If you look at Mac, Mac was up 16%, and on iPad, we were up 15%. The Mac was driven by a very strong uptake on our new products during the quarter and the continued success of the MacBook Air. And so, as you know, we launched an M4-based MacBook Pro, an iMac, and a Mac Mini during the quarter. We believe we've got the best AI PC out there for running workloads.\n\n0:39:36\n\nThe silicon in the Mac is, and it has been for several years now, designed by us and really designed for these workloads, and so I don't want to project at the category level for the future, but we're incredibly pleased with both the Mac and the iPad for the quarter.\n\n0:40:04\n\nOkay, and Tim, I'm going to use your earlier discussion about India as a strong emerging market to sort of ask you about the supply chain planning there in terms of how much of the supply chain planning there that you're doing is more of a reflection of the growth expectations from that market relative to in terms of more diversification of the supply chain and how should we sort of think about that strategy relative to that particular country?\n\n0:40:33\n\nYeah.\n\n0:40:35\n\nIf you look at the manufacturing we do there, we do manufacturing both for the domestic market and we export. And so our business needs a certain economies of scale for it to make sense to manufacture in-country. And so that really means that we're going to be both a use for the domestic market and an export market.\n\n0:41:09\n\nGreat. Thank you.\n\n0:41:12\n\nYeah. Thanks.\n\n0:41:13\n\nThank you, Samik. Operator, could we get the next question, please?\n\n0:41:18\n\nOur next question is from David Vogt with UBS. Please go ahead.\n\n0:41:24\n\nGreat. Thanks, guys, for taking my question. So maybe, Tim, this is for you. I'm trying to think about your commentary around Apple Intelligence being sort of a momentum driver for the iPhone business.\n\n0:41:36\n\nWhen I think about your kind of framework for the March quarter, if I kind of adjust for channel inventory over the last couple of years, it kind of feels like your iPhone revenue for the March quarter is going to be relatively similar to the quarter two years ago and even the quarter last year. How do we square kind of the momentum versus kind of the iPhone business effectively really kind of unchanged over the last couple of years? Second, when I think about kind of the gross margin profile of the business, obviously, you've done a great job in taking gross margins up. Where do you think we sit in terms of, on the services side at least, where margins could go?\n\n0:42:09\n\nIt looks like the 75% margin has been an incredibly successful quarter, but just trying to get a sense for where do you think this number could go over the intermediate term? Thank you.\n\n0:42:18\n\nYeah. If you look at Apple Intelligence, my point earlier was that markets where we had rolled out Apple Intelligence during the Q1 period performed better on a year-over-year basis than markets where we had not. And so that gives us a positive indicator that we were pleased with. There are many compelling reasons to upgrade. And the other thing I would say that I think I mentioned earlier is that if you look at it from a launch to the end of the December quarter, and so that goes back to September, the 16 family is outperforming the 15 family. And so I think those are two good data points.\n\n0:43:15\n\nOur next round of language rollouts will be in April, and so it will be in our Q3 quarter, and I'll let Kevan take the gross margin question.\n\n0:43:30\n\nYep. Great. Hi, David. How are you? So on the services gross margin, I think maybe we should step back a second. Services business in general in aggregate is accretive to the overall company margin, and one of the things, as an important reminder, is we have a very broad services portfolio. And those businesses have very different margin profiles, and so I think, one, it's because of the nature of those businesses and in part also because of the way we account for them. And so one of the big factors that drives the services gross margins are relative performance of those different businesses within the portfolio.\n\n0:44:05\n\nWe also have the dynamic of some scale businesses like payment services, iCloud that are actually growing. And there, when we add incremental users, those end up being accretive to margins as well. And so in general, what we saw in the December quarter was nice momentum across our entire services business that allows us to deliver that 75% margin at the services level. And I think our guidance takes into consideration what we think we're going to land from a company standpoint at 46.5%-47.5%, which, again, we think is a strong guide.\n\n0:44:36\n\nGreat. Thanks, guys.\n\n0:44:39\n\nAll right. Thank you, David. Operator, could we have the next question, please?\n\n0:44:43\n\nOur next question is from Krish Sankar with TD Cowen. Please go ahead.\n\n0:44:50\n\nYeah. Thanks for the invitation, Kristian. I also share two of them. One, the first one is for Tim.\n\n0:44:56\n\nYou had very strong Mac growth, 16% year-over-year last quarter. Just wondering how much of that was driven by some of the Mac silicon innovation versus a replacement cycle for Macs?\n\n0:45:08\n\nI don't know the answer to your question precisely, but I think it is a combination of these products are so compelling. The M4-based products are so compelling that it's driving both upgrades at the double-digit level and it's driving switchers at a double-digit level. And so we're seeing both come out, and I think it's just because of the compelling products.\n\n0:45:45\n\nGot it. Got it. Thanks, Tim. And a follow-up for Kevan on the gross margin. I want to ask you a little more on the product side. Last quarter, you had 39.3%, which is very strong, similar to a year-ago period.\n\n0:46:02\n\nI'm kind of curious how much more levels do you have on the product side to improve the gross margin, or do you think with some of the more new AI-related devices, there's more upside to gross margin from here on the product hardware side?\n\n0:46:16\n\nYeah. Thanks, Krish, for the question. So on the product side, as you mentioned, we had pretty strong sequential improvement through 100 basis points for the December quarter. That was really driven by we talked about favorable mix and leverage. As you know, in Q1, again, it's a launch quarter for many products, and so we tend to benefit from the leverage that we get from that higher volume. I would say, in general, our gross margin for products is driven by a number of factors. One of them is the various product launches that we had.\n\n0:46:49\n\nDifferent products do have different margin profiles, and so that mix does make a difference, and in particular, what we're seeing is, for example, many of our mixes across phone, for example, we're seeing customers gravitate towards our Pro products because of things like affordability that allows our customers to get into our best products, which have favorable gross margins, so we're continuing to see that trend that impacted us in the December quarter, as well, I think we're in a favorable commodity environment from a cost standpoint, and so we're benefiting from that as well in the December quarter, and then that's going to be, as we talked about, we're going to have a foreign exchange headwind heading into the March quarter, but that's contemplated in the guidance range that we gave of the 46.5%-47.5%.\n\n0:47:36\n\nThanks, Kevan. Thanks, Tim.\n\n0:47:39\n\nThank you, Krish.\n\n0:47:43\n\nOperator, could we get the next question, please?\n\n0:47:45\n\nOur next question is from Richard Kramer with Arete Research. Please go ahead.\n\n0:47:54\n\nThanks very much. My first question is for Tim. I'd like to ask about what might accelerate the pace of Apple Intelligence adoption. I guess, do you see this simply as a question of time, i.e., to launch more markets and languages or increase the percentage of installed base devices that can support it? Or is it a question of money, i.e., shifting R&D or marketing spend towards AI? And based on other prior Apple services, do you expect a sort of tipping point where adoption will go mainstream? Thanks.\n\n0:48:22\n\nI do believe it will go mainstream. I'm getting feedback from people using different features today.\n\n0:48:35\n\nKeep in mind that on the iPhone side of our business, you either have to have an iPhone 15 Pro or iPhone 16 to use Apple Intelligence. So as that base grows, I think the usage will continue to grow. I know from my own personal experience, once you start using the features, you can't imagine not using them anymore. I know I get hundreds of emails a day, and the summarization function is so important. I think it's a combination of that. Of course, in April, we roll out a whole series of new languages that we had mentioned, and so the base grows further.\n\n0:49:30\n\nOkay. Thank you. Then, Kevan, one of Luca's legacies was really getting Apple to record margin levels and also maintaining very consistent pricing across the product range.\n\n0:49:43\n\nBut taking the current high levels of profitability as fairly stable, what observations might you share about price sensitivity of users and whether having a wider range of pricing across the products might unlock potentially further market share gains or boost overall product growth?\n\n0:49:59\n\nYeah. It's a good question. I think, one, I don't think we're going to really depart from what's served us pretty well to now. I mean, we always take into consideration looking at short-term comparisons between the short-term and the long-term. I think we've had a pretty disciplined pricing strategy, which would serve us pretty well. And I think we're going to continually kind of stick with that as far as I can tell.\n\n0:50:23\n\nOkay. Thanks.\n\n0:50:27\n\nThank you, Richard. Operator, could we get the next question, please?\n\n0:50:32\n\nOur next question is from Atif Malik with Citi. Please go ahead.\n\n0:50:38\n\nHi. Thank you for taking my question.\n\n0:50:43\n\nHow do you guys see the potential tariff impact to your product for consumer demand under Trump 2.0? You guys did fine under Trump 1.0.\n\n0:50:52\n\nWe are monitoring the situation and don't have anything more to add than that.\n\n0:51:01\n\nGreat. And Tim, as a follow-up, there is a lot of discussion on agentic AI, the use of agents. Do you guys see the upgraded Siri expected in April as something that will, let's say, be the killer application among the suite of features that you have announced in Apple Intelligence?\n\n0:51:24\n\nI think the killer feature is different for different people. But I think for most, they're going to find that they're going to use many of the features every day. And certainly, one of those is Siri, and that will be coming over the next several months.\n\n0:51:51\n\nThank you.\n\n0:51:55\n\nAll right. Thank you, Atif.\n\n0:51:58\n\nOperator, could we please get the last question?\n\n0:52:01\n\nOur last question is from Ben Bollin from Cleveland Research Company. Please go ahead.\n\n0:52:08\n\nGood evening, everyone. Thanks for taking the question. Tim, I'm interested in your thoughts in how you would have us think about the average useful life of these devices in the wild. And in particular, curious if you look at the strength you saw in fiscal 2021 and how that might support accelerated refresh opportunity into the future.\n\n0:52:36\n\nYeah. Ben, I think it's different for different types of users. I mean, you have very early adopter kind of users that are very quick to jump on the latest technology that upgrade very frequently. And then you have people that are on the entire opposite side of that barbell. And most people are between those two points.\n\n0:53:08\n\nAnd so I do think there were lots of units that are sold during the COVID period of time, and it's a huge opportunity for us as a company for more than one of the product categories.\n\n0:53:26\n\nThat's it for me. Thanks, Tim.\n\n0:53:32\n\nThank you.\n\n0:53:32\n\nAll right. Thanks, Ben. I guess that's it. A replay of today's call will be available for two weeks on Apple Podcasts or as a webcast on apple.com/investor and via telephone. The number for the telephone replay is 866-583-1035. Please enter confirmation code 7398532 followed by the pound sign. These replays will be available by approximately 5:00 P.M. Pacific Time today. Members of the press with additional questions can contact Josh Rosenstock at 408-862-1142. And financial analysts can contact me, Suhasini Chandramouli, with additional questions at 408-974-3123. Thanks again for joining us here today.\n\nA Silver or Gold subscription plan is required to access historical transcripts.\n\nSign in to access your portfolio",
      "fetched_at": "2026-02-03T14:51:36.274Z"
    },
    {
      "ticker": "AAPL",
      "title": "Apple Inc. (AAPL) Q2 FY2025 earnings call transcript",
      "published_date": "2026-02-03T14:51:33.316Z",
      "fiscal_year": "2025",
      "quarter": "Q2",
      "url": "https://finance.yahoo.com/quote/AAPL/earnings/AAPL-Q2-2025-earnings_call-311069.html",
      "content": "Oops, something went wrong\n\nSkip to navigation Skip to main content Skip to right column US English US y LATAM Español Australia English Canada English Canada Français Deutschland Deutsch France Français 香港 繁中 Malaysia English New Zealand English Singapore English 台灣 繁中 UK English News Finance Sports News Today's news US Politics 2025 Election World Weather Climate change Health Science Originals Newsletters Games Life Health Parenting Style and beauty Horoscopes Shopping Food Travel Autos Gift ideas Buying guides Valentine's Day gifts Entertainment Celebrity TV Movies Music How to Watch Interviews Videos Finance My portfolio Watchlists Markets News Videos Screeners Personal finance Crypto Sectors Industries Sports Fantasy Daily fantasy NFL NBA MLB NHL College football College basketball Soccer NFL Draft Yahoo Sports AM Show all New on Yahoo Creators Tech Local services Selected edition Mail Sign in Back to quote Apple Inc. (AAPL) Q2 FY2025 earnings call transcript Powered by Quartr May 1, 2025, 5:00 PM EDT Earnings call Apple reported Q2 FY25 revenue of $95.4B, up 5% YoY, and record EPS of $1.65, up 8% YoY. Services hit an all-time high of $26.6B (+12% YoY). Management guided for low to mid-single-digit revenue growth in Q3, with gross margin pressured by $900M in tariff-related costs. Apple reported Q2 FY25 revenue of $95.4B, up 5% YoY, and record EPS of $1.65, up 8% YoY. Services hit an all-time high of $26.6B (+12% YoY). Management guided for low to mid-single-digit revenue growth in Q3, with gross margin pressured by $900M in tariff-related costs.\n\n0:00:00\n\nGood afternoon and welcome to the Apple Q2 Fiscal Year 2025 earnings conference call. My name is Suhasini Chandramouli, Director of Investor Relations. Today's call is being recorded. Speaking first today is Apple's CEO, Tim Cook, and he'll be followed by CFO, Kevan Parekh. After that, we'll open the call to questions from analysts. Please note that some of the information you'll hear during our discussion today will consist of forward-looking statements, including, without limitation, those regarding revenue, gross margin, operating expenses, other income and expense, taxes, capital allocation, and future business outlook, including the potential impact of tariffs and other trade measures and macroeconomic conditions on the company's business and results of operations. These statements involve risks and uncertainties that may cause actual results or trends to differ materially from our forecast.\n\n0:01:07\n\nFor more information, please refer to the risk factors discussed in Apple's most recently filed reports on Form 10Q and Form 10K, and the Form 8K filed with the SEC today, along with the associated press release. Additional information will also be in our report on Form 10Q for the quarter ended March 29, 2025, to be filed tomorrow, and in other reports and filings we make with the SEC. Apple assumes no obligation to update any forward-looking statements, which speak only as of the date they are made. I'd now like to turn the call over to Tim for introductory remarks.\n\n0:01:53\n\nThank you, Suhasini. Good afternoon, everyone, and thanks for joining the call. Today we are reporting $95.4 billion in revenue, up 5% from a year ago and at the high end of the range we provided last quarter. Diluted EPS was $1.65, up 8% year over year and a March quarter record. Services achieved an all-time revenue record, growing 12% compared to the prior year. We also set a number of quarterly records in countries and regions across the world, including the U.K., Spain, Finland, Brazil, Chile, Turkey, Poland, India, and the Philippines. We are as dedicated as ever to the innovation and ingenuity that will enrich our customers' lives and help us leave the world better than we found it.\n\n0:02:44\n\nWe are proud to increase our impact around the world, including here in the United States, where we recently announced plans to spend $500 billion over the next four years. We are going to be expanding our teams and our facilities in several states, including Michigan, Texas, California, Arizona, Nevada, Iowa, Oregon, North Carolina, and Washington. We are going to be opening a new factory for advanced server manufacturing in Texas. During calendar year 2025, we expect to source more than 19 billion chips from a dozen states, including tens of millions of advanced chips being made in Arizona this year. We also sourced glass used in iPhone from an American company. All told, we have more than 9,000 suppliers in the U.S. across all 50 states. Now I will turn to products, starting with iPhone. iPhone revenue was $46.8 billion, up 2% from a year ago.\n\n0:03:44\n\nDuring the quarter, we introduced iPhone 16e, a great new entry-level addition to our iPhone 16 lineup. It's powered by our latest generation A18 chip and includes the all-new Apple-designed C1 modem, the most energy-efficient modem ever in an iPhone, allowing iPhone 16e to have the longest battery life of any 6.1-inch iPhone. iPhone 16 and iPhone 16 Plus users are exploring how they can use camera control, whether capturing stunning images or exploring the world with visual intelligence. Our iPhone 16 Pro models continue to be a hit with our users. They are turbocharged by the remarkable capabilities and efficiency of A18 Pro and feature larger displays and an advanced camera system and a beautiful design. Mac revenue was $7.9 billion, 7% higher year over year, another great quarter for Mac. During the quarter, we introduced significant new updates to our lineup.\n\n0:04:50\n\nThe world's most popular laptop just got even better. The M4-powered MacBook Air features a 12-megapixel center stage camera and delivers a massive boost in performance. Now it comes in a beautiful new sky blue color. The new Mac Studio is the most powerful Mac we've ever shipped, equipped with M4 Max and our new M3 Ultra chip. It's a true AI powerhouse, capable of running large language models with over 600 billion parameters entirely in memory. Apple Intelligence brings great capabilities to the Mac, with features like writing tools and notification summaries that help users stay focused and get more done. Turning to iPad, revenue for the quarter was $6.4 billion, up 15% from a year ago, another strong quarter of double-digit growth. Our iPad lineup continues to help users learn, work, play, and go wherever their imaginations take them.\n\n0:05:54\n\nThe new iPad Air with M3 combines powerful performance and exceptional portability, whether you're taking it across the street or around the world. Apple Intelligence and Apple Pencil Pro are a perfect match, with features like the cleanup tool in Photos to remove distractions and Image Wand in the Notes app to elevate simple sketches into polished illustrations. Across wearables, home, and accessories, revenue was $7.5 billion, down 5% from a year ago. From walking trails to bike paths, Apple Watch Series 10 is an essential partner wherever you are on the health and fitness journey. AirPods 4 with active noise cancellation delivers an extraordinary experience in an open-ear design. Customers continue to tell me how important our hearing health features for AirPods Pro 2 are to them, and we've been expanding their availability to reach even more users around the world.\n\n0:06:54\n\nMillions have already taken hearing tests, and the stories we received about the new hearing aid feature are deeply moving, showing how these innovations are making a real difference in people's daily lives. It's a powerful reminder of the impact technology can have when it's designed with care. Meanwhile, Apple Vision Pro takes the concert experience to a whole new level with Metallica, our latest Apple immersive video, which you have to see to believe. visionOS 2.4 unlocks the first set of Apple Intelligence features for Vision Pro users, while inviting them to explore a curated and regularly updated collection of spatial experiences with the Spatial Gallery app.\n\n0:07:40\n\nIn retail, in addition to the two stores we opened during the quarter, we're also looking forward to a new retail store in the UAE, the arrival of the online store in Saudi Arabia, and new retail stores in India starting later this year. Let's now turn to services, where we achieved an all-time revenue record of $26.6 billion, up 12% from a year ago, with strong performance across all of our categories. From starting their morning with their podcast of choice, to buying a coffee with Apple Pay, to spending an afternoon reading the latest bestseller on Apple Books, to using their favorite app from the App Store, or an evening workout with Fitness+, Apple services are enriching our users' lives all throughout their day.\n\n0:08:27\n\nWith incredible shows like The Studio, Your Friends and Neighbors, and the culture-shaping Severance, Apple TV+ has become a must-see destination with record viewership during the quarter. We are excited for our upcoming movie F1, starring Brad Pitt, which will hit theaters this summer and gives an incredible inside look at one of the most intense sports on Earth. There is so much more to come this year. It is no wonder Apple TV+ has earned more than 2,500 award nominations and 560 wins. We are also reaching sports fans in more ways than ever, from watching their favorite teams go to bat on Friday Night Baseball, to cheering on their local team with MLS Season Pass, to following the results of every Grand Prix with Formula One, now on the Apple Sports app.\n\n0:09:21\n\nTurning to software, we just released iOS 18.4, which brought Apple Intelligence to more languages, including French, German, Italian, Portuguese, Spanish, Japanese, Korean, and simplified Chinese, as well as localized English to Singapore and India. AI and machine learning are core to so many profound features we've rolled out over the years to help our users live a better day. It's why we designed Apple Silicon with a neural engine that powers so many AI features across our products and third-party apps. It's also what makes Apple products the best devices for generative AI. At WWDC24, we announced Apple Intelligence and shared our vision for integrating generative AI across our ecosystem into the apps and features our users rely on every day. To achieve this goal, we built our own highly capable foundation models that are specialized for everyday tasks.\n\n0:10:25\n\nWe designed helpful features that are right where our users need them and are easy to use. We went to great lengths to build a system that protects user privacy, whether requests are processed on-device or in the cloud with Private Cloud Compute, an extraordinary step forward for privacy and AI. Since we launched iOS 18, we've released a number of Apple Intelligence features, from helpful writing tools to Genmoji, Image Playground, Image Wand, Cleanup, Visual Intelligence, and a seamless connection to ChatGPT. We made it possible for users to create movies of their memories with a simple prompt and added AI-powered photo search, smart replies, priority notifications, summaries for mail messages, and more. We've also expanded these capabilities to more languages and regions.\n\n0:11:18\n\nWith regard to the more personal Siri features we announced, we need more time to complete our work on these features so they meet our high-quality bar. We are making progress, and we look forward to getting these features into customers' hands. Turning to sustainability, we just celebrated Earth Day, and we were proud to announce that we've cut our emissions by 60% from our 2015 levels. Today, we're using more clean energy across our operations and more recycled materials in our products than ever. We have worked with suppliers to bring 17.8 gigawatts of renewable electricity online. We're also saving billions of gallons of fresh water and redirecting millions of metric tons of waste from landfills. All of this will help us make important progress towards our goal of carbon neutrality across our supply chain and the lifecycle of our products by 2030.\n\n0:12:14\n\nNow let me walk you through the impacts of tariffs in the March quarter and give you some color on what we expect for the June quarter. For the March quarter, we had a limited impact from tariffs as we were able to optimize our supply chain and inventory. For the June quarter, currently we are not able to precisely estimate the impact of tariffs as we are uncertain of potential future actions prior to the end of the quarter. However, for some color, assuming the current global tariff rates, policies, and applications do not change for the balance of the quarter and no new tariffs are added, we estimate the impact to add $900 million to our costs. This estimate should not be used to make projections for future quarters as there are certain unique factors that benefit the June quarter.\n\n0:13:07\n\nFor our part, we will manage the company the way we always have, with thoughtful and deliberate decisions, with a focus on investing for the long term and with dedication to innovation and the possibilities it creates. As we look ahead, we remain confident, confident that we will continue to build the world's best products and services, confident in our ability to innovate and enrich our users' lives, and confident that we can continue to run our business in a way that has always set Apple apart. Next month, we can't wait to welcome our developer community for the Worldwide Developers Conference, and we look forward to revealing some exciting announcements. With that, I'll turn it over to Kevan.\n\n0:13:50\n\nThanks, Tim, and good afternoon, everyone. Our March quarter revenue of $95.4 billion was up 5% year over year, despite a headwind of almost 2.5 percentage points from foreign exchange.\n\n0:14:03\n\nWe also grew in the majority of the markets we track. Products revenue was $68.7 billion, up 3% year over year, driven by growth in iPhone, iPad, and Mac. Thanks to our high levels of customer satisfaction and strong loyalty, our installed base of active devices reached an all-time high across all product categories and geographic segments. Services revenue was $26.6 billion, up 12% year over year, despite over 2 percentage points of foreign exchange headwinds. As Tim mentioned, this was an all-time revenue record. We also grew in every geographic segment and saw double-digit growth in both developed and emerging markets. Company gross margin was 47.1% in the middle of our guidance range and up 20 basis points sequentially, primarily driven by favorable mix. Products gross margin was 35.9%, down 340 basis points sequentially, driven by mix, foreign exchange, and a seasonal loss of leverage.\n\n0:15:08\n\nServices gross margin was 75.7%, up 70 basis points sequentially, primarily driven by a different mix, partly offset by foreign exchange. Operating expenses landed at $15.3 billion, up 6% year over year. Net income was $24.8 billion, and diluted earnings per share was $1.65, up 8% year over year and a March quarter record. Operating cash flow was also strong at $24 billion. Now I'm going to provide some more details for each of our revenue categories. iPhone revenue was $46.8 billion, up 2% year over year, driven by the iPhone 16 family. The iPhone active install base grew to an all-time high in total and in every geographic segment, and iPhone upgraders grew double digits year over year. According to a recent survey from Kantar, during the March quarter, iPhone was the top-selling model in the U.S., urban China, the U.K., Germany, Australia, and Japan.\n\n0:16:18\n\nWe continue to see high levels of customer satisfaction in the U.S. at 97%, as measured by 451 Research. Mac revenue was $7.9 billion, up 7% year over year, driven by the latest MacBook Air, MacBook Pro, and Mac Mini models. This performance was broad-based, with every geographic segment growing year over year. The Mac install base reached an all-time high, and we saw strong growth for both upgraders and customers new to the Mac. Customer satisfaction was reported at 95% in the U.S. iPad revenue was $6.4 billion, up 15% year over year, driven by the new M3-powered iPad Air. The iPad install base reached another all-time high, and over half the customers who purchased an iPad during the quarter were new to the product. Based on the latest reports from 451 Research, customer satisfaction was 97% in the U.S.\n\n0:17:18\n\nWearables, home, and accessories revenue was $7.5 billion, down 5% year over year. Keep in mind, we did face a more difficult compare against the launch of the Apple Vision Pro in the year-ago quarter, as well as the Watch Ultra 2 launch last year. At the same time, the Apple Watch install base reached a new all-time high, with over half of customers purchasing an Apple Watch during the quarter being new to the product. Customer satisfaction for Watch in the U.S. was recently measured at 95%. Our services revenue reached an all-time high of $26.6 billion, up 12% year over year. This growth rate was comparable to the December quarter year-over-year growth rate when we removed the negative impact from foreign exchange. We saw strong momentum in the March quarter, and the growth of our install base of active devices gives us great opportunities for the future.\n\n0:18:09\n\nCustomer engagement across our services offerings also continued to grow. Both transacting and paid accounts reached new all-time highs, with paid accounts growing double digits year over year. Paid subscriptions also grew double digits. We have well over a billion paid subscriptions across the services on our platform. We continue to improve the quality and breadth of our service offerings, from additional features in News+ to new games available in Arcade. Apple Pay continues to help our customers with an easy, secure, and private payment solution, and we were pleased to see that our active users in Apple Pay reached an all-time record, up double digits year over year. Turning to enterprise, organizations are investing more in Apple products and services to drive productivity and employee engagement. For example, KPMG recently rolled out iPhone 16 for all US employees, reflecting their confidence in Apple's security and privacy features.\n\n0:19:05\n\nWe also continue to see strong Mac performance in enterprise. Nubank, the largest digital bank in Latin America, has selected MacBook Air as a standard computer for their thousands of employees. With Vision Pro, companies are continuing to find new and innovative ways to leverage this technology. Dassault Systèmes, a leading provider for engineering and 3D design software, has natively integrated Apple Vision Pro into their next-generation platform, bringing a powerful and immersive spatial experience to thousands of enterprise customers. Now let's turn to our cash position and capital return program. We ended the quarter with $133 billion in cash and marketable securities. We had $3 billion in debt maturities and increased commercial paper by $4 billion, resulting in $98 billion in total debt. Therefore, at the end of the quarter, net cash was $35 billion. During the quarter, we returned $29 billion to shareholders.\n\n0:20:05\n\nThis included $3.8 billion in dividends and equivalents and $25 billion through open market repurchases of 108 million Apple shares. Given the continued confidence we have in our business now and into the future, today, our board authorized an additional $100 billion for share repurchases as we maintain our goal of getting to net cash neutral. We're also raising our dividend by 4% to $0.26 per share of common stock, and we continue to plan for annual increases in the dividend going forward, as we have done for the last 13 years. This cash dividend will be payable on May 15, 2025, to shareholders of record as of May 12, 2025. As we move ahead into the June quarter, I'd like to review our outlook, which includes the types of forward-looking information that Suhasini referred to.\n\n0:20:58\n\nImportantly, the color we're providing assumes that global tariff rates, policies, and application remain in effect as of this call, and the global macroeconomic outlook does not worsen from today for the current quarter. Despite the overall uncertain environment, we will still be providing color at the total company level, subject to these assumptions and the risk factors that we referred to at the beginning of the call. We expect our June quarter total company revenue to grow low to mid-single digits year over year. We expect gross margin to be between 45.5% and 46.5%, which includes the estimated impact of the $900 million of tariff-related costs that Tim referred to earlier. We expect operating expenses to be between $15.3 billion and $15.5 billion. We expect OINE to be around negative $300 million, excluding any potential impact from the mark-to-market of minority investments, and our tax rate to be around 16%.\n\n0:21:56\n\nWith that, let's open the call to questions.\n\n0:21:58\n\nThank you. Ask that you limit yourself to two questions. Operator, may we have the first question, please?\n\n0:22:09\n\nCertainly. We'll go ahead and take our first question from Eric Woodring with Morgan Stanley.\n\n0:22:16\n\nGreat. Thanks so much, guys, for taking my questions. Tim, I'd love to maybe touch on the tariff point first. There were comments from you earlier on CNBC talking about 50% of iPhones for the U.S. currently coming from India. Where do you expect the mix of India-sourced iPhones for the U.S. to be by the end of your fiscal year? Is it the goal to source 100% of your U.S.-bound iPhones from India? Can you just help us understand kind of how we should expect that to trend as we look beyond just the June quarter? I have a follow-up. Thank you.\n\n0:22:49\n\nYeah, Eric.\n\n0:22:52\n\nHi, it's Tim. The existing tariffs that apply to Apple today are based on the product's country of origin, as you alluded to. For the June quarter, we do expect the majority of iPhones sold in the U.S. will have India as their country of origin and Vietnam to be the country of origin for almost all iPad, Mac, Apple Watch, and AirPods products sold in the U.S. China would continue to be the country of origin for the vast majority of total product sales outside the U.S. If you look at the categories of tariffs that are applicable to us today, for the June quarter, most of our tariff exposure relates to the February IEEPA-related tariff at the rate of 20%, which applies to imports to the U.S. for products that have China as their country of origin.\n\n0:24:01\n\nIn addition, for China, there was an additional 125% tariff for imports of certain categories of products announced in April. For us, that's some of our U.S. AppleCare and accessories businesses and brings the total rate in China for these products to at least 145%. Also, for transparency and clarity, the vast majority of our products, including iPhone, Mac, iPad, Apple Watch, and Vision Pro, are currently not subject to the global reciprocal tariffs that were announced in April, as the Commerce Department has initiated a Section 232 investigation into imports of semiconductors, semiconductor manufacturing equipment, and downstream products that contain semiconductors. For the June quarter, as I talked about in my opening comments, we estimate the impact, assuming that the current global tariff rates, policies, and applications do not change for the balance of the quarter, to be $900 million to our costs.\n\n0:25:21\n\nI wouldn't want to predict the mix of production in the future, but I wanted to give you clarity for the June quarter of where the country of origins are so you can use that for your modeling.\n\n0:25:39\n\nOkay. I appreciate that, Colette. Thank you, Tim. Maybe my follow-up is there were a number of reports during the quarter that Apple had pulled forward sell-in into the channel to get ahead of tariffs. Can you just help us better kind of understand or clarify if sell-in and sell-through were aligned in the March quarter, if you're assuming that they would be aligned in the June quarter guide, and ultimately, do you believe that consumers are accelerating hardware purchases to get ahead of any potential pricing increases, or was behavior normal? Thank you so much, Tim.\n\n0:26:19\n\nYeah, thanks, Eric, for the question. There are several questions there.\n\n0:26:23\n\nOne, in terms of the pull forward in demand, if you look at the March quarter, we do not believe that we saw obvious evidence of a significant pull forward in demand in the March quarter due to tariffs. If you look at our channel inventory from the beginning of the quarter to the end of the quarter, the unit channel inventory was similar, not only for iPhone, but for the balance of our products. Again, for transparency, you will see that we did build ahead inventory, and that is reflected in our manufacturing purchase obligations that you will see on the quarterly filing when it comes out. I hope that answers all your questions.\n\n0:27:17\n\nThank you so much, Tim. Good luck.\n\n0:27:23\n\nThanks.\n\n0:27:23\n\nThank you. Eric, Operator, could we have the next question, please?\n\n0:27:30\n\nOur next question is from Ben Ricey with Melius. Please go ahead.\n\n0:27:34\n\nHey, thanks a lot.\n\n0:27:38\n\nHey, Tim, if you had told me that on April 2nd that your hit from tariffs was only a nickel a quarter at $900 million, that would have been a pretty good outcome given the panic that ensued. I'm surprised that it's that low. You did make a comment about after the June quarter. Sorry to push you on that, but could it be a multiple of that figure, or is it just completely unknown? We're all just trying to figure out what happens after June, and if there's just any guidance you guys can possibly give that it's bigger, smaller, or what. Hoping you can just give us a little color on that. Thanks.\n\n0:28:26\n\nYeah, Ben, thanks for the question.\n\n0:28:29\n\nI tried to give you some information in the previous question about the country of origin, which currently is the key factor in determining the tariffs that we're paying. I do not want to predict the future because I'm not sure what will happen with the tariffs. There is the Section 232 investigation going on. It is very difficult to predict beyond June. June has the assumptions in it that I mentioned earlier.\n\n0:29:07\n\nAll right. Thanks, Tim. Just with regard to China, down 2%, I mean, you intuitively would have thought there would have been an increased nationalism there, and perhaps it would have been worse than that. The trajectory there is improving, even with subsidies, because subsidies benefited your competitors too. Just wondering if a little more color there. Can it keep improving?\n\n0:29:36\n\nWhat are you thinking with regard to that trajectory in China, given all the geopolitical tensions? Thanks.\n\n0:29:41\n\nYeah, we were down 2%, as you point out, for the March quarter. To provide a little more transparency around that, we were roughly flat when you removed the headwinds from foreign exchange. We did see quite a bit of sequential improvement from the December quarter, which was down 11. Going out of the way for transparency, the channel inventory at the end of March, the unit channel inventory was similar to where we started the quarter. There was not a build of channel inventory in there. I do believe that the subsidies played a favorable impact on the results. It is difficult to estimate with precision as to exactly how much, but I think it was positive. Some of our products are included. Some of them are not.\n\n0:30:39\n\nGenerally, on iPhone, if something is priced above RMB 6,000, it is not eligible for the subsidy. The other products have different rules. I do think it helped. I think it is helping others as well, I am sure. iPhone was the key driver of the improvement sequentially. Hopefully, that provides you some color. The other thing I would say is that the Mac, the iPad, and the Watch are attracting a majority of customers new to that product. That continues to look quite good in China. iPhone was the top two models in urban China. iPad was the top two tablets in urban China. There are some positive nuggets there.\n\n0:31:41\n\nThanks a lot, Tim.\n\n0:31:44\n\nYep. Thank you, Ben.\n\n0:31:46\n\nThank you, Ben. Operator, may we have the next question, please?\n\n0:31:52\n\nOur next question is from Michael Ng with Goldman Sachs. Please go ahead.\n\n0:31:57\n\nHi, good afternoon. Thank you very much for the question. I was just wondering if you could talk a little bit about your responses on some of this trade policy uncertainty. I appreciated the transparency around building ahead with inventory. Will you continue to do that in this interim period until we get some clarity on the Section 232 investigation? Could you talk a little bit about your philosophy on pricing, elevated costs to the extent that comes through, whether that be to resellers or end consumers and other efficiency efforts that you might be able to pursue? Thank you.\n\n0:32:37\n\nYeah, obviously, we're very engaged on the tariff discussions. We believe in engagement and will continue to engage. On the pricing piece, we have nothing to announce today. I'll just say that the operational team has done an incredible job around optimizing the supply chain and the inventory.\n\n0:33:08\n\nWe will obviously continue to do those things to the degree that we can.\n\n0:33:14\n\nGreat. Thanks. Just as a quick follow-up for Kevan, on product gross margins, I was just wondering if you could provide a little bit more color on some of the factors that may have impacted product gross margins in the quarter. Obviously, down sequentially on seasonal factors, but there was a year-over-year decline as well. Any additional color would be helpful. Thank you.\n\n0:33:41\n\nYeah, Michael, thanks. This is Kevan. On the sequential, as we mentioned in the prepared remarks, we had a decrease in the product gross margin by 340 basis points sequentially. That was primarily driven by mix, seasonal, loss of leverage, foreign exchange. That was partly offset by cost savings. When we look at the year-on-year performance, we were down 70 basis points on a year-on-year basis.\n\n0:34:07\n\nThat was driven by a different mix in foreign exchange.\n\n0:34:10\n\nGreat. Thank you.\n\n0:34:14\n\nThank you.\n\n0:34:16\n\nGreat. Thank you, Mike. Operator, could we have the next question, please?\n\n0:34:23\n\nOur next question is from Amit Daryanani with Evercore. Please go ahead.\n\n0:34:27\n\nYep. Thanks a lot. I guess I'll have to start with the tariff question as well. Tim, I think when you talked about the $900 million impact to your cost of goods sold, you sort of had a statement that there are certain unique factors that benefit you in the June quarter related to that number. Can you just talk about what are these unique factors that are benefiting you in the June quarter, and what would the impact be without those benefits, essentially?\n\n0:34:52\n\nI wouldn't want to go through all of them, but as an example, the build ahead that I mentioned earlier that's in the manufacturing purchase obligations were helpful.\n\n0:35:07\n\nGot it. As I think about the June quarter guide of low to mid-single-digit revenue growth, do you folks expect services growth to remain in the double-digit range as you go into the back half of the year? I imagine FX is a bit of a benefit as you go to the back half. I'd love to just understand, within that framework, how do you think services stacks up as you go through the June quarter?\n\n0:35:32\n\nYeah, Amit. Hey, it's Kevan. I think when we talk about the overall June quarter, we talked about the low to mid-single digits year-over-year. We do expect foreign exchange in the June quarter to improve sequentially.\n\n0:35:44\n\nHowever, we are expecting it to be a slight headwind to revenue on a year-on-year basis. With respect to services, given the uncertainty we see from several factors, we aren't providing the category level of color today.\n\n0:35:56\n\nGot it. Thank you.\n\n0:36:03\n\nThank you.\n\n0:36:05\n\nThanks, Amit. Operator, could we have the next question, please?\n\n0:36:12\n\nOur next question is from Wansi Moen with Bank of America. Please go ahead.\n\n0:36:16\n\nYes, thank you. Tim McCavern, how should investors think about the gross margin trajectory as you source more from the U.S. in particular or other supply chain changes that you're making, including in India? How should those kind of play into the cost structure, and how should we think about that gross margin trajectory? I will follow up.\n\n0:36:39\n\nWe're excited about bringing more production to the U.S.\n\n0:36:46\n\nAs you know, we've been very key in the TSMC project in Arizona and are the largest and first customer getting product out of that. That's the SSC that's coming out of there. We also have glass coming out of the U.S. and the Face ID module and loads of chips. In fact, there's 19 billion chips coming out across 12 states. This is down to the resistor and capacitor level, obviously. There's some that is already built into the margins that Kevan has quoted. We don't really forecast beyond the current quarter, as you know.\n\n0:37:38\n\nYeah, maybe I'll add a couple more points as we think about just the margin going forward. A couple of observations I'd mention is every product cycle is different. Over the years, we have managed gross margin well. We've made good decisions balancing units' revenue margins.\n\n0:37:53\n\nWhen we launch new products, they tend to have a higher cost structure than the products they replace as we introduce new features and technologies. We do have a good track record of reducing those cost structures over the life of the product. Our products and services all have different levels of profitability, and their relative success in the marketplace has an impact on the overall gross margin. I hope that's helpful color and context for you.\n\n0:38:18\n\nYeah, no, that's super helpful. Thank you. I guess you just noted that you weren't going to give services maybe growth forecast here in light of some of the uncertain news. Maybe, Tim, could you share any color around what you have seen in developer behavior in areas like Europe where there has now been emergence of alternate app stores for a little more time?\n\n0:38:48\n\nWhat have you seen anecdotally or within your data in terms of maybe developer behavior, whether it's large or small? Any color you can share on what has actually happened?\n\n0:39:02\n\nIt's embedded in our results that Kevan talked about earlier and embedded in the overall company color that was provided. As you know, the Digital Markets Act went into effect in, I believe it was March of last year. The Digital Markets Act has been enacted for a bit over a year. There have been alternate app stores for some period of time of that. At this point in Europe, there are some embedded in the actuals. There may be more to come and so forth. I don't want to predict beyond the current quarter.\n\n0:39:58\n\nOkay. Thank you, Tim.\n\n0:39:58\n\nThank you, Wansi. Operator, could we have the next question, please?\n\n0:40:06\n\nOur next question is from David Vogt with UBS. Please go ahead.\n\n0:40:10\n\nGreat. Thanks, guys. Thanks for taking my questions. I have two as well. Tim, this is more of a big picture supply chain philosophical question. Can you maybe update us on your thoughts on how you're thinking about your sort of resiliency and redundancy following the changes that you guys talked about earlier on the call? I guess what I'm trying to understand is how do we think about where your supply chain is two to three years from now? Is there any risk, at least in the near term, of maybe some export control issues in your outlook for the balance of this year? I'll give you my second one at the same time. You quantified a $900 million hit from tariffs.\n\n0:40:47\n\nKevin, is there any impact in how you're thinking about the demand backdrop in your outlook for the June quarter on the revenue line holistically? Thanks.\n\n0:40:56\n\nIn terms of the resiliency and risk, etc., we have a complex supply chain. There's always risk in the supply chain. I wouldn't tell you anything different than that. What we learned some time ago was that having everything in one location had too much risk with it. We have, over time, with certain parts of the supply chain, not the whole thing, but certain parts of it, opened up new sources of supply. You could see that kind of thing continuing in the future. I'll let Kevin answer the other question.\n\n0:41:45\n\nHi, David. On the other question, I would say that our best thinking is captured in the outlook that we provided.\n\n0:41:52\n\nHowever, I did want to reemphasize the point that the assumptions we made on the outlook do assume that the global tariff rates, the policies, and application remain the same as they are today as of this call, and that the global macroeconomic outlook does not worsen from today.\n\n0:42:08\n\nOkay, but no quantifiable impact on demand to date, at least from where we are over the last month? Is there a way to kind of think about that from early April to early May?\n\n0:42:21\n\nI would say our best thinking is reflected in the range that we provided.\n\n0:42:26\n\nOkay. Thanks, Kevan. Thanks, guys.\n\n0:42:28\n\nThank you.\n\n0:42:28\n\nThank you, David. Operator, could we have the next question, please?\n\n0:42:35\n\nOur next question is from Samik Chatterjee with JP Morgan. Please go ahead.\n\n0:42:41\n\nHi. Good afternoon. Thanks for taking my questions.\n\n0:42:44\n\nI guess, Tim, you made a comment on the last earnings call about Apple Intelligence making a visible impact on iPhone sales in the countries where it was available. I'm just curious if you continue to see that play out similarly in sort of the more broader number of countries you've rolled that out, or the delays that you talked about relative to personalized Siri features, has that had an impact in terms of consumer willingness to upgrade? I have a follow-up.\n\n0:43:11\n\nThank you. Yeah, thank you for the question. During the March quarter, we saw that in markets where we had rolled out Apple Intelligence, that the year-over-year performance on the iPhone 16 family was stronger than those where Apple Intelligence was not available. A lot of the languages that I think you're referring to rolled out in April, and so they actually rolled out in Q3.\n\n0:43:35\n\nOkay.\n\n0:43:40\n\nGot it. Maybe for my follow-up, I mean, you have a lot of insights now in terms of what consumers are, how consumers are reacting to the overall macro. I know you sort of prefaced all your guidance with macro remaining consistent, but what are you seeing in terms of the U.S. consumer, and what's the reaction there in terms of the tariff impact? We saw U.S. GDP also shrink here in Q1. When you look at velocity at the stores or trade down within the sort of iPhone portfolio mix, what are you seeing in terms of how the consumer is reacting to the macro at this point? Thank you.\n\n0:44:17\n\nI'm not an economist, and so I start by saying that. In terms of the, as you can see from a total company point of view, our results accelerated sequentially to the 5% level.\n\n0:44:34\n\nThe U.S. is obviously the vast majority of the Americas segment, and you can see how the Americas performed during the quarter. That is all I would want to say about that. I do not want to try to predict what happens in the months from now. The past, I am quite pleased with the results from Q2.\n\n0:45:03\n\nThank you. Thanks for taking the questions.\n\n0:45:07\n\nThank you, Samik. Operator, could we have the next question, please?\n\n0:45:14\n\nOur next question is from Krish Sankar, TD Cowen. Please go ahead.\n\n0:45:18\n\nYeah, hi. Thanks for taking my question. I told them to Tim, thanks for that information on the $500 billion U.S. investment. I am kind of curious how to think about the composition of that. How much is CapEx versus R&D? How much is going into the Texas server? How much is going into maybe TSMC Arizona?\n\n0:45:38\n\nAny kind of color you can give on that $500 billion investment would be helpful, and then I'd have a follow-up.\n\n0:45:43\n\nThere's lots of all of it is what I would say. We're not giving out the exact split, but as we expand facilities in the different states from Michigan to Texas to California and Arizona and Nevada and Iowa and Oregon and North Carolina and Washington, there will be CapEx involved in that and OpEx involved in it. Standing up advanced server manufacturing in Texas, we'll do that through a partner as we do our manufacturing through a partner. We'll be putting a fair amount in cost of goods sold to do that and some OpEx as well. I'm sure some CapEx as well. It's a bit of all of it.\n\n0:46:36\n\nGot it. Got it.\n\n0:46:40\n\nI kind of have a long-term, more like a philosophical question. When you look at in the past, you've spoken about AI on the edge. Obviously, it's very topical to you from both the iPhone angle and the Mac angle. I'm just kind of curious. When you look at AI on the edge, are the current smartphone specs or improved hardware and silicon specs good enough to meet future edge LLM for inference? Or do you think we need to come up with a whole new different kind of device? I'm just kind of curious how to think about the evolution of the edge devices from here. Thank you.\n\n0:47:15\n\nYeah. As you know, we're shipping an LLM on the iPhone 16 today.\n\n0:47:24\n\nThere are some of the queries that are being used by our customers are on-device, and then others go to the private cloud where we've essentially mimicked the security and privacy of the device into the cloud. Others for world knowledge with the integration with ChatGPT. We continue to be very excited about the opportunities here. We are very excited about the roadmap. We are pleased with the progress that we're making.\n\n0:48:10\n\nThanks, Tim.\n\n0:48:13\n\nThank you, Krish. Operator, could we get the next question, please?\n\n0:48:19\n\nOur next question is from Richard Kramer with Arete Research. Please go ahead.\n\n0:48:26\n\nThank you very much. I won't ask about tariffs.\n\n0:48:31\n\nTim, given your recognition that a new Siri assistant is taking longer than you thought to deliver, I'd like to go back to my question from the last call and ask about what some of the learnings you had from those delays and whether you attribute them to organizational factors, to your legacy software stack, or is it a matter of R&D spending? What are some of the key gating factors investors should look for, either at WWDC or beyond, to have a sense that Apple can deliver on some of the promises of the announcements at the prior WWDC? Thanks.\n\n0:49:03\n\nYeah. If you sort of step back from what we said at WWDC, we talked about a number of different features that would launch with iOS 18.\n\n0:49:17\n\nWe have released a slew of those from writing tools to seamlessly connecting to ChatGPT, to Genmoji, to Image Playground, to Image Wand, to Cleanup and Visual Intelligence, making movies or movies of your memories with a simple prompt, AI-powered photo search, smart replies, priority notifications. The list goes on. We have delivered a lot. We just recently, just a few weeks ago, expanded it into several different languages, including French, German, Italian, Portuguese, Spanish, Japanese, Korean, Simplified Chinese, as well as localized English for both Singapore and India. We have delivered a lot. However, with regard to the more personal Siri, as you mentioned, we just need more time to complete the work so they meet our high-quality bar. There is not a lot of other reason for it. It is just taking a bit longer than we thought. We are making progress.\n\n0:50:36\n\nWe're extremely excited to get the more personal Siri features out there.\n\n0:50:41\n\nRichard, I'll just add that on your question about investment, we don't underestimate invest in our business. We make significant investments in R&D that continues to grow. We're continuing to grow our R&D investment. We definitely are making all the investments we think we need to enable our roadmap.\n\n0:51:00\n\nThanks. Kevin, one for you. I mean, it's hard to ignore some of the ongoing very high-profile legal cases that touch on Apple, be it yesterday's EPIC case injunction or the Google antitrust trial touching on default search. Investors are clearly concerned that these might have material impacts on your services business.\n\n0:51:23\n\nDo you feel now that you have ample ways in which you might be able to mitigate some of the potential negative impacts on Apple services business that might come about from what's been proposed or might come about in legal rather than commercial pressures that the business faces?\n\n0:51:39\n\nLet me make a couple of comments on that before Kevan. The case yesterday, we strongly disagree with. We've complied with the court's order, and we're going to appeal. In the DOJ case that you referenced with Google, that case is ongoing, and I don't really have anything to add beyond that. We are monitoring these closely. As you point out, there's risk associated with them, and the outcome is unclear. Yeah.\n\n0:52:21\n\nI think Tim answered it really well. I don't have anything to add to that.\n\n0:52:23\n\nThank you.\n\n0:52:27\n\nAll right. Thank you, Richard.\n\n0:52:29\n\nOperator, we will take our last question, please.\n\n0:52:35\n\nWe'll go ahead and take our last question from Aaron Rakers with Wells Fargo. Please go ahead.\n\n0:52:40\n\nYeah. Thanks for taking the question. I want to go back to the AI strategy a little bit. I know, Tim, in your prepared comments, you had mentioned building some of your own foundational models. I'm curious of how important you think it is for Apple to have their own foundational models. Kind of dovetailed with that is that how do you think about your data center footprint when we look at Apple spending, call it $3 billion a quarter relative to some of these other companies spending multiples of that? How does the strategy play out in your opinion?\n\n0:53:17\n\nOn the data center side, we have a hybrid strategy.\n\n0:53:23\n\nWe utilize third parties in addition to the data center investments that we're making. As I mentioned in the $500 billion, there's a number of states that we're expanding in. Some of those are data center investments. We do plan on making investments in that area, and we're not gating it. We invest in the business first, as Kevan talked about, is our most important thing to do. In terms of the foundation models, we want to have certain models, and we'll partner as well. I don't view it as all of one or all of the other. We've been working on foundation models for quite some time and are shipping some today, obviously, with what's on device and what's in the private cloud compute.\n\n0:54:27\n\nYeah.\n\n0:54:30\n\nThen as a follow-up, I'm curious with the iPhone 16e launching this quarter, internalizing your C1 modem. I'm curious of how you see kind of the modem strategy playing out or maybe just the continual deepening of that internal silicon opportunity for Apple.\n\n0:54:50\n\nWe're super excited to ship the first one and get it out there, and it's gone well. We love that we can produce better products from a point of view of really focusing on battery life and other things that customers want. We have started on a journey, is the way I would put it.\n\n0:55:19\n\nThank you.\n\n0:55:21\n\nYep.\n\n0:55:22\n\nThank you, Aaron. A replay of today's call will be available for two weeks on Apple Podcasts as a webcast on apple.com/investor and via telephone. The number for the telephone replay is 866-583-1035. Please enter confirmation code 3729688 followed by the pound sign.\n\n0:55:47\n\nThese replays will be available by approximately 5:00 P.M. Pacific Time today. Members of the press with additional questions can contact Josh Rosenstock at 408-862-1142. Financial analysts can contact me, Suhasini Chandramouli, with additional questions at 408-974-3123. Thank you again for joining us today.Once again, this does conclude today's conference. We do appreciate your participation.\n\nA Silver or Gold subscription plan is required to access historical transcripts.\n\nSign in to access your portfolio",
      "fetched_at": "2026-02-03T14:51:33.319Z"
    },
    {
      "ticker": "AAPL",
      "title": "Apple Inc. (AAPL) Q3 FY2025 earnings call transcript",
      "published_date": "2026-02-03T14:51:30.411Z",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/AAPL/earnings/AAPL-Q3-2025-earnings_call-341149.html",
      "content": "Oops, something went wrong\n\nSkip to navigation Skip to main content Skip to right column US English US y LATAM Español Australia English Canada English Canada Français Deutschland Deutsch France Français 香港 繁中 Malaysia English New Zealand English Singapore English 台灣 繁中 UK English News Finance Sports News Today's news US Politics 2025 Election World Weather Climate change Health Science Originals Newsletters Games Life Health Parenting Style and beauty Horoscopes Shopping Food Travel Autos Gift ideas Buying guides Valentine's Day gifts Entertainment Celebrity TV Movies Music How to Watch Interviews Videos Finance My portfolio Watchlists Markets News Videos Screeners Personal finance Crypto Sectors Industries Sports Fantasy Daily fantasy NFL NBA MLB NHL College football College basketball Soccer NFL Draft Yahoo Sports AM Show all New on Yahoo Creators Tech Local services Selected edition Mail Sign in Back to quote Apple Inc. (AAPL) Q3 FY2025 earnings call transcript Powered by Quartr Jul 31, 2025, 5:00 PM EDT Earnings call Apple reported Q3 FY25 revenue of $94B (+10% YoY), beating expectations with record EPS of $1.57 (+12% YoY). Growth was broad-based across iPhone (+13%), Mac (+15%), and Services (+13%). Management guided for mid-to-high single-digit revenue growth in Q4, with continued AI investment and $1.1B in expected tariff costs. Apple reported Q3 FY25 revenue of $94B (+10% YoY), beating expectations with record EPS of $1.57 (+12% YoY). Growth was broad-based across iPhone (+13%), Mac (+15%), and Services (+13%). Management guided for mid-to-high single-digit revenue growth in Q4, with continued AI investment and $1.1B in expected tariff costs.\n\n0:00:00\n\nGood afternoon, and welcome to the Apple q fiscal year twenty twenty five earnings conference call. My name is Suhasini Chandramali, Director of Investor Relations. Today's call is being recorded. Speaking first today is Apple's CEO, Tim Cook, and he'll be followed by CFO, Kevin Parekh. After that, we'll open the call to questions from analysts.\n\n0:00:24\n\nPlease note that some of the information you'll hear during our discussion today will consist of forward looking statements, including, without limitation, those regarding revenue, gross margin, operating expenses, other income and expense, taxes, capital allocation and future business outlook. These statements involve risks and uncertainties that may cause actual results or trends to differ materially from our forecast, including risks related to the potential impact to the company's business and results of operations from macroeconomic conditions, tariffs and other measures, and legal and regulatory proceedings. For more information, please refer to the risk factors discussed in Apple's most recently filed reports on Form 10 Q and Form 10 ks and the Form eight ks filed with the SEC today along with the associated press release. Additional information will also be in our report on Form 10 Q for the quarter ended 06/28/2025 to be filed tomorrow and in other reports and filings we make with the SEC. Apple assumes no obligation to update any forward looking statements, which speak only as of the date they are made.\n\n0:01:40\n\nI'd now like to turn the call over to Tim for introductory remarks.\n\n0:01:45\n\nThank you, Suasini. Good afternoon, everyone, and thanks for joining the call. Today, we are proud to report a June revenue record of $94,000,000,000 up 10% from a year ago, which was better than we expected. EPS set a June record of $1.57 up 12% year over year. We saw an acceleration of growth around the world in the vast majority of markets we track, including Greater China and many emerging markets.\n\n0:02:18\n\nAnd we had June revenue records in more than two dozen countries and regions, including The US, Canada, Latin America, Western Europe, The Middle East, India, and South Asia. These results were driven by double digit growth across iPhone, Mac, and services. We set a June record for iPhone, which grew a strong 13% year over year. We saw iPhone growth in every geographic segment and double digit growth in emerging markets, including India, The Middle East, South Asia and Brazil. Mac continued to see excellent results with revenue up 15% year over year.\n\n0:03:01\n\nAnd we set another all time revenue record in services, which grew 13% with double digit growth in both developed and emerging markets. Last month, we hosted WWDC, an incredible event for our developer community with millions joining us online and more than 1,000 developers here in person at Apple Park. We shared some truly exciting updates, including a stunning new design crafted from a material we call liquid glass. It's both beautiful and expressive. And for the first time ever, this design extends across all of our platforms.\n\n0:03:39\n\nWe can't wait for users everywhere to experience it this fall. And we were excited to share some updates across our AI work. We announced even more capabilities coming later this year, including live translation and WorkoutBuddy. In addition to those new features, we announced new support for a number of languages. And we opened up access to the on device foundation models at the core of Apple Intelligence, enabling developers to build a whole new experience for our users.\n\n0:04:11\n\nIt's wonderful to see great momentum building for our platforms. IOS 26, macOS 26 and iPadOS 26 are by far the most popular developer betas we've had. Taking a step back, we see AI as one of the most profound technologies of our lifetime. We are embedding it across our devices and platforms and across the company. We are also significantly growing our investments.\n\n0:04:39\n\nApple has always been about taking the most advanced technologies and making them easy to use and accessible for everyone, and that's at the heart of our AI strategy. With Apple Intelligence, we're integrating AI features across our platforms in a way that is deeply personal, private, and seamless, right where users need them. We've already released more than 20 Apple Intelligence features, including visual intelligence, cleanup and powerful writing tools. We're making good progress on a more personalized Siri. And as we've said before, we expect to release these features next year.\n\n0:05:21\n\nApple Silicon is at the heart of all of these experiences, enabling powerful Apple intelligence features to run directly on device. For more advanced tasks, our servers, also powered by Apple Silicon, deliver even greater capabilities while preserving user privacy through our private cloud compute architecture. We believe our platforms offer the best way for users to experience the full potential of generative AI. Thanks to the exceptional performance of our systems, our users are able to run generative AI models right on their Mac, iPad and iPhone. We're excited about the work we're doing in this space, and it's incredibly rewarding to see the strong momentum building.\n\n0:06:08\n\nNow let me turn to more details about our results for the quarter, starting with iPhone. IPhone revenue was $44,600,000,000 up 13% from a year ago, and we set a June record for upgraders. This strong broad based performance was driven by the incredible popularity of the iPhone 16 family, which was up strong double digits year over year as compared to the 15 family. We also recently marked a significant milestone. We shipped the three billionth iPhone since its launch in 02/2007.\n\n0:06:45\n\nFrom the Pro models with the powerhouse A18 Pro and innovative Pro camera features to the iPhone 16E with breakthrough battery life and a two in-one camera system, users are finding so many reasons to love the best iPhone lineup we've ever created. And iOS 26 will take that experience even further. In addition to the beautiful new design and powerful Apple intelligence features, it introduces a range of meaningful updates, like real time call screening and hold assist in the phone app, smarter messaging tools and new live translation features. It all adds up to a smarter, more personal iPhone experience that we can't wait for users everywhere to enjoy this fall. In Mac, we had another strong quarter with revenue of $8,000,000,000 up 15% year over year, largely driven by the strength of the M4 MacBook Air.\n\n0:07:44\n\nWe set a June record for upgraders on Mac, and we saw great performance in emerging markets with strong double digit growth on revenue as well as strong double digit growth on both upgraders and customers new to Mac. MacBook Air, the world's most popular laptop, unlocks a whole new level of performance with the power of M4. MacBook Pro customers, meanwhile, continue to be drawn to its incredible power and the longest battery life we've ever had on a Mac. Customers are also loving the newest Mac Studio, which is the most powerful Mac we've ever made with next level capabilities to tackle even the most demanding AI workflows. At the same time, Mac Mini continues to win over customers by packing so much performance into an ultra compact design.\n\n0:08:39\n\nAnd with fantastic new updates in macOS Tahoe 26, from the phone app to live activities to our biggest ever update to Spotlight, Mac users across our entire lineup are going to find delightful new ways to stay connected and productive. For iPad, June revenue was $6,600,000,000 Our incredibly versatile iPad lineup brings together power and portability like never before, And users are already excited for our biggest iPad software update ever with the upcoming release of iPadOS 26. It starts with a new windowing system that's remarkably intuitive, giving users more control than ever of their iPad experience. An enhanced Files app makes it easier than ever to stay organized. And that's all on top of a beautiful new software design that brings these updates to life.\n\n0:09:40\n\nTurning to Wearables, Home and Accessories. Revenue was $7,400,000,000 and we saw a June record for upgraders to Apple Watch. During the quarter, we marked the ten year anniversary of Apple Watch, celebrating a decade of helping users navigate their health and fitness journeys. And with watchOS '20 six, Apple Watch will be more intelligent than ever with smart updates to the workout app and smart stack along with a fresh new design that feels both dynamic and personal. We're also thrilled about what's coming to Apple Vision Pro with Vision OS 26, introducing spatial widgets that let users customize their digital space, more lifelike personas, and new enterprise APIs that empower companies to build their own spatial experiences.\n\n0:10:33\n\nAnd this fall, new features for our latest AirPods lineup will unlock even more possibilities from studio quality audio recording to using AirPods as a camera remote, giving users powerful new ways to capture content and stay connected. As we're innovating across our lineup, we're especially proud of the work we're doing to help our users live healthier lives. Since we first launched our hearing health features for AirPods Pro two, I've received notes from people who are delighted to be able to connect more deeply with loved ones. Whether it's with AirPods Pro two or Apple Watch or iPhone, it's amazing to see the power of our health and safety features, from hearing tests to fall detection alerts to irregular rhythm notifications having such a profound impact. Turning to services.\n\n0:11:29\n\nRevenue for the June was $27,400,000,000 up 13% from a year ago and an all time record. Apple TV plus scored 81 nominations, a record for the platform across nearly every eligible category for this year's Emmy Awards. Severance leads all Emmy nominees with 27 nominations, and the studio follows close behind with 23 nominations, more than any other freshman comedy series ever. It's amazing to see how these and other Apple TV shows have captured the popular imagination. To date, Apple TV plus has earned more than 2,700 award nominations and five eighty five wins on the strength of the highest rated original content of any streaming network.\n\n0:12:24\n\nAnd we continue to see very positive trends in the June with TV plus viewership up strong double digits year over year. In June, we were also thrilled to release F1 in theaters around the world, one of the summer's most unforgettable blockbusters. During the quarter, we celebrated a big anniversary with ten years of Apple Music. To mark the occasion, we launched an all new studio space in Los Angeles for artists to create content and connect with fans. And later this year, we're bringing Apple Music users even more to love, from an enhanced listening experience with automix, which mixes songs like a DJ, to lyrics translation and more.\n\n0:13:11\n\nThe App Store, meanwhile, continues to be the very best place to discover the latest apps from developers around the world in a safe and trusted way, and App Store revenue grew double digits year over year, setting a June record. In retail, we continue to find opportunities in emerging markets to connect with even more customers. We recently launched the Apple Store online in Saudi Arabia, and we couldn't be more excited to open new stores in The UAE and India later this year. We were also delighted to welcome customers in Japan to a new location in the heart of Osaka. Across everything we do at Apple, we show up by leading with our values.\n\n0:13:56\n\nWe feel strongly that the benefits of technology should be shared by everyone. That's why we make technology for everyone. In May, to mark Global Accessibility Awareness Day, we announced updates to help users learn, connect and interact with their worlds, including Magnifier for Mac, a new braille experience and Accessibility Reader, a new system wide reading mode to make it easier to understand content. And we're proud to introduce accessibility nutrition labels, giving users an understanding of accessibility features before they download an app while helping developers educate people on features their app support. This month, we also announced a $05,000,000,000 commitment with NP Materials to strengthen the supply of vital recycled rare earth materials in The U.\n\n0:14:51\n\nS. And support American industry. And in August, we're opening our all new Apple Manufacturing Academy in Detroit to train and support American manufacturers. These investments are part of Apple's largest ever spin commitment, which we announced earlier this year. Over the next four years, Apple is investing $500,000,000,000 in The U.\n\n0:15:16\n\nS, driving innovation and creating jobs in cutting edge fields like advanced manufacturing, silicon engineering, and artificial intelligence. We're proud of this work and all that we're doing to tap into American innovation and bring the best technology experiences to users across the globe. And we continue to look for further opportunities to do even more. Finally, the situation around tariffs is evolving, so let me provide some color there. For the June, we incurred approximately $800,000,000 of tariff related costs.\n\n0:15:55\n\nFor the September, assuming the current global tariff rates policies and applications do not change for the balance of the quarter and no new tariffs are added, we estimate the impact to add about $1,100,000,000 to our costs. This estimate should not be used to make projections for future quarters as there are many factors that could change, including tariff rates. We're really proud of our results for the June, and I want to thank our teams and our customers. In everything we do, we're driven by transformative innovation, delivering the most exceptional products and services we've ever created, and we're especially excited about what's ahead. With that, I'll turn it over to Kevin.\n\n0:16:44\n\nThanks, Tim, and good afternoon, everyone. Our revenue of $94,000,000,000 was up 10% year over year and is a new June record. We grew in every geographic segment and in the vast majority of the markets we track. Products revenue was $66,600,000,000 up 8% year over year, driven by growth across iPhone and Mac. And thanks to our high levels of customer satisfaction and strong loyalty, our installed base of active devices reached another all time high across all product categories and geographic segments.\n\n0:17:18\n\nServices revenue was $27,400,000,000 up 13% year over year and an all time record. We saw strength across the world with double digit growth in the majority of our markets. Company gross margin was 46.5%, at the high end of our guidance range and down 60 basis points sequentially, primarily driven by approximately $800,000,000 in tariff related costs Tim mentioned earlier. Products gross margin was 34.5%, down 140 basis points sequentially, driven by mix and tariff related costs, partly offset by cost savings. Services gross margin was 75.6%, down 10 basis points sequentially.\n\n0:18:00\n\nOperating expenses landed at $15,500,000,000 up 8% year over year. This strong business performance led to June records for both net income at $23,400,000,000 and diluted earnings per share of 1.57 which was up 12% year over year. Operating cash flow was also strong at $27,900,000,000 Now I'm going to provide some more details for each of our revenue categories. IPhone revenue was $44,600,000,000 up 13% year over year driven by the iPhone 16 family. As Tim noted, we saw iPhone growth in every geographic segment and double digit growth in many emerging markets.\n\n0:18:44\n\nThe iPhone active installed base grew to an all time high in total and in every geographic segment, and we reached a June record for upgraders. According to a recent survey from World Panel, formerly of Kantar, iPhone was a top selling model in The U. S, urban China, The U. K, Australia, and Japan during the June. And we continue to see very high levels of customer satisfaction in The U.\n\n0:19:12\n\nS. At 98%, as measured by four fifty one Research. Mac revenue was $8,000,000,000 up 15% year over year, driven by continued strength across the portfolio, including MacBook Air, Mac Mini, and MacBook Pro. We grew in every geographic segment and saw double digit growth in Europe, Greater China, and the rest of Asia Pacific. The Mac installed base reached an all time high and we hit a June record for upgraders.\n\n0:19:43\n\nIn The U. S, customer satisfaction was recently measured at 97%. IPad revenue was $6,600,000,000 down 8% year over year, which was expected given the difficult compare against the launch of the iPad Air and iPad Pro in the year ago quarter. At the same time, the iPad installed base reached another all time high and over half of the customers who purchased an iPad during the quarter were new to the product. And based on the latest reports from four fifty one Research, customer satisfaction was 98% in The U.\n\n0:20:15\n\nS. Wearables, Home and Accessories revenue was $7,400,000,000 down 9% year over year. This was driven by a difficult compare on accessories due to the prior year's iPad launches that I just referred to. The Apple Watch installed base reached a new all time high with over half of customers purchasing an Apple Watch during the quarter being new to the product. We also set a quarterly record for upgraders on Apple Watch.\n\n0:20:42\n\nAnd the latest customer satisfaction for Watch in The U. S. Was reported at 97%. Our services revenue reached an all time high of $27,400,000,000 up 13% year over year. The performance in the June was broad based.\n\n0:20:56\n\nWe saw a sequential acceleration across a majority of the categories, including cloud services where we reached an all time revenue record driven by the year over year growth of iCloud paying accounts. We saw strong momentum during the June, and the growth of our installed base of active devices gives us great opportunities for the future. Customer engagement across our services offerings also continued to grow. Both transacting and paid accounts reached new all time highs, with paid accounts growing double digits year over year. Paid subscriptions also grew double digits.\n\n0:21:29\n\nWe have well over 1,000,000,000 paid subscriptions across the services on our platform. We continue to improve the quality and breadth of our service offerings, from the new Apple Games app to a continued expansion of tap to pay and Wallet. Turning to enterprise, organizations are continuing to invest in Apple products to drive employee innovation and productivity. With companies like PayPal and Roche deploying more Macs for their workforce, we had the best June ever for Mac and Enterprise. In Thailand, Siam Commercial Bank, one of the largest Thai banks, has deployed thousands of iPads across their branches to enhance the quality and efficiency of their banking operations from loan services to wealth management.\n\n0:22:07\n\nCAE, a leader in pilot training and simulation technology, is using Apple Vision Pro to enable pilots to become more familiar with aircraft procedures, leading to more productive in person flight simulator training outcomes. Let's turn to our cash position and capital return program. We ended the quarter with $133,000,000,000 in cash and marketable securities. We had 5,700,000,000 of debt maturities, issued $4,500,000,000 of new debt and increased commercial paper by $4,000,000,000 resulting in $102,000,000,000 in total debt. Therefore, at the end of the quarter, net cash was $31,000,000,000 During the quarter, we returned over $27,000,000,000 to shareholders.\n\n0:22:51\n\nThis included $3,900,000,000 in dividends and equivalents and $21,000,000,000 through open market repurchases of 104,000,000 Apple shares. As we move into the September, I'd like to review our outlook, which includes the types of forward looking information that Suhasim referred to. Importantly, the color we're providing assumes that the global tariff rates, policies, and application remain in effect as of this call, the global macroeconomic outlook does not worsen from today, and the current revenue share agreement with Google continues. We expect our September total company revenue to grow mid to high single digits year over year. We expect services revenue to grow at a year over year rate similar to what we reported in the June.\n\n0:23:38\n\nWe expect gross margin to be between 4647%, which includes the estimated impact of the $1,100,000,000 tariff related costs that Tim referred to earlier. We expect operating expenses to be between $15,600,000,000 and $15,800,000,000 We expect OI and E to be around negative $25,000,000 excluding any potential impact from the mark to market of minority investments and our tax rate to be around 17%. Finally, today our Board of Directors has declared a cash dividend of $0.26 per share of common stock payable on 08/14/2025, to shareholders of record as of 08/11/2025. With that, let's open the call to questions.\n\n0:24:27\n\nThank you, Kevin. We ask that you limit yourself to two questions. Operator, may we have the first question please?\n\n0:24:36\n\nCertainly. We'll go ahead and take our first question from Michael Ng with Goldman Sachs. Please go ahead.\n\n0:24:43\n\nHey, good afternoon. Thank you for the questions. I just have one on upgrade rates and one on CapEx. First, on the upgrade rates, it was encouraging to see the records on iPhone, Mac and Watch. I was wondering if you're seeing strength in the upgrade rates?\n\n0:25:01\n\nOr is the records more a function of the growing installed base? What is your research showing that made upgrades particularly compelling this year? For example, is it product features, tariff pull forward, perhaps Apple Intelligence? And then I'll give my follow-up on CapEx.\n\n0:25:23\n\nYou want to do CapEx first?\n\n0:25:25\n\nYes, let's do CapEx first. Mike,\n\n0:25:31\n\nthe CapEx, it's up notably year to date. Could you just comment on your capital spending plans this year and next and provide some qualitative color in terms of what's driving that growth? Is it AI related or supply chain diversification, for instance? Thank you.\n\n0:25:50\n\nYeah, Mike. It's it's it's a combination of factors. I would say a pretty significant driver, as Tim talked about, is the fact we are increasing our investment significantly in AI. So that is certainly a a component of it. As you know, we've been investing in private cloud compute, is also in our first party data centers.\n\n0:26:04\n\nThe other piece, as you know, is we do have a hybrid strategy where in cases we do use third parties to make capital investments, and we also invest in our own. So you are going to see an increase in CapEx. We also from time to time have other investments in facilities, in tooling, but I would say a significant portion of the driver of growth that you're seeing now is really driven by some of our AI related investments.\n\n0:26:26\n\nOn the upgrades, Michael, if you look at iPhone, the 16 family grew double digit as opposed to the 15 family from the year ago quarter. And so we did set an upgrade record. I think it directly is because of the strength of the product. Mac also set records on upgrade. And I think, you know, we continue to see a move to Apple Silicon and the performance of Apple Silicon is playing a very key role.\n\n0:27:03\n\nAnd so it was an incredible quarter. In terms of if you're wondering about pull forward, we would estimate the pull forward of demand into April specifically to be about one point of the 10 points in terms of people buying because of discussions about tariffs.\n\n0:27:33\n\nAlright.\n\n0:27:33\n\nThank you, Tom. Thank you, Kevin.\n\n0:27:35\n\nThanks, Mike. Operator, can we have the next question, please?\n\n0:27:41\n\nOur next question is from Eric Woodring with Morgan Stanley. Please go ahead.\n\n0:27:47\n\nHey, good afternoon, guys. Thank you very much for taking my questions. I have two as well. Pip, maybe starting with You know, shortly after March earnings, there were some reports about searches on Safari declining in April for the first time, I think, in over two decades. Judging by your 13% services growth this quarter, it doesn't seem to indicate that April trends necessarily played out through the remainder of the June quarter.\n\n0:28:15\n\nAnd so I'm I'm really just looking for a little bit more color on on really how the rest of the quarter played out and if you believe Apple products as kind of search access points are losing their strategic value as AI platforms become more valuable or popular or increasing in strategic value? And then I have a follow-up. Thank you.\n\n0:28:35\n\nI think they continue to be very valuable. I think that consumers' behaviors are evolving, and we're monitoring it very closely.\n\n0:28:53\n\nOkay. I appreciate that color. Thanks, Tim. And then maybe second to that, I'd love if you could maybe elaborate a bit on what you're seeing in China. I think in an interview earlier this afternoon, you alluded to some of the promotions being tailwinds.\n\n0:29:10\n\nBut just bigger picture, if we take a step back in China, how would you characterize demand interest in the iPhone 16 and some of your other products? Is that shifting? Or maybe were some of the trends in the June maybe a bit more onetime and unique in nature?\n\n0:29:26\n\nYes.\n\n0:29:27\n\nWe did grow in Greater China by 4% during the quarter versus the previous quarter. It was driven by an acceleration by iPhone, although we also had substantial growth on the Mac year over year. From a as you know, the government has placed certain subsidies that affect some of our products, not all of them, but there are some of them. And I think that had some effect. It was the first full quarter of the subsidy playing out.\n\n0:30:06\n\nThat it cut in during a portion of the previous quarter. The also the other things I would say are the that the installed base hit a record high in Greater China, and we set an all time record for the iPhone installed base. The iPhone upgraders in Mainland China set a record for the June. And according to World Panel, which was formerly known as Kantar, iPhone had the top three models in urban China, which is extraordinary. Also, you look at the other products, Mac, iPad, and Watch, the majority of customers that are buying in China Mainland were new to the product.\n\n0:30:58\n\nSo lots of good things there. And the other thing I would point out, which is an interesting point, the MacBook Air was the top selling laptop model in all of China, and the Mac Mini was the top selling desktop model in in all of China. So overall, a positive very positive quarter.\n\n0:31:23\n\nGreat. Thanks for the color, Tim. Good luck.\n\n0:31:26\n\nRight. Thank you, Eric. Eric. Operator, can we have the next question, please?\n\n0:31:31\n\nOur next question is from Ben Reitsis with Melius Research. Please go ahead.\n\n0:31:38\n\nYeah. Thanks. I I really appreciate it. I wanted to, ask about Siri, Tim, and just overall AI investment. There's a perception that Siri is going to help drive other new products potentially that maybe where voice is quite needed.\n\n0:31:59\n\nAnd just wondering in your how's your confidence towards launching that next year? Is there anything that's been done internally to increase that confidence? Is it tied to the investment? I just think folks would love to know a little bit more about your confidence and how that's going. And then I have a follow-up. Thanks.\n\n0:32:20\n\nYes. Thanks for the question. We're making good progress on a more personalized Siri, and we do expect to release the features next year as we had said earlier. Our focus from an AI point of view is on putting AI features across the platform that are deeply personal, private, and seamlessly integrated. And, of course, we've done that with more than 20 Apple intelligence features so far from visual intelligence to cleanup to writing tools and all the rest.\n\n0:32:56\n\nWe are significantly growing our investment. We did during the June. We will again in the September. I'm not putting specific numbers behind that at this point, but you can probably tell in the guidance that things are moving up. We are also reallocating a fair number of people to focus on AI features within the company that are you know, we have great, great team, and we're we're putting all of our energy behind it.\n\n0:33:35\n\nTerms of products here. In terms of other products, I you know, I don't want to really comment on specific other products, but we have an exciting road map ahead. And I could not be more excited about it.\n\n0:33:52\n\nThat's great, Tim. Thanks for the color. Just with regard to my second question, it's about the overall revenue guide. And I appreciate that you guide the best you can see it, but I just wanted to challenge it from a different way is, why would it decelerate if services is staying the same at 13%? What is there a conservatism there?\n\n0:34:17\n\nI would think even currency is just as favorable, if not more favorable. So why would it decelerate to the higher single digits from where you were in the quarter? Or is it just being conservative? And if there's something decelerating or a comp, do you mind just pointing that out? Thanks.\n\n0:34:35\n\nYeah, Ben, this is Kevin. Thanks for the question. I think when you look at the growth from Q3, which is reported to the mid to high single digit guide, I think you have to kind of keep in mind two components. The first is the effect of the tariff related pull ahead in demand that Tim referenced earlier, which we estimated to be about one point of the 10 points that we ended up doing in Q3. And then the other factor that I think you have to take into consideration is the fact that in September a year ago, we had the full quarter impact of the iPad launches, which also leads to a difficult compare this year.\n\n0:35:11\n\nSo those two components are things you have to take into consideration as you think about the move from Q3 to Q4. I would say foreign exchange is a very minor tailwind going from Q3 to Q4, so not really a major factor.\n\n0:35:25\n\nOkay, thanks a lot.\n\n0:35:27\n\nAwesome. Thank you, Ben. Operator, could we have the next question please?\n\n0:35:33\n\nOur next question is from Wamsi Mohan with Bank of America. Please go ahead.\n\n0:35:39\n\nHi, yes. Thank you so much. Tim, I know you said similar growth in services and that's predicated with Google payments continuing. Is there any way for us to dimensionalize sort of or maybe just conceptually talk about maybe options if the counter were to happen, if the payments were not allowed in some way, what are some of the things that Apple could do given that it is a significant chunk of profitability? And I have a follow-up.\n\n0:36:08\n\nYeah. Wamsi, I don't really want to speculate on the court ruling and how they would rule and what we would do as a consequence of it.\n\n0:36:18\n\nOkay. Okay. I guess we'll wait for that ruling to come out. I guess separately, Tim, at a high level, when you look at some of what is perceived fears of new form factors and ways to interact with devices, there was some worry that given some of the developments in AI that there could be a world where dependence on screen based devices significantly diminishes. And I'm kind of curious to get your thoughts on if do you think that would happen and and rate and pace in which, and and how do you think Apple is preparing in in in that case?\n\n0:37:00\n\nYeah. When you when you think about all the things an iPhone can do from connecting people to bringing app and game experiences to life, to taking photos and videos, to helping users explore the world and conduct their financial lives and pay for things and so much more. You know, it's it's difficult to see a world where iPhone's not living in it. And that doesn't mean that we are not thinking about other things as well. But I think that the devices are likely to be complementary devices, not substitution.\n\n0:37:51\n\nOkay. Thank you so much, Tim.\n\n0:37:52\n\nThank you.\n\n0:37:53\n\nThank you, Wamsi. Operator, could we have the next question, please?\n\n0:38:00\n\nNext question is from Amit Daryanani with Evercore. Please go ahead.\n\n0:38:06\n\nYes. Good afternoon. I guess to start with, Tim, the tariff assumption of $1,100,000,000 in the September, kind of saw I understand the uptick you folks are talking about. But can you just talk about assuming tariffs remain at these levels or even if they evolve under Section two thirty two, how do you eventually think about offsetting this headwind to your P and L? And when do you decide to execute on the levers to offset this headwind versus just looking at your bottom line?\n\n0:38:34\n\nYou know, right now, we're just estimating the cost of it. And it's up quarter over quarter because our volume is up quarter over quarter. And there was some build ahead in the previous quarter. And so that's the primary reasons that it's up. In terms of what we do to mitigate, we obviously try to optimize our supply chain.\n\n0:39:06\n\nAnd ultimately, we're we will do more in The United States. We've committed 500,000,000,000 investment in The U. S. Over the next four years, and we've already building chips in Arizona. And in fact, we're building semiconductors across 12 states and 24 factories and have a lot of other things in the works.\n\n0:39:37\n\nYou probably saw the investment in MP Materials last week. And so we continue to explore these things and look for more that we can do, which I think ultimately is the objective.\n\n0:39:59\n\nGot it. Super helpful. And then your services growth, I think, was extremely impressive at 13%, especially given all the fierce folks had. Can you just touch on did you see any impact that was notable from the Epic case and the steering dynamics that came after that? And maybe just touch on what does that appeals process looks like looks like for me as you go forward? Thank you.\n\n0:40:20\n\nYeah. This is Kevin. Let let me take that one. In general, I think, just reminding, I think you just said we had a very strong services quarter. We had an all time record, had the $27,400,000,000 up 13%.\n\n0:40:33\n\nThe one thing I would also say is our services performance is broad based. So we also saw strength in developed and emerging markets, both parts of the world had double digit growth. We also saw a sequential acceleration across the majority of our categories, including cloud services where I mentioned in the prepared remarks that we had an all time revenue record. As it relates to the Epic decision, you know, we keep in mind, we only just introduced the change required by the court in the June. And as you know, we don't provide the level of detail, but but in general, I would say it was a very, very in in The US, we had a double digit growth for The US App Store, and we set an all time record.\n\n0:41:10\n\nAnd so we'll continue to monitor the effects on our business, but we'll continue to innovate and ensure that the App Store delivers the best experience for users and remains a great business opportunity for developers.\n\n0:41:22\n\nAll right. Thank you, Amit. Operator, could we have the next question, please?\n\n0:41:28\n\nOur next question is from David Vo with UBS. Please go ahead.\n\n0:41:33\n\nGreat. Thanks, guys. And I have two questions as well. Maybe, Tim, just on the supply chain strategy. I know last quarter, talked about focusing production or assembly to India.\n\n0:41:44\n\nAnd I just want to get an update on how you're thinking about the strategy holistically given sort of the tariff rates, I think, in India potentially are higher than I think anyone has expected. So I know you mentioned some U. S. Investments would love to kind of get your thoughts on how you're thinking about China versus the rest of Southeast Asia and India going forward. And then I'll give you my second question also.\n\n0:42:02\n\nSo Kevin, I'm just trying to understand a little bit more about the demand drivers of iPhone in the quarter because obviously the 16 has been in the market for some time. I know there was some promotional activity, but seasonally, you generally don't see this kind of strength in the June quarter. Maybe can you help us understand outside of maybe the promotional activity, what else were some of the drivers that led to what was looks like a pretty significant above seasonal strength in the June? Thanks.\n\n0:42:27\n\nYeah. In terms of the tariff situation and country of origin and so forth, one thing I would say just to remind everyone is keep in mind that the vast majority of our products are covered under the Section two thirty two investigation. And so the today, or I should say last quarter, the bulk of the tariffs that we paid were the IEEPA tariffs that hit early in the year related to China. And so that's just a reminder of where things are and what we assumed as we calculated the projection of $1,100,000,000 that's in our outlook color. In terms of the country of origin, it's the same as I referenced last quarter. There hasn't been a change to that, which is the vast majority of the iPhones sold in The US, or the majority, I should say, have a country of origin of India. And the the vast majority of the products other products, the Mac and the iPad and the Watch, have a country of origin of Vietnam that are sold in The United States.\n\n0:44:00\n\nStill, the products for other international countries, the vast majority of them are coming from China. And so that hopefully gives you a flavor of the of where things are. But I would I would stress again that we do a lot in this country, in The United States, and we've committed $500,000,000,000 and we're always looking to do more. And you could kind of see that in the most recent announcements, whether it's MP Materials or our manufacturing academy that we're standing up in Detroit in a couple weeks or so. And and so we're gonna be doing we're doing more in this country, and that's on top of having roughly 19,000,000,000 chips coming out of The US now, and we're we will do more. And, of course, glass from iPhone and the face ID module. And so there's there's loads of different things that are done in in The United States.\n\n0:45:18\n\nAnd then, David, as as And then on the and then on the iPhone activity?\n\n0:45:22\n\nYeah. So I was gonna mention the iPhone activity. You asked if there's any kind of unique characteristics this quarter. I would just say, as Tim outlined, we really believe that the strong upgrade performance, which was a, you know, a June record, was really driven by the strength of the product lineup. You know, the iPhone 16 family has done incredibly well compared to the iPhone 15 family.\n\n0:45:40\n\nAnd we also, as you recall, you know, recently introduced the 16 e as well, which also continued to, you know, impact the success of the overall iPhone 16 lineup.\n\n0:45:50\n\nGreat. Thanks, guys. Thank you.\n\n0:45:52\n\nGreat. Thank you, David. Operator, could we have the next question, please?\n\n0:45:59\n\nOur next question is from Krish Sankar with TD Cowen.\n\n0:46:07\n\nI have two of The first one is for Kevin. Just on the previous question, do you think there was any pull in of iPhones in the June that led to some of the upside? And how to think about channel inventory in June and how it looks in September relative to seasonal trends? And then I had a longer term follow-up for Tim.\n\n0:46:28\n\nLet me see if can answer the channel inventory question or what I think is the channel inventory question. If you look at iPhone channel inventory from the beginning of the quarter to the end of the quarter, we reduced it and it ended toward the low end of our targeted range. And so that's the answer on the inventory piece of it.\n\n0:46:53\n\nAnd then I think you also asked about the pull ahead impact. I think we referenced that earlier. Just to be clear on what we believe we saw on the June, we did, you know, we did see some obvious signs of pull ahead really in the April time frame around the tariff related, you know, discussions that were out in the marketplace. And so we felt that that was, from what we saw, about a one point impact of the 10 points at a total company level of growth. And so that was the the limited impact that we really we saw for the quarter.\n\n0:47:23\n\nGot it. Very helpful. I know I just had like a a long term follow-up for Tim. Tim, I was kinda curious about your thoughts on AI for edge devices. You know, there's, like, some people who think that LLM could be a commodity in the future.\n\n0:47:39\n\nDo you think do you see a scenario where LLM become a core part of your iOS? Or is the SLM the way to go? And how to think about evolution of edge devices in a futuristic AI world, and is smartphone gonna be the choice of device? Just curious your thoughts on it, broadly speaking. Thank you.\n\n0:47:59\n\nI the way that we look at AI is that it's one of the most profound technologies of our lifetime. And I think it will affect all devices in a significant way. What pieces of the chain are commoditized and not commoditized, I wouldn't want to really talk about today because that gives away some things on our strategy. But I think it's a good question.\n\n0:48:30\n\nThanks, Jim.\n\n0:48:32\n\nYeah.\n\n0:48:32\n\nThank you, Krish. Operator, could we have the next question, please?\n\n0:48:39\n\nOur next question is from Samik Chatterjee with JPMorgan. Please go ahead.\n\n0:48:45\n\nHi. Thanks for taking my questions. Tim, maybe if I can start with your remarks about the pull ahead being about a one percentage point benefit here. Anything to share in terms of how what's underlying that estimate in terms of what you're seeing for? Is it a pull ahead largely on iPhones?\n\n0:49:05\n\nOr is it across the board? And is it primarily in The US or, again, sort of across multiple regions? Any color there would be helpful in terms of how you're sort of getting to that assumption there. And I have a follow-up.\n\n0:49:18\n\nIt was principally on iPhone and Mac. And it was pretty you know, it was obvious evidence of it. It was an unusual buying pattern there and that largely occurred in April toward the beginning of the quarter. And it was really we believe it was largely United States.\n\n0:49:52\n\nOkay. Okay. Got it. And maybe on the tariff front, when you gave the estimate of $900,000,000 last quarter, which came in at 800,000,000 you did highlight it was there were some unique factors in the quarter. When I take the $1,100,000,000 that you're now sort of expecting for the September quarter, and as we start to think about December, would is there anything unique in the December quarter in terms of sourcing from regions, etcetera, that would uniquely impact December just given sort of that you had highlighted that quarter to quarter or so there would be unique things?\n\n0:50:27\n\nJust curious if December looks very different from September because of any unique factors.\n\n0:50:31\n\nI would be careful about projecting based on the numbers from Q2 and Q3 because, one, we're uncertain of what the rates will be, and so the rates may change. Two, in particularly in last quarter, we had some build ahead inventory that we were that we had within the company and within our supplier within our supply chain. And so those two are a little unique. Also, as you know from following us for so long, Q1 is generally a higher volume quarter. The tariffs are currently are pretty linear with volume.\n\n0:51:36\n\nOkay. No, understood. Thank you.\n\n0:51:37\n\nYeah.\n\n0:51:38\n\nThanks for taking my questions.\n\n0:51:39\n\nAll right. Thank you, Samik. Operator, could we have the next question, please?\n\n0:51:45\n\nOur next question is from Aaron Rakers from Wells Fargo. Please go ahead.\n\n0:51:50\n\nYeah.\n\n0:51:51\n\nThanks for taking the question. I've I've got two as well, and and I'll just ask them together. I I guess the first one is just more housekeeping. Kevin, when we think about, you know, currency impact, how much of a benefit was currency this quarter? And I guess across the business and in particular, maybe on the services segment?\n\n0:52:09\n\nAnd on a year on year basis, how much currency benefit should we be thinking about embedded in the guidance into the September? And then the second quick question is CapEx is clearly moving higher. I know you guys don't guide specifically to that number. But just kind of qualitatively, should we as you lean in more on AI, should we really start to see that CapEx, which is running close to about $4,000,000,000 annualized today, really start to move appreciably higher? Any color on that would be helpful.\n\n0:52:41\n\nGreat, Aaron. Thanks for the questions. Let me answer the first one, first around foreign exchange. For Q3, we really had no impact from a foreign exchange standpoint on the year on year results. And so when we look at both the revenue growth as well as the gross margin, there was really, you know, virtually no impact from foreign exchange.\n\n0:53:01\n\nAs we look at going from Q3 to June to the September, again, very, very, as I mentioned earlier, a very small tailwind going from Q3 to Q4 from a foreign exchange standpoint on both revenue as well as gross margin. And then on the second question, sure, on the CapEx side, think I we talked about the fact that we are and Tim mentioned the fact that we are increasing our investments significantly in AI. You are going to continue to see our CapEx grow. It's not going to be exponential growth, but it is going to grow substantially. And a lot of that's a function of the investments we're making in AI.\n\n0:53:39\n\nAs we mentioned, we also have other items that fall into that category, facilities and some of our retail store investments. But I would say a lot of the growth is really being driven by AI. I would remind you that we do have a hybrid model though where we also leverage third party infrastructure in addition to investing in our own first party infrastructure.\n\n0:54:00\n\nYeah. Thank you.\n\n0:54:02\n\nThank you.\n\n0:54:03\n\nThank you, Aaron. Operator, may we have the next question please?\n\n0:54:09\n\nOur next question is from Atas Malik with Citi. Please go ahead.\n\n0:54:15\n\nHi. Thank you for taking my question. Tim, at the WWDC earlier in the quarter, you showed impressive updates on VisionPRO with the use of widgets, facial scenes, persona and new ways to create content. Appears like Meta and Xiaomi are seeing strong momentum on their AI glasses. So is the focus still around enterprises on VisionPRO, or are you thinking of broadening the use cases and maybe tying it to to to more of your devices?\n\n0:54:41\n\nAny thoughts on VisionPro as it did not get enough airtime in the prepared remarks?\n\n0:54:47\n\nYeah. Thanks thanks for bringing it up. I was thrilled with the release from the team on VisionOS 26. It includes many things in it like spatial widgets to enable users to customize their digital space. The personas took a huge increase with they're much more lifelike.\n\n0:55:09\n\nAnd, of course, there's new enterprise APIs for companies as well. And we're seeing, as Kevin talked about in his opening remarks, we're seeing those things resonate out with CAE and other customers. And so we continue to be very focused on it. And I don't want to get into the road map on it, but this is an area that we really believe in.\n\n0:55:41\n\nGreat. And Kevin, historically, guys have not done much big M and A. Do you feel like you need to accelerate your AI roadmap or just keep the organic focus?\n\n0:55:52\n\nLet me take that one as well. We've acquired around seven companies this year, and that's companies from all walks of life, not all AI oriented. And so we're doing one think of it as one every several weeks. We're very open to M and A that accelerates our road map. We are not stuck on a certain size company, although the ones that we have acquired thus far this year are small in nature.\n\n0:56:29\n\nBut we basically ask ourselves whether a company can help us accelerate a road map. If they do, then we're interested, but we don't have anything to share specifically today.\n\n0:56:46\n\nAlright. Thank you, Atif. A replay of today's call will be available for two weeks on Apple Podcasts, as a webcast on apple.com/investor, and via telephone. The number for the telephone replay is (866) 583-1035. Please enter confirmation code 6287473 followed by the pound sign.\n\n0:57:11\n\nThese replays will be available by approximately 5PM Pacific time today. Members of the press with additional questions can contact Josh Rosenstock at (408) 862-1142, And financial analysts can contact me, Suhasini Chandramali, with additional questions at (408) 974-3123. Thanks again for joining us\n\nA Silver or Gold subscription plan is required to access historical transcripts.\n\nSign in to access your portfolio",
      "fetched_at": "2026-02-03T14:51:30.418Z"
    },
    {
      "ticker": "AAPL",
      "title": "Apple Inc. (AAPL) Q4 FY2025 earnings call transcript",
      "published_date": "2026-02-03T14:51:27.535Z",
      "fiscal_year": "2025",
      "quarter": "Q4",
      "url": "https://finance.yahoo.com/quote/AAPL/earnings/AAPL-Q4-2025-earnings_call-369370.html",
      "content": "Oops, something went wrong\n\nSkip to navigation Skip to main content Skip to right column US English US y LATAM Español Australia English Canada English Canada Français Deutschland Deutsch France Français 香港 繁中 Malaysia English New Zealand English Singapore English 台灣 繁中 UK English News Finance Sports News Today's news US Politics 2025 Election World Weather Climate change Health Science Originals Newsletters Games Life Health Parenting Style and beauty Horoscopes Shopping Food Travel Autos Gift ideas Buying guides Valentine's Day gifts Entertainment Celebrity TV Movies Music How to Watch Interviews Videos Finance My portfolio Watchlists Markets News Videos Screeners Personal finance Crypto Sectors Industries Sports Fantasy Daily fantasy NFL NBA MLB NHL College football College basketball Soccer NFL Draft Yahoo Sports AM Show all New on Yahoo Creators Tech Local services Selected edition Mail Sign in Back to quote Apple Inc. (AAPL) Q4 FY2025 earnings call transcript Powered by Quartr Oct 30, 2025, 5:00 PM EDT Earnings call Apple reported Q4 FY2025 revenue of $102.5B (+8% YoY), EPS of $1.85 (+13% YoY), and record services revenue of $28.8B (+15% YoY). Management expects December quarter revenue to grow 10–12% YoY, led by iPhone and services strength. Apple reported Q4 FY2025 revenue of $102.5B (+8% YoY), EPS of $1.85 (+13% YoY), and record services revenue of $28.8B (+15% YoY). Management expects December quarter revenue to grow 10–12% YoY, led by iPhone and services strength.\n\n0:00:00\n\nAfternoon, and welcome to the Apple Q4 Fiscal Year 2025 Earnings Conference call. My name is Suhasini Chandramouli, Director of Investor Relations. Today's call is being recorded. Speaking first today is Apple's CEO, Tim Cook, and he'll be followed by CFO, Kevin Parekh. After that, we'll open the call to questions from analysts. Please note that some of the information you'll hear during our discussion today will consist of forward-looking statements, including, without limitation, those regarding revenue, gross margin, operating expenses, other income and expense, taxes, capital allocation, and future business outlook. These statements involve risks and uncertainties that may cause actual results or trends to differ materially from our forecast, including risks related to the potential impact to the company's business and results of operations from macroeconomic conditions, tariffs and other measures, and legal and regulatory proceedings.\n\n0:01:04\n\nFor more information, please refer to the risk factors discussed in Apple's most recently filed reports on Form 10-Q and Form 10-K, and the Form 8-K filed with the SEC today, along with the associated press release. Additional information will also be in our report on Form 10-K for the year ended September 27, 2025, to be filed tomorrow and in other reports and filings we make with the SEC. Apple assumes no obligation to update any forward-looking statements, which speak only as of the date they are made. Additionally, today's discussion will refer to certain non-GAAP financial measures. You can find a reconciliation of these measures in our fourth quarter earnings release, which is available on our Investor Relations website. I'd now like to turn the call over to Tim for introductory remarks.\n\n0:02:00\n\nThank you, Suhasini. Good afternoon, everyone, and thanks for joining the call. Today, Apple Inc. is proud to report $102.5 billion in revenue, up 8% from a year ago and a September quarter record. Services achieved an all-time revenue record of $28.8 billion, growing 15% from a year ago. EPS came in at $1.85, setting a September quarter record. We grew in the vast majority of markets we track and had September quarter revenue records in dozens of markets, including the U.S., Canada, Latin America, Western Europe, the Middle East, Japan, Korea, and South Asia. We also set a September quarter revenue record in emerging markets and an all-time revenue record in India. These results come at the close of an extraordinary year for Apple Inc., in which we achieved an all-time revenue record of $416 billion for the fiscal year.\n\n0:03:04\n\nWe set all-time revenue records in emerging and developed markets. We set an all-time revenue record for iPhone. In services, we achieved all-time records across every geographic segment. These results reflect the tremendous customer enthusiasm for Apple Inc. products and services, as well as our deep commitment to innovation. We are incredibly excited about the strength we're seeing across our products and services, and we expect the December quarter's revenue to be the best ever for the company and the best ever for iPhone. We are heading into the holiday season with a truly remarkable lineup that includes the biggest leap ever for iPhone, which has had a tremendous response from our users around the world. Our Apple Watch lineup is more capable than ever too, giving users ways to take charge of their health like never before through new features like hypertension notifications and sleep score.\n\n0:04:04\n\nThe next-level sound quality and active noise cancellation of AirPods Pro 3 are hitting all the right notes for our users. In October, we also broke new ground in power-efficient performance with the uncomparably fast M5 chip, packed with neural accelerators in each GPU core to supercharge AI workloads. iPad Pro combines game-changing features in iPadOS 26 with the power of M5 to create our most capable iPad ever. At the same time, the M5 MacBook Pro raises the bar for what users can do with a laptop, while the new M5-powered Apple Vision Pro opens up amazing possibilities on its infinite canvas. We also launched a beautiful new software design that creates a unified experience across all of our platforms for the very first time. The design is crafted with a new material called Liquid Glass that brings fluidity, vitality, and flexibility to our products.\n\n0:05:10\n\nAlong with the new design, we delivered powerful new features to enable users to do even more with their devices. That includes updates to the phone and messages apps in iOS 26 to help users stay connected, continuity enhancements in Mac to deliver an even more seamless experience across devices, and a powerful new windowing system that fundamentally transforms the user experience in iPadOS 26. As we continue to expand our investment in AI, we're bringing intelligence to more of what people already love about our products and services, making every experience even more personal, capable, and effortless. At the heart of it all is Apple Silicon, and we were thrilled to launch new products powered by the A19 Pro chip and M5. These incredibly advanced chips make Apple products the very best place to experience the power of AI.\n\n0:06:09\n\nWith Apple Intelligence, we've introduced dozens of new features that are powerful, intuitive, private, and deeply integrated into the things people do every day. Features like live translation, which help users communicate across languages in real time, and visual intelligence, which opens new ways to learn about and explore the world. We also introduced Workout Buddy, a new experience that uses AI to provide personalized motivational insights based on a user's workout data and fitness history. These join so many others, from cleanup in photos and new image creation tools to powerful writing tools. We're also seeing developers take advantage of our on-device foundation models to create entirely new experiences for users around the world. We're also excited for a more personalized Siri. We're making good progress on it, and as we've shared, we expect to release it next year.\n\n0:07:10\n\nNow let's take a closer look at the September quarter results across our lineup, starting with iPhone. iPhone set a revenue record for the September quarter at $49 billion, up 6% from a year ago, with growth in the vast majority of markets we track, despite supply constraints we faced on several iPhone 16 and iPhone 17 models given strong demand. Redesigned from the inside out and powered by the outstanding A19 Pro chip, the iPhone 17 Pro is by far the most powerful iPhone we've ever made, setting a whole new standard for the smartphone industry. The iPhone 17 Pro also offers our best camera system ever, with an all-new 8x telephoto camera, and looks stunning with bold new finishes like Cosmic Orange.\n\n0:08:02\n\nThe iPhone Air introduces an incredibly breakthrough design, and with a bigger and brighter display with ProMotion, the iPhone 17 is a fantastic upgrade packed with features users will love. In Mac, we had a strong September quarter with revenue of $8.7 billion, up 13% year over year, driven by the strength of the MacBook Air. The MacBook Air enables users to get things done easily on the world's most popular laptop. Mac Mini users are loving how much performance is packed into our smallest Mac ever made, while Mac Studio customers are pushing the envelope of what's possible with our most powerful Mac ever. The latest 14-inch MacBook Pro unlocks incredible speed and next-level performance with the all-new M5 chip, which delivers three and a half times faster AI performance than M4. Turning to iPad, revenue was $7 billion for the September quarter.\n\n0:09:04\n\nLast month, we released one of the most attention-grabbing software updates we've had in years with iPadOS 26, and we recently gave iPad users even more to love with the launch of the incredible M5 iPad Pro, which offers an incredible boost in AI performance. With an unmatched combination of power and versatility, the new iPad Pro makes every interaction delightful with its thin, light, and portable design. In wearables, home and accessories, revenue was $9 billion. As I mentioned earlier, we were excited to unlock new possibilities for users with the launch of our newest Apple Watch lineup, making the world's most popular watch even better. That includes Apple Watch Ultra 3 with the largest display ever in an Apple Watch, improved battery life, and emergency SOS via satellite.\n\n0:10:02\n\nApple Watch Series 11 brings our users the most comprehensive set of health features yet, and Apple Watch SE 3 delivers advanced capabilities at an incredible value. AI and advanced machine learning are at the core of powerful health features like heart rate monitoring, fall detection, crash detection, and more. With our latest Apple Watch lineup, we were proud to introduce hypertension notifications developed using large-scale machine learning models. Hypertension is one of the leading risk factors for heart attack and stroke, affecting more than 1 billion adults worldwide, and we expect to notify more than a million users of this life-threatening condition. We're also excited about SleepScore, a simple, intuitive way to help users better understand their sleep quality and discover ways to improve it. That's something I'm sure we can all benefit from. Meanwhile, AirPods Pro 3 have been a huge hit.\n\n0:11:06\n\nYou have to hear them to really understand just how remarkable they are. Users and reviewers alike are praising their incredible sound quality and improved fit. They feature the world's best in-ear active noise cancellation, removing up to two times as much noise as the previous generation. With live translation powered by Apple Intelligence, AirPods deliver an incredibly new and exciting experience for users around the world. Turning to services, as I mentioned earlier, revenue was $28.8 billion for the September quarter, 15% higher year over year and an all-time record. We saw double-digit growth in both developed and emerging markets and set new all-time records across advertising, App Store, cloud services, music, payment services, and video. Apple TV+ celebrated a big night at this year's Emmy Awards with 22 wins. The studio led the night with 13 wins, the most of any comedy series in Emmy's history.\n\n0:12:16\n\nSeverance topped all dramas with eight wins, adding to the accolades for this landmark series. To date, Apple TV+ productions have now earned over 600 wins and 2,800 nominations in total, driven by powerful, original storytelling. We're excited for audiences to discover new productions like Pluribus and to catch returning favorites like Slow Horses and The Morning Show. Soon, Apple TV+ will be the destination for F1 fans across the U.S. on track day, thanks to a new partnership with Formula One. F1 is one of the most exciting and fastest-growing sports in the world, and starting next year, Apple TV+ will be the place for subscribers to follow every twist and turn of the new season. In addition, F1: The Movie, one of the year's biggest blockbusters, will be coming to Apple TV+ on December 12th. During the September quarter, we also marked the 10-year anniversary of Apple News.\n\n0:13:23\n\nApple News provides access to front-page news from all around the world, putting hundreds of publications right at users' fingertips. Turning to retail, we're heading into our busiest time of year with our best-ever lineup. In the last few months, we've opened new stores in emerging markets like India and the UAE and new locations in the U.S. and China. I was also in Tokyo last month for the opening of the redesigned and reimagined Apple Ginza store, and the energy among the crowd was truly remarkable. When it originally opened, it was our first store outside the U.S., and so it was especially meaningful to come back to welcome customers to the beautiful new space.\n\n0:14:10\n\nEverywhere we operate and in everything we do, we strive to give the best to our users while living by our values, whether that's building new accessibility features into our most recent software releases, advancing our environmental work by using even more recycled materials in our latest lineup, or providing free educational programming to train and support American businesses with our new Apple Manufacturing Academy in Detroit. We're continuing to invest in innovation and user experiences that will transform our future. A great example is the work we're doing in the U.S., where we're committed to invest $600 billion over the next four years with a focus on innovation in strategic areas like advanced manufacturing, silicon engineering, and artificial intelligence. These commitments build on our longstanding investments in America while supporting more than 450,000 jobs with thousands of suppliers across all 50 states.\n\n0:15:14\n\nWe built a new factory in Houston for advanced AI service, for example, which just started shipping its first products off the line, and we're leading the creation of end-to-end silicon supply chain across the country. In recent months, I've connected with developers, innovators, artists, entrepreneurs, and so many others around the world, people passionate about innovation and all the things they can do with Apple products. Each one is another reminder of why we do what we do. We're driven to empower people to do more of the things that matter most to them and enrich their lives along the way. As we head into the holiday season with our most powerful lineup ever, I couldn't be more excited for what's to come. With that, I'll turn it over to Kevin.\n\n0:16:03\n\nThanks, Tim, and good afternoon, everyone. Our revenue of $102.5 billion was up 8% year over year and is a new September quarter record. We set September quarter records in the Americas, Europe, Japan, and the rest of Asia-Pacific, and grew in the vast majority of markets we track. Products revenue was $73.7 billion, up 5% year over year, driven by growth across iPhone and Mac, and reached a September quarter record. Thanks to our exceptional customer satisfaction and strong levels of loyalty, our install base of active devices has reached another all-time high across all product categories and geographic segments. Services revenue was $28.8 billion, up 15% year over year, and an all-time record. The performance was broad-based, with double-digit growth in the vast majority of the markets we track and double-digit growth across most of our services categories.\n\n0:17:03\n\nCompany gross margin was 47.2%, above the high end of our guidance range and up 70 basis points sequentially, driven by favorable mix. This includes approximately $1.1 billion of tariff-related costs, which is in line with what we had estimated on our last call. Products gross margin was 36.2%, up 170 basis points sequentially, driven by favorable mix. Services gross margin was 75.3%, down 30 basis points sequentially. Operating expenses landed at $15.9 billion, up 11% year over year, driven by increased investment in R&D. These strong levels of business performance led to September quarter records for both net income and diluted earnings per share. Net income was $27.5 billion. Diluted earnings per share was $1.85, up 13% year over year on an adjusted basis, excluding the one-time charge we recognized during the fourth quarter of 2024. Operating cash flow was also a September quarter record at $29.7 billion.\n\n0:18:15\n\nNow, I'm going to provide some more details for each of our revenue categories. iPhone revenue was $49 billion, up 6% year over year, driven by the iPhone 16 family. iPhone grew in the vast majority of the markets we track, with September quarter records in many emerging markets, including Latin America, the Middle East, and South Asia, and an all-time record in India. The iPhone active install base grew to an all-time high, and we set a September quarter record for upgraders. According to the recent survey from World Panel, iPhone was a top-selling model in the U.S., urban China, the UK, France, Australia, and Japan. We continue to see very high levels of customer satisfaction in the U.S. at 98%, as measured by 451 Research. Mac revenue was $8.7 billion, up 13% year over year, driven by MacBook Air.\n\n0:19:13\n\nWe grew in every geographic segment with strong double-digit growth in emerging markets. The Mac install base reached another all-time high, with nearly half of customers who purchased a Mac being new to the product. The latest customer satisfaction for Mac in the U.S. was reported at 96%. iPad revenue was $7 billion, flat year over year. Keep in mind we faced a difficult compare against the full quarter impact of the iPad Air and iPad Pro launch from last year, offset by the better-than-expected performance on the iPad. The install base reached an all-time high, with a September quarter record for upgraders, and over half of the customers who purchased an iPad during the quarter were new to the product. Based on the latest reports from 451 Research, customer satisfaction was 98% in the U.S. Wearables, home, and accessories revenue was $9 billion, flat year over year.\n\n0:20:11\n\nThis was driven by growth on Watch and AirPods, offset by accessories, which was impacted by strong performance in the year-ago quarter, driven by the iPad launches. Both the Apple Watch and AirPods install bases reached new all-time highs. Over half of the customers purchasing an Apple Watch during the quarter were new to the product. We also set a September record for upgraders on Apple Watch. In the U.S., customer satisfaction was recently measured at 95%. Our services revenue reached an all-time high of $28.8 billion, up 15% year over year. We achieved all-time revenue records in the Americas, Europe, Japan, and rest of Asia-Pacific, as well as a September quarter record in Greater China.\n\n0:20:58\n\nThe majority of categories saw a sequential acceleration, and as Tim mentioned, we set many all-time revenue records, including payment services, where we reached an all-time revenue record and saw double-digit growth year over year on Apple Pay active users. This strong momentum in the September quarter drove our total fiscal year services revenue to surpass $100 billion, up 14% year over year and our best ever. The growth of our install base of active devices continues to offer us great opportunities for the future. Customer engagement across our services offerings also continued to grow. Both transacting and paid accounts reached new all-time highs. We continue to improve the quality and expand the reach of our services offerings, from additional markets for Apple Pay, now available in nearly 90 countries, to Apple Care One, a great new way to cover multiple Apple products in a single plan.\n\n0:21:53\n\nTurning to enterprise, we are seeing an adoption of Apple products accelerate across industries to improve productivity and drive innovation. The BMW Group has been deploying tens of thousands of iPhones, including to factory employees, to further strengthen its digital capabilities and advanced innovation at the company. Capital One has expanded its Mac Choice program by adding thousands more MacBook Airs across its workforce. In the Czech Republic, its largest bank, Česká Spořitelna, continues to invest in the Apple ecosystem with over 5,000 iPhones in addition to its existing thousands of iPads and Macs. Purdue University has launched a spatial computing hub built around Apple Vision Pro, designed to help prepare students to lead the next wave of innovation in critical industries like semiconductor and pharmaceutical manufacturing. Let's turn to our cash position and capital return program. We ended the quarter with $132 billion in cash and marketable securities.\n\n0:22:55\n\nWe had $1.3 billion of debt maturities and decreased commercial paper by $1.9 billion, resulting in $99 billion in total debt. Therefore, at the end of the quarter, net cash was $34 billion. During the quarter, we returned $24 billion to shareholders. This included $3.9 billion in dividends and equivalents and $20 billion through open market repurchases of 89 million Apple shares. Taking a step back, we are very pleased with our record fiscal year 2025 results. As Tim Cook mentioned, total company revenue for the year was $416 billion, with growth in iPhone, Mac, iPad, and services, and all-time records in the vast majority of markets we track. This revenue performance led to very strong full-year operating results, with all-time records for net income and for diluted EPS, which grew double digits year over year on an adjusted basis.\n\n0:23:56\n\nAs we move ahead into the December quarter, I'd like to review our outlook, which includes the types of forward-looking information Suhasini referred to. Importantly, the color we're providing assumes that the global tariff rates, policies, and application remain in effect as of this call, and the global macroeconomic outlook does not worsen from today. We expect our December quarter total company revenue to grow by 10% to 12% year over year, which would be our best quarter ever. We expect iPhone revenue to grow double digits year over year, which would be our best iPhone quarter ever. On Mac, keep in mind we expect to face a very difficult compare against the M4 MacBook Pro, Mac Mini, and iMac launches in the year-ago quarter. We expect services revenue to grow at a year-over-year rate similar to what we reported in the fiscal year 2025.\n\n0:24:50\n\nWe expect gross margin to be between 47% and 48%, which includes an estimated impact of $1.4 billion of tariff-related costs. As we've said before, we are significantly increasing our investments in AI while continuing to invest in our product roadmap. For the December quarter, we expect operating expenses to be between $18.1 billion and $18.5 billion. We expect OI&E to be around $150 million, excluding any potential impact from the mark-to-market of minority investments, and our tax rate to be around 17%. Today our board of directors has declared a cash dividend of $0.26 per share of common stock payable on November 13, 2025, to shareholders of record as of November 10, 2025. With that, let's open the call to questions.\n\n0:25:44\n\nThank you, Kevin. We ask that you limit yourself to two questions. Operator, may we have the first question, please?\n\n0:25:51\n\nCertainly. We will go ahead and take our first question from Eric Woodring with Morgan Stanley. Please go ahead.\n\n0:26:00\n\nHey, good afternoon, guys. Thank you for taking my question. Congrats on the results. Tim, can you maybe share a bit more detail on why you think the iPhone 17 is having the degree of success that it is at this point? The question is, do you believe this is the age install base replacement cycle kicking in, or are there specific features or functionality you believe stand out this cycle versus past cycles that consumers are really looking for? Just a quick follow-up, thanks.\n\n0:26:31\n\nEric, thanks for your comments. I think it's all about the product. The product lineup is incredibly strong. They're strongest ever. The 17 Pro is the most pro phone we've ever done. It's incredible in the design. The iPhone Air feels so thin and so light in your hand, it feels like it's going to fly away. The 17 phone is an incredible value and takes several of the features that were reserved for Pro before and brings them down to the consumer lineup. Overall, strongest iPhone lineup ever, and it's resonating around the world.\n\n0:27:18\n\nGreat. Thank you. Thank you, Tim. Maybe a follow-up for you, Kevin. Can you just discuss your approach to managing component cost inflation during this time? You're obviously increasing the memory content in your devices quite substantially. At the same time, memory prices are going through some pretty significant inflation. Just how are you managing through this cycle? Thanks so much, guys.\n\n0:27:44\n\nYeah. Hey, Eric, thanks for the question. Look, as you know, we've got a pretty incredible world-class procurement team, and we're constantly finding ways to continue to drive cost opportunities.\n\n0:27:56\n\nRight now, on the commodity side, I would say we're seeing a slight tailwind on memory and storage prices, so nothing really to note there. As we saw from our gross margin performance, we landed in a pretty good spot above the high end of the guidance range we provided at 47.2%. As well, we're guiding at 47% to 48%. I think we're managing costs pretty well. As you'll recall, when we talk about this time in the cycle, we just launched a bunch of new products. Those new products do have a slightly higher cost structure than the products they replace, but the team does a very good job of focusing our efforts on getting those costs down over time. We feel pretty good about the performance we're seeing right now overall on material cost savings.\n\n0:28:35\n\nGreat. Thanks so much. Good luck, guys.\n\n0:28:39\n\nAll right.\n\n0:28:39\n\nThank you.\n\n0:28:39\n\nThanks, Eric. Operator, can we get the next question, please?\n\n0:28:42\n\nOur next question is from Ben Ricey with Melius Research. Please go ahead.\n\n0:28:49\n\nHey, guys. Thanks for this. Tim, can you talk a little bit about iPhone in China specifically? How is that going to trend in the December quarter? Have you turned the corner there, and how do you think that trajectory is going? I have a quick follow-up. Thanks.\n\n0:29:07\n\nYeah. Ben, I was just there. It's incredibly vibrant and dynamic. The store traffic is up significantly year over year. The iPhone 17 family has been very well received there. We do believe that we'll return to growth in Q1, and that is largely based on the reception of the iPhone there. I couldn't be more pleased with how things are going there in the early going.\n\n0:29:41\n\nAll right. That's great. Services, great upside there. A little surprising, right? We were a little worried about that one only a few quarters ago. I was wondering if there were any tax payments in there or if the resolution that we saw with the antitrust ruling with one of your partners was a boost and if that played a role or if it was all really just organic outperformance with many of the things you mentioned. Thanks.\n\n0:30:14\n\nYeah. Hey, Ben. It's Kevin here. Let me try to answer that question. You're referring, just wanted to clarify. When you're referring to the antitrust piece, you're talking about the Google trial. Is that what you're referring to?\n\n0:30:24\n\nYes, sir.\n\n0:30:26\n\nThere was no tax-related impact. What I would say is our strong performance for the quarter is really organically driven. Just to reiterate, we had an all-time revenue record here for the quarter at $28.8 billion. As well, we surpassed $100 billion, so best year ever at 14% YoY. That was all organic growth. As Tim outlined and I outlined in the prepared remarks, we saw a majority of the categories have sequential acceleration, and we had many all-time revenue records, but nothing abnormal at all, really pretty much all organic growth.\n\n0:31:00\n\nThank you.\n\n0:31:02\n\nThanks, Ben. Operator, could we get the next question, please?\n\n0:31:07\n\nOur next question is from Michael Ng. Please go ahead.\n\n0:31:14\n\nHi. Good afternoon. Thank you for the question. I just have two as well. First, just to follow up on the last one. The services revenue growth, I think, was the fastest across many categories and certainly the fastest in the last two years. I was just wondering if you could just unpack a little bit more of the drivers of the acceleration. Was there kind of cross-selling with the new iPhone launch? Was it just installed base growth? I know you've been doing a lot of bundling with Apple One and Apple Care One. Any thoughts on that would be very helpful. I just have a quick follow-up. Thank you.\n\n0:31:54\n\nHi, Michael. It's Kevin. Thanks for the question. Let me build on the answer there. I think that the way we look at it is not one thing to point to that would have driven this higher performance. You're right that it is slightly higher than we've seen in the last few quarters. As you know, our services portfolio is very broad with a broad range of businesses. All have different growth profiles and different performance characteristics, so those can vary in any given quarter. I would say our strength, again, was very broad-based, both across categories and also geographically. I wouldn't point to any particular factor that drove any kind of outperformance at all. We were just very pleased to see that result.\n\n0:32:32\n\nGreat. Thank you. Just on iPhone sell-through, I was wondering if you were seeing any notable shifts in trends between the sell-through coming from upgraders versus switchers. Is the U.S. carrier competitive dynamic helping at all in terms of promotional activity? Any thoughts on channel inventory? Thank you.\n\n0:33:00\n\nWe did set a September quarter record for upgraders, and it was a great quarter from that point of view. It's really too early in the cycle on 17 to make any comments about upgraders or switchers. In terms of channel inventory, we ended the quarter toward the low end of the targeted range, obviously because we had constraints on several models of the 16 and the 17. For complete transparency and clarity, we're constrained today on several models of the iPhone 17. There's not a ramp issue. We just have very strong demand, and we're working very hard to fulfill all the orders that we have.\n\n0:33:59\n\nThank you, Tim. Thank you, Kevin.\n\n0:34:01\n\nThank you.\n\n0:34:02\n\nThanks, Mike. Operator, could we get the next question, please?\n\n0:34:05\n\nOur next question is from Amit Daryanani with Evercore. Please go ahead.\n\n0:34:12\n\nThanks a lot. I have two as well. Kevin, maybe just to start with gross margins, can you walk through the expectations for December quarter? I think it implies up 30 basis points or so sequentially. Can you talk about the percentage on gross margin given you do have very sizable operating leverage in the quarter? What are the percentages around that would be really helpful.\n\n0:34:33\n\nYeah, sure. Let me walk through the outlook. As we mentioned in our outlook, we're targeting a range of 47% to 48%. We take the midpoint of that range at 47.5%. You said it's roughly 25 basis points, 30 basis points higher. There are a lot of percent takes, as I talked about earlier. This is a quarter we launched with a lot of new products. Those new products tend to have a higher cost structure than the products they replace, so there's definitely an impact from the cost side of things, but that was more than offset by favorable mix, especially on the product side. As you outlined, we typically see higher leverage in this quarter. I would say those are the two big drivers, and the sequential increase is really going to be driven by favorable mix, particularly from the product side.\n\n0:35:16\n\nGot it. If I go back to the China discussion for a minute, the performance in China, at least in September quarter, was a bit muted. Could you talk about what resulted in the weakness over there? Do you think it was a bit more of a pause given iPhone Air, for example, I don't think was available until a few weeks ago? Just talk about what drove the weakness in September, and is the uptick or better expectations for December there just from the iPhone Air coming out, or are there other factors as well? Thank you.\n\n0:35:45\n\nYeah. The Greater China revenue was down 4% year over year in the September quarter. It was driven by iPhone. If you look at the iPhone, the majority of the sequential year-over-year change was due to supply constraints that I mentioned earlier. It was basically supply constraints that drove the results. We're thrilled with what we're seeing right now, with traffic being up significantly year over year and the reception of the iPhone 17 family. We expect to return to growth this quarter.\n\n0:36:24\n\nGreat. Thank you.\n\n0:36:29\n\nThank you.\n\n0:36:30\n\nThanks, Amit. Operator, could we have the next question, please?\n\n0:36:35\n\nOur next question is from Wamsi Mohan with Bank of America. Please go ahead.\n\n0:36:41\n\nYes. Thank you so much. Tim, I'd probably follow up on your comments about the constrained supply in the quarter, just given the very strong demand for iPhones. Do you expect that, as you can see your visibility across demand and supply, do you think that you will be exiting December at a point where you wouldn't be constrained anymore, or do you still expect that there could be constraints as you exit the December quarter? Any way to quantify sort of what revenue could have been, a bit of a follow-up to Ben's question. Given that there are some concerns around search volumes decelerating at the expense of AI, how do you think about the broader sustainability of these very strong mid-teens growth rates for services for an extended period of time, not just for next quarter where you're obviously guiding to 14%?\n\n0:37:32\n\nThis is Tim. The advertising category, which is a combination of third-party and first-party, did set a record during the quarter. Okay. Sorry, just to be clear, both Apple's own internal advertising and within the licensing individually set records? Actually, I'm not saying that. I'm just saying that the combination of the two set a record. I'm dodging the question intentionally because we don't split it at that level.\n\n0:38:11\n\nOkay. Okay. Understood. Thank you.\n\n0:38:15\n\nYeah. Thank you.\n\n0:38:16\n\nAll right. Thank you, Wamsi. Operator, could we get the next question, please?\n\n0:38:21\n\nOur next question is from Samik Chatterjee with JPMorgan. Please go ahead.\n\n0:38:28\n\nHi, Mel. Thanks for taking my question. Maybe for the first one, Tim, you talked about the strong momentum you're seeing in China, which is also driving your confidence for the December quarter. Any thoughts on the role that the smartphone subsidies in that region are playing in this momentum? How do you think about sort of what portion of consumers are maybe using some of those subsidies, leveraging the subsidies at this point? Any more insights into that? I have a follow-up. Thank you.\n\n0:38:54\n\nYeah. The subsidies play a favorable role. The subsidies, as you know, are sort of across multiple categories from PCs to tablets to smartwatches and smartphones. However, it's important to note they only apply to certain price ranges. There's a maximum price, and there's several of our products that sell above that price and therefore are not eligible for a subsidy. It does have a favorable effect, and it's clearly, at least from our vantage point, driving some consumer demand.\n\n0:39:42\n\nOkay. Got it. A follow-up for Kevin here on the OpEx increase going into the December quarter, fairly sizable step up. If you could just dig into that number a bit more, what are sort of the components towards what you're spending? That increase year over year in OpEx does sort of exceed your revenue growth. Is that sort of what we should expect on a going-forward basis as well, where you probably need to invest a bit more in the near future? Thank you.\n\n0:40:13\n\nYeah. Samik, thanks for that question. As we've been outlining and reiterated in our last call, we are increasing our investments in AI. We'll also continue to invest in our product roadmap. The vast majority of the increase to our operating expenses are driven by R&D. While we continue to manage the company in a thoughtful and disciplined way, we're also managing the business for the long term and are super excited about all the opportunities we see ahead. As it relates to the question around OpEx and revenue growth, while OpEx has been growing at a faster rate than revenue, we have seen gross margin expansion. When we look at that on a combined basis, it does allow us to have healthy operating leverage, and our operating income growth has been generally outpacing revenue growth for the past several years.\n\n0:40:57\n\nClear. Thank you. Thanks a lot.\n\n0:41:01\n\nAwesome. Thank you, Samik. Operator, could we get the next question, please?\n\n0:41:06\n\nOur next question is from David Vogt with UBS. Please go ahead.\n\n0:41:12\n\nGreat. Thanks, guys, for taking my questions. Maybe, Kevin, can I ask first, can you help us understand the tariff impact sequentially from the September quarter to the December quarter, particularly around iPhone supply constraints? I think I heard you say tariffs go from $1.1 billion to $1.4 billion, but the sequential uplift in iPhone revenue and presumably production, given supply chain constraints, is dramatically bigger. Can you help us understand how to think about the timing of those tariff headwinds as we move forward and that correlation? I have a follow-up.\n\n0:41:45\n\nDavid, I'll take this one. You're right. It goes from $1.1 billion to a projection of $1.4 billion. The $1.4 billion is based on what we know right now and where the tariff rates and policies are. It assumes a stable kind of environment for the quarter. It does comprehend the change that was just made, which we're very encouraged to see, with the tariffs moving from 20% to 10% in China. That is factored in, and that is one of the reasons why it's not linear to volume, if you will. Does that make sense?\n\n0:42:38\n\nGot it. No, that's helpful. That's what I was asking, if the change is reflected in that outlook. As a follow-up, when you think about, I think on the Mac, I know people aren't asking about it, you talked about the tough comp, you're going into a holiday season. I understand that. When you think about the attached possibility for other products to the iPhone in the holiday season, how do we think about where the consumer's head is at and their wallet is at this point in the cycle? Granted, it is a tough comp, but is there an opportunity to see some upside from an attached rate perspective given the strength of the iPhone portfolio?\n\n0:43:10\n\nWe always like to remind people that by an iPhone, all the other things that we offer. You can bet that we're doing that. From a Mac point of view, the challenge is that last year was the mother of all Mac launches. All of these, from Mac Mini to iMac to all the MacBook Pros, all launched literally at the same time. This year, that compares to launching the 14-inch MacBook Pro, so there's a very difficult compare. Of course, in the long run, I'm very bullish on the Mac. You can see that the Mac, again, last quarter outgrew the market. We feel really well about how Mac is positioned, but this certain quarter is an extremely difficult compare.\n\n0:44:15\n\nTim, I'll add to that that we also had the DRAM upgrades last year for the Mac lineup, which also was another factor.\n\n0:44:21\n\nGreat. Thanks, Tim. Thanks, Kevin.\n\n0:44:24\n\nYeah. Sure.\n\n0:44:25\n\nAwesome. Thank you, David. Operator, could we get the next question, please?\n\n0:44:29\n\nOur next question is from Krish Sankar with TD Cowan. Please go ahead.\n\n0:44:37\n\nYeah. Thanks for taking my question. My first one is on the iPhone constraints. Is it a way to quantify how much business you left on the table because of those constraints? Is the different iPhone manufacturing from two different regions contributing to the constraint? I have a follow-up for you.\n\n0:44:55\n\nTo be clear, the constraint was not related to manufacturing capacity per se. It was that we called the number of iPhone 16s that we were going to make and were a bit short of where the demand really was. We could have sold more. We're not, publicly at least, estimating the extent of that. On iPhone 17 family, the demand is very strong. We obviously came out of the Q4 timeframe with lots of backorders.\n\n0:45:40\n\nGot it. Thanks for that, Tim. A quick follow-up. Given the prevalence of chatbots and now some of these AI-infused web services, do you think that could change the consumer behavior on mobile app ecosystems? Are you seeing any of that? Would that have any impact on your App Store?\n\n0:46:05\n\nI think there are opportunities on the App Store with artificial intelligence. As we have made our on-device models available for developers, we've seen developers begin to adopt them. As that proliferates, there's an opportunity for developers and for Apple to benefit from that, from adding features to their apps and so forth.\n\n0:46:40\n\nThanks a lot, Tim. Appreciate it.\n\n0:46:44\n\nYeah. Thank you.\n\n0:46:45\n\nThanks, Krish. Operator, could we get the next question, please?\n\n0:46:49\n\nOur next question is from Aaron Rakers with Wells Fargo. Please go ahead.\n\n0:46:56\n\nYeah. Thanks for taking the question. I have two as well. I guess the first question is, when we look at the iPhone 17 demand, which you've repeatedly highlighted as very strong, I'm curious if there's been any discernible kind of change in the mix within the iPhone 17 categories between the Pro and the Pro Max versions relative to prior cycles?\n\n0:47:15\n\nIt's really too early to call the mix, to be honest. We don't like to publicly disclose that for competitive reasons. Frankly, we don't really know what the mix will be yet because we have constraints on both sides of the ledger, at the top and at the entry. We'll see what happens as we get more supply.\n\n0:47:46\n\nAs a quick follow-up, I'm curious as we work through the AI narrative that continues to build. Could you provide any updated thoughts around the buildout of Apple's Private Cloud Compute and how we should think about that as we look forward?\n\n0:48:02\n\nWe're obviously using PCC, our Private Cloud Compute, today for a number of queries for Siri, and we will continue to build it out. In fact, the manufacturing plant that makes the servers used for Apple Intelligence just started manufacturing in Houston a few weeks ago, and we've got a ramp planned there for use in our data centers. It's robust.\n\n0:48:42\n\nAaron, I'll add maybe there too, since you asked the question about Private Cloud Compute, that in 2025, we did have CapEx costs associated with building out our Private Cloud Compute environment in our first-party data centers. You would have seen that in some of the CapEx investment in the year.\n\n0:48:58\n\nThank you.\n\n0:49:01\n\nThank you.\n\n0:49:03\n\nThanks, Aaron. Operator, could we get the next question, please?\n\n0:49:06\n\nOur next question is from Optus Malik with CITI. Please go ahead.\n\n0:49:12\n\nHi. Thank you for taking my questions and great execution. The first question is on iPhone Air. Does the consumer reception on iPhone Air give you a feel on perhaps the foldable phone market, or are the two form factors very different?\n\n0:49:27\n\nI'm not sure that one is a proxy for the other. The thing that I would say is that where we don't get into the model kind of demand, at the aggregate level, we are thrilled with how iPhone has been received, and that's the reason that we're expecting double-digit growth in the current quarter.\n\n0:49:52\n\nGreat. Tim, as a follow-up, good to know that the personalized Siri is making good progress and on track for next year. Will you continue to use a three-pronged approach with your own foundation models and partner with other LLM providers and maybe potential M&A, or is one strategy more emphasized over another?\n\n0:50:14\n\nWe're obviously creating Apple foundation models within Apple. We ship them on-device and use them in the Private Cloud Compute as well, and we've got several in development. We also continually surveil the market on M&A and are open to pursuing M&A if we think that it will advance our roadmap.\n\n0:50:52\n\nThank you.\n\n0:50:55\n\nYep. Thank you.\n\n0:50:56\n\nThanks, Optus. Operator, can we get our last question, please?\n\n0:51:00\n\nOur last question is from Richard Kramer with Array Research. Please go ahead.\n\n0:51:08\n\nThank you very much. Tim, we've often seen Apple be a fast follower with iPhone and new technology, whether large displays or 4G or 5G. With all the hype now around AI, are you seeing evidence that AI capabilities or features are a material purchase consideration for consumers, or are the record sales levels you're reporting simply reflecting other factors like the retention of your iOS base?\n\n0:51:36\n\nI think that there are many factors that influence people's purchasing considerations. We don't have a great in-depth survey yet on the current iPhone 17 because it's very new in the cycle, and we give it some time to formulate. I would say that Apple Intelligence is a factor, and we're very bullish on it becoming a greater factor. That's the way that we look at it.\n\n0:52:16\n\nOkay. Thanks. One for Kevin. In the wake of nearly every other large tech company massively increasing their CapEx in advance of AI demand and also mentioning that there's scarce capacity, do you anticipate Apple altering its sort of long-standing hybrid approach to your own and third-party data centers? Maybe can you talk a little bit about the role you see for Apple Silicon with the new M5 series of chipsets?\n\n0:52:44\n\nHi, Richard. Thanks for the question. In general, I think, as we've talked about before, we are expecting increases in our CapEx spending related to AI investments. For example, as I mentioned earlier, we did end up having investments this year to build out our Private Cloud Compute environment. We do believe this hybrid model has served us very well, and we continue to want to leverage it.I don't see us moving away from this hybrid model where we leverage both first-party capacity as well as leverage third-party capacity. We'll continue to want to build out Private Cloud Compute, as Tim outlined, as we have more usage there over time. In general, we'll want to continue to have this hybrid model.\n\n0:53:23\n\nOkay. Thanks.\n\n0:53:27\n\nThanks, Richard. A replay of today's call will be available for two weeks on Apple Podcasts as a webcast on apple.com/investor and via telephone. The number for the telephone replay is 866-583-1035. Please enter confirmation code 0689794 followed by the pound sign. These replays will be available by approximately 5:00 P.M. Pacific Time today. Members of the press with additional questions can contact Josh Rosenstock at 408-862-1142. Financial analysts can contact me, Suhasini Chandramouli, with additional questions at 408-974-3123. Thanks again for joining us.\n\n0:54:14\n\nThis does conclude today's conference. We do appreciate your participation.\n\nA Silver or Gold subscription plan is required to access historical transcripts.\n\nSign in to access your portfolio",
      "fetched_at": "2026-02-03T14:51:27.542Z"
    },
    {
      "ticker": "AAPL",
      "title": "Apple Inc. (AAPL) Q1 FY2026 earnings call transcript",
      "published_date": "2026-02-03T14:51:24.531Z",
      "fiscal_year": "2026",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/AAPL/earnings/AAPL-Q1-2026-earnings_call-406161.html",
      "content": "Oops, something went wrong\n\nSkip to navigation Skip to main content Skip to right column US English US y LATAM Español Australia English Canada English Canada Français Deutschland Deutsch France Français 香港 繁中 Malaysia English New Zealand English Singapore English 台灣 繁中 UK English News Finance Sports News Today's news US Politics 2025 Election World Weather Climate change Health Science Originals Newsletters Games Life Health Parenting Style and beauty Horoscopes Shopping Food Travel Autos Gift ideas Buying guides Valentine's Day gifts Entertainment Celebrity TV Movies Music How to Watch Interviews Videos Finance My portfolio Watchlists Markets News Videos Screeners Personal finance Crypto Sectors Industries Sports Fantasy Daily fantasy NFL NBA MLB NHL College football College basketball Soccer NFL Draft Yahoo Sports AM Show all New on Yahoo Creators Tech Local services Selected edition Mail Sign in Back to quote Apple Inc. (AAPL) Q1 FY2026 earnings call transcript Powered by Quartr Jan 29, 2026, 5:00 PM EST Earnings call Apple posted its best-ever quarter with $143.8B in revenue (+16% YoY) and record EPS of $2.84 (+19% YoY), fueled by a 23% surge in iPhone sales and 14% growth in services. Management guided for 13%-16% revenue growth in Q2 despite supply constraints and rising memory prices. Apple posted its best-ever quarter with $143.8B in revenue (+16% YoY) and record EPS of $2.84 (+19% YoY), fueled by a 23% surge in iPhone sales and 14% growth in services. Management guided for 13%-16% revenue growth in Q2 despite supply constraints and rising memory prices.\n\n0:00:00\n\nGood afternoon, and welcome to the Apple Q1 Fiscal Year 2026 earnings conference call. My name is Suhasini Chandramouli, Director of Investor Relations. Today's call is being recorded. Speaking first today is Apple CEO, Tim Cook, and he'll be followed by CFO, Kevan Parekh. After that, we'll open the call to questions from analysts. Please note that some of the information you'll hear during our discussion today will consist of forward-looking statements, including, without limitation, those regarding revenue, gross margin, operating expenses, other income and expense, taxes, capital allocation, and future business outlook. These statements involve risks and uncertainties that may cause actual results or trends to differ materially from our forecast, including risks related to the potential impact to the company's business and results of operations from macroeconomic conditions, tariffs and other measures, and legal and regulatory proceedings.\n\n0:01:08\n\nFor more information, please refer to the risk factors discussed in Apple's most recently filed reports on Form 10-Q and Form 10-K, and the Form 8-K filed with the SEC today, along with the associated press release. Additional information will also be in our report on Form 10-Q for the quarter ended December 27, 2025, to be filed tomorrow, and in other reports and filings we make with the SEC. Apple assumes no obligation to update any forward-looking statements, which speak only as of the date they are made. I'd now like to turn the call over to Tim for introductory remarks.\n\n0:01:52\n\nThank you, Suhasini. Good afternoon, everyone, and thanks for joining the call. I am proud to say that we just had a quarter for the record books. We are reporting our best-ever quarter with $143.8 billion in revenue, up 16% from a year ago and exceeding our expectations. The demand for iPhone was simply staggering, with revenue growing 23% year-over-year and all-time records across every geographic segment. Services set an all-time revenue record as well, up 14% from a year ago, and EPS reached an all-time record of $2.84, growing a robust 19% year-over-year. We set all-time revenue records in the Americas, Europe, Japan, and rest of Asia Pacific, and grew in the vast majority of markets we track.\n\n0:02:48\n\nWe continue to gain momentum in emerging markets, which includes India, where we saw strong double-digit revenue growth. Greater China also grew 38% year-over-year, driven by iPhone, which had record upgraders and double-digit growth on switchers. Apple's December quarter results underscore our relentless commitment to innovation, to our customers, and to our mission to build the best products and services in the world. Now I'd like to take a closer look at results from across our lineup, beginning with iPhone. As I mentioned earlier, it was a fantastic quarter for iPhone, with an all-time revenue record of $85.3 billion, up 23% year-over-year. This is the strongest iPhone lineup we've ever had, and by far the most popular. Throughout the quarter, customer enthusiasm for iPhone was simply extraordinary. Users were incredibly excited about everything it enables them to do.\n\n0:03:56\n\niPhone 17 Pro and 17 Pro Max deliver the ultimate iPhone experience. They feature the best-ever performance and battery life on an iPhone, the most advanced camera system, and a striking design. iPhone Air, our slimmest and lightest smartphone yet, packs powerful capabilities into an ultra-slim and sleek design. iPhone 17 is a truly fantastic upgrade and an incredible value. Turning to Mac, revenue was $8.4 billion for the December quarter. We were pleased to see the Mac install base reach another all-time high, with nearly half of customers who purchased a Mac being new to the product. The M5-powered 14-inch MacBook Pro takes a huge leap in AI performance, thanks to the next-generation GPU architecture and a faster Neural Engine.\n\n0:04:53\n\nFrom the world's most popular laptop for consumers and businesses in MacBook Air to the small and spectacular Mac Mini, every Mac in our lineup has something special to offer users. And with the recently released Apple Creator Studio, available across Mac, iPad, and iPhone, creators have more tools at their fingertips to make incredible music or turn their devices into a video production studio. Meanwhile, iPad saw December quarter revenue of $8.6 billion, up 6% from a year ago, with an all-time record for upgraders. We are proud to have our strongest lineup ever, from iPad powered by A16, which is proving to be incredibly popular, to iPad Air, with its amazing versatility, to the unbelievably powerful M5 iPad Pro, with its remarkably thin and light design. It's no wonder that iPad continued to be the most popular tablet in the world.\n\n0:05:58\n\nAcross wearables, home, and accessories, revenue was $11.5 billion. With Apple Watch Ultra 3 and Apple Watch Series 11, users are tapping into a comprehensive set of health and wellness features to help them meet their health goals. In a recent survey, we see an increasing number of users telling us they're wearing their Watch to sleep, which allows them to check their sleep scores each morning and find ways to improve their sleep quality. Apple Watch alerts are enabling important conversations between users and their doctors regarding potential signs of hypertension. These are just some of the many ways that Watch is helping people live healthier lives. The response to AirPods Pro 3 has been amazing. Customers are raving about the rich, immersive sound quality, the unmatched level of active noise cancellation, and the noticeably improved comfort that makes them effortless to wear.\n\n0:06:59\n\nFeatures like Live Translation are also changing the way people can communicate by helping users connect across languages in real time and making everyday conversations feel more natural and accessible. Together, these innovations create an experience that feels both powerful and personal, and the enthusiasm we are seeing reflects just how strongly AirPods Pro 3 are resonating with customers. Across our product categories, we are seeing very high levels of customer satisfaction, and we are proud to report that we have a new record for our installed base, with more than 2.5 billion active devices. During the quarter, we were excited to see that the majority of users on enabled iPhones are actively leveraging the power of Apple Intelligence. Since the launch of Apple Intelligence, we've introduced dozens of features, including writing tools and cleanup, and made it available in 15 languages.\n\n0:08:01\n\nThese AI experiences are personal, private, integrated across our platforms, and relevant to what our users do every day. We are bringing intelligence to more of what people already love about our products, so we can make every experience even more capable and effortless. One of our most popular features is Visual Intelligence, which helps users learn and do more than ever with the content on their iPhone screen, making it faster to search, take action, and answer questions across their apps. And as I touched on earlier, we are hearing powerful stories of people using Live Translation to communicate seamlessly across languages. And these are just some of the many powerful AI features that are enabling our users to do remarkable things with our products, which are far and away the best platforms in the world for AI.\n\n0:08:56\n\nThat's in no small part because of the extraordinary power and performance of Apple Silicon. Building on our efforts in the AI space, we are also collaborating with Google to develop the next generation of Apple Foundation Models. This will help power future Apple Intelligence features, including a more personalized Siri coming this year. We're incredibly excited for what's to come with so many new experiences to unlock. Turning to services, we achieved an all-time revenue record of $30 billion, 14% higher from a year ago. Services also set all-time revenue records in both developed and emerging markets. Apple TV has seen fantastic momentum, with December seeing a 36% increase in viewership over the previous year. It's no wonder with shows like Pluribus, which are creating landmark cultural moments that audiences are loving.\n\n0:09:58\n\nAnticipation is building for upcoming new productions like Cape Fear from Steven Spielberg and Martin Scorsese, and we are thrilled to announce that Ted Lasso will be returning for a fourth season this summer. Six years since launch, we're excited by the growing enthusiasm viewers have for Apple TV, and we are grateful for the accolades that have followed, most recently at the Critics' Choice and Golden Globe Awards. To date, Apple TV productions have earned more than 650 wins and more than 3,200 nominations, including a recently announced Oscar nomination for Best Picture for F1, the movie. And speaking of F1, we're also approaching the start of a new Formula One season, and for F1 fans in the U.S., Apple TV will be the place to watch every practice, qualifying, sprint, and Grand Prix.\n\n0:10:55\n\nMLS fans will also be able to watch every regular and postseason game with their Apple TV subscription this year, and we're looking forward to kickoff in the coming weeks. Looking back, 2025 was a fantastic year for services as we rolled out amazing new features and broke records. Apple Music climbed to all-time highs in both listenership and new subscriber growth. Apple Pay eliminated more than $1 billion in fraud for our partners last year, and we've made it available in more markets than ever before. Last year, we welcomed more than 850 million users every week on average to the App Store, the world's safest and most innovative app marketplace. Developers have now earned more than $550 billion on our platform since 2008.\n\n0:11:51\n\nIn retail, we continue to bring a magical experience to our customers all around the world, and we were thrilled to have our best-ever results in retail during the quarter. We were excited to open our fifth store in India in December and have plans to open another store in Mumbai soon. Wherever we are, we see ourselves as part of a larger whole. That's why we show up with our values in everything we do.... That means working with partners in places like Vietnam to bring more clean water to rural areas. It means celebrating graduations of new classes of innovators from our developer academies in places such as Brazil, Indonesia, and South Korea. It means 3D printing titanium cases for Apple Watch using recycled materials so that they're better for the planet without compromising quality, and so much more.\n\n0:12:47\n\nWe're especially proud of the work we're doing to support American innovation. Last year, we committed to invest $600 billion over 4 years in vital industries like advanced manufacturing, silicon engineering, and artificial intelligence. As we're building on our long-standing investments in America, we're supporting nearly 500,000 jobs with thousands of suppliers across all 50 states. In the year since we made our initial commitment, we're making great progress. Today, we're shipping servers to power Apple Intelligence from our new manufacturing facility in Houston. Through our advanced manufacturing program, we're working with Corning in Kentucky to make 100% of cover glass for iPhone and Apple Watch.\n\n0:13:34\n\nWe're working with Micron, which broke ground on a new advanced chip packaging and test facility, and we continue to advance the development of an end-to-end silicon supply chain across the country, sourcing 20 billion U.S. chips in 2025. Through our Apple Manufacturing Academy in Detroit, we're already training American businesses and innovators on the latest smart manufacturing and artificial intelligence techniques. Six months since opening, the academy is already making an enormously positive impact for businesses working alongside Apple engineers to drive productivity, efficiency, and quality in their supply chains. As I said at the beginning of my remarks, this was, in so many ways, a remarkable quarter for Apple, and we're excited for all the opportunities we'll have in the year ahead to deliver innovations that have never been seen before and enrich the lives of users every step of the way.\n\n0:14:37\n\nWith so much to look forward to in the weeks and months ahead, I have every confidence that our best work is yet to come. With that, I'll turn it over to Kevan.\n\n0:14:48\n\nThanks, Tim, and good afternoon, everyone. Our revenue of $143.8 billion was up 16% year-over-year, our best quarter ever. Across the world, we set all-time revenue records in both developed and emerging markets, and we saw double-digit growth year-over-year across the majority of the markets we track, including the U.S., Latin America, Western Europe, Greater China, India, and South Asia. Products revenue was $113.7 billion, up 16% year-over-year, driven by double-digit growth in iPhone, setting a new all-time record. And as Tim mentioned, thanks to our strong levels of customer loyalty and satisfaction, our installed base of active devices has now surpassed 2.5 billion, reaching another all-time high across all product categories and geographic segments. Services revenue was $30 billion, up 14% year-over-year.\n\n0:15:45\n\nThis performance continues to be broad-based, with double-digit growth in almost every market we track. We also reached all-time revenue records for advertising, cloud services, music, and payment services, with December quarter records on the App Store and video. Company gross margin was at 48.2%, above the high end of our guidance range and up 100 basis points sequentially, driven by favorable mix and leverage. Products gross margin was 40.7%, up 450 basis points sequentially, driven by favorable mix and leverage. Services gross margin was 76.5%, up 120 basis points sequentially, driven by mix. Operating expenses landed at $18.4 billion, up 19% year-over-year. This was within the range we provided and driven by increased investment in R&D.\n\n0:16:42\n\nNet income was $42.1 billion, and diluted earnings per share was $2.84, up 19% year-over-year. Both net income and diluted EPS were all-time records, and these incredibly strong business results drove an all-time record for operating cash flow, coming in at $53.9 billion. Now, I'm going to provide some more details for each of our revenue categories. iPhone revenue was $85.3 billion, up 23% year-over-year, driven by the iPhone 17 family. iPhone saw strength around the world, reaching all-time revenue records in many of the markets we track, including the U.S., Greater China, Latin America, Western Europe, the Middle East, Australia, and South Asia, as well as a December quarter record in India.\n\n0:17:35\n\nThe iPhone active install base grew to an all-time high and set a new all-time record for upgraders in aggregate and across many countries, including the U.S., China Mainland, Japan, and India. According to a recent survey from Worldpanel, iPhone was the top-selling model in the U.S., urban China, the U.K., Australia, and Japan. Customers are loving the latest iPhone lineup. The latest customer satisfaction for the iPhone 17 family in the U.S. was measured at 99% by 451 Research. Mac revenue was $8.4 billion, down 7% year-over-year. As we described in the last call, we faced a very difficult compare against the M4 MacBook Pro, Mac Mini, and iMac launches in the year-ago quarter. Despite this difficult compare, we continued to see growth in several emerging markets, including Brazil, India, Malaysia, Vietnam, and more.\n\n0:18:36\n\nAs Tim mentioned earlier, the Mac install base reached another all-time high, with nearly half of the customers who purchased a Mac being new to the product. In the U.S., customer satisfaction for Mac was measured at 97%. iPad revenue was $8.6 billion, up 6% year-over-year, driven by the M5-powered iPad Pro and the A16-powered iPad. We continued to add new users to the iPad. In fact, over half the customers who purchased an iPad during the quarter were new to the product. This helped the iPad install base to reach an all-time high, and we also reached an all-time high for upgraders. Based on the latest reports from 451 Research, customer satisfaction was 98% in the U.S. Wearables, home, and accessories revenue was $11.5 billion, down 2% year-over-year.\n\n0:19:32\n\nDuring the quarter, we experienced constraints on the AirPods Pro 3, and we believe the overall category would have grown had it not been for these constraints. The wearables install base reached a new all-time high, with over half of customers purchasing an Apple Watch during the quarter being new to the product. In the U.S., customer satisfaction was recently reported at 96%. Our services revenue reached an all-time high of $30 billion, up 14% year-over-year. As we said earlier, we had all-time revenue records on advertising, music, payment services, and cloud services, where we saw a double-digit growth on paid subscribers. We continue to be optimistic about the future of our services business. With our install base of over 2.5 billion active devices, we have an incredibly strong foundation for new growth opportunities.\n\n0:20:23\n\nWe saw increased customer engagement across our service offerings, with both transacting and paid accounts reaching all-time highs in the quarter. We continue to improve the quality and expand the breadth of our services offerings. From new Wallet features like Digital ID, which provides a way for users to create an ID in Wallet using information from their U.S. passport, to additional ads coming to search in the App Store, which provides advertisers more ways to drive downloads from search. Turning now to enterprise, organizations are continuing to expand their fleet of Apple devices to drive productivity while remaining secure. Snowflake has deployed over 9,000 Mac devices company-wide, establishing Mac as a primary laptop across all business units, resulting in increased performance and a reduction in support tickets.\n\n0:21:13\n\nAstraZeneca is rolling out over 5,000 M5-powered iPad Pros to its pharmaceutical sales team to take advantage of AI capabilities, including Apple Intelligence, while meeting with clinicians daily. In Mexico, Coppel, the country's largest domestic retailer, recently added MacBook Air in addition to a growing fleet of over 10,000 iPad devices. Let's turn to our cash position and capital return program. We ended the quarter with $145 billion in cash and marketable securities. We had $2.2 billion of debt maturities and decreased commercial paper by $6 billion, resulting in $91 billion in total debt. Therefore, at the end of the quarter, net cash was $54 billion. During the quarter, we returned nearly $32 billion to shareholders.\n\n0:22:08\n\nThis included $3.9 billion in dividends and equivalents and $25 billion through open market repurchases of 93 million Apple shares. As we move ahead into the March quarter, I'd like to review our outlook, which includes the types of forward-looking information that Suhasini referred to. Importantly, the color we're providing assumes that global tariff rates, policies, and their application remain in effect as of this call, and the global macroeconomic outlook does not worsen from today. We expect our March quarter total company revenue to grow by 13%-16% year-over-year, which comprehends our best estimates of constrained iPhone supply during the quarter. We expect services revenue to grow at a year-over-year rate, similar to what we reported in the December quarter. We expect gross margin to be between 48% and 49%.\n\n0:23:05\n\nWe expect operating expenses to be between $18.4 billion and $18.7 billion, which is at a similar level to what we reported in the December quarter and driven by higher R&D on a year-over-year basis. We expect OI&E to be around $100 million, excluding any potential impact from the Mark-to-Market of minority investments and our tax rate to be around 17.5%. Finally, today, our board of directors has declared a cash dividend of $0.26 per share of common stock payable on February 12th, 2026, to shareholders of record as of February 9th, 2026. With that, let's open the call to questions.\n\n0:23:50\n\nThank you, Kevin. We ask that you limit yourself to two questions. Operator, may we have the first question, please?\n\n0:23:59\n\nCertainly. We'll go ahead and take our first question from Amit Daryanani of Evercore.\n\n0:24:09\n\nYes, I have two. Maybe to start with, you know, there's a lot of focus on the impact of memory to a host of companies, and I'd love to kind of get your perspective when you folks are guiding gross margins up into the March quarter. Just talk about, you know, A, your comfort in securing the bits that you need for shipment, and B, how do we think about memory inflation flowing through Apple's model over time?\n\n0:24:30\n\n... Yeah, Amit. Hi, it's Tim. Let me back up a bit and talk about the constraints that Kevin referred to in his remarks and memory, and try to get both of these out at once. First of all, we were thrilled with the customer response on the latest iPhone lineup. It exceeded our expectations, to say the least, and, you know, iPhone grew 23%. What the result of that was was that we exited the December quarter with very lean channel inventory due to that staggering level of demand. And based on that, we're in a supply chase mode to meet the very high levels of customer demand. We are currently constrained, and at this point, it's difficult to predict when supply and demand will balance.\n\n0:25:26\n\nThe constraints that we have are driven by the availability of the advanced nodes that our SoCs are produced on. At this time, we're seeing less flexibility in the supply chain than normal, partly because of our increased demand that I just spoke about. From a memory point of view, to answer your question, memory had a minimal impact on the Q1, the December quarter gross margin. We do expect it to be a bit more of an impact to the Q2 gross margin, and that was comprehended in the outlook of 48%-49% that Kevan gave earlier. Beyond Q2, you know, we don't obviously provide outlooks beyond the current quarter, but we do continue to see market pricing for memory increasing significantly. As always, we'll look at a range of options to deal with that.\n\n0:26:37\n\nHopefully that gives you the full, full view.\n\n0:26:43\n\nYep. No, thank you, and I appreciate all the clarity on that, Tim. You know, maybe the other second question I have for you is, you know, maybe just touch on the China strength you folks had. I think this is very close to all-time high revenues you've had in China. What's driving the strength over here? And just sort of the durability of the growth rate we saw in, in the December quarter would be helpful to understand. Thank you.\n\n0:27:03\n\nSure. Greater China was up 38% year-over-year. It was driven by iPhone, where we set an all-time revenue record. So it was the best iPhone quarter in history in Greater China. It's driven by the customer enthusiasm for the iPhone 17 lineup. And I would tell you that during the quarter, traffic in our stores in China grew by strong double digits year-over-year. It was a terrific quarter. Our installed base reached an all-time high in both Greater China and Mainland China, and we set an all-time record for the upgraders, and we saw strong double-digit growth on switchers. And according to a survey from Worldpanel, iPhones were the top three smartphones in urban China during the quarter.\n\n0:28:06\n\nSo it was and it's really driven primarily by the product strength and the customer response to the product strength. We do see on non-iPhone products that the majority of customers that are buying a Mac, an iPad, a watch, are still new to that product, so that's a very good sign for us. And if you look at iPad, on that same survey, iPad was the top tablet model in urban China. And according to Counterpoint, the MacBook Air was the top-selling laptop model, and Mac Mini was the top-selling desktop model in the December quarter. So overall, a great quarter in China. We could not be more happy with it.\n\n0:29:01\n\nAwesome. Thank you, Amit. Operator, could we get the next question, please?\n\n0:29:07\n\nOur next question is from Eric Woodring of Morgan Stanley. Please go ahead.\n\n0:29:13\n\nGreat, guys. Thank you for taking my questions. Tim, congrats on announcing the partnership with Google, and we're all excited to see what you bring to market later this year. When I think about your AI initiatives, you know, it's clear there are added costs associated with that. We're obviously seeing that flow through in OpEx. You know, can you help us understand maybe what the revenue upside potential that exists with AI? You know, many of your competitors have already integrated AI into their devices, and it's just not clear yet what incremental monetization they're seeing because of AI, but you're always disciplined with investing. You obviously have a differentiated product. So how do you monetize AI, and what's the timeline to realizing that ROI? Then a quick follow-up. Thank you.\n\n0:29:56\n\nWell, let me just say that we're bringing intelligence to more of what people love, and we're integrating it across the operating system in a personal and private way. I think that by doing so, it creates great value, and that opens up a range of opportunities across our products and services. And we are-\n\n0:30:22\n\nOkay, super helpful.\n\n0:30:24\n\nAnd we're-\n\n0:30:25\n\nThanks.\n\n0:30:25\n\nWe're very happy with the collaboration with Google as well, I should add.\n\n0:30:33\n\n... Thank you, Tim. And then maybe just a follow-up. Now, now that you have kind of more time and, and data to evaluate this cycle, can you maybe help us understand what the primary factors are driving strength in the iPhone? I'm sure there's a number of factors, but if you, if you had to point to one or two, just what would they be, and how sustainable do you think those are?\n\n0:30:54\n\nI think it's different for different cohorts of where people are coming from and the device that they have. But it's a combination of things always that make the product sing. It's the display, it's the camera, it's the performance, it's the new selfie camera, it's the design. The design is beloved. And so it's all of these things that come together at once and are producing a very strong product cycle, as witnessed by our December quarter results.\n\n0:31:38\n\nGreat. Thank you, Tim. Best of luck.\n\n0:31:39\n\nYeah, thank you.\n\n0:31:41\n\nAwesome. Thank you, Eric. Operator, could we get the next question, please?\n\n0:31:46\n\nWe'll now go to Michael Ng of Goldman Sachs. Please go ahead.\n\n0:31:52\n\nWonderful. Good afternoon, and thank you for the questions. I have two as well, if I could. First, you know, it was encouraging to hear about the revenue growth outlook of 13%-16% for the March quarter. I was just wondering if you could, you know, talk about any comps that we should be particularly aware of as we kind of think about each of the product categories. I know last year you guys had, you know, MacBook Air with M4, the iPhone 16e, the iPad A16, and the iPad Air with M3. So just wanted to, you know, ask if those things would create tough comps, or is it just less of an issue just given the new product outlook? Thank you.\n\n0:32:33\n\nYeah, Mike, it's Kevan. How are you? Thanks for the question. Yeah, I wouldn't say there's any particular comp issue that we'd note. As you recall, last quarter, we talked about the difficult comparison we had on Mac, but there's nothing that rises to that kind of color that we'd outline, you know, in the outlook. And so I think it's just, you know, continuation of the strong cycle we're seeing, subject to the constraints that I had mentioned in the prepared remarks and that Tim, you know, alluded to a little earlier as well.\n\n0:32:59\n\nGreat. Wonderful. And then, you know, just on services, you know, advertising, you know, strong in the quarter. I wanted to ask about some of the, you know, new growth opportunities in advertising. I know you guys are doing the new ad slots in the App Store. Maybe you could just talk a little bit about that and then any plans to do more in advertising across other products like Maps or TV. Thank you.\n\n0:33:29\n\nYeah, sure. Mike, what I would say, just if I step back, in general, I think as we outlined, we saw really good broad-based performance in our cross-sell services business, so ranging from, you know, all-time records in advertising, music, payment services, and cloud services. So I think we see really good opportunities across a lot of our service categories, and we continue to, you know, add new service offerings. We talked about, you know, what we added to the Wallet, like Digital ID, and you referenced the additional kind of additional ads coming into search in the App Store, which we are excited about. It provides, you know, advertisers more ways to be discovered. And so I think we'll continue to look for ways to expand opportunities to add value to users and also, you know, create opportunities for Apple.\n\n0:34:10\n\nI think as we talked about, we created, you know, across a really significant milestone of 2.5 billion, you know, active devices, so we really feel excited about the opportunity that provides for our services business as well.\n\n0:34:22\n\nWonderful. Thanks for the thoughts, Kevan.\n\n0:34:24\n\nSure thing.\n\n0:34:25\n\nThank you, Mike. Operator, could we get the next question, please?\n\n0:34:31\n\nThe next question will be coming from, Ben Reitzes of Melius. Please go ahead.\n\n0:34:38\n\nYeah. Hey, guys. How are you?\n\n0:34:41\n\nHi, Ben.\n\n0:34:43\n\nHey, Tim. First question is on Google partnership again. I wanted to understand how you came to that decision with regard to the AI and Siri in particular, and if there's an opportunity for you guys to share in revenue, too, with that partnership like you do in search. Thanks.\n\n0:35:08\n\nYeah, we basically determined that Google's AI technology would provide the most capable foundation for AFM, or I'm sorry, Apple Foundation Models. And we believe that we can unlock a lot of experiences and innovate in a key way due to the collaboration. We'll continue to run on the device and run in Private Cloud Compute and maintain our industry-leading privacy standards in doing so. In terms of the arrangement with Google, we're not releasing the details of that.\n\n0:35:55\n\nAh, bummer.\n\n0:35:56\n\nYeah.\n\n0:35:56\n\nOkay, well, I tried.\n\n0:35:58\n\nYou did.\n\n0:35:58\n\nSo, yeah, you knew it would be me. So the next question is on gross margin. You know, I'm pretty shocked, I gotta hand it to you, Tim, you know, that you're able to do 48%-49%. What's really going on there? How are you doing that with this memory, the NAND prices? Is it due to mix that there's, you know, a good less hardware and more services, and services margins are going up? How are you doing it to keep it at 48%-49%?\n\n0:36:39\n\n... Yeah, Ben, this is Kevin. How are you doing? Let me start maybe by just reflecting on the Q1 gross margin. I think we talked about the fact that we landed at 48.2%, so just above the high end of the range that we provided, you know, on the last call. And I think if you look at that performance, you know, we were up 100 basis points sequentially. We talked about the fact that we had favorable mix. I mean, as you know, when we have a good product cycle, strong product cycle, we're seeing for iPhone, that does lend itself to a bit more favorable opportunity on the mix and leverage side. So we're having a strong iPhone cycle, as Tim outlined, and so that also translated itself.\n\n0:37:11\n\nWe talked about products sequentially went up by 450 basis points. So I think in general, I think we're just seeing, you know, favorable mix dynamics as well. You know, services continues to contribute as well. That business is growing, you know, you know, double digits, so that also is a contributor. And I think that, you know, if you looked at our guidance, you know, we're providing a similar range to where we reported in December, and there's going to be a few puts and takes. You know, we do expect to see favorable mix in the services. As you know, when we move from Q1 to Q2, that tends to be the case, and that's partly offset by a seasonal loss of leverage.\n\n0:37:42\n\nThere'll be puts and takes, but, you know, again, we feel pretty good about the guide of 48%-49%, which is similar to the range we reported in December.\n\n0:37:51\n\nWow! Okay, great. Thank you.\n\n0:37:53\n\nAll right. Thanks, Ben. Operator, could we get the next question, please?\n\n0:37:59\n\nThe next question will be coming from David Vogt of UBS.\n\n0:38:05\n\nGreat. Thanks, guys, for taking my question. Maybe, maybe Tim or Kevan, if we could pull out a little bit, can you help us understand how you're thinking about the overall kind of smartphone market demand, particularly given where memory prices are headed? And we've heard some conversations with some other OEMs as well as component providers that are worried about either the availability of components, potential market weakness in terms of demand destruction, and some of the actions to offset or higher prices. I know you don't give outlooks for the full year, but how are you thinking about all of those different vectors and what that might mean for the overall smartphone market, and then ultimately what that might mean for demand for iPhones as we move through the rest of this calendar year?\n\n0:38:45\n\nYeah, on the supply side, I had made comments earlier about the constraint that we are seeing in Q2. You know, that's reflected in the revenue guidance that Kevan gave earlier. The constraint, as I'd mentioned, is due to the advanced node capacity, and it's really a result of growing so well in Q1 with the 23% and having less flexibility, partly due to that in the process, to increase it as much as we would like to increase it. Beyond Q2, I don't really want to comment on supply, you know, it's supply is a function of a lot of things in the industry that move around a lot. So I wouldn't want to comment on that. I...\n\n0:39:54\n\nI commented before on the memory pricing, and so, hopefully, that answers your question.\n\n0:40:06\n\nIt does, maybe I'll-\n\n0:40:06\n\nIn terms of smartphone demand-\n\n0:40:11\n\nYeah.\n\n0:40:13\n\nYou know, we believe that based on the information that we've got is we gained share in the December quarter. Obviously, the market wasn't growing at 23%, so we feel good about doing that. But I wouldn't want to predict how the market reacts in the future. It's very difficult to do that.\n\n0:40:46\n\nGot it. At the risk of not getting this answered, I'm going to follow up with, can you maybe help us understand, you know, you mentioned there's a range of options that you're looking at. What should we think about kind of like LTAs in the marketplace? I mean, is that an option as we move through the year, or is it more spot-based from a, on a perspective, particularly around memory? Just want to get a better sense for how we should think about kind of the dynamics in the marketplace.\n\n0:41:11\n\nIt's a range, and so I don't want to get more specific than that. I mean, there are different levers that we can push, and who knows how successful they'll be, but there's just a range of options.\n\n0:41:31\n\nGreat. Thanks, guys.\n\n0:41:32\n\nYeah.\n\n0:41:32\n\nGreat. Thank you, David. Operator, could we get the next question, please?\n\n0:41:38\n\nWe'll now be taking a question from Wamsi Mohan from Bank of America. Sorry for the pronunciation.\n\n0:41:47\n\nThat's fine. Thank you. Tim, on services, you grew a pretty impressive 14%, and I know you said that the App Store was a record for the December quarter, but third-party data is showing a notable deceleration in App Store growth, maybe 7% in the December quarter relative to your 14% growth. I was hoping if you could maybe confirm that, and secondarily, if it's correct, what might be some of the drivers of that, and what could be things that you could do to reverse that in future quarters? And I have a follow-up.\n\n0:42:20\n\nHey, Wamsi, it's Kevan here. Look, I think we want to reiterate the fact that during the summer quarter, you know, we had a quarterly record on the App Store. As you know, we don't provide, you know, specific color on how the individual services categories have done. But again, if we step back, I think we saw, you know, again, broad-based growth across all the different categories, also across, you know, various geographies. We had, you know, all-time records in both developed and emerging markets as well, so, and double-digit growth in both of those too. And so I think in general, you know, we don't provide, you know, the color at the detailed, you know, services level.\n\n0:42:59\n\n... Okay, thanks, Kevan. I guess back to the memory price. I appreciate you have a range of options to address that. Historically, Apple's not used a pricing lever unless, you know, FX markets got maybe very dislocated to prevent arbitrage or issues like that. But, given some of these unprecedented moves in memory, would pricing be a lever that you would be willing to pull or push and, outside of every other thing that, you know, outside of everything else that you can do?\n\n0:43:33\n\nYeah, I wouldn't want to speculate on that one.\n\n0:43:39\n\nOkay, thanks, Tim.\n\n0:43:41\n\nYeah.\n\n0:43:42\n\nThanks, Wamsi. Operator, could we have the next question, please?\n\n0:43:47\n\nWe'll now go to Samik Chatterjee of JPMorgan. Please go ahead. Your line is open.\n\n0:43:54\n\nYep. Hi, thanks for taking my questions. Maybe for the first one, I'm just looking at your capital investment in the first quarter, which did moderate from the last one, and wondering if the partnership with Google on Gemini and sort of help collaboration to develop the next generation of Apple Foundation Models, does that have any near-term sort of impact on your intent to use Apple Private Cloud Compute? I know you emphasize sort of the role Apple Private Cloud Compute plays in the long term, but are there any changes on that front through this collaboration? Any thoughts around that? And I have a quick follow-up. Thank you.\n\n0:44:29\n\nYeah, sure. I think this is Kevan here. I think in general, you know, as Tim outlined, we weren't going to provide any details on our, you know, arrangement and collaboration with Google. Just speaking of CapEx in general, you know, as you know, we have a hybrid, you know, model for CapEx. And so I think that, you know, what happens is our CapEx can be volatile, independent of kind of the volume and performance of our business. And as you know, our CapEx is made of several different line items that include tooling, our facilities, retail investments, or investments in our retail store, data centers. And on tooling and data centers, we leverage this hybrid model that I mentioned before, which we leverage a combination of first and third-party capacity.\n\n0:45:13\n\nIn general, it's hard to read into the CapEx and, you know, draw any conclusions. I think I would just say there's going to be some ebbs and flows in CapEx. Last year, remember, we did build out our Private Cloud Compute environment, and so we did have CapEx spending related to that in our results in December.\n\n0:45:30\n\nGot it. Got it. And my follow-up probably is for you, again. You did mention product gross margin and the sort of drivers there for the product gross margin improvement. When you sort of highlighted mix as a driver, can you just sort of talk through what are the big differences in mix you're seeing for iPhone 17 versus 16? And, did tariffs and tariffs coming in more favorable play a role at all, and what are you expecting for tariffs for the next quarter?\n\n0:45:57\n\nYeah, so there's a few things to unpack there. So on the overall margin and product side, I think I mentioned that we had favorable mix of products and leverage. I think given the strong iPhone cycle we're seeing, that was, I would say, probably a higher favorability than you might have seen in maybe other cycles. And as well, as you know, in Q1, typically we do see the impact of the cost structure of our new products that we launch. And in this case, we are seeing a more favorable offset from mix of products and leverage versus historical, you know, sequential changes from Q4 to Q1.\n\n0:46:31\n\nOn the tariff piece, we had outlined an amount of $1.4 billion for the December quarter, and we landed roughly in that range, you know, at that level.\n\n0:46:44\n\nThank you.\n\n0:46:45\n\nAwesome. Thank you, Samik. Operator, could we have the next question, please?\n\n0:46:51\n\nWe'll now go to Krish Sankar of TD Cowen. Please go ahead.\n\n0:46:57\n\nOkay. Hi, thanks for taking my question. The first one I have for us, for Tim, I think you touched upon this earlier on the Gemini integration and Apple foundational model. How to think about kind of like the, you know, the difference between Apple foundational model functionality and third-party models? Like, you know, does the Apple foundational model evolve to a different layer in the AI software stack? How to think about it as you partner with third-party frontier models? I had a follow-up.\n\n0:47:24\n\nYeah, Krish, you should think of it as a collaboration. Not... And we'll, we'll obviously independently continue to do some of our own stuff, but you should think of what is going to power the personalized version of Siri as a collaboration with Google.\n\n0:47:49\n\nGot it. Got it. So then a quick follow-up for maybe Kevin or Tim. Just, you know, a lot of discussion on memory pricing. Given that the memory constraint or commodities scarcity is impacting both the smartphone and the PC markets, and Apple arguably having more purchasing power, do you think this is a chance for you to increase your market share, both in iPhone and Mac, at the expense of competition, who might have more constraints in getting access to memory?\n\n0:48:19\n\nYeah, I'd only want to talk about, kind of what has happened. We do believe, as I had shared, that iPhone gained share in the December quarter. If you look at Mac for the full year of, full calendar year of 2025, we also believe we gained share. So we feel, very good about our position.\n\n0:48:45\n\nThanks, Tim.\n\n0:48:46\n\nYeah.\n\n0:48:46\n\nThank you, Krish. Operator, could we have the next question, please?\n\n0:48:52\n\nWe'll now go to Atif Malik calling from Citi. Please go ahead.\n\n0:48:58\n\nHi, thank you for taking my questions. The first one for Tim. Tim, some of the industry pundits are comparing the iPhone 17 upgrade cycle to the 2020, 2021 years as some of the iPhone 12, 13 users upgrade. Curious if you agree with that view, and also if you can layer on the impact from Apple Intelligence to the refresh rate.\n\n0:49:21\n\nI think each iPhone cycle has its own unique characteristics, and so I wouldn't compare it to a specific one. I think iPhone 17, the family of 17 is a unique product that brings several very compelling features in one product, and it has done extremely well. And so we feel, you know, quite good about it.\n\n0:49:53\n\nYeah, and I'll just add to Tim's comment that we talked about the fact we have a large and diverse installed base of customers, and so this product has really resonated with multiple cohorts, whether you're on older devices or newer, newer iPhones as well. So we've seen really strong reaction to the product lineup.\n\n0:50:11\n\nGreat. As my follow-up, there was a lot of discussion, supply constraints, and I'm surprised that you guys are constrained on advanced packaging as you generally get your share at the big foundry. How long will these supply impact your ability to ship to true demand?\n\n0:50:28\n\nIt's difficult to estimate demand when you haven't met the demand. And so, we've obviously. We have internal estimates on that, but I don't want to share those. But it's very difficult. And just to be clear, it's the advanced nodes that, like 3 nanometer, to be specific, where our SoCs are. The latest SoCs are produced on, as to what is gating the Q2 supply. And it's a the-\n\n0:51:09\n\nThank you.\n\n0:51:09\n\nIt's a direct result of the 23% growth and, you know, that far outstripping what we had internally estimated and having more limited flexibility in the supply chain for some period of time. But I don't want to estimate when supply and demand will balance at this point.\n\n0:51:35\n\nVery helpful. Thanks.\n\n0:51:36\n\nAll right.\n\n0:51:36\n\nYep.\n\n0:51:36\n\nThank you, Atif. Operator, could we have the next question, please?\n\n0:51:41\n\nThe next question will be coming from Aaron Rakers, calling from Wells Fargo. Please go ahead.\n\n0:51:47\n\nYeah, thanks for taking the question. I have two as well, and I'll try and stay away from the memory question. I'm curious, and, you know, obviously, a lot of focus on the China demand, but I'm curious, you also called out India. And so can you maybe unpack some of the things that you're seeing in the Indian market, you know, as far as iPhone traction? Any kind of color on, you know, what is a very large installed base in India that seems to be a good growth opportunity for Apple still?\n\n0:52:13\n\nYeah, thanks for the question. We did set a quarterly revenue record during the December quarter. To go a little further down, we set quarterly revenue records on iPhone and Mac and iPad, and an all-time revenue record on services. So it was a terrific quarter in India. We really like what we see there. It's the second largest smartphone market in the world and the fourth largest PC market. We still have, despite a very nice growth history, modest share there, and so we think there's a huge opportunity for us there. We could not be more excited about it. If you look at the...\n\n0:52:59\n\nThe other thing that I would point out is that the majority of customers that are buying iPhone and Mac and iPad and Watch are all new to that product, and so it speaks very well to opportunity there.\n\n0:53:17\n\nYeah, and Aaron, I'd add, you mentioned the install base. We're seeing strong double-digit growth in the install base in India as well, which is really encouraging.\n\n0:53:25\n\nYep. And then as a quick follow-up, you know, kind of tied to memory, maybe not so much, but, you know, part of this, this current generation, you know, iPhone cycle is you, you clearly deepen some of your own internal silicon capabilities on the device. I'm curious if that, if we should think about that as a lever and maybe a supportive factor to gross margin that might be underappreciated. And, you know, any thoughts on, you know, where we go from here as far as continual opportunities of internalizing your own silicon? Thank you.\n\n0:53:56\n\nYeah, I'll let Kevin talk about the gross margin, but in terms of the product, which is, at the heart of what we think about in the user, Apple Silicon has just been an incredible game changer for us, starting with iPhone and then on iPad and of course, the Mac as of a few years ago. And so we, we believe it's a game changer and a major competitive advantage.\n\n0:54:25\n\nYeah, and as far as impact on gross margin, yeah, we have been, as you know, investing in core technologies like our own silicon, our own modem. Certainly, while those do provide opportunities for cost savings and can be reflected in margins, they also importantly provide, you know, the differentiation that's really important for our products as well and give us more control over our roadmap. So I think there's a lot of strategic value to it, but also we are seeing, you know, investments in our core technologies impacting, you know, gross margin in a positive way.\n\n0:54:52\n\nYep. Thank you.\n\n0:54:53\n\nAwesome. Thank you, Aaron. Operator, could we have our last question, please?\n\n0:54:59\n\nMost certainly. Our last question will be coming from Richard Kramer, calling from Arete Research. Please go ahead.\n\n0:55:06\n\nThanks very much. I have two questions. Tim, when you think about how Apple might manage AI, do you see that evolving towards more edge AI or on-device services versus cloud-based AI? And are you confident you've reserved sufficient data center capacity to support the widespread Siri adoption, especially given that you're not following the other hyperscalers in sharply increasing CapEx?\n\n0:55:32\n\nThe answer is that we see both being important, the on-device and the Private Cloud Compute. And so we don't see it as an either/or. We see it as a both. And, you know, and we believe it's a differentiator because of our privacy approach. In terms of do we have enough capacity, it's hard to estimate with precision what the demand will be. But we've done the best job that we can do, and we either have or are putting capacity in for it.\n\n0:56:13\n\nOkay. And you also mentioned the 2.5 billion active device number, but Apple Intelligence features have only been available since the 15 Pro. So can you speak at all to roughly what portion of your iPhone or overall active device install base is now AI-capable? And has this been a factor in maybe a more gradual pace of launching wider AI services?\n\n0:56:36\n\nYeah, Richard, this is Kevin. You know, we don't provide that specific number, but it is a growing number, as you can imagine, in our Install Base, and so we're encouraged by the amount of devices now that are capable. But we're not going to provide a specific figure on that today.\n\n0:56:50\n\nOkay. Well, I had to try. Thank you.\n\n0:56:55\n\nAll right. Thank you, Richard. A replay of today's call will be available for two weeks on Apple Podcasts as a webcast on apple.com/investor and via telephone. The number for the telephone replay is 866-583-1035. Please enter confirmation code 8902968, followed by the pound sign. These replays will be available by approximately 5 P.M. Pacific Time tonight. Members of the press with additional questions can contact Josh Rosenstock at 408-862-1142, and financial analysts can contact me, Suhasini Chandramouli, with additional questions at 408-8-\n\nSign in to access your portfolio",
      "fetched_at": "2026-02-03T14:51:24.539Z"
    }
  ]
}