{
  "ticker": "ADI",
  "last_updated": "2026-02-04T15:42:24.493Z",
  "total_transcripts": 4,
  "transcripts": [
    {
      "ticker": "ADI",
      "title": "Analog Devices, Inc. (ADI) Q4 FY2025 earnings call transcript",
      "published_date": "Nov 25, 2025, 10:00 AM EST",
      "fiscal_year": "2025",
      "quarter": "Q4",
      "url": "https://finance.yahoo.com/quote/ADI/earnings/ADI-Q4-2025-earnings_call-377175.html",
      "content": "**Operator**\nGood morning and welcome to the Analog Devices Fourth Quarter Fiscal Year 2025 Earnings Conference Call, which is being audio webcast via telephone and over the web. I'd like to now introduce your host for today's call, Mr. Jeff Ambrosi, Head of Investor Relations. Sir, the floor is yours.\n\n**Jeff Ambrosi** (Head of Investor Relations)\nThank you, Gigi. Good morning, everybody. Thanks for joining our Fourth Quarter Fiscal 2025 Conference Call. Joining me on the call today is ADI's CEO and Chair, Vincent Roche, and ADI's Chief Financial Officer, Richard Puccio. For anyone who missed the release, you can find it and related financial schedules at investor.analog.com. The information we're about to discuss includes forward-looking statements, which are subject to certain risks and uncertainties, as further described in our earnings release, periodic reports, and other materials filed with the SEC. Actual results could differ materially from the forward-looking information, as these statements reflect our expectations only as of the date of this call. We undertake no obligation to update these statements except as required by law.\n\n**Jeff Ambrosi** (Head of Investor Relations)\nReferences to gross margin, operating and non-operating expenses, operating margin, tax rate, earnings per share, and free cash flow in our comments today will be on a non-GAAP basis, which excludes special items. When comparing our results to our historical performance, special items are also excluded from prior periods. Reconciliations of these non-GAAP measures to their most directly comparable GAAP measures and additional information about our non-GAAP measures are included in today's earnings release. References to earnings per share are on a fully diluted basis. With that, I'll turn the call over to ADI's CEO and Chair, Vincent Roche.\n\n**Vincent Roche** (CEO and Chair)\nThanks, Jeff. Good morning, everyone. Our fourth quarter results reflect the ongoing business recovery, with continued growth in revenue and earnings per share, both of which finished above the midpoint of our outlook. Now widening the aperture to our full fiscal 2025, revenue accelerated throughout the year and returned to meaningful growth despite the persistent macro and geopolitical headwinds. All of our end markets increased by double digits, reflecting both cyclical and company-specific drivers, including strong execution against our maximum revenue synergy targets. Top-line strength, combined with margin expansion, resulted in earnings per share growth of more than 20% in fiscal 2025. Our strong operating results and reduced CapEx enabled us to generate record free cash flow of more than $4 billion, or 39% of revenue. We also returned more than $4 billion to our shareholders, supporting an 8% dividend increase as well as share count reduction.\n\n**Vincent Roche** (CEO and Chair)\nInnovation has always been integral to ADI's brand and our value proposition, forming the foundation for strong financial performance. Consequently, R&D activities receive capital prioritization, with record investments made in fiscal year 2025 to advance our leadership in analog, mixed-signal, and power technologies. We've also intensified our focus on software, digital, and artificial intelligence capabilities to strengthen our core franchise, enabling us to address increased customer complexity and expedite their innovation cycles and time to market. Our comprehensive technology portfolio, combined with extensive application domain expertise, uniquely positions us to proactively identify and resolve the most complex engineering challenges for our customers. As a result, we're realizing stronger value capture, as reflected in the increase in our average selling prices, particularly in new products where ASPs significantly exceed those of legacy offerings. Beyond product innovation, our dedication to customer success encompasses ongoing investments to streamline and accelerate their product development activities.\n\n**Vincent Roche** (CEO and Chair)\nTo this end, we are rapidly expanding our development support environment from research to deployment, with a combination of proprietary ADI tools and leading ecosystem and open-source platforms. Furthermore, following the acquisition of Maxim, we've allocated over $3 billion in capital expenditures to substantially enhance capacity, optionality, and resiliency for our customers, supporting our long-term vision for sustained growth. As you've seen, our relentless focus on driving customer success translated to strong results and a diverse design pipeline that grew more than 20% in fiscal 2025. I'd like to share a few examples of our success this past year. Within industrial, every sector grew, driven by improved cyclical dynamics and powerful secular trends such as AI, automation, and the drive for efficient and reliable energy generation, transmission, and distribution.\n\n**Vincent Roche** (CEO and Chair)\nFor example, the exponential growth in demand for AI and high-performance compute drove a record year in our automatic test equipment business, building upon and extending our strong position in the SoC and memory test markets. We anticipate further growth in FY 2026 due to our expanding design pipeline, industry transitions to HBM4, and expected double-digit growth in hyperscaler CapEx. In 2025, robust automation design and growth was propelled by the burgeoning demand for enhanced productivity, efficiency, and reliability across key sectors such as manufacturing, logistics, and healthcare. This momentum was particularly evident within our robotics segment, which saw notable expansion as customers increasingly prioritized automation to streamline operations and improve business outcomes. As highlighted in our previous quarter, we foresee tremendous long-term opportunity as advancements in AI fuel the emergence of content-rich humanoid robots, positioning ADI at the forefront of the next wave of robotics innovation.\n\n**Vincent Roche** (CEO and Chair)\nWithin healthcare, the proliferation of robot-assisted surgical systems represents a vibrant vector of growth alongside our imaging and diagnostic segments. Additionally, we expect growing demand for our suite of diabetes management solutions to continue to contribute to growth in fiscal year 2026. Energy was our fastest-growing industrial segment this past year, driven by high demand from the industrial, transportation, and data center sectors. Design and activity was especially strong for grid management and battery storage systems, and we anticipate continued growth in 2026 and well beyond. Aerospace and defense achieved record results, and we expect further growth in the year ahead, driven by our expanding portfolio of advanced sensor, mixed-signal, and power solutions, coupled with an increasingly strong opportunity pipeline. We also expect to maintain our strong presence in the growing low Earth orbit satellite market.\n\n**Vincent Roche** (CEO and Chair)\nTurning to automotive, advances in autonomous driving and cabin digitalization led to a record year for ADI in fiscal 2025, with growth outpacing light vehicle production. Our intelligent audio and video connectivity solutions, which avoid bulky and expensive cabling, drove multiple new growth awards across GMSL A to B and our signal processing and safe power portfolios. Building on this success, our new E to B Ethernet bus is expanding our market, simplifying customer systems, boosting power efficiency, and lowering costs as it gains traction. In the communication sector, AI CapEx investment led to a record year for our data center segment, with design and activity more than doubling. Strong demand for high-throughput connectivity and power delivery solutions support our confidence in continued growth through 2026.\n\n**Vincent Roche** (CEO and Chair)\nWireless communications was one of the few areas of softness in 2025, but we believe customers have completed their inventory digestion phase and that the market bottomed during the year. In addition, we see a positive impact of new products such as our software-defined, AI-enabled macro base station on a chip solution, for which we secured design-ins from leading OEMs and service providers, and see additional opportunity beyond telecommunications in private industrial networks, as well as other secure communications applications. Finally, as consumer markets rapidly evolve, we're expanding our SAM and growing a diverse pipeline by delivering integrated solutions in hearables, wearables, gaming, AR/VR, and many related areas. For example, our new acoustics platform combines analog, power, digital, software, and machine learning for advanced environmental awareness and adaptive noise cancellation.\n\n**Vincent Roche** (CEO and Chair)\nWe've secured design wins for these solutions in consumer and healthcare segments, enabling ADI to triple the value generated over legacy designs. We've also captured several new power management design wins in premium handsets and smart glasses in fiscal year 2025, positioning us for further growth in 2026. In summary, our diversified business model has proven agile and consistently capable of generating superior outcomes, reflected in both last year's resilient margins and this year's strong rebound in profitable growth.\n\n**Vincent Roche** (CEO and Chair)\nWhile we're mindful of the macro environment and the continued impacts of tariffs and trade uncertainty, we remain confident in our growth in FY 2026 and beyond as we continue to leverage our key differentiators, namely an enviable technology leadership position at the intelligent edge as it becomes a center of gravity for a host of secular growth markets, unrivaled application domain expertise, and the trusted brand that we have developed and strengthened with our customers over the decades. With that, I'll pass it over to Rich.\n\n**Richard Puccio** (CFO)\nThank you, Vince. Let me add my welcome to our fourth quarter earnings call. I'll start with a brief overview of our full fiscal 2025 financial performance. Revenue for the year came in at just over $11 billion, up 17% from fiscal 2024, with double-digit growth across all end markets. Gross margin finished at 69.3%, up 140 basis points driven by higher utilizations. Operating margin finished up 100 basis points at 41.9% and includes the headwind associated with the normalization of variable comp. All told, earnings per share of $7.79 increased 22% versus fiscal 2024. Now on to our fourth quarter results. Revenue in the fourth quarter came in toward the higher end of our outlook at $3.08 billion, growing 7% sequentially and 26% year over year. Industrial represented 46% of our fourth quarter revenue, finishing up 12% sequentially and 34% year over year.\n\n**Richard Puccio** (CFO)\nThe stronger-than-seasonal results underpins the cyclical momentum we see across industrial, as well as the secular growth unfolding in AI infrastructure, which drove record quarter for our ATE business. For the full year, industrial increased 15% with growth across every major application, including record years for aerospace and defense and ATE. Automotive represented 28% of quarterly revenue, finishing up 1% sequentially and up 19% year over year. Double-digit year-over-year growth continues to be the driving, excuse me, continues to be driven by our leading connectivity and functionally safe power solutions. For the full year, automotive increased 16% to an all-time high, driven predominantly by our higher content and share position across level 2+ ADAS systems globally. Communications represented 13% of quarterly revenue, finishing up 4% sequentially and 37% year over year.\n\n**Richard Puccio** (CFO)\nOur data center segment surpassed a $1 billion run rate this quarter and, on a year-over-year basis, has now grown more than 50% for three consecutive quarters, fueled by continued strength in the AI infrastructure market. Wireless revenue was up double digits year over year for the second straight quarter, owing to improving cyclical dynamics. For the full year, communications was our fastest-growing market, increasing 26%, driven by our data center segment, which had a record year, while wireless revenue was flat. Lastly, consumer represented 13% of quarterly revenue, finishing up 7% both sequentially and year over year. For the full year, consumer increased 19%, driven by strong growth in handsets, gaming, and a record year for our hearables and wearables segment. Now on to the rest of the P&L.\n\n**Richard Puccio** (CFO)\nFourth quarter gross margin was 69.8%, up 60 basis points sequentially and 190 basis points year over year, driven by higher utilization and favorable mix. OpEx in the quarter was $809 million, resulting in an operating margin of 43.5%, up 130 basis points sequentially and up 240 basis points year over year. Non-operating expenses finished at $60 million, and the tax rate for the quarter was 12.7%. All told, EPS was $2.26, up 10% sequentially and 35% year over year. Now I'd like to highlight a few items from our balance sheet and cash flow statements. Cash and short-term investments finished the quarter at $3.7 billion, and our net leverage ratio decreased to 0.9. As I discussed previously, we continue to build dye bank buffers for our fastest-growing applications. As such, our inventories were higher by $59 million sequentially, while days of inventory declined by 1 to 159.\n\n**Richard Puccio** (CFO)\nChannel inventory increased but remains lean at approximately six weeks. Fiscal 2025 operating cash flow and CapEx were $4.8 billion and $0.5 billion, respectively, resulting in record free cash flow of $4.3 billion, or 39% of revenue, up from 33% in 2024. In total, we returned $4.1 billion to shareholders through dividends and share repurchases. As a reminder, we target 100% free cash flow return over the long term, using 40-60% for our dividend and the remainder for share count reduction. Now moving on to our first quarter of 2026 outlook. Revenue is expected to be $3.1 billion, plus or minus $100 million. Operating margin at the midpoint is expected to be 43.5%, plus or minus 100 basis points. Our tax rate is expected to be 12-14%, and based on these inputs, adjusted EPS is expected to be $2.29, plus or minus $0.10.\n\n**Richard Puccio** (CFO)\nIn closing, fiscal 2025 was a strong year, highlighted by a return to growth, margin expansion, and record free cash flow. Importantly, I'm confident in our ability to continue navigating macro and geopolitical challenges and believe we are well positioned to drive further profitable growth in 2026. With that, I'll give it back to Jeff for Q&A.\n\n**Jeff Ambrosi** (Head of Investor Relations)\nAll right. Thank you, Rich. Now let's get to our Q&A session. We ask that you limit yourself to one question in order to allow for additional participants on the call this morning. If you have a follow-up question, please re-queue, and we will take your question if time allows. With that, can we have our first question, please?\n\n**Operator**\nFor those participating by telephone dial-in, if you have a question, please press star 11 on your phone to enter the queue. If your question has been answered and you wish to be removed from the queue, please press star 11 again. If you are listening on a speakerphone, please pick up the handset when asking your question. We will pause for just a moment to compile the Q&A roster. Our first question comes from the line of Vivek Arya from Bank of America Securities.\n\n**Vivek Arya** (Managing Director)\nThank you for taking my question. I had a near and a medium term. On the near term, I think you're guiding Q1 slightly up, which is a little bit above seasonal. I was hoping you could give us some color by segment where you are seeing the strength, because I do think industrial was slightly below what you had thought in Q4. Just any dynamics going into Q1. If we zoom out, Vince, I mean, if I were to just annualize Q1 guidance, that suggests a very strong kind of 12-13% sales growth year in fiscal 2026. I was really hoping to get your perspective as you start the new fiscal year on what you're seeing from a broader macro perspective and whether this kind of growth rate is possible in fiscal 2026. Thank you.\n\n**Vincent Roche** (CEO and Chair)\nSure. Thanks, Vivek. Rich?\n\n**Richard Puccio** (CFO)\nVivek, I'll take the first part of your question. Q1, which is our weakest sequential quarter with normal seasonality, typically down mid-single digits. Our outlook is for up slightly quarter over quarter, reflects our seventh straight quarter of above seasonal growth. Another key point is, additionally, our outlook assumes sell-in and sell-through are equal. From an end market color perspective, industrial, we expect to be up mid-single digits above seasonal. We expect auto to be down mid-single digits below seasonal, where we continue to see some risk there around tariff and some of the macro environment. Coms, we expect to be up 10% above seasonal. Again, as Vince mentioned, we're seeing real strength in the AI infrastructure and demand for our data center products. Consumer seasonally down low double digits. All markets, we expect to be up year over year.\n\n**Vincent Roche** (CEO and Chair)\nYeah. Maybe if we look year over year, Vivek, we believe we're well positioned to see broad-based growth in 2026. I think cyclical, as well as many idiosyncratic factors, are giving us tailwinds. My expectation is that in 2026, industrial and communications will lead the charge. I think when you look at industrial and coms, as I said, the cyclical dynamics are good. Very lean inventories out there. I think both of those markets bottomed some quarters ago. Data center, which is going to see, again, we believe, a strong surge in CapEx. We've got good exposure to that sector, and it's two-thirds of our coms business at this point in time. Aerospace and defense, as well as ATE, which are together about a third of the industrial market. We've got strong content growth stories in both.\n\n**Vincent Roche** (CEO and Chair)\nCoupled with the ADI demand surge in the ATE business, I think it is very, very well positioned. I think as well in consumer, we talked a little bit in the preparatory marks there about the higher content and key applications. We have tremendous diversity in that business at a level we never had before as a company. Both in applications and customers and platforms, we are well positioned. Last but not least, if I talk a little bit about the auto sector, it has been, I think, SAR has really been flat now for quite a while. We see that persist in 2026. Given that we have been able to show against our 10% content growth per annum, we see that continue given the strength of the pipeline that we have. All that said, we have a very uncertain macro environment.\n\n**Vincent Roche** (CEO and Chair)\nMy expectation is all the end markets will be up despite the outlook from a macro perspective.\n\n**Vivek Arya** (Managing Director)\nThank you.\n\n**Operator**\nThank you. One moment for our next question. Our next question comes from the line of Joe Moore from Morgan Stanley.\n\n**Joe Moore** (Managing Director)\nGreat. Thank you. Speaking of autos, I think you guys had indicated when you guided the quarter that you'd be slightly down. You ended up slightly up. Can you talk about what's coming in a little bit better? You guys have been pretty good about helping us understand pull forwards and things like that. Any sign of any activity now?\n\n**Richard Puccio** (CFO)\nSure, Joe. I'll take that one. For us, auto has been our strongest market, right? Double-digit CAGR through cycle driven by secular content gains, compounded by our share gains, particularly in connectivity and power for ADAS and next-gen infotainment systems. Here, I would note we've had pretty significant share gains in China, which is where you see a lot of the light vehicle share getting increased. That's been beneficial. Near term, the market's been more resilient than we and many had predicted, right? Evidenced by the stronger volumes on vehicles. We do think some of the upside we've seen in the volumes in our business this year was tariff and policy-related. We've talked in prior calls about our view that there might have been some pull-ins. It can't be precise or certain, but we did make that estimation.\n\n**Richard Puccio** (CFO)\nGiven this, we did approach Q4 with some caution and expected to see, I think I said on the last call, we thought we'd see some of this pre-buying unwind in the fourth quarter. That did not appear to happen to us. Our results were fairly seasonal, and bookings were normal with a book-to-build just below one, which is actually pretty typical for Q4. We are still being a bit cautious on the market as it is unclear how the tariffs and volatilities we saw will ultimately impact us and our customers. Also, just given short lead time orders, visibility tends to be pretty low right now. As we think about our Q1 outlook, is a sub-seasonal quarter or down mid-single digits sequentially, but up year over year?\n\n**Richard Puccio** (CFO)\nGiven the content gains in this market and the positive design win traction that Vince mentioned, we do think fiscal 2026 can be another strong year.\n\n**Joe Moore** (Managing Director)\nVery helpful. Thank you very much.\n\n**Operator**\nThank you. One moment for our next question. Our next question comes from the line of Stacy Raskin from Bernstein Research.\n\n**Stacy Rasgon** (Managing Director and Senior Analyst)\nHi guys. Thanks for taking my question. I wanted to ask about gross margins. You sort of talked about being at 70% gross margins, around $3 billion. You're sitting over there, and you're still, I mean, even in the quarter, you came in a little below 70%. As far as I can tell, the guidance implies gross margins relatively flattish around that 70% range. You can let me know if that's right or not. I'm just wondering why we're not seeing more leverage on the gross margin line, especially as utilizations are going up and everything else. Why shouldn't we expect more leverage on gross margins?\n\n**Richard Puccio** (CFO)\nOkay. Can I take that one? Obviously, with our interesting leading gross margins, we can see the impact that we get from the innovation premium. We did increase quarter over quarter and year over year, and we did have higher utilization and some favorable mix. We did not get to the 70% as planned as the mix component was not as strong as we were expecting. As we have talked about, we had a much stronger result in auto, which kept the industrial mix a bit lower than we planned, and that is what kept us from getting all the way to the 70%. Now, if I look out to Q1, gross margin % for us is typically lower in Q1 seasonally, given the annual shutdown factories for required maintenance and around the holidays in conjunction with customer shutdowns.\n\n**Richard Puccio** (CFO)\nHowever, based on our outlook, we are anticipating that the higher industrial mix in Q1, which we think will offset the seasonal component and hold gross margin flat. You were right that embedded is a flattish gross margin where we get an offset from higher mix, which will offset the pressure from the shutdowns. I guess in the last piece, as we think about the continued go forward, Stacy, and at this revenue level, one of the things I like to remind is we did have a pretty significant capacity expansion while we were addressing our resilience over the last several years. It will take us higher revenue dollars to continue to expand beyond 70. Also, as we have talked about, the continued movement in mix.\n\n**Richard Puccio** (CFO)\nGiven the strength we see in industrial into going into 2026, we expect that that share of our business will continue to increase.\n\n**Vincent Roche** (CEO and Chair)\nYeah. I think just one other piece of color, Stacy, that pricing is in good shape. It is really a question of mix and continuing to push the utilizations.\n\n**Jeff Ambrosi** (Head of Investor Relations)\nThank you.\n\n**Stacy Rasgon** (Managing Director and Senior Analyst)\nGot it. Thank you, guys.\n\n**Jeff Ambrosi** (Head of Investor Relations)\nThanks, Stacy. Move on to our next question, please.\n\n**Operator**\nThank you. One moment for our next question. Our next question comes from the line of Christopher Danely from Citi.\n\n**Christopher Danely** (Managing Director and Semiconductor Equity Research Analyst)\nHey, thanks, guys. Just to follow up on Stacy's question, has the relative gross margin levels, have those changed at all between the end markets? Have any of them gone up or down versus the corporate average? I guess just to cut to the chase, have the auto gross margins gotten a little worse relative to the corporate average over the last two, three years? Or anything else changed?\n\n**Richard Puccio** (CFO)\nChris, I would say that the way we've characterized the individual end market margins versus average has not changed, not in any meaningful way.\n\n**Christopher Danely** (Managing Director and Semiconductor Equity Research Analyst)\nOkay. Thanks, Rich.\n\n**Richard Puccio** (CFO)\nSure.\n\n**Operator**\nThank you. One moment for our next question. Our next question comes from the line of Timothy Arcuri from UBS.\n\n**Timothy Arcuri** (Managing Director)\nThanks a lot. Vincent, you talked about maximum revenue synergies. Can you update us on that? I know you said you're on track, but maybe you can give us a sense of where that stands. Rich, can you tell us sort of what your sense of a normal fiscal Q2 is? It seems like normal seasonal and fiscal Q2 is up like mid-singles. Is that sort of how you think about a typical fiscal Q2? Maybe what are the puts and takes as you kind of head into fiscal Q2? Thanks.\n\n**Vincent Roche** (CEO and Chair)\nYeah. Tim, I'll start with the synergies. We began the conversion process, the conversion of the pipeline in 2024, and began in earnest in 2024. It contributed tens of millions of dollars to ADI's top line in 2024. It's clearly accelerated in 2025, and it's in the hundreds of millions against our billion-dollar target by 2027. We expect an even stronger contribution in 2026, given the momentum that we have in terms of new products and cross-sell. We're seeing, as we said, when we acquired Maxim, we saw tremendous complementarity in terms of some technology niches that Maxim filled, particularly in areas like power, these connectivity structures that we use in automobiles and now industrial products. The complementarity actually works for ADI right across the spectrum of applications, but particularly auto, as I've just said, consumer, healthcare, and data centers.\n\n**Vincent Roche** (CEO and Chair)\nI think we are well on track to meet our commitment, possibly even a little earlier than what we thought. Rich, you want to take that?\n\n**Richard Puccio** (CFO)\nYeah. Tim, you're absolutely right. Q2 tends to be our seasonally strongest quarter, where we tend to be up mid-single digits. I think that's the right way to think about it.\n\n**Jeff Ambrosi** (Head of Investor Relations)\nThank you, Tim. We'll move on to our next question, please.\n\n**Operator**\nThank you. One moment for our next question. Our next question comes from the line of C.J. Muse from Cantor Fitzgerald.\n\n**CJ Muse** (Senior Managing Director)\nYeah. Good morning. Thank you for taking the question. Vincent, in your prepared remarks, you talked about IDEO drivers led by AI in the data center. I was hoping you could perhaps speak a bit more to a framework that we should be thinking about across both industrial and comms. Obviously, you dominate semi-test analog. You've got some real design wins on the optical and power side. You also spoke about energy strength. Is there kind of a percentage of mix that we should be thinking about that should be growing significantly faster than the rest of your business? If there's kind of numbers around that, that would be very helpful. Thank you.\n\n**Vincent Roche** (CEO and Chair)\nYeah. Maybe I'll just give some color and Richard with some numbers. Yeah. Look, specifically when we talk about AI, there's the data center and the ATE businesses. If I look at data center in 2025, it grew about 50%. The ATE business, which also benefits from the skyrocketing compute intensities, the new memory types that are being used as well, new memory chips, that business, so the ATE business grew up 40% last year. We believe we'll see that growth continue in 2026. If I just talk about where we are, data center, I think, as Rich said in the prepared remarks, is running about a billion-dollar run rate at this point in time. There are really two primary sectors there. One is at the electro-optical interface, and we're seeing tremendous upsurge in demand for 800 gig.\n\n**Vincent Roche** (CEO and Chair)\nNow we're seeing 1.6 terabit electro-optical interfaces that require very, very sophisticated power management and control systems. There is power more generally, I think, in the areas of protection. We're beginning to see a shift in very, very high voltage technologies that require very sophisticated monitoring and control. There is power conversion and power delivery. We're seeing our portfolios in those three areas gain significant traction. On the delivery side, we had mentioned before, vertical power. That technology now is beginning to be adopted broadly. We're at the kind of, we use a term in the electronics industry, we're at the knee of the curve. I think we're in place to see exponential growth there. ATE, $800 million run rate. As I said, very, very well positioned with all the key players, both the vertically integrated players as well as the OEMs in chip testing.\n\n**Vincent Roche** (CEO and Chair)\nAs the shift to HBM4 takes place, we're going to see higher pin count, more complexity, more speed, basically more instrumentation compute density in our chips. I think we're in a good place from a customer engagement standpoint, from a technology standpoint. My sense is we should see double-digit growth in both those areas over the next few years. Rich, do you want to add anything?\n\n**Richard Puccio** (CFO)\nI will add my concurrence on your view about the outlook for the next few years in these areas. Look, if you look at the external factors, particularly around the data center piece and the high-performance compute, the forecast from all of the hyperscalers and the big buyers in the space continue to go up. Even recently, several of the large hyperscalers have added even further increases to their CapEx plans. I do think that that near-medium-term spend is going to continue, and we should be a big beneficiary given our strength there.\n\n**Jeff Ambrosi** (Head of Investor Relations)\nThank you, C.J. Move on to our next caller, please.\n\n**Operator**\nThank you. One moment for our next question. Our next question comes from the line of Harlan Suhr from JPMorgan.\n\n**Harlan Suhr** (Analyst)\nYeah. Good morning. Thanks for taking my question. One of the other strong dynamics among several which separates ADI from peers is obviously the strong exposure to aerospace and defense. This has been a growth area for ADI during this last downturn. I think the business is now driving well over $1 billion of annualized run rate revenues or roughly greater than 10% of your total revenues. It grew strongly double digits in fiscal 2025. Does the team anticipate continued strong double digits growth in fiscal 2026? Maybe help us understand what are some of the ADI-specific product cycles here that's going to continue to drive the strong growth profile going forward?\n\n**Vincent Roche** (CEO and Chair)\nYeah. Thanks very much for the question. Yeah, the journey for ADI in that aerospace and defense market really took off in earnest when we acquired Hittite. We got Hittite's really high-quality RF and microwave portfolio, which is central to all the communications activities right across the aerospace and defense market, from defense systems, every type of defense system you can imagine, to satellite communications. The primary portfolios we have there are obviously microwave and RF sensors. The highest performance conversion products that we build on the precision and very, very high-speed signal processing side are central. Increasingly, when we acquired LTC and Maxim, we were able to cross-connect with all those signal processing technologies, the power tech, all the power management technologies. If you look then at the market drivers, you've got the world isn't becoming any more peaceful.\n\n**Vincent Roche** (CEO and Chair)\nThere is going to be increasing capital deployment to build defense systems globally. We are seeing very strong demand, an increasing demand in Europe and beyond. We work with all of the primary OEMs. All that, coupled with increasing ASPs, I mean, some of these products we build attract tens of thousands of dollars per system. I think that business has the capacity by the end of the decade to more than double.\n\n**Jeff Ambrosi** (Head of Investor Relations)\nThank you, Harlan. We'll move on to our next question.\n\n**Harlan Suhr** (Analyst)\nThank you.\n\n**Operator**\nThank you. One moment for our next question. Our next question comes from the line of Joshua Buchalter from TD Cowen.\n\n**Joshua Buchalter** (Director and Semiconductor Equity Research Analyst)\nHey, guys. Thank you for taking my questions and congrats on the strong results. I wanted to follow up on the comments about fiscal Q2 being a seasonal plus mid-single digit %. Could you maybe speak to what's driving the confidence and the visibility there? Any metrics you're able to give on lead times? Bigger picture, how has your visibility looking forward changed as the mix has changed? Do you think compared to a couple of years ago, there's more of your exposure tied to ADI drivers like aerospace and defense and data center, and that's increasing your visibility? I'd just be curious to hear because you mentioned there was some uncertainty on the shape of the year in the press release. I'd be curious to hear how you're feeling about visibility. Thank you.\n\n**Richard Puccio** (CFO)\nThanks, Josh. First, I didn't guide for Q2. I confirmed what the historical seasonality is. As we've been talking about, right, we still don't have a ton of visibility beyond current quarter plus one, right? As we've talked about, the lead times are most of our products have lead times sub-13 weeks. We get a lot of orders in quarter. We get a lot of orders with short lead times, which does reduce some of that visibility. I think on the first part of your question, and I don't think we've necessarily seen an improvement in visibility over the last two years, although I do agree, I think that we've now got broad strength in a number of the ADI areas that Vince described.\n\n**Richard Puccio** (CFO)\nGiven where we are from an inventory on hand position as well as our cycle times, we're not getting a ton of outside of a quarter visibility.\n\n**Jeff Ambrosi** (Head of Investor Relations)\nThank you, Josh. We will move to our last question, please.\n\n**Operator**\nThank you. One moment for our next question. Our next question comes from the line of Torrey Svanberg from Stifel.\n\n**Tore Svanberg** (Managing Director)\nYeah. Thank you for squeezing me in. Vince, ADI has been always very thoughtful about allocating R&D dollars. The economy is changing in the front of our eyes structurally quite significantly here. How are you thinking about prioritizing your R&D spend right now? Are there any areas you would like to double down in and perhaps areas you would like to de-emphasize as a company? Thank you.\n\n**Vincent Roche** (CEO and Chair)\nYeah. Thanks, Torrey. Yeah. When I look at the analog space, in the core analog business, we continue to push the edges of signal processing, data conversion systems, and precision as well as very, very high speed. I think power management for ADI is still an opportunity with a much, much bigger growth story. That is a place that, as we've gone through our strategy planning cycle in the last few quarters here, we're doubling down on for sure. There are areas as well of our digital portfolio where we see very, very strong niches for what we do in terms of, for example, low power, low latency, these heterogeneous compute structures, as well as algorithmic technologies.\n\n**Vincent Roche** (CEO and Chair)\nI mentioned during the prepared remarks how we're enhancing the functionality of our core analog technologies by using machine learning techniques, for example, in base stations, in the consumer areas as well. I think most of what we do is making sure that we have the platforms to be able to compete globally across all the geographies, across the spectrum of markets that we find most attractive, solve the most important problems. What I can tell you is that our customers are asking us to do more and more to tame their complexity and help them speed up their innovation cycle. When we think about the investment portfolio, we're very opportunity-rich. We've got a very high-quality problem, which is picking the most valuable opportunities in that spectrum that's replete with opportunity.\n\n**Tore Svanberg** (Managing Director)\nThank you for the call.\n\n**Jeff Ambrosi** (Head of Investor Relations)\nThanks, Torrey.\n\n**Jeff Ambrosi** (Head of Investor Relations)\nThanks, Torrey. Thanks, everyone, for joining us this morning. A copy of this transcript will be available on our website. All available reconciliations and additional information can also be found in the quarterly results section of our investor relations website. Thank you for your continued interest in Analog Devices, and happy Thanksgiving.\n\n**Operator**\nThis concludes today's Analog Devices conference call. You may now disconnect.",
      "fetched_at": "2026-02-04T15:42:02.805Z"
    },
    {
      "ticker": "ADI",
      "title": "Analog Devices, Inc. (ADI) Q3 FY2025 earnings call transcript",
      "published_date": "Aug 20, 2025, 10:00 AM EDT",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/ADI/earnings/ADI-Q3-2025-earnings_call-349426.html",
      "content": "**Operator**\nGood morning and welcome to the Analog Devices Third Quarter Fiscal Year 2025 Earnings Conference Call, which is being audio webcast via telephone and over the web. I'd like to now introduce your host for today's call, Mr. Richard Puccio, Executive Vice President and Chief Financial Officer. Sir, the floor is yours.\n\n**Richard Puccio** (EVP and CFO)\nThank you, Josh, and good morning, everybody. Thanks for joining our Third Quarter Fiscal 2025 Conference Call. Joining me today on the call is ADI's CEO and Chair, Vincent Roche. For anyone who missed the release, you can find it and related financial schedules at investor.analog.com. The information we're about to discuss includes forward-looking statements, which are subject to certain risks and uncertainties, as further described in our earnings release and our periodic reports and other materials filed with the SEC. Actual results could differ materially from the forward-looking information as these statements reflect our expectations only as of the date of this call. We undertake no obligation to update these statements except as required by law. References to gross margin, operating and non-operating expenses, operating margin, tax rate, EPS, and free cash flow in our comments today will be on a non-GAAP basis, which excludes special items.\n\n**Richard Puccio** (EVP and CFO)\nWhen comparing our results to our historical performance, special items are also excluded from prior periods. Reconciliations of these non-GAAP measures to their most directly comparable GAAP measures and additional information about our non-GAAP measures are included in today's earnings release. References to EPS are on a fully diluted basis. With that, I'll turn it over to ADI's CEO and Chair, Vincent Roche.\n\n**Vincent Roche** (CEO and Chair)\nThank you, Rich, and a very good morning to you all. Our third quarter revenue and earnings exceeded our expectations, and for the second quarter in a row, we achieved double-digit year-over-year growth across all of our end markets. While geopolitical and macro uncertainty continues to cloud the outlook, we believe ADI's innovation-driven, resilient, highly diversified business model positions us to continue to successfully navigate these challenges. The accelerated recovery of our industrial business, encompassing instrumentation, automation, healthcare, aerospace and defense, and energy management, is a case in point. As you've heard us detail on prior calls, our industrial recovery began in the aerospace and defense and instrumentation sectors, driven by our strong product and customer portfolio positions, as well as spending growth in defense and AI infrastructure. We're now seeing double-digit year-over-year growth across the entire industrial portfolio.\n\n**Vincent Roche** (CEO and Chair)\nFor today's call, I'm going to focus on our billion-dollar plus industrial automation business, which was the last sector to return to double-digit growth. Its market dynamics and trajectory are expected to bring long-term expansion. Companies have long invested in automation systems to gain first-order productivity, efficiency, and quality benefits. Today, a new wave of adoption is being driven by economic and demographic pressures, and enabled by the potential to transform and accelerate business through leverage of real-time intelligent Edge data. ADI's high-performance technology stack and deep domain expertise are crucial to customer success in this highly sensed, securely connected, software-driven era, and the new robotic modalities that are emerging. It's predicted that the convergence of compounding macro and AI-enabled technology factors will drive robust double-digit growth within the robotics market for the foreseeable future.\n\n**Vincent Roche** (CEO and Chair)\nADI's ability to deliver exceptionally accurate physical representations and enable faster insights at the edge will become even more essential as the market migrates to next-generation autonomous robotic systems. Our long history in robotics has given us a deep understanding of the sector's hardest problems and the greatest opportunities. We're investing to maintain our performance edge in analog while capturing increasing levels of system value. In addition, we're building ecosystem partnerships and deploying experts and an increasingly broad suite of technologies to enrich and deepen our customer collaborations. We expect this multipronged approach to unlock significant ASP and SAM expansion for our automation business, following the proven path we've successfully executed in other markets such as aerospace and defense and healthcare. Now, let me share a few examples of our strategy in action. Earlier this year, we partnered with Teradyne Robotics.\n\n**Vincent Roche** (CEO and Chair)\nOur solutions for precision positioning and dynamic motion control are helping Teradyne increase their value proposition to the logistics industry through higher-performance cobots and autonomous mobile robots, or AMRs. In the agricultural sector, where labor shortages are chronic, high-precision robotic systems are increasingly filling the gap. In addition, these systems' enhanced data collection capabilities are enabling higher crop use while reducing water and chemical usage levels. A growing portion of our robotics revenue is coming from this sector as we help customers solve their toughest challenges through our sensing, connectivity, and energy management solutions. In the healthcare sector, robot-assisted surgery systems minimize invasiveness and improve patient outcomes through enhanced system precision. We're leveraging our leading precision technology franchise to successfully attach more of our power management, connectivity, and sensing content to the more innovative systems being designed and deployed.\n\n**Vincent Roche** (CEO and Chair)\nThis year, we're achieving robust growth and expect continued momentum as the proliferation of automated surgical procedures further expands our opportunities in this space. Overall, the near and medium-term outlook for robotics is compelling, supported by increasing revenue and a burgeoning opportunity pipeline. From this strong foundation, we're extending into the next promising era of robotics, namely humanoid and other highly dexterous robot form factors, and creating a potentially exponential growth opportunity for ADI. Our content in a humanoid robot is likely to be several thousands of dollars, and that's basically a 10x increase over the content in today's cutting-edge AMRs. The primary reason for this content multiplier is the explosion in sensor and actuator counts. Every joint and point of contact requires accurate sensing and precision motor control, and every sensor and actuator drives a signal chain and power management opportunity for ADI.\n\n**Vincent Roche** (CEO and Chair)\nTo further capture this flourishing opportunity, we're investing in higher-level application-specific solutions that integrate multiple sensing modalities, such as pressure, vibration, depth, acoustics, vision, and positioning, with high accuracy, ultra-low power signal chains, functionally safe power management, and AI algorithms powered by robotics foundation models. Simultaneously, we're collaborating with NVIDIA on a range of digital twin simulation programs and reference designs for humanoid and other robotic systems to accelerate development and AI training for our customers. This work is particularly relevant for high-value applications such as dexterous manipulation of cable assemblies in data centers and, of course, in automotive manufacturing, to name just one. We are combining ADI's unique sensor expertise and our latest advances in robotics policy training and techniques to enhance realism in NVIDIA's Isaac Sim and substantially shorten our customers' innovation timelines.\n\n**Vincent Roche** (CEO and Chair)\nIn summary, we're capitalizing on growth in advanced robotics today and investing to capture even more value in the future. Ultimately, the strategy, investments, and customer impact of our robotics business is a microcosm of our approach across ADI, namely uncovering and tackling the hardest innovation challenges at the intelligent physical edge and leveraging our industry-leading technology portfolio and expertise to solve them. As we turn our attention to the end of fiscal 2025 and the beginning of the new fiscal year, we're focused on executing our strategy and capitalizing on cyclical and idiosyncratic momentum. Despite the geopolitical and macro turbulence, we remain undeterred and excited by the tremendous growth opportunities that we see over both the near and long terms. With that, I'm going to pass it back to Rich.\n\n**Richard Puccio** (EVP and CFO)\nThank you, Vince. Now on to our third quarter results. Revenue of $2.88 billion came in above the high end of our outlook, up 9% sequentially and 25% year-over-year. Industrial represented 45% of our third quarter revenue, finishing up 12% sequentially and 23% year-over-year. Our industrial recovery has continued with sequential growth across all subsectors and regions. Year-over-year growth accelerated across all major applications led by our automatic test equipment business, fueled by increasing AI investment. Additionally, our aerospace and defense business had a record quarter. Automotive represented 30% of quarterly revenue, finishing down 1% sequentially and up 22% year-over-year. Double-digit year-over-year growth continues to be driven by our leading connectivity and functionally safe power solutions. Communications represented 13% of quarterly revenue, finishing up 18% sequentially and 40% year-over-year.\n\n**Richard Puccio** (EVP and CFO)\nOur wireline and data center business, which is roughly two-thirds of total communications, grew double digits sequentially and year-over-year as increasing AI demand continues. Wireless also grew double digits both sequentially and year-over-year. Lastly, consumer represented 13% of quarterly revenue, finishing up 16% sequentially and 21% year-over-year, marking the fourth straight quarter of double-digit year-over-year growth. We continue to see strength across handsets, gaming, hearables, and wearables. Now on to the rest of the P&L. Third quarter gross margin was 69.2% and operating margin was 42.2%, up 100 basis points sequentially and year-over-year. Non-operating expenses finished at $57 million and the tax rate for the quarter was 11.9%. All told, EPS was $2.05 above the high end of our guided range and up 30% year-over-year. Now I'd like to highlight a few items from our balance sheet and our cash flow statements.\n\n**Richard Puccio** (EVP and CFO)\nCash and short-term investments finished the quarter at $3.5 billion and our net leverage ratio remained virtually flat at 1.1. Inventory increased $72 million sequentially in support of the cycle recovery. Days of inventory declined to 160 and channel weeks ticked lower. We are continuing to execute our strategy of keeping leaner channel inventories while maintaining higher levels on our balance sheet. Over the trailing 12 months, operating cash flow and CapEx were $4.2 billion and $0.5 billion respectively. We continue to expect fiscal 2025 CapEx to be within our long-term model of 4%-6% of revenue. Free cash flow over the trailing 12 months was $3.7 billion or 35% of revenue, and we have returned $3.5 billion in cash to shareholders over the last four quarters.\n\n**Richard Puccio** (EVP and CFO)\nAs a reminder, we target a 100% free cash flow return over the long term using 40%-60% for our dividend and the remainder for share count reduction. Now on to our fourth quarter guidance. Revenue is expected to be $3 billion plus or minus $100 million. On a sequential basis at the midpoint, we expect industrial, communications, and consumer to increase with the fastest growth in industrial. Automotive is expected to decline. Operating margin is expected to increase to 43.5% plus or minus 100 basis points. Our tax rate is expected to be between 11% and 13%, and based on these inputs, adjusted EPS is expected to be $2.22 plus or minus $0.10. In closing, our strong results and outlook for continued growth, especially in the industrial market, reinforce our view that 2025 will close as a strong recovery year for ADI.\n\n**Richard Puccio** (EVP and CFO)\nHowever, we are mindful of the continued uncertainty facing customers with respect to tariffs and are monitoring the impacts closely. We believe we are well positioned to successfully navigate an evolving global operating environment thanks to the optionality enabled by the diversity of our markets, applications, and products, and the resilience of our hybrid manufacturing strategy. With that, let's go to our Q&A session. We ask that you limit yourself to one question in order to allow us for additional participants on the call this morning. If you have follow-up questions, please re-queue and we will take your question if time allows. Operator, can we have our first question, please?\n\n**Operator**\nThank you. For those participating by telephone, dial in. If you have a question, please press star one one on your phone to enter the queue. If your question has been answered and you wish to be removed from the queue, please press star one one again. If you are listening on a speakerphone, please pick up the handset when you are asking your question. We'll pause for just a moment to compile the Q&A roster. Our first question comes from Timothy Arcuri with UBS. You may proceed.\n\n**Timothy Arcuri** (Analyst)\nThanks a lot. Industrial last quarter was up 7%. It was up 11% this quarter, and it sounds like it's going to be very strong again in fiscal Q4. Can you just talk, do you think you're now shipping above consumption in these markets? How do you view sort of where we are? Are we now in, you know, inventory build mode in those markets? How do you sort of assess, you know, how long the business can last?\n\n**Richard Puccio** (EVP and CFO)\nSince we called the bottom back in Q2, industrial has been our most profitable business and has grown sequentially every quarter. More recently, as we talked about, the growth has accelerated and our outlook for Q4, which is normally a seasonally down quarter for industrial, we expect it to grow in the low to mid-teens quarter-over-quarter. Very, very strong outlook there. You know, and what's important is growth is happening across all of our industrial sectors, including instrumentation, automation, aerospace, defense, healthcare, and energy infrastructure, as well as across all the geographies. Again, an indication that we are in this cyclical upturn. At the same time for us, we've talked about this in multiple quarters. Our channel inventories continue to be very lean and we believe end demand is still double digits below consumption.\n\n**Richard Puccio** (EVP and CFO)\nNow we are going to start seeing some catch up to the end demand in the fourth quarter. As I mentioned in my prepared remarks, we did see the channel inventory weeks tick down a little bit, as the end demand was a bit higher than we had planned. On top of that, as we look forward, we are continuing to see green shoots across aerospace and defense and ATE. We feel pretty good about where we are both near and long term, from an industrial perspective.\n\n**Timothy Arcuri** (Analyst)\nGreat, thank you.\n\n**Operator**\nThank you. Our next question comes from Harlan Sur with JPMorgan. You may proceed.\n\n**Harlan Sur** (Analyst)\nHey, good morning. Thanks for taking my question and great job on the quarterly execution. Looks like you guys had anticipated last earnings call gross margins for Q3 to be closer to 70%, but actually, you know, afterwards we're actually closer to 69%. I assume it's because of the upside in the lower margin communications business, which was up 17% sequentially. Potentially a mix related. Is that a fair assumption? On Q4 at the midpoint of your guidance range, are you guys assuming that gross margins are improving sequentially?\n\n**Richard Puccio** (EVP and CFO)\nYeah, Harlan, I'll take that one. Yes, we did have an implied increase in the margin. However, we did have an unexpected lower utilization during the quarter, which kept us from growing our gross margin on a sequential basis. However, the utilization is back on track and we expect it to resume its increase. In Q4 at the midpoint, we do expect to get back to a 70% margin. Had we not had the disruption in the utilization in the third quarter, we actually would have grown sequentially. The mix piece, as you mentioned, because we still are only at 45% industrial mix in the third quarter, would have kept us from fully getting to 70%.\n\n**Harlan Sur** (Analyst)\nI see. Thank you, Rich.\n\n**Richard Puccio** (EVP and CFO)\nSure.\n\n**Operator**\nThank you. Our next question comes from Tore Svanberg with Stifel. You may proceed.\n\n**Tore Svanberg** (Analyst)\nYes, congrats on the continuous recovery here. Vince, I had a question on the automation revenue. I think in the past you've talked about this sort of being a 15% grower and that's certainly, you know, above the corporate average. I'm just curious, given everything that you're seeing now in humanoids and robotics, reference designs with some key GPU players and so on and so forth, are you starting to see perhaps an acceleration to that 15% growth target going forward?\n\n**Vincent Roche** (CEO and Chair)\nYeah, thanks for the question, Tore. The automation business for ADI is multiple hundreds of millions of dollars on an annual basis. It's our sense that by 2030, we can double the size of that business given the strength of the R&D pipeline, the opportunity pipeline that we have, as well as some of these new modalities that are coming into play, as demographics and macro pressures kind of lean on putting more and more manufacturing capability closer to points of consumption. There's obviously a security issue as well, supply chain security issues. All those factors, I think, exogenous and endogenous factors point to a strong growth in that business. Also, as I pointed out in the prepared remarks, we're seeing a lot of new sensing modalities come to bear.\n\n**Vincent Roche** (CEO and Chair)\nEvery one of those sensors or actuators that our customers are putting in place requires very, very, very precise sensing control and data processing. For all those reasons, we feel very optimistic about the state of this business and its potential to grow and double its size over the next five or six years.\n\n**Tore Svanberg** (Analyst)\nThank you, Vince.\n\n**Operator**\nThank you. Our next question comes from Vivek Arya with Bank of America. You may proceed.\n\n**Vivek Arya** (Analyst)\nThanks for taking my question. I think in response to a prior question, you mentioned that you're seeing green shoots in different parts of industrial right then, despite the strength that you saw in Q2 and Q3. Does it mean that as we kind of potentially look out to Q1, is ADI still capable of growing at least seasonal or above seasonal? If yes, what is kind of normal range of seasonality so we can calibrate our models? Thank you.\n\n**Richard Puccio** (EVP and CFO)\nVivek, I'll start. From a Q1 perspective, as we've said before, we don't guide to Q1, but we do expect that we'll be able to grow at seasonal. Obviously, for us on an overall perspective, first quarter tends to seasonally be down in the low single digits.\n\n**Vincent Roche** (CEO and Chair)\nYeah, I think, you know, as we look into the new year, I believe industrial will be a very, very strong part of our momentum in the coming year. As Rich narrated in part of the Q&A here, from just the supply-demand side of things, we're seeing customers are in the digestion phase of their excess inventories, and particularly in the broad market, which is a significant piece or has been a significant piece of the industrial business in the past, we're still seeing the demand there quite light. There's still a kind of normalization to take place, which should boost the industrial sales in the coming quarters as well as our position with new products and our position with customers and new applications. In the automation space, we've got aerospace and defense, which has been incredibly strong. In fact, in some ways, we're supply limited in that business.\n\n**Vincent Roche** (CEO and Chair)\nI think that will be the bedrock of the next several quarters of the company's performance.\n\n**Vivek Arya** (Analyst)\nThank you.\n\n**Operator**\nThank you. Our next question comes from Jim Schneider with Goldman Sachs. You may proceed.\n\n**Jim Schneider** (Analyst)\nGood morning. Thanks for taking my question. I was wondering if you could provide a little bit more color on what you're seeing in the automotive market. I believe last quarter you referenced some pullback in activity. Did you actually see that occur in the quarter? If so, from what regions? Going forward, maybe talk a little bit about what's driving the sequential decline you expect in the next quarter and any color you can provide on regions or customer OEM types would be helpful. Thank you.\n\n**Richard Puccio** (EVP and CFO)\nThanks, Jim. Obviously, we continue to perform very well in automotive, particularly in our connectivity and power management. Fueling auto revenue, as we've said, we expect to record record levels of auto revenue for 2025. In addition to our content growth and share gains in the next-gen ADAS and infotainment systems, we do believe our auto revenue has been aided by some order acceleration, which we talked about in Q2. We do think there was some additional acceleration in Q3. However, we do see that unwinding in Q4, which is why we expect to see Q4 come down. We think that will be the sort of closeout of that early buying. This is what we actually talked about when we released our last quarter results; we expected that the pull-ins were likely going to come from our Q4 or Q1 period.\n\n**Richard Puccio** (EVP and CFO)\nBased on the way it's settling out, it looks like it's unwinding in the fourth quarter. If you think about that from just a sizing perspective in the current quarter, we were obviously above our high end of our guide. I think largely that part of the reason we were above the high end of our guide was likely related to auto pull-ins. What's different this time is the auto pull-ins we saw in Q3 were in China, whereas when we talked about them in Q2, that was for North America and Europe. It's impossible for us to know how this will shake out. We do think that given the behavior we've seen from our auto customers, EV credits expiring and the risk that tariffs could curtail production, we are taking a bit of a more conservative view to automotive in the near term.\n\n**Richard Puccio** (EVP and CFO)\nStepping back again, we'll have our third record year in auto in the last four years, which is reflecting our content and share gains. We've talked about this before; we tend to outpace the SAR volumes with content gains where we're getting about a double-digit benefit from share and content. We feel really well positioned there as we go into the medium and long term.\n\n**Operator**\nThank you. Our next question comes from Stacy Rasgon with Bernstein Research. You may proceed.\n\n**Stacy Rasgon** (Analyst)\nHi guys, thanks for taking my question. Around the auto pull-ins, and I guess relative to industrial, you're guiding auto implicitly down 15% sequentially as those pull-ins kind of ease. Industrial, you're guiding up, I don't know, you said low to mid-teens, which would put it up, you know, in the mid-30% year-over-year. What are you seeing differently on the trends in industrial versus what you saw in auto that gives you confidence that the strength you're seeing in industrial is not also pull forward?\n\n**Richard Puccio** (EVP and CFO)\nWhat we talked about last time is the indicators, Stacy, for what we thought were pull-ins, where we saw unplanned growth in areas, you know, around, and we saw the anomalous bookings behavior that happened around the tariff announcements and in the exceeding reversals, things normalized. We have not seen that kind of behavior in industrial. In fact, the bookings trends have followed the trends we were expecting. It's impossible to say there isn't some minor amount maybe in any of the businesses, but we haven't seen anything outside of auto that would give us an indication there's any meaningful pull-in in our business.\n\n**Vincent Roche** (CEO and Chair)\nYeah, I think it's going to... Go ahead.\n\n**Stacy Rasgon** (Analyst)\nThe guide for industrial is well above seasonal, though. Is that just increased demand? It's channel fill or what?\n\n**Vincent Roche** (CEO and Chair)\nNo, it's nothing to do with channel. Channel is very lean. We're still under shipping real consumption of the market. Parts of industrial have been just in inventory digestion mode for actually a couple of years. We're starting to get that behind us. If you look at the strength of our aerospace and defense business, I mentioned there a little while ago, we're actually supply limited there. Very, very strong backlog. ATE which is supporting the build-out of AI chips and infrastructure, very, very strong demand. We've begun to see the recovery of the automation business over the last couple of quarters, two, three quarters.\n\n**Vincent Roche** (CEO and Chair)\nWhen you couple that as well with healthcare, which has been really damp in terms of demand ever since the peak of the pandemic, that should come good as well in that we're seeing signs of stabilization, but that should come good over the next few quarters. I think you put all that together, the breadth and the depth, the customer count, the product count, some of the idiosyncratic trends that we've captured, as well as just the overall rising tide in demand across the board, bodes well for the industrial business.\n\n**Stacy Rasgon** (Analyst)\nGot it. That's helpful. Thank you.\n\n**Operator**\nThank you. Our next question comes from Chris Danely with Citi. You may proceed.\n\n**Chris Danely** (Analyst)\nHey, thanks, guys. Can you just give us a little more color on why the utilization rates came down, where utilization rates are, where you expect them to go, and any other gross margin drivers going forward as well? Thanks.\n\n**Vincent Roche** (CEO and Chair)\nI think we had, as Rich said, a one-time event in our European fab during the last quarter. That was the primary dampening effect on the gross margin. It became an absorption issue. I will say as well, pricing has been very, very steady. As our mix improves on the industrial side of things, we get the benefit of that in the gross margin. I don't expect a repeat of what was a one-time event in one of our factories in the last quarter to repeat.\n\n**Chris Danely** (Analyst)\nWhat are utilization rates now?\n\n**Richard Puccio** (EVP and CFO)\nI know you always like to ask me this question. They're increasing. We're not yet back to the utilization levels we were, obviously, in the pandemic era, nor do we expect to get all the way there. We are continuing to increase, as I mentioned, other than this one-time hiccup, which is now behind us. We are back increasing as given the growth we're seeing and the planned starts in the factories. We're getting higher utilizations.\n\n**Vincent Roche** (CEO and Chair)\nI think as well, we have talked many, many times about the CapEx that we've deployed to strengthen the resiliency of the internal fabs at ADI. We have built, we've more than doubled the footprint of the internal fabs that support largely the industrial business. We're absorbing that cost, and as the industrial business continues to increase in strength, that absorption strengthens as well. I think you've got to bear those things in mind.\n\n**Chris Danely** (Analyst)\nOkay, thanks, guys.\n\n**Richard Puccio** (EVP and CFO)\nThanks, Chris.\n\n**Operator**\nThank you. Our next question comes from Joe Moore with Morgan Stanley. You may proceed.\n\n**Joe Moore** (Analyst)\nGreat, thank you. A couple of minutes ago, you talked about seeing some supply limitations in aerospace and defense. I wanted to just follow up on that and ask where those supply constraints might be coming from. Are you seeing any supply constraints in any other part of your industrial business as things get stronger?\n\n**Vincent Roche** (CEO and Chair)\nI think we've just seen a tremendous upsurge in demand. It just takes time to lay in the capacity, the tooling in the aerospace and defense area. It's a highly diversified business with an incredible array of product complexities. It's really just a case of each quarter we're laying in more capacity, but the demand keeps increasing. It's a very, very high-quality problem that we have. Demand is surging ahead of our ability to manufacture right now. We've been laying in the CapEx, the tools to make sure that we capture the opportunity. Pretty much everything we do there is sole source. These are proprietary products. We see this. We've increased our footprint. We have an internal factory that's very, very important to the manufacturing of our aerospace and defense solutions. We've been tooling that facility as well. I think, generally speaking, we're in a better and better position.\n\n**Vincent Roche** (CEO and Chair)\nReally, the problem, it's a high-quality problem of surging demand.\n\n**Richard Puccio** (EVP and CFO)\nI'll put an even finer point on it for you, Joe. We're actually deploying tools into the aerospace and defense manufacturing in the third and fourth, some in the third and more in the fourth quarter to alleviate some of the stress events just described. From an overall business perspective, we certainly have supply right now to cover all of the near-term demand that we have on the books.\n\n**Vincent Roche** (CEO and Chair)\nI think the rest of the industrial business is in good shape overall regarding supply.\n\n**Richard Puccio** (EVP and CFO)\nYes.\n\n**Joe Moore** (Analyst)\nThank you.\n\n**Richard Puccio** (EVP and CFO)\nThanks, Joe.\n\n**Operator**\nThank you. Our next question comes from Joshua Buchalter with TD Cowen. You may proceed.\n\n**Joshua Buchalter** (Analyst)\nHey guys, thank you for taking my question and congrats on the good results. Apologize for being nitpicky in an objectively good quarter. I did want to ask about gross margins, though. I think a couple of quarters ago you had mentioned $2.7 billion being sort of the level at which you'd hit 70% gross margins. It looks like that's, you know, seemingly around $3 billion. I guess, can you maybe walk through what's changed and how we should think about fall through from here going forward? Thank you.\n\n**Richard Puccio** (EVP and CFO)\nThanks, Josh. We have talked about this a lot. I think that the part two of what we've said all along is getting to $2.7 billion and getting back to a 70% margin would require us to get back to a more normal industrial mix. Near term, as you saw, we were only 45% industrial when we were building all those models. We were a much larger percentage. We have said we would need to have that mix. Obviously, the mix is shifting as the industrial grows. If you look to our, you know, where we expect our Q4 to go with the industrial growth we've talked about, we will probably exit Q4 with a more like a 49% industrial mix, which is part of the reason we think we'll get back into that 70% range in our fourth quarter.\n\n**Richard Puccio** (EVP and CFO)\nIt is, as we talked at the beginning a little bit, also mix constrained given the industrial piece is our most profitable business.\n\n**Joshua Buchalter** (Analyst)\nUnderstood. Thank you for the color there.\n\n**Richard Puccio** (EVP and CFO)\nThanks, Josh.\n\n**Operator**\nThank you. Our next question comes from Ross Seymore with Deutsche Bank. You may proceed.\n\n**Ross Seymore** (Analyst)\nHi guys, thanks for letting me ask a question. Just wanted to pivot over to the OpEx side of things. Any sort of color for your fiscal fourth quarter? Probably more importantly, as we look into fiscal 2026, I know you guys have a big variable component to your OpEx. This year, it looks like it's up, I don't know, high teens, something like that in fiscal 2025. Any sort of color on how the OpEx would relate to revenues in fiscal 2026? Thank you.\n\n**Richard Puccio** (EVP and CFO)\nFrom a fiscal 2025 perspective, assuming the midpoint for Q4, we expect we'll deliver about 100 basis points of operating leverage versus 2024, which I feel very good about because when we started the year, knowing we were going to have a pretty significant headwind on the variable comp, we thought we might have a pretty flat operating leverage year, but we are going to deliver some additional leverage. A lot of that is coming from the gross margin expansion, as we've talked about, because of variable, our OpEx is growing at a higher rate than we would normally expect.\n\n**Richard Puccio** (EVP and CFO)\nThat is, as we've talked about, in the prior year, given our bonus pays on revenue growth and profitability and the fact that 2024 had no revenue growth and margins were muted, bonus was very low, which was part of the reason we were able to hold our 40% operating margin in the trough year. Now, with a return to significant growth, our variable comp is normalizing to a much higher level from a very low payout in the prior year. If you look forward to 2026, I would expect that acceleration piece that we saw from the variable comp to decline. We obviously would expect to have variable comp in a growth year, but given the new baseline of 2026, we would expect in the revenue growth that we would get some continued leverage as the variable won't increase as radically as it did 2024 to 2025.\n\n**Richard Puccio** (EVP and CFO)\nExcuse me, obviously all of these points of view are contingent on revenue growing, which we're assuming from a top line perspective.\n\n**Ross Seymore** (Analyst)\nThank you.\n\n**Operator**\nThank you. Our final question comes from Chris Caso with Wolfe Research. You may proceed.\n\n**Chris Caso** (Analyst)\nYes, thanks. Good morning. Just a question on business in China right now. You mentioned in some of your earlier comments that China auto was strong last quarter. Could you give us some sense of what the totality of the China business looked like? In that case, even outside of auto, is there any fear of any pull forwards within that business or any anomalies that you may have seen within the China business in the last quarter?\n\n**Richard Puccio** (EVP and CFO)\nSure. Obviously, we've talked about China is a very, very competitive place for us. I continue to be very confident in our ability to win and to grow in China, which we've done for decades. Now, if you think about how we're positioned in the market, we tend to get a premium for our performance, and that's that innovation premium you've all heard me talk about. Where performance matters, they're going to continue to pick us, which is why we tend to get higher ASPs. It also makes it very challenging for those that make products that are good enough to compete with us in that market. From a competitive perspective, we feel very well. Obviously, the other thing for us that's significant is scale is really important, especially in analog with the broad base of components. We've got six decades of experience building that with 70,000 SKUs.\n\n**Richard Puccio** (EVP and CFO)\nIt's really, really especially true in industrial given the diverse nature of that product. As we've talked about now for a number of quarters, China has been leading our recovery. We've talked about them achieving record auto results this year. We had record design wins in 2024. We've continued growth in design wins in 2025. Our outlook for China is pretty positive over the next three to five years based on the things we're seeing here. It is interesting. We've spent a lot of time talking about how strong China auto is. We've started to see year-over-year growth in China across all of the industrial end markets. Outside of auto, all of those other end markets are well off their prior peaks, north of 35% at least, and some of them are still 50% off their peaks.\n\n**Richard Puccio** (EVP and CFO)\nWe think there's still runway there for us from a medium and long-term perspective as that market continues to rebound.\n\n**Operator**\nThank you. I would now like to turn the call back over to Mr. Richard Puccio for any closing remarks.\n\n**Richard Puccio** (EVP and CFO)\nAll right. Thanks everyone for joining us this morning. A copy of this transcript will be available on our website. All available reconciliations and additional information can also be found at the quarterly results section of our investor relations site at investor.analog.com. Thanks again for joining us and your continued interest in Analog Devices.\n\n**Operator**\nThank you. This concludes today's Analog Devices conference call. You may now disconnect.",
      "fetched_at": "2026-02-04T15:42:07.182Z"
    },
    {
      "ticker": "ADI",
      "title": "Analog Devices, Inc. (ADI) Q2 FY2025 earnings call transcript",
      "published_date": "May 22, 2025, 10:00 AM EDT",
      "fiscal_year": "2025",
      "quarter": "Q2",
      "url": "https://finance.yahoo.com/quote/ADI/earnings/ADI-Q2-2025-earnings_call-317229.html",
      "content": "**Operator**\nGood morning, and welcome to the Analog Devices Second Quarter Fiscal Year twenty twenty five Earnings Conference Call, which is being audio webcast via telephone and over the web. I'd like to introduce Rich Pucccio, Chief Financial Officer of Analog Devices.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nThank you, Josh, and good morning, everyone. Before we start the formal part of our earnings call, I'd like to say a few words about Mike Lucarelli. As many of you may know, this will be Mike's last earnings call as he will be leaving ADI at the May to pursue a new career opportunity. I want to thank Mike for his many contributions over his ten years at Analog Devices. Mike has been instrumental in my transition into the company and I will be forever grateful for his advice and guidance as I learned the ropes here.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nI will miss Mike's insights, optimism, and relentless work on behalf of our stakeholders. Mike, I wish you the best in your new adventure. I'll now turn the call over to Mike Lucarelli, vice president of investor relations.\n\n**Michael Lucarelli** (VP - IR and Controller for Data Center &amp; Energy Businesses)\nThank you, Rich. Good morning, everyone. I will say I've thoroughly enjoyed my time working in investor relations. That's because of all you on this call. From investors to the sell side, to my colleagues at ADI.\n\n**Michael Lucarelli** (VP - IR and Controller for Data Center &amp; Energy Businesses)\nVince, it's been a great ten years. Rich, it was short and sweet, but it was good. And to my ADI crew, the Thunder Alley crew, thank you for everything for the past ten years. It's been awesome. Jeff, who I hired over six years ago from the sell side, has been a great asset to the IR team and ADI overall.\n\n**Michael Lucarelli** (VP - IR and Controller for Data Center &amp; Energy Businesses)\nHe'll be replacing me as head of investor relations. Now, Jeff, when I started, the stop was $50. It's now $225.04 x. That means you need to drive this stock to a thousand dollars, and I trust you can do that. So let me pass it to you, Jeff, to host today's call.\n\n**Jeffrey Ambrosi** (Director - IR)\nThank you, Mike. It's been a privilege working for you. You've taught me many things about semis, ADI, and life in general. So, while I'm sad to see you go, I am excited for the opportunity. I'm looking forward to it.\n\n**Jeffrey Ambrosi** (Director - IR)\nNow, for anyone who missed our earnings press release, you can find it and relating financial schedules at investor.analog.com. The information we're about to discuss includes forward looking statements, which are subject to certain risks and uncertainties as further described in our earnings release and our periodic reports and other materials filed with the SEC. Actual results could differ materially from the forward looking information as these statements reflect our expectations only as of the date of this call. We undertake no obligation to update these statements except as required by law. References to gross margin, operating margin, operating expenses and non operating expenses, tax rate, EPS, and free cash flow in our comments today will be on a non GAAP basis, which exclude special items.\n\n**Jeffrey Ambrosi** (Director - IR)\nWhen comparing our results to our historical performance, special items are also excluded from prior periods. Reconciliations of these non GAAP measures to their most directly comparable GAAP measures and additional information about our non GAAP measures are included in today's earnings release. References to EPS are on a fully diluted basis. Okay, and with that, I'll turn the call over to ADI's CEO and Chair, Vincent Rhoef. Vince?\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nThanks very much, Jeff, and very good morning to you all. Our second quarter results exceeded our expectations, both on the top and bottom lines. Revenue growth was broad based with double digit year over year growth across all end markets. Against the volatile operating backdrop, our favorable performance and positive outlook underscores the growing demand for our exceptional product portfolio and the resilience and agility of our business model. While we believe the evolving tariff situation is impacting customers' decision making, the cyclical and ADI specific tailwinds I highlighted last quarter continue, and we're ever more confident that our revenues bottomed in 2024 and that we're returning to growth in fiscal 'twenty five.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nThe secret to our success over these many decades has been sensing business transitions early and adapting quickly to continue focusing our capital where we can best increase our value to customers and improve our ability to capture that value. We invested substantial CapEx over recent years to enhance and scale our hybrid manufacturing model, which helps our customers navigate increasingly dynamic geopolitical and macroeconomic environments. We expanded capacity at our existing fabs in The US and Europe, and added commensurate capacity in our back end facilities. Further, we deepened partnerships with trusted foundries around the world, including securing additional 300 millimeter fine pitch technology capacity at TSMC's Japan subsidiary. We've cross qualified a significant portion of our broad product portfolio to be able to quickly swing production across geographies.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nIn short, our customers now enjoy greater supply optionality and resilience than ever before. On the OpEx side, we're investing at record levels to further strengthen and extend our world class technology stack and continue enhancing our customers' experience and engagement with ADI. These investments allow us to take maximum advantage of the incredible opportunities for profitable growth that we see across our end markets. ADI plays a game that prizes leaps in innovation that transcends near term macro concerns. We focus on five key megatrends that are persistently driving the future of business, the global economy and society, namely autonomy, proactive healthcare, the energy transition and sustainability, immersive experience, and AI driven computing and connectivity.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nAs the essential interface between the physical and digital domains, ADI is a critical enabler of these trends. We continue to define and pioneer the state of the art in high performance analog, mixed signal and power management from sensor to cloud, microwave to bits, and nanowatts to kilowatts. Today, customers are turning to us for more complete solutions. The combination of our extensive franchise with the exquisite creativity and broad based expertise of our technologists gives us the ability to deliver elegant solutions to customer challenges that others struggle even to address. For example, as healthcare becomes more preventative and preemptive, our ability to accurately and reliably sense, measure, interpret and connect clinical grade vital signs in ultra low power settings is driving robust content and revenue growth at key customers in the smart wellness wearable space.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nWithin clinical care settings, our cutting edge imaging and patient monitoring solutions are enabling earlier identification and diagnosis of disease, which can enable more effective treatment and better patient outcomes. Turning to the autonomy trend, advances in automation within the industrial market, for example, are generating tremendous opportunity for ADI. The progression of robotics from fixed arm to autonomous and mobile to humanoid form factors requires ever greater quantities and integrations of sensing, edge computing, connectivity and energy management, driving our content from hundreds of dollars in fixed robots today to potentially thousands in autonomous and humanoid robots. In automotive, higher levels of autonomy are increasing demand for our sensing connectivity and functionally safe power solutions across all vehicle types combustion engines, hybrids and full EVs. Each new generation of automated system, be it industrial robots or car, dramatically expands our content and revenue opportunity.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nAnd one final example from the AI driven computing and connectivity trend, where the world's rapid adoption of AI continues to accelerate the growth of our ATE and data center businesses. Our leadership and success in ATE underscores the quality of our portfolio, as the winners in this market are determined first and foremost by performance. Our content per tester stretches into the hundreds of thousands of dollars, and looking ahead, we believe our leverage of additional mixed signal and digital capabilities to further reduce test time and power requirements will result in even more content per tester. And with AI investments showing no signs of slowing, testing demand for GPUs, XPUs and high bandwidth memory continues to increase, giving us confidence in a long runway for growth. Beyond tests, our data center customers are turning to us to solve the vast and complex power and connectivity challenges that come with high performance, always on AI computing.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nAs a result, demand continues to grow for our innovative systems protection, optical control and power delivery solutions. These are just a few examples of how our solutions leverage persistent trends that transcend business cycles, drive an average selling price four times the industry average, and deliver differentiated results for both our customers and our shareholders. So in closing, we've successfully anticipated the transitions of the ICT industry and invested ahead of the curve for decades. Today we're well positioned to deliver the AI driven intelligent edge solutions that will shape our future success. You may have seen that we just celebrated our sixtieth anniversary, a milestone that fewer than 1% of public companies reach.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nBut as thrilling as that accomplishment is, I'm even more excited about our future and the immense opportunity before us. Now before I hand it over to Rich, I'd like to thank Mike Lucarelli, young Mike, for his distinguished and stellar contributions over the past several years to ADI's success, and I wish him well in his next adventure. With that, over to you, Rich.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nThank you, Vince. Second quarter revenue of $2,640,000,000 came in above the high end of our outlook, up 9% sequentially and 22% year over year. Industrial represented 44% of our second quarter revenue, finishing up 8% sequentially and 17% year over year. Our industrial recovery broadened with all subsectors and regions increasing sequentially. On a year over year basis, we continue to see strong growth in aerospace and defense and ATE.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nAutomotive represented 32% of quarterly revenue, finishing up 16% sequentially and 24% year over year. This record result was fueled by continued strong demand of our leading connectivity and functionally safe power solutions, particularly in China. Additionally, we saw sequential growth in Europe and North America. Communications represented 12% of quarterly revenue, finishing up 5% sequentially and 32% year over year. Wireline and data center, which makes up roughly two thirds of our total communications business, drove our strong growth as AI build outs continue to increase demand for our power and optical control products.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nAnd while wireless revenue declined on a year over year basis, it did grow sequentially. And lastly, Consumer represented 12% of quarterly revenue, finishing flat sequentially and up 30% year over year, our third consecutive quarter of robust growth. This reflects our greater share and stronger content position across a diversified list of applications. Now on to the P and L. Second quarter gross margin was 69.4%, up 60 basis points sequentially, driven by higher utilization.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nOpEx in the quarter was $744,000,000 up $57,000,000 sequentially, driven entirely by variable compensation, resulting in an operating margin of 41.2%. Non operating expenses finished at $54,000,000 and the tax rate for the quarter was 11%. All told, EPS was $1.85 up 32% year over year and above the high end of our guided range. Now I'd like to highlight a few items from our balance sheet and our cash flow statements. Cash and short term investments finished the quarter at $2,400,000,000 and our net leverage ratio decreased to one.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nInventory increased $50,000,000 sequentially as we continue to invest in Divebank to support our recovery. Days of inventory decreased to 169 and channel weeks ticked lower. In the near term, we are maintaining our strategy of balancing leaner channel inventories with higher levels of inventory on our balance sheet. Over the trailing twelve months, operating cash flow and CapEx were $3,900,000,000 and $600,000,000 respectively. We continue to expect fiscal twenty twenty five CapEx to decrease materially from 2024 and be within our long term model of 4% to 6% of revenue.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nFree cash flow over the trailing twelve months was $3,300,000,000 or 34% of revenue. And during that same period, we have returned nearly $2,500,000,000 to shareholders through dividends and share repurchases. As a reminder, we target 100% free cash flow return over the long term, using 40% to 60% for our dividend and the remainder for share count reduction. Before moving on to guidance for our fiscal third quarter, let me provide additional color on recent demand trends given the current backdrop. Unsurprisingly, buying behavior was a bit choppier than normal as we saw some increased activity around the tariff announcements.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nThis was short lived and orders have returned to more normalized levels. Overall, Q2 bookings grew sequentially across all end markets and all geographies, and our backlog entering Q3 is higher than a quarter ago. These signals support our view that our revenue bottomed in 2024, customer inventories are lean, and we are in a cyclical upturn. Now moving on to guidance. Third quarter revenue is expected to be $2,750,000,000 plus or minus $100,000,000 On a sequential basis, at the midpoint, we expect industrial and consumer to lead our growth, Communications to be up and Automotive to decline after a very strong quarter.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nOperating margin is expected to be 41.5%, plus or minus 100 basis points. This includes the impact of our annual salary increases. Our tax rate is expected to be 11% to 13%, and based on these inputs, adjusted EPS is expected to be $1.92 plus or minus $0.10 Now I'll pass it back to Jeff to begin our Q and A session.\n\n**Jeffrey Ambrosi** (Director - IR)\nThank you, Rich. Now let's get to our Q and A session. We ask that you limit yourself to one question in order to allow for additional participants on the call this morning. If you have a follow-up question, please re queue, and we will take your questions if time allows. With that, can we have our first question, please?\n\n**Operator**\nThank you. For those participating by telephone dial in, if you have a question, please press 11 on your phone to enter the queue. If your question has been answered and you wish to be removed from the queue, Our first question comes from Joseph Moore with Morgan Stanley. You may proceed.\n\n**Joseph Moore** (Managing Director)\nGreat. Thank you. And congratulations to young Mike. Can you discuss automotive? The 16% sequential growth really stands out relative to what peers are seeing.\n\n**Joseph Moore** (Managing Director)\nJust what's driving that? And kind of any sense for if there's any tariff pull forward in that or just any mitigation that's happening there? Just how are you growing so much in autos? Thanks.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nThanks, Joe. I'll take that one. So Q2 was notably stronger than expected. Bookings were strong. Turns were a lot higher than normal.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nAnd given some volatility we saw in the quarter, we do think our auto results were aided by pull in activity. While it's difficult to delineate what was pull in versus normal, our estimate for pull in upside is in the high single digit range. However, buying behavior, as I mentioned, has normal pull ins to recur, and this is why we expect to decline in Q3, actually. Additionally, if you think about it, if you adjust for what we think the pull in impact was, we're really guiding a seasonally flat Q3 for auto. On the pull ins, right around the 25% auto tariff news, we saw an acceleration in auto sell through and orders, most notably in The Americas and in Europe, which were collectively up about 20% sequentially, much better than we had planned.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nAnd at the industry level, we saw stronger SAAR numbers than expected in the quarter, potentially also explained by consumers getting ahead of the higher prices. So our hunch is that the upside in auto right around tariffs was not a coincidence. As for China, the other major market for auto, noted last quarter we expect a continued growth and we had another record, and that is what occurred in Q2. And there could have been some pull in activity, but not nearly as noticeable as what we're seeing in North America and Europe.\n\n**Jeffrey Ambrosi** (Director - IR)\nThank you. Go to our next question, please.\n\n**Operator**\nThank you. Our next question comes from Vivek Arya with Bank of America Securities. You may proceed.\n\n**Vivek Arya** (Managing Director)\nThanks for taking my question and thanks and best wishes to Mike as well. So first is, you mentioned that you are at a cyclical upturn and I'm curious, how much do you think you are under shipping demand right now? Is it 10%? Is it 20%? And how many quarters until this kind of just under shipment impact normalizes?\n\n**Vivek Arya** (Managing Director)\nRight? So when do you think your sales will start to correspond more to end demand rather than just inventory replenishment? And I know you just spoke about autos, but I was hoping, once you could give us some more color on the industrial side as well, and the level of under shipment, and then the normalization timing for that. Thank you.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nThanks, Vivek. I'll take the first part of the question. Yeah, so I think, look, we've seen we're in a period now where we've got cyclical tailwinds. We've kept the channel very, very lean. We've been undershipping industrial significantly, actually, I think more so than any other market over the past two years.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nMy sense is we're getting back to a more kind of a normalized convergence between demand and supply in that area. We're still keeping overall inventory, particularly in the channel, we're keeping it very, very lean, putting more and more, as Rich said earlier, putting more inventory on our balance sheet to be ready for the upside. On the industrial side, so I think what we're saying is the franchise, the core franchise of the business, automation, broad base of customers recovering nicely. And we've also seen some excellent examples of green shoots in the aerospace and defense and the AI test area, which I alluded to in my script. And we've got a lot of new wins in healthcare and automation.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nSo there's a good blend, I think, of kind of the legacy franchise and the new technologies pushing the company. So we've got cyclical tailwinds, and we've got idiosyncratic tailwinds as well, given the new products in the new applications.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nYeah. And Vivek, what I'd add is I would say from a consumption perspective, we're probably still shipping 10 plus percent below end consumption. But if you think about the outlook, if you take our guide, embedded in that guide is about 10% in growth in industrial. And at that midpoint, we will be shipping to end demand. And as we talked about, we'll continue to balance the channel inventory.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nBut we will, at the midpoint, be expecting to ship into end demand in 3Q.\n\n**Jeffrey Ambrosi** (Director - IR)\nThank you. Next question, please.\n\n**Operator**\nThank you. Our next question comes from Harlan Sur with JPMorgan. You may proceed.\n\n**Harlan Sur** (Executive Director - Equity Research)\nGood morning. Thank you for taking my question. And Mike, thanks for all the great support over the years and best of luck in your future endeavors. Industrial Automation, I think you guys touched on it a little bit, which is one of your larger sub segments within Industrial. I believe it's about 25% of industrial segments.\n\n**Harlan Sur** (Executive Director - Equity Research)\nThis is one of the last large subsegments to show recovery given the tie in to global manufacturing activity. Automation inflected, I think, in October of last year, it grew in January. Did you guys see further sequential growth in industrial automation in April? And then coincidentally, trade and tariff historically has driven weakness in automation as manufacturers pull back in the face of uncertainty. Are you seeing any changes in industrial automation order trends recently, especially out of China?\n\n**Richard Puccio** (Executive VP &amp; CFO)\nSo we have continued to see growth. In fact, when we look at where we ended the quarter from an automation perspective, we actually have got a book to bill in excess of one. We continue to expect that growth to continue into Q3. In fact, if you look at our industrial business across all of the subsectors of industrial, we have positive book to bills in all of those areas above one. So we feel like that has improved.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nObviously, there's uncertainty across the board around the tariffs, so it's impossible to speculate what that will do. But we have seen growth in bookings and in the revenue.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nI think it's true as well, you know, right across the whole spectrum of applications, automation, we've seen very, very strong book to bill geographically as well, so I think we're in a solid patch right now. Tariffs are definitely, you know, weighing heavily. The uncertainty is, I think, causing circumspection. Many of our customers are holding back on build outs, but I don't think there's any question about the importance of automation from many, many dimensions. We've got the kind of the normal build outs of automation, know, more and more precision, more connected, flexible factories, but also my sense is we'll see a CapEx cycle as localization takes root as well over the coming several years.\n\n**Harlan Sur** (Executive Director - Equity Research)\nThe localization point is, yeah, that's a good example. Thank you.\n\n**Jeffrey Ambrosi** (Director - IR)\nGo to our next question, please.\n\n**Operator**\nThank you. Our next question comes from Tore Svanberg with Stifel. You may proceed.\n\n**Tore Svanberg** (Managing Director)\nYes. Thank you. Congrats on the results. And Mike, thank you so much. Wishing you best of luck.\n\n**Tore Svanberg** (Managing Director)\nVince, you mentioned this a little bit in your script, but robotics, I know this is a market that you have a lot of exposure to. And I think there was a slowdown in that market, especially around the pandemic, yes. But now with AI, it seems that we're sort of at an inflection point. So I was just hoping you could talk a little bit more about that opportunity and some of the design activity that you're seeing on the robotics side. Thank you.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nYeah, thanks, Tory, for the question. Yeah, I think one of the pervasive trends we're seeing is demographic shift. I think automation of productivity is going to be endemic across the globe, and that predates the concern about the need to localize and so on and so forth. So I think the trend is very, very solid. What we're going to see is a new epoch, I think, in robotics that will move into more tactile, more precise robotic systems that will use a lot of intelligence at the edge.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nAnd you know, we are you may have seen some of the press and some of the areas where we're collaborating with robotic suppliers, complementary semiconductor partners as well, to enable this new era of highly tactile precision robotics to take place. Everybody's focused on the humanoid, but I think there are many steps to take place between the kind of the big heavy arm robotics and the more mobile tactile robotic systems. So, you know, our content typically in a large arm system would be hundreds of dollars, but as we see more available opportunity to bring intelligence to the edge, We see more modalities of sensing take roots in these more sophisticated robotic systems. I think the content that we could see there will be an order of magnitude more, maybe more over the coming five, ten years. So my sense is this is a long term persistent trend, and I think we're very, very well positioned at that edge.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nOf course, AI will enable more and more intelligence at the edge, and that's something that we're preparing our solutions to be able to incorporate.\n\n**Jeffrey Ambrosi** (Director - IR)\nThank you. Next question, please.\n\n**Operator**\nThank you. Our next question comes from Chris Daintley with Citi. You may proceed.\n\n**Christopher Danely** (Analyst)\nHey, thanks guys. First of all, Mike, thanks a lot for all your help and honesty over the years. First Dave Paul, now Mike Lucarelli leaving, this is super depressing. Anyway, but congratulations in all honesty. So just a question on leverage guys.\n\n**Christopher Danely** (Analyst)\nSo if we look at the April results and the July guide, OpEx is basically growing about as much as sales. And then the guide for the July, even though you don't guide gross margin implies minimal gross margin growth. So can you just talk about why that's happening? And should we expect some sort of acceleration in leverage going forward? Or should OpEx continue to grow about the same amount of sales and same way with gross margin? Thanks.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nAll right, Chris. I'll take that one. So I'll do the near term first, and then I'll talk a little bit about 'twenty five and what I think you might be able to expect in 'twenty six. So Q2's operating margin was up sequentially despite the big acceleration in variable comp. In fact, our base OpEx was actually flat sequentially.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nSo that's what you saw in Q2. In Q3, we do expect to see some continued operating leverage, which will get offset by the impact of our annual salary increases as well as our continued growth in the variable. Although we will expect the increase in variable certainly sequentially to be lesser degree than we've seen in Q2. If you think about it, just as a reminder for everybody, the mechanics of our variable comp plan, is tied to year over year growth in operating margin, Given the absence of revenue growth in 'twenty four, it was a pretty low year for us. And considering our return to growth here in 'twenty five, variable comp is going to grow and will continue to grow meaningfully.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nSo while we are optimistic we will continue to achieve operating margin percent growth, the increase in the variable in '25 is muting that. However, when we look to '26, we'll be going off of a smaller base. And so we do expect we'll get more leverage if we continue the cyclical upturn. And then on the gross margin side, at the 2.75% guide we expect to be around 70%, which we've talked about. Baked into that assumption is that we will see the growth in industrial we're anticipating, which as you guys know is our most profitable, And that has been one of our challenges.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nWe've talked about it in getting additional leverage. And if you look at just the most recent, the outperform in auto puts pressure on gross margin. But as we see the industrial leading the charge coming out with 10% expected growth in industrial in Q3, we do expect we will get back to around that 70% margin.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nYeah, I think it's worth noting as well, Chris, that where we are adding OpEx to the company, aside from the kind of the inflationary things that we have to deal with, it's in the engineering side. We see tremendous opportunity across more and more spaces for analog technology, power technology, but also digital and software. So we're judiciously adding talent where we need it, and that's a contributor to the OpEx, of course. But obviously, long term, we expect to get the returns and get the growth from these investments.\n\n**Christopher Danely** (Analyst)\nGot it. Thank you.\n\n**Jeffrey Ambrosi** (Director - IR)\nThank you. Question, please.\n\n**Operator**\nThank you. Our next question comes from Stacy Rasgon with Bernstein Research. You may proceed.\n\n**Stacy Rasgon** (Analyst)\nHi, guys. I have two quick questions just on the demand environment. Just first, given the auto dynamics, you talked about, you know, SAAR and everything. What are your expectations for SAAR and auto builds, like, into the second half of the year amid all the tariff uncertainty? Because I think autos are getting hit more by that.\n\n**Stacy Rasgon** (Analyst)\nAnd then secondly, just just, I guess, philosophically, you know, you are seeing pull forward in auto. You don't seem to be seeing it industrial. How would you know if the strength you're seeing industrial is actually true cyclical recovery versus pull forward in the wake of tariffs or uncertainty.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nThanks, Stacy. I'll do the last one. One of the things we looked at as we were trying to assess what we thought might be pull ins, as we track our ordering patterns and what our expectations around the ordering patterns were. So what we saw was at the start of Q2, bookings were progressing higher as we expected them to. Then toward the March, around the time we heard about the auto tariffs, we saw an acceleration in automotive and that lasted for a couple of weeks.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nAs I mentioned, it since has normalized. But when we look across the other end markets, we didn't notice anything unusual from a booking trends. They were as expected and we ended the quarter with, like I said, we ended the quarter with book to bills above parity. And from a geographic perspective, actually bookings were up in all regions. So like I said, we didn't see anything anomalous in the booking patterns outside of what we saw in automotive.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nYeah, I'd say generally speaking, from the conversations we have with our industrial customers, it's kind of steady as she goes to some extent. There's no particular ire or anxiety around supply, so I think it's a pretty normal pattern. And as I said earlier, we're seeing a convergence between, you know, shipment and sell through.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nYeah, and Stacy, sorry, I skipped your first part of your question on SAAR. Our expectation is that we'll see SAAR down in the back half. And as we've talked about before, we still get benefit from the continued increase in content to offset some of that SAAR pressure, but we are expecting the second half SAAR to be lower.\n\n**Stacy Rasgon** (Analyst)\nGot it. That's helpful. Thank you, guys.\n\n**Jeffrey Ambrosi** (Director - IR)\nThanks, Thank you. Next question, please.\n\n**Operator**\nThank you. Our next question comes from Chris Caso with Wolfe Research. You may proceed.\n\n**Chris Caso** (Managing Director)\nYes, thank you. And Michael, the best. Just a question regarding how all of this affect second half and obviously, too early to provide guidance here. But with respect to auto with some of the what you've seen now, as we go into the July, do you think this has normalized such that, whatever happens going into the second half is really a reflection of true demand? And I guess, the same question for the industrial side as well.\n\n**Chris Caso** (Managing Director)\nHow should we be thinking about the puts and takes as we go into the second half?\n\n**Richard Puccio** (Executive VP &amp; CFO)\nSure. I'll talk about a little bit about Q3. So as I said, we do think we benefited from some pull ins in Q2. But given what we've seen in the order rates since and continuing into Q3, we're not really expecting any incremental impact from pull ins in Q3. So our outlook reflects the acceleration in our recovery, most notably, again, in industrial market where we're expecting a very strong quarter.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nWe've got strong bookings momentum across all applications and geographies. As we think about the back half of the year, if you remember last quarter we talked about hitting 7% to 10% for the full year growth. With what we saw in Q2 and what we've seen in bookings trends in our Q3 outlook, I'm actually more confident than I was a quarter ago that we'll end at the higher end of that range. But we will continue to be cautious and mindful given all the tariff uncertainty.\n\n**Jeffrey Ambrosi** (Director - IR)\nThank you. Let's go to our next question.\n\n**Operator**\nThank you. Our next question comes from Joshua Buchalter with TD Cowen. You may proceed.\n\n**Joshua Buchalter** (Director - Equity Research)\nHey, guys. Thanks for taking my questions. Mike, congrats on the new gig. Jeff, congrats to you as well, and good luck with the $1,000 stock price. Sorry to pull on and keep pulling on this thread, but I did want to ask about industrial again. I mean, you were very clear in your commentary about your on books and channel inventory, but do you get the sense that there's any element of your end customer restocking that's going on? Or do or do you think this is, you know, really just an industrial recovery?\n\n**Joshua Buchalter** (Director - Equity Research)\nBecause, again, it does just the sequentials are are better than most of your peers reported even though they, you know, they did go a month ago. Thank you.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nYeah. Go go ahead, Rich.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nThanks. So I I actually don't I don't think we've seen seen sign of I wouldn't call it restocking. I do think that because they are coming off of inventory lows across most of our customer base, and and we we know that because when we look at net new orders, we're seeing net new orders come in from the industrial customers. So I do think that they've had lean inventory and we've seen their purchasing accelerate. But as we've talked about, we've been undershipping industrial pretty significantly for the last two years, and if we head into Q3, we do not expect to undership industrial in Q3.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nWe use POS signals as well to gauge, to get as close to true demand as we possibly can. As we said earlier, industrial is the area where we've been undershipping most, and I think what we're getting back to now is a more normalized pattern of shipping and sell through.\n\n**Joshua Buchalter** (Director - Equity Research)\nThank you both for the color.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nThanks, Josh.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nThanks, Josh.\n\n**Jeffrey Ambrosi** (Director - IR)\nCan we go to our next question, please?\n\n**Operator**\nThank you. Our next question comes from Blayne Curtis with Jefferies. You may proceed.\n\n**Blayne Curtis** (Managing Director)\nHey, good morning guys and I'll offer the congrats to young Mike as well. I actually kind of wanted to ask about the plans outsource versus in source. So obviously, pre pandemic, you were leaning more towards external. And then when you ran out of supply, it was, let's do more internal. I heard you talking about qualifying external fabs. I'm just kind of how are you thinking about this now? Obviously, tariffs are a moving target, but it does seem like more diversity in foundry geographic location is preferable. How are you thinking about it now?\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nYes. Well, look, I think, first and foremost, we're in a good place in terms of the overall capacity footprint that we have. It's more than 2x what it was before the pandemic. So we've been investing primarily in CapEx, building out front end and back end, really to support our growth and give us more resiliency, more flexibility. And I think what we've got now is, particularly on the internal piece, I want to make this point as well.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nWhen it came to nodes at 180 nanometers and above, which would be the majority, Most of ADI's revenue would ship on semiconductor process nodes that are 180 nanometers and above. Essentially, was no external investment in those nodes for many, many years. So we decided, you know, that was an area that we're still developing a lot of new products on. It's a very, very important part of many of our businesses, particularly industrial and automotive. So we decided to place the investments internally to make sure that we have sufficient growth upside and ability to capture the value that we're creating.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nSo my sense is now we're, you know, as I said, we've got more than 2x the internal capacity, and we've got this flexible swing between external and internal. You know, from nodes from five nanometers, by the way, we're designing new products in five nanometers. So this business is characterized by massive diversity of semiconductor recipes. But the ones that we can do internally to support the broad base of our business, where now we've secured our position there, and that we'll continue to partner with our key collaborators on the finer geometry nodes at kind of 90 nanometers and below.\n\n**Jeffrey Ambrosi** (Director - IR)\nAll right, that was our final question. Thanks everyone for joining us this morning. And with that, a copy of the transcript will be available on our website and all available reconciliations and additional information can also be found at the quarterly results section of our Investor Relations site at investor.analog.com. Thanks again for joining us and your continued interest in Analog Devices.\n\n**Operator**\nThis concludes today's Analog Devices conference call. You may now disconnect.",
      "fetched_at": "2026-02-04T15:42:11.803Z"
    },
    {
      "ticker": "ADI",
      "title": "Analog Devices, Inc. (ADI) Q1 FY2025 earnings call transcript",
      "published_date": "Feb 19, 2025, 10:00 AM EST",
      "fiscal_year": "2025",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/ADI/earnings/ADI-Q1-2025-earnings_call-259862.html",
      "content": "**Operator**\nGood morning, and welcome to the Analog Devices First Quarter Fiscal Year twenty twenty five Earnings Conference Call, which is being audio webcast via telephone and over the web. I'd now like to introduce your host for today's call, Mr. Michael Lucarelli, Vice President of Investor Relations and Division Controller of Data Center, Energy and Power. Sir, the floor is yours.\n\n**Michael Lucarelli** (VP, IR)\nThank you, Daniel, and good morning, everybody. Thanks for joining our first quarter fiscal twenty twenty five conference call. Moving on the call today are ADI CEO, Chair Vincent Roche and ADI's CFO, Rich Puccio. For anyone who missed the release, you can find it and relaying financial schedules@investor.analog.com. On to the disclosures.\n\n**Michael Lucarelli** (VP, IR)\nThe information we're about to discuss includes forward looking statements, which are subject to certain risks and uncertainties as further described in our earnings release and other periodic reports and other materials filed with the SEC. Actual results could differ materially from the forward looking information as these statements reflect our expectations only at the date of this call. We undertake no obligation to update these statements except as required by law. Refundance to gross margin, operating and non operating expenses, operating margin, tax rate, EPS and free cash flow in our comments today will be on non GAAP basis. These excluded special items.\n\n**Michael Lucarelli** (VP, IR)\nWhen comparing our results to historical performance, special items are also excluded from prior periods. Reconciliations of these non GAAP measures to the most directly comparable GAAP measures and additional information about our non GAAP measures are included in today's earnings release. All references to earnings per share on a fully diluted basis. And with that, I'll turn it over to Asia's CEO and Chair, Vincent Roche.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nThanks very much, Mike, and a very good morning to you all. First quarter revenue profitability and earnings per share all finished above the midpoint of our outlook. And while we continue to operate in a challenging macro and geopolitical environment, our first quarter results and outlook for double digit year over year growth in our second quarter builds my confidence that 2025 will be a year of growth. Our track record of resilience and profitability through cycles, combined with our strong balance sheet, supports our long standing robust capital return program. I'm delighted to share that we've increased our dividend for the twenty first consecutive year and that over just the past five years, we have returned more than $16,000,000,000 or roughly 15% of our current market cap to shareholders through dividends and share repurchases.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nTurning now to our operating environment, the magnitude and duration of this most recent semiconductor cycle has surprised many of us, but we believe ADI has entered and is well positioned for sustained recovery. Throughout the cycle, we invested diligently to enhance and leverage our hybrid manufacturing model to support the dynamic needs of our customers, both big and small. We work closely with our customers to be responsive to their evolving business needs and map factory starts to true end demand. As a result, inventory levels have largely normalized and our partnership approach with our customers throughout the volatility of the past several years has enabled us to balance supply and real demand. While the macro backdrop will continue to influence the pace of our recovery, the signals we monitor from lean channel inventories to gradual bookings improvements over the past eighteen months, support our view that we've passed the cyclical trough and the tide has turned in our favor.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nThroughout the cycle, we've been busily deepening our customer engagements and accelerating our pipeline growth and conversion. Many of the design wins I've shared on recent calls are now contributing to growth. And let me give you some examples. For example, in industrial automation, the shift towards decentralized intelligence to enable modular manufacturing is driving significant growth in software defined connectivity solutions. Our software configurable IO products at double channel density and reduced power consumption by 40% have been installed across all major automation suppliers.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nRevenue from these wins has begun ramping as the automation market begins to recover and will provide a durable revenue stream over the next decade. Within the growing surgical robotics segment, increasing levels of content from across our portfolio and in particular, our high precision solutions are being deployed in next generation surgical systems. And additionally in healthcare, the growing interest in a data driven approach to health and wellness is creating a convergence of the clinical and consumer markets and driving demand for higher performance vital signs monitoring in consumer wearables. Our suite of high performance sensors, signal chains and efficient power solutions and wins at leaders in these markets position us for double digit growth this year. Within the automatic test equipment market, the growth of AI has significantly increased our signal chain and power content.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nIn some cases, by up to 300% across memory test systems. Customers are leveraging our solutions to increase channel density and throughput, while reducing power demands by up to 30% per system. In light of increased hyperscaler CapEx, we expect our 2025 memory and high performance compute test revenue to achieve strong growth. In our broad aerospace and defense portfolio, our modules, which support ASPs often into the hundreds of thousands of dollars, are expected to lead double digit growth in this industrial subsector in 2025. In addition, we're anticipating growth this year from newer design wins in orofin power in the military and commercial satellite sectors.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nIn automotive, the convergence of trends ranging from autonomy to electrification to immersive in cabin experiences continue to drive robust demand for many of our solutions. For example, our GMSL portfolio is outpacing the growth of advanced driver assistance systems and is positioned to reach yet another record breaking year in 2025. Since acquiring this video connectivity technology in 2021, our revenue has nearly tripled. We're also anticipating continued record setting revenue from our A2B and functionally safe power franchises, which share similar growth trajectories. Lastly, in electric vehicles, BMS is poised to return to growth in 2025 after a challenging prior year.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nPart of this growth is coming from our higher content wireless solution wins with key OEMs ramping in America and Europe. In Communications, our growth is predominantly being driven by robust CapEx investments to support AI infrastructure build outs. Our high precision electro optical controller is now shipping in a 1.6 terabit optical module for AI systems based on industry leading GPUs. On the power side of the data center, we're delivering high voltage power path protection systems, which are on a strong growth trajectory and we'll begin shipping our vertical power solutions later in this year. Finally, in consumer, design wins secured in recent years at multiple customers across numerous applications, including premium handsets, hearables, wearables and gaming systems began to drive robust diversified growth in the second half of fiscal twenty twenty four.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nWith even more content in upcoming launches, we expect a strong year ahead and beyond in consumer. Collectively, we anticipate these combined cyclical and idiosyncratic trends to return us to a solid growth path this year. So in closing, the relatively favorable position in which we find ourselves coming out of one of the worst downturns the industry has ever experienced is not by chance, but rather a reflection of our fiscal and operational discipline, commitment to the success of our customers and our investments for the long term. And while I'm excited about our prospects for 2025, I'm even more excited about the longer term opportunities across numerous concurrent secular growth areas, including automation, digital healthcare, electrification, automotive data center and many, many more. A common request from our customers across our many diversified applications is that we help them tame the increasing complexity by bringing more complete solutions to them, a reflection of our robust technology stack and stellar customer reputation.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nIn stepping up to our customers' challenge, we continue to push the edges by investing vigorously in our world class analog, mix signal and power portfolios and integrate higher levels of supporting digital and software into our solutions to meet our customers at the application layer. And so with that, I'd like to pass the call over to Rich.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nThank you, Vince. And let me add my welcome to our first quarter earnings call. First quarter revenue of $2,420,000,000 came in above the midpoint of our outlook for a 1% sequential decrease and a 4% decline year over year. Adjusting for the extra week in our fiscal Q1 twenty twenty four, however, our Q1 twenty twenty five performance represents a 4% increase in our first year over year growth since Q2 of twenty twenty three. Industrial represented 44% of our first quarter revenue finishing up 1% sequentially.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nThe improved customer inventory backdrop is benefiting each of our industrial sites. In addition, we are seeing stronger demand in our automatic pest and aerospace and defensive businesses, each of which were up year over year. Automotive represented 30% of quarterly revenue finishing up 2% sequentially. Our leading connectivity and functionally safe power solutions were each up double digits year over year once again, reflecting secular content growth and greater share position. Communications represented 12% of quarterly revenue, finishing up 6% sequentially.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nWireline, which makes up roughly two thirds of our total communications business was up double digit sequentially and year over year, driven by data center infrastructure build outs fueled by AI demand. Conversely, our wireless revenue continues to see demand challenges. And lastly, consumer represented 13% of quarterly revenue, finishing down 15% sequentially, reflecting seasonal weight. Our second consecutive quarter of robust year over year growth reflects our greater share and stronger content position across a diversified list of applications. Now on to the rest of the P and L.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nFirst quarter gross margin was 68.8%, up 90 basis points sequentially driven by favorable product mix. OpEx in the quarter was $687,000,000 up 32,000,000 sequentially resulting in an operating margin of 40.5%. All told excuse me, non operating expenses finished at $58,000,000 and the tax rate for the quarter was 11.8%. All told, adjusted EPS was $1.63 at the high end of our guided range. Now I'd like to highlight a few items from our balance sheet and cash flow statements.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nCash and short term investments finished the quarter at $2,700,000,000 and our net leverage ratio decreased to 1.1. Inventory increased 27,000,000 sequentially as we replenished the die bank of our fastest turning products. Days of inventory increased to 176, while channel weeks moved lower and remained below our target of seven to eight weeks. Over the trailing twelve months, operating cash flow and CapEx were $3,800,000,000 and $656,000,000 respectively. We continue to expect CapEx for fiscal twenty twenty five to decrease from 24% and fall within our long term model of 4% to 6% of revenue.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nFree cash flow over the trailing twelve months was $3,200,000,000 or 34% of revenue. And during the same time period, we have returned more than $2,400,000,000 to shareholders through dividends and share repurchases. As a reminder, we target 100% free cash flow return over the long term using 40% to 60% for our dividend with the remainder used for share count reduction. As Vince mentioned, we announced an 8% increase to our quarterly dividend to $0.99 from $0.92 In addition, our Board has authorized an incremental $10,000,000,000 for share repurchases resulting in roughly $11,500,000,000 of remaining buyback potential under our current program. Now moving on to guidance.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nSecond quarter revenue is expected to be $2,500,000,000 plus or minus $100,000,000 On a sequential basis at the midpoint, we expect industrial to lead our growth and automotive to grow, while communications and consumer decline. Operating margin is expected to be 40.5% plus or minus 100 basis points, flat sequentially due to a notable uptick in variable compensation. Our tax rate is expected to be 11% to 13% and based on these inputs adjusted EPS is expected to be $1.68 plus or minus $0.1 Before passing it back to Mike to begin our Q and A session, I'd like to address the near term backdrop. Overall, our business continues to improve off our Q2 twenty twenty four trough in what continues to be an uncertain macro environment. We saw further order improvement and a positive book to bill during Q1. Importantly, booking strength was driven by industrial and automotive, our two largest end markets. Given this trend and the exciting product cycles Vince described, I'm confident we will return to long term model growth in 2025 and believe we are well positioned to capture additional upside should macro conditions improve. Over to you, Mike.\n\n**Michael Lucarelli** (VP, IR)\nThanks Rich. Let's get to the Q and A session. We ask that you limit yourself to one question in order to allow for additional participants on the call this morning. If you have a follow-up question, please re queue and locate your question at time levels. With that, we have our first question please.\n\n**Operator**\nOur first question comes from Joseph Moore with Morgan Stanley. Your line is open.\n\n**Joseph Moore** (Analyst)\nGreat. Thank you. I wonder if you could talk about the puts and takes in the auto market. China seems to be the strongest region. Can you talk about how that affects you guys if there is an ongoing shift in the center of gravity towards China? Does that have any impact on pricing margin or the TAM potential for you guys?\n\n**Richard Puccio** (Executive VP &amp; CFO)\nSure. Joe, I'll take that one. This is Rich. So let me give you a little color on what we're seeing in auto. Starting with Q1, revenue came in better than expected, driven by Asia, which we've talked about continued strength in China.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nAs we've talked about in our recent calls, we have flagged we have stronger share and content position at major Chinese EV OEMs with multiple products, again, including our audio and video connectivity solutions, functionally safe power and BMS. And this is coming through in the results and we expect it to continue into Q2. As for the impact of a change in center, we continue to see strong results, right, from three straight quarters of double digit growth in China being led by auto. In addition, from what we can talk about this, we've seen growth in the other parts of the China business, but the auto is continuing to lead.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nYes, I've been saying for a long time, Joe, that as long as there is a market for high performance technologies, that ADI's technologies would continue to be relevant and that is the case. We see it in automotive, we see it in the industrial sector, the cloud communications. And we're getting well paid for the quality of the technologies that we're bringing. So it's clearly a competitive market, particularly at the kind of mid low end with indigenous suppliers coming on stream. But given the high performance trust in our portfolio, we're getting rewarded for the capabilities that we bring at the system level for our customers. Thanks, John.\n\n**Joseph Moore** (Analyst)\nGreat. Thank you.\n\n**Operator**\nThank you. Our next question comes from Vivek Arya with Bank of America Securities. Your line is open.\n\n**Vivek Arya** (Managing Director)\nThanks for taking my question. Rich, just to clarify, what is that long term model growth that you expect to return to this year? And then Vince, my question is for you. You mentioned that inventory levels have largely normalized. Is that distributors?\n\n**Vivek Arya** (Managing Director)\nIs that at OEMs also? Does it apply to all end markets or mostly to industrial? Basically, how does that inform us about how ADI can feel about demand visibility and growth over the next handful of quarters? Thank you.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nYes. Maybe I can take the second part of the question first. Vivexo, we are seeing the normalization across the direct as well as distribution channels. And in pretty much every part of our business, including we were very, very encouraged by the recovery in industrial bookings. And that's a very, very important part of ADI's business.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nIt's at its peak it was 50, a little 50% of the total ADI revenue stream. So we're seeing we monitor also by the way customer inventories, our top customers. So So we see normalization across segments, across customers, both big and small. We've also, by the way, kind of a bellwether for the general base of customers, outside the top few hundreds would be our mass market or a broad market. We've also started to see recovery there.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nYes. And Vivek, when I talk about the long term model, I'm talking about the published range of 7% to 10%. Although, I think as we've talked about as the macro's turn, I think there's opportunity for us to capture even more growth than that.\n\n**Michael Lucarelli** (VP, IR)\nI think your one part, three part question, Vivek, you talked about what we think from here, a kind of growth back half of this year. I think what you mean with that is how do we think about seasonality as you get to 3Q and 4Q. Again, this is not guidance for 3Q, but I'll give you kind of what we see as trends typically over the last ten years for our third quarter. In our third quarter, industrial auto and comps are usually flat plus or minus little depending on where you're on the cycle. Given what Vince was saying about industry normalizing new wins coming on, I think those markets should be flat up.\n\n**Michael Lucarelli** (VP, IR)\nSo I think on the higher end of what normal seasonality is for those businesses. On the consumer side, until we start your holiday build, which means you start growing 5% to 10% in 3Q. Now, obviously a lot of macro crosscurrents, really a cocktail of uncertainty out there on the macro side, which could be the second half. We'll update you in ninety days what we really think about 3Q. Our next question please.\n\n**Operator**\nThank you. Our next question comes from Tore Svanberg with Stifel. Your line is open.\n\n**Tore Svanberg** (Managing Director)\nYes, thank you. I had a question for you, Vince. ADI is a pretty unique position because of your hybrid manufacturing model. And I was just wondering, given all the political turmoil, the geopolitical turmoil that's going on right now, how are you thinking strategically about that hybrid model? Because obviously, you're working with a very important partner in Asia, but then obviously also do some of your own internal manufacturing.\n\n**Tore Svanberg** (Managing Director)\nSo yes, how are you thinking about how this is going to play out in the next few years?\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nThanks, Tori. Well, I think in times of great turbulence, diversity is a great benefit. Diversity of markets, diversity of products, diversity of customers and geographies. So I think I feel good in terms of our ability with that diversity to solve two problems essentially. One is diversity gives us optionality, but it also gives us resiliency.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nAnd by the kind of end of twenty twenty six and early twenty twenty seven, we will have secured at least dual sourcing for the entire product chain of ADI. So about 95% of the products will have at least dual sources. And we've obviously desensitized geographic centricity over the last year as we've invested in our fabs internally in America and Europe. And we've worked with our partners as well to get at least two geographical sources for the products that we procure from our partners externally. So I think, we're in a good position as a company to make sure that overall we have internally got twice the capacity we had at the start of the pandemic. And as I said, we've secured also additional supply in new sources, new fabs with existing partners. So I think we're in a very, very good position to whether whatever turbulence might come our direction.\n\n**Tore Svanberg** (Managing Director)\nThat's great color. Thank you, Vince.\n\n**Michael Lucarelli** (VP, IR)\nThanks, Tore.\n\n**Operator**\nThank you. Our next question comes from Chris Danely with Citi. Your line is open.\n\n**Christopher Danely** (Analyst)\nHey, thanks guys. I guess just to dig into the industrial strength, can you just talk about where that's coming from? Is this mostly inventory replenishment? Is it mostly improved demand? Is it both?\n\n**Christopher Danely** (Analyst)\nAnd then how did bookings trend during the quarter? Was the linearity pretty steady or was there a spike or just a little more color there would be great? Thanks.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nSure, Chris. I'll jump in on that. So on the industrial, if we take a step back, we've grown this business now sequentially for three straight quarters off of what we said was our trough in Q2. And then as for Q2, we actually expect industrial to be the fastest growing market. So we feel pretty good that our recovery is taking shape and really could accelerate if the macro improved.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nFor Q1 specifically, and we've talked about this in a couple of quarters, we saw continued strength in ADAP and in the automatic test equipment. And then what we started to see from a positive perspective is stabilization across automation, healthcare and energy, which I think has been important. And then in Q1, '1 of the things that we've talked a bunch about on prior calls is watching for the pickup in the broad market. We started to see some of that. In fact, the pickup in the broad market drove much of the upside relative to our initial expectations, which gives us confidence to begin shipping in line with end demand.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nSo if you think about we've talked about in prior calls that we took a significant amount of inventory out of the channel during 2024 of about $300,000,000 most of that impacted the industrial market. So as we look at our growth trajectory, shipping more to sell through into the channel will be a tailwind for industrial as well.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nYes. As you know, the industrial sector is largely served through the distribution channel. So, with leanness there, demand recovering, I think all both of those two concurrent streams are tailwinds for the company.\n\n**Michael Lucarelli** (VP, IR)\nYes. On the bookings side, bookings have improved industrial in 1Q versus 4Q, pretty much a problem, all the areas with the biggest strength obviously in AT and ADAM as we talked about. And we think industrial will be our fastest growth market in 2Q and that's supported by the bookings. Thanks, Chris.\n\n**Operator**\nThank you. Our next question comes from Joshua Buckhalter with TD Cowen. Your line is open.\n\n**Joshua Buchalter** (Director - Equity Research)\nHey guys, thank you for taking my question. I wanted to follow-up on the previous one. I think you mentioned in the prepared remarks inventory levels in the channel moved down and I think they entered the quarter already below your seven to eight weeks target. Does either the April guidance or the fiscal twenty twenty five initial outlook of being in your target range include any sort of channel refill? And I guess what signals do you guys need to see before you would want to more clearly get back into that seven to eight week range? Thank you.\n\n**Richard Puccio** (Executive VP &amp; CFO)\nYes. So the current guide for Q2 has us shipping to sell through, so not adding into the channel. And I'll tell you for me for the benchmark and we talk to our distribution partners pretty regularly is if we're fulfilling customer requirements and we're not getting any escalations, we're feeling pretty comfortable right now operating below the seven weeks seven to eight weeks we've had historically. To balance that out, we're carrying a bit more inventory on our own books, which gives us some flexibility, particularly given the amount of the inventory we're carrying in Die Bank, which allows us to be quicker to respond. So near to medium term, I don't expect that we would be adding back to the channel, but we certainly do not want to go any lower.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nYes, I think just add a bit of color to what Richard said as well. The centralization of inventory management, I think has served our customers very well, customers of all sizes over the past to what is essentially now five years of this of the old cycle. So we'll continue doing that and that will be a critical guide as we think about how we modulate channel inventories over time.\n\n**Joshua Buchalter** (Director - Equity Research)\nVery helpful color. Thank you and congrats on the results in the cocktail of uncertainty.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nThank you.\n\n**Operator**\nThank you. Our next question comes from Christopher Rolland with Susquehanna. Your line is open.\n\n**Christopher Rolland** (Senior Equity Analyst)\nHey guys, thank you for the question. Mine is around two very specific opportunities that you've talked about in the past. One is optical connectivity and then the other is AI power. If you have any developments in those products or markets, would love to know those or maybe it's just playing out like you thought it would, but would love to know how interest orders etcetera are going for those products?\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nYes. Thank you. Well, I'd say first and foremost, our opportunity pipeline has been growing steadily in this AI driven infrastructure world. And we've been a long term player in this electro optical interface category, where we provide these very precise high compute throughput control systems for stabilizing the electro optical modems. And we've just introduced our 1.6 terabit, which is the very much the benchmark for throughput in the systems today.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nOf course, those speeds will continue to increase. The sophistication of what we build will continue to grow as well. So that's been a very good business, a high growth business for Adriana for many, many years and it predates the AI build out of the build out AI infrastructure. Our power technologies really straddle two different areas. One is, if you like the power control systems that are important for the overall health of a data center at kind of the board level, the server level.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nAnd the other is and a good example by the way of that part control will be these hot swapping reset generators and so on these very, very tough analog problems that need to be solved. The second part of the power story is the delivery of energy to the GPUs, the chip systems themselves. And we're going to production in the second half of this year with a vertical power technique with one of the big hyperscalers. And we have other designs in train that will come on stream as well, I believe in the '26 period.\n\n**Christopher Rolland** (Senior Equity Analyst)\nFantastic color there. Thank you so much. And maybe just kind of playing into these kind of new products that are emerging here. Are there any new other new products to call out, new customers, new end markets, any of these kind of free options as I like to call them, that are emerging for your company? And anything you can point to, anything new that maybe you haven't had before any new opportunities?\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nThat depends on how far into the future he wants to go. But let me give you a couple of real time examples here. I mentioned in the prepared remarks, the conversions of wellness based healthcare solutions with the consumer sector. We see that the interest in building those systems out is becoming, I would say, very, very active. We're well positioned as a company because we've been building the sensory and signal processing technologies for a long, long time.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nSo I would call that out as an area with good spectrum of customers across many geographies and many, many different types of healthcare modalities that need to be measured at the clinical grade level incidentally areas like continuous glucose monitoring, being able to do that in a closed loop system, both the input and the output. So I think that is an area that we're excited about, but we have a lot of good technologies that are being deployed at faster rates into that area. And if you want to go really into the future, there is life beginning to appear in the whole quantum computing world. And we're at the early stages of building control systems, if you like precision control systems for these very, very complex computing elements.\n\n**Christopher Rolland** (Senior Equity Analyst)\nVery cool. Thank you so much.\n\n**Michael Lucarelli** (VP, IR)\nHey, it's Krish. As a reminder, if there's any additional questions from people who've asked questions, please re queue. We have some extra time. Otherwise, we'll go to our next question.\n\n**Operator**\nThank you. Our next question comes from Harsh Kumar with Piper Sandler. Your line is open.\n\n**Harsh Kumar** (Managing Director &amp; Senior Research Analyst)\nYes. Hey, guys. I just wanted to hit upon the call for the bottom. I guess you're calling that, I guess what is the confidence level that this is not a head fake? I know you're talking about increased orders and normalization of inventory, but there's a lot of geopolitical movement, there's a lot of tariffs.\n\n**Harsh Kumar** (Managing Director &amp; Senior Research Analyst)\nHelp us understand why the confidence level is so high that we've reached the bottom and this isn't just some kind of head fake? Thank you.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nWell, I think first and foremost, we have a lot of conversations with a lot of customers. We've tens of thousands of customers in our portfolio. We pay attention to the signal that matters to us most is sell through. So POS is how we that's where we focus and that POS signal is how we plan our supply at ADI, how we run our business and run our supply system. So that's first and foremost.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nI think we are seeing the stabilization in the business and growth in certain areas right across the spectrum. And then there is geographically, there is a diversity of progress as well. I'd say Japan is most muted. America and China are strongest. I would say Asia Pacific is strong and Europe is somewhere between where Japan is and where the rest are.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nSo but that's essentially how we view the work. As we said in the prepared remarks, what's incalculable here in our thinking is the effect of any potential geopolitical turmoil, trade war and so on and so forth. So that I think will be the governor ultimately during this year as to the rate of recovery. But I have a strong conviction that we're in a new cycle in the semi sector and certainly in ADI's business.\n\n**Harsh Kumar** (Managing Director &amp; Senior Research Analyst)\nThank you for the color. Thanks.\n\n**Michael Lucarelli** (VP, IR)\nThanks Harshan. We'll go to our last question please.\n\n**Operator**\nThank you. Our next question comes from Tore Svanberg with Stifel. Your line is open.\n\n**Tore Svanberg** (Managing Director)\nYes. I just had a follow-up on the conviction in growth there. Typically when we go through these cycles, I think customers they sort of hold off buying new products until sort of the older products have cleared out. And I'm just wondering if there's some of that going on. I mean, I guess that really relates to your design win conversion rate.\n\n**Tore Svanberg** (Managing Director)\nSo any comments you can make on that conversion rate really starting to play out would be really helpful. Thank you.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nYes. Well, for example, Tory, the strength we're seeing in ATE markets, in the automotive market, for example, in areas like new data center modalities, those areas are largely driven by a lot of new products. So I would say there's three examples of where new products are making a huge difference. In fact, they're also with each new generation, we're capturing more ASP. So, we've often shared with you our famous vintage chart, which shows the age of the portfolio.\n\n**Vincent Roche** (CEO &amp; Chair of the Board of Directors)\nWe measure very, very carefully within that vintage chart, the contribution of newer products within a three and ten year period as to what's going on. But I can tell you the conversion rate, the introduction of new parts and the capturing of opportunity with new parts is strong, new products and new solutions. And obviously, we've got also a very strong franchise. Our legacy products tend to get pulled by these new anchor products that we're building. I'd say overall, I'm pleased with the effectiveness of our R and D spends and how we're capturing and creating new markets and new applications and opportunities.\n\n**Tore Svanberg** (Managing Director)\nVery helpful. Thank you.\n\n**Michael Lucarelli** (VP, IR)\nThanks, Torrance. And I'll now have one more question from Joe Moore, I believe.\n\n**Operator**\nThank you. I'm showing no further questions at this time.\n\n**Michael Lucarelli** (VP, IR)\nAll right. No problem. I think we answered all the questions then. Thanks everyone for joining us this morning. A copy of transcript will be available on our website.\n\n**Michael Lucarelli** (VP, IR)\nThanks for joining and your continued interest in Analog Devices.\n\n**Operator**\nThis concludes today's Analog Devices conference call. You may now disconnect.",
      "fetched_at": "2026-02-04T15:42:16.181Z"
    }
  ]
}