{
  "ticker": "AMZN",
  "last_updated": "2026-02-04T15:38:09.254Z",
  "total_transcripts": 3,
  "transcripts": [
    {
      "ticker": "AMZN",
      "title": "Amazon.com, Inc. (AMZN) Q3 FY2025 earnings call transcript",
      "published_date": "Oct 30, 2025, 5:00 PM EDT",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/AMZN/earnings/AMZN-Q3-2025-earnings_call-369430.html",
      "content": "**Operator**\nThank you for standing by. Good day, everyone, and welcome to the Amazon.com Third Quarter 2025 Financial Results Teleconference. At this time, all participants are in a listen-only mode. After the presentation, we will conduct a question-and-answer session. Today's call is being recorded, and for opening remarks, I'll be turning the call over to the Vice President of Investor Relations, Mr. Dave Fildes. Thank you, sir. Please go ahead.\n\n**Dave Fildes** (VP of Investor Relations)\nHello, and welcome to our Q3 2025 Financial Results Conference call. Joining us today to answer your questions is Andy Jassy, our CEO, and Brian Olsavsky, our CFO. As you listen to today's conference call, we encourage you to have a press release in front of you, which includes our financial results, as well as metrics and commentary on the quarter. Please note, unless otherwise stated, all comparisons in this call will be against our results for the comparable period of 2024. Our comments and responses to your questions reflect management's views as of today, October 30, 2025, only, and will include forward-looking statements. Actual results may differ materially. Additional information about factors that could potentially impact our financial results is included in today's press release and our filings with the SEC, including our most recent annual report on Form 10-K and subsequent filings.\n\n**Dave Fildes** (VP of Investor Relations)\nDuring this call, we may discuss certain non-GAAP financial measures in our press release, slides accompanying this webcast, and our filings with the SEC, each of which is posted on our IR website. You will find additional disclosures regarding these non-GAAP measures, including reconciliations of these measures with comparable GAAP measures. Our guidance incorporates the order trends that we've seen to date and what we believe today to be appropriate assumptions. Our results are inherently unpredictable and may be materially affected by many factors, including fluctuations in foreign exchange rates, changes in global economic and geopolitical conditions, tariff and trade policies, and customer demand and spending, including the impact of recessionary fears, inflation, interest rates, regional labor market constraints, world events, the rate of growth of the internet, online commerce, cloud services, and new and emerging technologies, and the various factors detailed in our filings with the SEC.\n\n**Dave Fildes** (VP of Investor Relations)\nOur guidance assumes, among other things, that we don't conclude any additional business acquisitions, restructurings, or legal settlements. It's not possible to accurately predict demand for our goods and services, and therefore our actual results could differ materially from our guidance. Now I'll turn the call over to Andy.\n\n**Andy Jassy** (CEO)\nThanks, Dave. We saw strong growth across our business in Q3, and we're reporting $180.2 billion in revenue, up 12% year-over-year, excluding the impact from foreign exchange rates. Operating income was $17.4 billion, but would have been over $21 billion if not for two special Q3 expenses: $2.5 billion for an FTC settlement and $1.8 billion for estimated severance costs. Trailing 12-month free cash flow was $14.8 billion. I'll start with AWS. AWS is growing at a pace we haven't seen since 2022, re-accelerating to 20.2% year-over-year, our largest growth rate in 11 quarters. It's worth remembering that year-over-year % growth is a relative term. It's very different having 20% year-over-year growth on a $132 billion annualized run rate than to have a higher % growth rate on a meaningfully smaller annual revenue, which is the case with our competitors.\n\n**Andy Jassy** (CEO)\nBacklog grew to $200 billion by Q3 quarter end and doesn't include several unannounced new deals in October, which together are more than our total deal volume for all of Q3. AWS is gaining momentum. Customers want to be running their core and AI workloads in AWS, given its stronger functionality, security, and operational performance. The scale I see in front of us gives me significant confidence in what lies ahead. I'll share a little more detail on why. It starts with AWS having much broader infrastructure functionality. Startups, enterprises, and governments want to move their production workloads to the place that has the broadest and deepest array of capabilities. AWS has more services and deeper features within those services than anybody else and continues to innovate at a rapid clip.\n\n**Andy Jassy** (CEO)\nThese are key building blocks for anything that customers want to create, and they're a big part of why Gartner has named AWS leader in its strategic cloud platform services, Magic Quadrant, for 15 consecutive years. We're bringing the same building block approach to AI. Amazon SageMaker makes it much simpler for companies to build and deploy their own foundation models. Amazon Bedrock gives customers leading selection of foundation models and superior price performance to deploy inference into their next-generation applications. A lot of the future value companies will get from AI will be in the form of agents. AWS is heavily investing in this area and well-positioned to be a leader. Companies will both create their own agents and use agents from other companies. For those building their own, it's been harder to build than it should be.\n\n**Andy Jassy** (CEO)\nIt's why we launched Strands to make it much easier to create agents from any foundation model that builders desire. For companies who've successfully built agents, they've hesitated putting them into production because they lack secure, scalable runtime services, or memory or observability built specifically for agents. It's why we launched AgentCore, a set of infrastructure building blocks that allow builders to deploy secure, scalable agents. Ericsson used AgentCore to deliver AI agents across their workforce. Sony used it to build an agentic AI platform with enterprise-level security, observability, and scalability. Cohere Health is using AgentCore to deploy agents that will reduce medical review times by up to 30% to 40%. AgentCore's SDK has already been downloaded over a million times, and our builders are excited about it. It's an enabler.\n\n**Andy Jassy** (CEO)\nCompanies will also use others' agents, and AWS continues to build many of the agents we believe builders will use in the future. For coding, we've recently opened up our agentic coding IDE called Curo. More than 100,000 developers jumped into Curo in just the first few days of preview, and that number has more than doubled since. It's processed trillions of tokens thus far, weekly actives are growing fast, and developers love its unique spec and tool calling capabilities. For migration and transformation, we offer an agent called Transform. Year to date, customers have already used it to save 700,000 hours of manual effort, the equivalent of 335 developer years of work. For example, Thomson Reuters used it to transform 1.5 million lines of code per month, moving from Windows to open-source alternatives and completing tasks four times faster than with other migration tools.\n\n**Andy Jassy** (CEO)\nCustomers have also already used Transform to analyze nearly a billion lines of mainframe code as they move mainframe applications to the cloud. For business customers, we've recently launched QuickSleep to bring a consumer AI-like experience to work, making it easy to find insights, conduct deep research, automate tasks, visualize data, and take actions. We've already seen users turn months-long projects into days, get 80%+ time savings on complex tasks, and realize 90%+ cost savings. For contact centers, we offer Amazon Connect, which creates a more personalized and efficient experience for contact center agents, managers, and their customers. Connect has recently crested a $1 billion annualized revenue run rate, with 12 billion minutes of customer interactions being handled by AI in the last year and is being used by large enterprises like Capital One, Toyota, American Airlines, and Ryanair.\n\n**Andy Jassy** (CEO)\nThese are real, practical results for customers, and there are many more examples like them. Because of its advantaged capabilities, security, operational performance, and customer focus, AWS continues to earn most of the big enterprise and government transformations to the cloud. As a result, AWS is where the preponderance of companies' data and workloads reside and part of why most companies want to run AI in AWS. To enable customers to do so, we need to have the requisite capacity, and we've been focused on accelerating capacity the last several months, adding more than 3.8 gigawatts of power in the past 12 months, more than any other cloud provider. To put that into perspective, we're now double the power capacity that AWS was in 2022, and we're on track to double again by 2027.\n\n**Andy Jassy** (CEO)\nIn the last quarter of this year alone, we expect to add at least another 1 gigawatt of power. This capacity consists of power, data center, and chips, primarily our custom silicon Trainium and NVIDIA. We've recently brought Project Rainier online, our massive AI compute cluster spanning multiple U.S. data centers and containing nearly 500,000 of our Trainium 2 chips. Anthropic is using it now to build and deploy its industry-leading AI model, Claude, which we expect to be on more than 1 million Trainium 2 chips by year-end. Trainium 2 continues to see strong adoption, is fully subscribed, and is now a multi-billion-dollar business that grew 150% quarter over quarter. Today, Trainium is being used by a small number of very large customers, but we expect to accommodate more customers starting with Trainium 3.\n\n**Andy Jassy** (CEO)\nWe're building Amazon Bedrock to be the biggest inference engine in the world, and in the long run, believe Bedrock could be as big a business for AWS as EC2, and the majority of token usage in Amazon Bedrock is already running on Trainium. We're also continuing to work closely with chip partners like NVIDIA, with whom we continue to order very significant amounts, as well as with AMD and Intel. These are very important partners with whom we expect to keep growing our relationships over time. You're going to see us continue to be very aggressive investing in capacity because we see the demand. As fast as we're adding capacity right now, we're monetizing it. It's still quite early and represents an unusual opportunity for customers in AWS.\n\n**Andy Jassy** (CEO)\nI'll now turn to stores, where the team continues to deliver and innovate for customers across our key priorities: selection, low prices, and convenience, particularly fast delivery. We're offering 14% more selection since last quarter from popular brands like The North Face and Charlotte Tilbury, and we've added hundreds of thousands of items from popular brands this year. Everyday essentials continues to grow quickly, and year to date is growing nearly twice as fast as the rest of the business. We continue to make it easier for customers to order low-priced perishable groceries from Amazon, and customers in more than 1,000 cities and towns now can shop fresh groceries alongside millions of Amazon.com products with free same-day delivery. This is a game changer for customers who can now order milk alongside electronics, check out with one card, and have everything delivered to their doorstep within hours.\n\n**Andy Jassy** (CEO)\nThe team also invented a new add-to-delivery button that lets customers add items to previously scheduled orders, and it's been used more than 80 million times since launch, and it just launched. It's an example of one of those seemingly simple but powerful innovations that make customers' lives easier. We remain committed to staying sharp on price and meeting or beating prices of other major retailers. In July, we had our biggest Prime Day event ever, with customers saving billions of dollars across more than 35 categories. We continue to break records on speed. We're on track to deliver at our fastest speeds ever for Prime members globally once again this year, and we've started rolling out three-hour delivery in select U.S. cities. We're also continuing to invest in infrastructure to speed up rural deliveries and serve more customers in more communities.\n\n**Andy Jassy** (CEO)\nThat includes committing over $4 billion to expand our rural delivery network across the U.S. These are small towns where people want fast delivery, but where other companies have been backing out and reducing service. In contrast, we've already increased the number of rural communities with access to our same-day and next-day delivery by 60%, reaching roughly half of the total communities we plan to expand to by the end of the year. The stores team is also innovating rapidly with AI. For example, Rufus, our AI-powered shopping assistant, has had 250 million active customers this year, with monthly users up 140% year-over-year, interactions up 210% year-over-year, and customers using Rufus during a shopping trip being 60% more likely to complete a purchase. Rufus is on track to deliver over $10 billion in incremental annualized sales. Here are the highlights.\n\n**Andy Jassy** (CEO)\nOur generative AI-powered audio feature that combines product summaries and reviews to make shopping easier has expanded from hundreds of products at launch to millions of products, and millions of customers have used it, streaming almost 3 million minutes. Amazon Lens, an AI-powered visual search tool that lets customers find products with their phone's camera, a screenshot, or a barcode, now includes Lens Live, which instantly scans products and shows real-time matches in a swipeable carousel. Tens of millions of customers are using Amazon Lens each month. Moving on to Amazon Ads, we're pleased with the continued strong growth, generating $17.6 billion of revenue in the quarter and growing 22% year-over-year. We see strength across our broad portfolio of full-funnel advertising offerings that helps advertisers reach an average ad-supported audience of more than 300 million in the U.S. alone.\n\n**Andy Jassy** (CEO)\nWe also continue to be excited about our demand-side platform, Amazon DSP, which lets advertisers plan, activate, and measure full-funnel investments. Last quarter, I mentioned our partnership with Roku, and we've built on that with a partnership with Netflix, providing advertisers using Amazon DSP with direct access to Netflix's premium ad inventory. We announced integrations with Spotify and SiriusXM. With Spotify, we provide advertisers with direct programmatic access to a global audience of more than 400 million monthly ad-supported listeners. With SiriusXM, brands can reach 160 million monthly digital listeners across services like Pandora and SoundCloud. We're excited about the advertising opportunity around Prime Video Live Sports. Live Sports got a lot of interest from advertisers in upfront negotiations for 2025-2026, and we exceeded our own expectations for upfront commitments with significant growth across the board. Finally, we're continuing to innovate for advertisers with AI.\n\n**Andy Jassy** (CEO)\nFor example, in September, we announced an agentic AI tool in Creative Studio that plans and executes the entire creative process in a matter of hours instead of weeks. We're also inventing and seeing strong momentum in several other areas, and I'll mention just a few. In Prime Video Live Sports, NBA on Prime tipped off last week, and our opening night doubleheader averaged 1.25 million viewers in the U.S., a double-digit increase over last season on cable. You'll see us bring the same constant innovation here that we brought to our NFL broadcasts. We're adding golf with the Masters in 2026 and a new skins competition with the PGA Tour on Black Friday this year. We've added Peacock and Fox One to Prime Video's add-on subscription offering of over 100 channels in the U.S. We continue to be energized by the response to Alexa Plus.\n\n**Andy Jassy** (CEO)\nCompared to what we call the classic Alexa experience, Alexa Plus customers are talking to Alexa two times more, those interactions are much longer, and they're covering a broader range of topics. They're using Alexa Plus on Fire TV at 2.5 times the rate of Classic, using natural conversation to discover audio content four times more, engaging with photos four times more, and customers are completing four times more shopping conversations that end in a purchase. We've expanded the number of Project Kuiper satellites in space to more than 150 and delivered over 1 gigabit per second speeds in tests with our enterprise-grade customer terminal, the first commercial phased array we know of to clear that threshold. Finally, Zoox Robotaxis are available to riders in Las Vegas, and we've announced Washington, D.C., as the eighth testing location. We're excited for these to continue rolling out to more riders.\n\n**Andy Jassy** (CEO)\nQ4 is one of our busiest and most energizing times of the year, and we're excited about the continued demand for AWS, the innovations we'll announce to re:Invent in December, the positive customer response to our AI-powered experiences, all the gifts we'll be delivering throughout the holiday season, and a lot more. Thanks in advance to our teammates around the world who are gearing up to deliver for customers once again. With that, I'll turn it over to Brian for a financial update.\n\n**Brian Olsavsky** (CFO)\nThanks, Andy. Starting with our top-line financial results, worldwide revenue was $180.2 billion, a 12% increase year-over-year, excluding a 90 basis point favorable impact of foreign exchange. In Q3, we reported worldwide operating income of $17.4 billion. This operating income includes two special charges, which reduced operating income by $4.3 billion.\n\n**Brian Olsavsky** (CFO)\nThe first charge, of $2.5 billion, is related to a legal settlement with the Federal Trade Commission, which impacts the North America segment and is recorded in the other operating expense line. The second charge, of $1.8 billion, relates to severance costs for role eliminations and impacts all three of our segments. The severance charge is recorded primarily in the technology and infrastructure, sales and marketing, and general and administrative expense line items. Excluding these two charges, worldwide operating income would have been $21.7 billion, or $1.2 billion above the high end of our guidance range. Moving to our segment results, we remain encouraged by the innovation our teams are delivering for customers across all three segments. In the North America segment, third-quarter revenue was $106.3 billion, an increase of 11% year-over-year. International segment revenue was $40.9 billion, an increase of 10% year-over-year, excluding the impact of foreign exchange.\n\n**Brian Olsavsky** (CFO)\nWorldwide paid units grew 11% year-over-year. We continue to prioritize the inputs that matter most to our customers. In the third quarter, our sharp pricing, broad selection, and fast delivery speeds continued to resonate with customers. Customers appreciate the ability to quickly receive items essential for their daily needs, including perishable groceries, and have them delivered in the same day. Our millions of global third-party sellers continue to be important contributors to our vast selection, which helps customers find the items they need at competitive prices. We're committed to building innovative services and features for our sellers, including our ongoing advancements in generative AI. Today, more than 1.3 million sellers have used our generative AI capabilities to more quickly launch high-quality listings. Better listings translate into better traction with customers, and in Q3, worldwide third-party seller unit mix was 62%, up 200 basis points from Q3 of last year.\n\n**Brian Olsavsky** (CFO)\nShifting to profitability, North America segment operating income was $4.8 billion, with an operating margin of 4.5%. Excluding the $2.5 billion charge related to the legal settlement with the FTC, North America segment operating income would have been $7.3 billion, with an operating margin of 6.9%. North America segment operating margin also includes a portion of the severance charge. International segment operating income was $1.2 billion, with an operating margin of 2.9%. Excluding the impact of the severance charge, International segment operating margins expanded year-over-year. Globally, our progress on key inputs is delivering a better customer experience while driving a more efficient cost structure. For example, we're making notable strides in improving inventory placement to speed up delivery to customers. For the third year in a row, we are on track to deliver our fastest speeds ever for Prime members in 2025.\n\n**Brian Olsavsky** (CFO)\nWe continue to tune and improve our fulfillment operations, and our regionalized network is operating at scale. We see many benefits from our inbound process improvements, including a reduction of U.S. inbound lead time by nearly four days compared to last year. This allows us to be more efficient with our inventory purchasing, which benefits working capital. We're also placing inventory more strategically throughout the network. By leveraging our existing infrastructure, we're now offering U.S. customers the ability to order perishable groceries and receive them the same day in as little as five hours. We're seeing positive early results. Since launching in January, when customers start shopping fresh groceries on Amazon, they are visiting the site more often and returning twice as often as non-perishable shoppers. Looking ahead, we see further opportunity to improve productivity in our global fulfillment and transportation network.\n\n**Brian Olsavsky** (CFO)\nWe will continue to improve inventory placement to drive down distance traveled and touches per package. We will also build on the gains from our regionalized network through algorithmic improvements, as well as launching robotics and automation. While operating margin may fluctuate quarter to quarter, we have a deliberate approach to achieve sustained progress over the long term. Shifting to advertising. Advertising revenue was $17.7 billion, and growth accelerated for the third consecutive quarter. We continue to see strong growth on an increasingly large base as our full-funnel advertising approach of connecting brands with customers is resonating. Moving next to our AWS segment, revenue was $33 billion, up 20.2% year-over-year. This is an acceleration of 270 basis points compared to last quarter, driven by strong growth across both our AI and core services and more capacity which has come online to support customer demand.\n\n**Brian Olsavsky** (CFO)\nAWS revenue increased $2.1 billion quarter over quarter and now has an annualized revenue run rate of $132 billion. AWS operating income was $11.4 billion and reflects our continued growth coupled with our focus on driving efficiencies across the business. We are expanding our data center footprint largely to accommodate GenAI, and to the extent those assets were placed into service, the related depreciation does impact our margins. As we've long said, we expect AWS operating margins to fluctuate over time, driven in part by the level of investments we're making at any point in time. Now turning to our cash CapEx, which was $34.2 billion in Q3. We've now spent $89.9 billion so far this year.\n\n**Brian Olsavsky** (CFO)\nThis primarily relates to AWS as we invest to support demand for AI and core services and in custom silicon like Trainium, as well as tech infrastructure to support our North America and international segments. We'll continue to make significant investments, especially in AI, as we believe it to be a massive opportunity with the potential for strong returns on invested capital over the long term. Additionally, we continue to invest in our fulfillment and transportation network to support the growth of the business, improve delivery speeds, and lower our cost to serve. These investments will support growth for many years to come. Looking ahead, we expect our full-year cash CapEx to be approximately $125 billion in 2025, and we expect that amount will increase in 2026. I'll finish up my remarks with net income.\n\n**Brian Olsavsky** (CFO)\nWhile we primarily focus our comments on operating income, our third-quarter net income of $21.2 billion includes a pre-tax gain of $9.5 billion related to our investment in Anthropic. This investment activity is not related to Amazon's ongoing operations and is included in non-operating income. We're encouraged by the start of the peak season, and we are ready to serve customers in the coming months. I want to thank our teams across Amazon for their hard work as we get ready to delight customers during the holiday season. Our commitment to elevating the customer experience is the only reliable way to drive sustainable value for our shareholders. With that, let's move on to your questions.\n\n**Operator**\nThank you. At this time, we will now open the call up for questions. We ask each caller to please limit yourself to one question.\n\n**Operator**\nIf you would like to ask a question, please press star one on your keypad. We ask that when you pose your question, you pick up your handset to provide optimum sound quality. Once again, to initiate a question, please press star, then one on your touch-tone telephone at this time. Please hold while we pull for questions. Our first question comes from the line of Justin Post with Bank of America. Please proceed.\n\n**Justin Post** (Managing Director)\nGreat. Thank you. I'll ask on AWS. Can you just kind of go through how you're feeling about your capacity levels and how capacity constrained you are right now? In your prepared remarks, you mentioned Trainium 3 demand and maybe broadening out your customer base. Can you talk about the demand you're seeing outside of your major customers for Trainium? Thank you. Yeah.\n\n**Andy Jassy** (CEO)\nOn the capacity side, we brought in quite a bit of capacity, as I mentioned in my opening comments, 3.8 gigawatts of capacity in the last year, with another gigawatt plus coming in the fourth quarter. We expect to double our overall capacity by the end of 2027. We're bringing in quite a bit of capacity. Today, overall in the industry, maybe the bottleneck is power. I think at some point it may move to chips, but we're bringing in quite a bit of capacity. As fast as we're bringing it in right now, we are monetizing it. On the Trainium demand outside of our major customers, first of all, as I mentioned on Trainium 2, it's really doing well. It's fully subscribed on Trainium 2. It's a multi-billion dollar business at this point. It grew 150% quarter over quarter in revenue.\n\n**Andy Jassy** (CEO)\nYou see really big projects at scale now, like our Project Rainier that we're doing with Anthropic, where they're training their next version of Claude on top of Trainium 2 on 500,000 Trainium 2 chips, going to a million Trainium 2 chips by the end of the year. As I mentioned, today with Trainium 2, we have a small number of very large customers on it. Because Trainium is 30 to 40% more price-performant than other options out there, and because as customers start to contemplate broader scale of their production workloads, moving to being AI-focused and using inference, they badly care about price performance. We have a lot of demand for Trainium. Trainium 3 should preview at the end of this year with much fuller volumes coming in the beginning of 2026.\n\n**Andy Jassy** (CEO)\nWe have a lot of customers, both very large and I'll call it medium size, who are quite interested in Trainium 3.\n\n**Operator**\nThe next question comes from the line of Brian Nowak with Morgan Stanley.\n\n**Brian Nowak** (Managing Director)\nThanks for taking my questions. Congrats on the quarter, guys. So maybe two. One, Andy, sort of a philosophical chip question. There's a lot of questions in the market about Trainium and sort of its positioning versus other third-party chips. How do you think about the key hurdles with Trainium 3 you need to overcome to really make Trainium adoption broader, to your point on the last question, and continue to drive Trainium, as opposed to satisfying what could be broader demand with third-party chips in the near term?\n\n**Andy Jassy** (CEO)\nYeah. First of all, we're always going to have multiple chip options for our customers.\n\n**Andy Jassy** (CEO)\nIt's been true in every major technology building block or component that we've had in AWS. Really, in the history of AWS, it's never just one player that over a long period of time has the entire market segment and can satisfy everybody's needs on every dimension. We have a very deep relationship with NVIDIA. We have for a very long time, and we will for as long as I can foresee the future. We buy a lot of NVIDIA. We are not constrained in any way in buying NVIDIA. I expect that we'll continue to buy more NVIDIA, both next year and in the future. We're different from most technology companies in that we have our own very strong chip team. This is our Annapurna team.\n\n**Andy Jassy** (CEO)\nYou saw it first on the CPU side with what we built with Graviton, which is about 40% better price performance than the other x86 processors. You're seeing it again on the custom silicon on the AI side with Trainium, which is about the same amount of price performance benefit for customers relative to other GPU options. Our customers to be able to use AI as expansively as they want, and remember, it's still relatively early days at this point, they're going to need better price performance, and they care about it deeply. I mentioned earlier the momentum that Trainium 2 has. I think that for us, as we think about Trainium 3, I expect Trainium 3 will be about 40% better than Trainium 2, and Trainium 2 is already very advantaged on price performance. We have to, of course, deliver the chip.\n\n**Andy Jassy** (CEO)\nWe have to deliver it in volumes and deliver it quickly. We have to continue to work on the software ecosystem, which gets better all the time. As we have more proof points like we have with Project Rainier, with what Anthropic is doing on Trainium 2, it builds increasing credibility for Trainium. I think customers are very bullish about it, and I'm bullish about it as well.\n\n**Operator**\nOur next question comes from the line of Doug Anmuth with J.P. Morgan. Please proceed with your question.\n\n**Doug Anmuth** (Managing Director and Internet Analyst)\nThanks for taking the question. I'll stick with basically the same topic, Andy. Can you just talk a little bit about the architecture of Project Rainier and how it's differentiated, and what that means for customers and for AWS? Do you expect Rainier to expand beyond Anthropic, and how do you replicate Rainier with Trainium 3 chips? Thank you.\n\n**Andy Jassy** (CEO)\nYeah. I think what is compelling for Anthropic around Project Rainier is really the Trainium 2 chip, which we've built. First of all, we built a very large cluster that they can use in a very expansive way. It's not simple to be able to build a cluster that has 500,000-plus chips going to a million. That's an infrastructure feat that's hard to do at scale. Some piece of it is the infrastructure capabilities that we've built over a long period of time in AWS that is unusual in the industry. It's also the performance of the chip and the price performance, both of which matter. I think that Project Rainier is something that is specific for Anthropic, but we have a lot of other customers who are interested in employing large clusters of Trainium chips that we're going to hopefully give them a chance to do so with Trainium 3.\n\n**Operator**\nThe next question comes from the line of Mark Mahaney with Evercore ISI. Please proceed with your question.\n\n**Mark Mahaney** (Senior Managing Director)\nThanks. I want to ask about two topics: groceries and then how to think about headcount in the future. On groceries, the perishables, I think last quarter you talked about 70% or something of users had never purchased from perishables from Amazon before. Just talk about whether you—I think you used the term game changer before. Does this mean that maybe you no longer need to do Amazon Fresh stores? You always had this DVD delivery van density advantage. Have you kind of reached a point, you think, of scale and speed that you really can change people's habit and really have them consider Amazon as one of their first grocery options? Do you really feel like you're at that point?\n\n**Mark Mahaney** (Senior Managing Director)\nSecondly, just on the headcount, given some of the recent news, just talk to us about how you think about headcount going forward. Are you seeing that—is the level of efficiencies that you're getting from AI such that. You can keep headcount relatively flattish for the foreseeable future? Just talk about the pros and cons or the wins and losses in terms of that headcount going forward. Thank you.\n\n**Andy Jassy** (CEO)\nYeah. I'll start with grocery, Mark. We have a very large grocery business. If you look at our entire grocery business, if I don't even count Whole Foods Market and Fresh, in the last 12 months, it's over $100 billion of gross merchandising sales, which would make us a top-three grocery in the U.S.\n\n**Andy Jassy** (CEO)\nA good chunk of it is a lot of the items that you'd find in the middle aisle, so consumables and canned goods and pet food and health and beauty. Very significant. That continues to grow at a very good clip. We also have Whole Foods Market, which is the pioneer in organic foods, which is also growing at a faster clip than most grocery companies and with an attractive trajectory on profitability. We'll expand our Whole Foods physical presence over the coming years here. I'm also very excited about this new concept, Daily Shop, that we have, which is a smaller version of Whole Foods in urban settings. We have three that we've launched that are off to very good starts that you should expect to see more of as well. We have always been, as you referenced, we've talked a lot about having a larger mass physical presence.\n\n**Andy Jassy** (CEO)\nWe continue to experiment with various formats. The one that we are most excited about is what you referenced, which is the ability to provide perishable groceries with same-day deliveries. If you think about how many of our customers are buying from us multiple times a week and who are buying things like shampoo or detergent or paper cups or water, where the ability to add milk and eggs and yogurt and other perishables to their order and have it live in the same shopping cart and then show up a few hours later is very compelling. We started with a few markets about a year ago, and we were really taken aback at the adoption, not just the number of people that started buying perishables from us very quickly, but how often they came back downstream to buy perishables and groceries from us in the future.\n\n**Andy Jassy** (CEO)\nWe've now expanded that to 1,000 cities around the U.S. We'll be in 2,300 by the end of the year. It's really changing the trajectory and the size of our grocery business. I also believe that this many-year tradition of the weekly stock-up, grocery stock-up is changing. I think we're a big part of that. I think there's a lot of potential there for the grocery side. It doesn't mean that we won't continue to experiment with other physical formats, but we're on to something very significant with what we're doing with perishables from our same-day facilities. On your headcount question, what I would tell you is the announcement that we made a few days ago was not really financially driven, and it's not even really AI-driven, not right now, at least. It's culture.\n\n**Andy Jassy** (CEO)\nIf you grow as fast as we did for several years, the size of businesses, the number of people, the number of locations, the types of businesses you're in, you end up with a lot more people than what you had before, and you end up with a lot more layers. When that happens, sometimes without realizing it, you can weaken the ownership of the people that you have who are doing the actual work and who own most of the two-way door decisions, the ones that should be made quickly and right at the front line. It can lead to slowing you down. As a leadership team, we are committed to operating like the world's largest startup. That means removing layers, increasing the amount of ownership that people have, and inventing and moving quickly.\n\n**Andy Jassy** (CEO)\nI don't know if there's ever been a time in the history of Amazon or maybe business in general with the technology transformation happening right now where it's important to be lean, it's important to be flat, and it's important to move fast. That's what we're going to do.\n\n**Operator**\nThe next question comes from the line of Eric Sheridan with Goldman Sachs. Please proceed with your question.\n\n**Eric Sheridan** (Managing Director)\nThanks so much for taking the question. I wanted to know, Andy, if you could reflect on the opportunity that's continuing to present itself in terms of rolling out more robotics and automation and the broader theme of physical AI across your operations and how you should be thinking about that as a driver of potential efficiencies, but also as a driver of the ability to possibly reinvest back in the business over the long term. Thanks so much.\n\n**Andy Jassy** (CEO)\nRobotics is a very substantial area of investment for us. We have over a million robots in our fulfillment network at this point. I would say that while that's significant, we have a lot of invention in flight, so I expect that we'll have more over a period of time. Robotics are very important for us and for our customers and for our teammates because they improve safety, they boost productivity, they increase speed, and they let our human teammates focus on problem-solving and what they do best. We expect that our people remain at the heart and the center of our fulfillment network as they have from when we first started working on robotics. We expect that over time, we will have a fulfillment network where robots and humans complement each other and work together. I think you're going to continue to see us invest very significantly in robotics.\n\n**Andy Jassy** (CEO)\nIt's going to help on the safety, the productivity, the speed, and ultimately some of the cost pieces, which will allow us to continue to improve the customer experience.\n\n**Operator**\nThe next question comes from the line of John Blackledge with TD Cowan. Please proceed with your question.\n\n**John Blackledge** (Senior Equity Research Analyst of Internet and New Media)\nGreat. Thank you. How does Amazon think about agentic commerce going forward? How do you think Amazon will serve customers using agents to purchase goods on Amazon in the future? Thank you.\n\n**Andy Jassy** (CEO)\nI'm very excited about, and as a business, we're very excited about, in the long term, the prospect of agentic commerce. It has a chance to be good for customers. It has a chance to be really good for e-commerce. I think if you know what you want to buy, there are a few experiences that are better than coming to Amazon.\n\n**Andy Jassy** (CEO)\nIf you don't know what you want, a physical store with a physical salesperson still has some advantages. Obviously, lots of people do it on Amazon all the time, but you very often want to ask questions and get help narrowing what you're going to look for. As you keep asking new questions, having a whole bunch of different options presented to you. I think AI and agentic commerce are going to change the experience online where that experience where you're narrowing what you want when you don't know is going to get better online than it even is in physical environments. We obviously have our own efforts here in agentic commerce. We have Rufus, which I talked about in my opening comments, which is continuing to get better and better and used more broadly.\n\n**Andy Jassy** (CEO)\nWe have features like Buy for Me where we will surface on Amazon even items that we don't stock that other merchants have. If customers want us to go and buy it for them on those merchants' websites, we will do that. Both of those have been successful for us. We're also. Having conversations with and expect over time to partner with third-party agents. I think that it reminds me in some ways of the beginning of search engines many years ago being sources of discovery for commerce. You had to kind of figure out the right way to work together. Today, search engines are a very small part of our referral traffic, and third-party agents are a very small subset of that. I do think that we will find ways to partner. We have to find a way, though, that makes the customer experience good.\n\n**Andy Jassy** (CEO)\nRight now, I would say the customer experience is not good. There's no personalization. There's no shopping history. The delivery estimates are frequently wrong. The prices are often wrong. We've got to find a way to make the customer experience better and have the right exchange of value. I do think that the exciting part of this and the promise is that AI and agentic commerce solutions are going to expand the amount of shopping that happens online. I think that's really good for customers. I think it's really good for Amazon because at the end of the day, you're going to buy from the outfit that allows you to have the broadest selection, great value, and continues to deliver for you very quickly and reliably. I think that bodes well for us.\n\n**Operator**\nOur final question comes from the line of Colin Sebastian with Baird. Please proceed with your question.\n\n**Colin Sebastian** (Managing Director and Senior Research Analyst of Internet and Digital Media)\nThanks. Good afternoon. I guess first on AWS, following up there, how much of this acceleration is driven by core infrastructure versus AI workload monetization? I think part of it is trying to understand how important numerous services like AgentCore are becoming and bringing enterprises to AWS to build agents. Secondly, regarding the acceleration in advertising, if you could potentially disaggregate the core advertising contribution versus DSP and Prime Video, that would be helpful as well. Thank you.\n\n**Andy Jassy** (CEO)\nYeah. I'll start on the AWS side. We are seeing. We're really pleased with the results from this quarter. 20% year-over-year on an annualized run rate of $132 billion is unusual. We have momentum, and you can see it. We see the growth in both our AI area where we see it in inference, we see it in training, we see it in the use of our Trainium custom silicon.\n\n**Andy Jassy** (CEO)\nBedrock continues to grow really quickly. SageMaker continues to grow quickly. I think that the number of companies who are. Working on building agents is very significant. I do believe that a lot of the value that companies will realize over time in AI will come from agents. I think that building agents today is still harder than it should be. You need tools to make it easier, which is why we built Strands, which is an open-source capability that lets people build agents from any model that they can imagine. Even more so, when you talk to enterprises or companies that care a lot about security and scale, they're starting to build agents, and they don't really feel like they've had building blocks that allow them to have the type of secure, scalable agents that they need to bet their businesses and their customer experiences and their data on.\n\n**Andy Jassy** (CEO)\nThat was really the inspiration behind AgentCore, to build another set of primitive building blocks like we built in the early days of AWS, where it was compute and storage and database. We defined a set of building blocks that you needed to be able to deploy agents securely and scalably that we provide in AgentCore. When we talk to our customers, it really resonates. There is not anything else like it. It's changing their timeframe and their receptivity to building agents, and it's very compelling for them. I do think the combination of what we're doing to enable agents to be built and run securely and scalably, as well as some of the agents that we're building ourselves that our customers are excited about, are compelling for them.\n\n**Andy Jassy** (CEO)\nI think the other place we see a lot of growth in AWS also is just the number of enterprises who have gotten back to moving from on-premises infrastructure to the cloud. We continue to earn the lion's share of those transformations. I look at the momentum we have right now, and I believe that we can continue to grow at a clip like this for a while. I think on the advertising side, that is also an area where I think collectively we feel very pleased about the progress. Every single one of our advertising offerings this quarter grew in a meaningful way. I think there's a few things going on for us. We have what I think of as a pretty unusual full funnel offering.\n\n**Andy Jassy** (CEO)\nIf you look at the top of the funnel, which typically tends to be awareness building and broad scale, to be able to use our own Prime Video and our live sports capabilities, as well as going all the way down to the bottom of the funnel at point of sale, being able to use sponsored products. Most people don't have a full funnel offering as robust as that. When you layer on top of it the combination of the audience curation and development we can do along with the advantage measurement, it just all leads to a return on advertising spend that's very unusual. I think there are multiple places where we can expect to continue to grow. One is in our stores business. I still think if you look at the worldwide market segment share of retail, still 80% to 85% of it lives in physical stores.\n\n**Andy Jassy** (CEO)\nThat equation is going to flip over time, and I think AI is going to only accelerate that. I think we have a significant opportunity still in our existing stores. I think video, we've only been at this for a little bit of time, but it's already a very large amount of advertising revenue, and we're still relatively early stage. I think that will continue to be a big area of growth. As you reference the demand-side platform, or Amazon DSP, that is growing really quickly as well. Some of it had to do with the fact that we had some features. We always had a number of the core components people wanted around some of our properties, the measurement capabilities, Amazon Marketing Cloud. We lacked some features for a while as we were building out our DSP that customers told us mattered.\n\n**Andy Jassy** (CEO)\nThe team over the last 20 months have closed those gaps in a very significant way so that now people feel like our DSP is fully featured. You look at some of the partnerships that we've done. The Roku partnership gives us the largest connected TV footprint in the U.S. You layer on top of that what we've recently done in providing our DSP customers the opportunity to integrate with the ad inventory in Netflix and Spotify and SiriusXM. It's powerful. We are growing very quickly on the demand-side platform. Very optimistic about what we're doing there. We have continued work to do, obviously, but I don't think we're close to being able to grow there.\n\n**Operator**\nThanks for joining us on the call today and for your questions. A replay will be available on our investor relations website for at least three months.\n\n**Operator**\nWe appreciate your interest in Amazon and look forward to speaking with you again next quarter.",
      "fetched_at": "2026-02-04T15:37:47.969Z"
    },
    {
      "ticker": "AMZN",
      "title": "Amazon.com, Inc. (AMZN) Q2 FY2025 earnings call transcript",
      "published_date": "Jul 31, 2025, 5:00 PM EDT",
      "fiscal_year": "2025",
      "quarter": "Q2",
      "url": "https://finance.yahoo.com/quote/AMZN/earnings/AMZN-Q2-2025-earnings_call-341150.html",
      "content": "**Operator**\nThank you for standing by. Good day, everyone, and welcome to the amazon.com Second Quarter twenty twenty five Financial Results Teleconference. At this time, all participants are in a listen only mode. After the presentation, we will conduct a question and answer session. Today's call is being recorded.\n\n**Operator**\nAnd for opening remarks, I will be turning the call over to the Vice President of Investor Relations, Mr. Dave Files. Thank you, sir. Please go ahead.\n\n**Dave Fildes** (VP - IR)\nHello, and welcome to our Q2 twenty twenty five financial results conference call. Joining us today to answer your questions is Andy Jassy, our CEO and Brian Lisowski, our CFO. As you listen to today's conference call, we encourage you to have a press release in front of you, which includes our financial results as well as metrics and commentary on the quarter. Please note, unless otherwise stated, all comparisons in this call will be against our results for the comparable period of 2024. Our comments and responses to your questions reflect management's views as of today, 07/31/2025 only and will include forward looking statements.\n\n**Dave Fildes** (VP - IR)\nActual results may differ materially. Additional information about factors that could potentially impact our financial results is included in today's press release and our filings with the SEC, including our most recent annual report on Form 10 ks and subsequent filings. During this call, we may discuss certain non GAAP financial measures. In our press release, slides accompanying this webcast and our filings with the SEC, each of which is posted on our IR website. You will find additional disclosures regarding these non GAAP measures, including reconciliations of these measures with comparable GAAP measures.\n\n**Dave Fildes** (VP - IR)\nOur guidance incorporates the order trends that we've seen to date and what we believe today to be appropriate assumptions. Our results are inherently unpredictable and may be materially affected by many factors, including fluctuations in foreign exchange rates, changes in global economic and geopolitical conditions, tariff and trade policies, and customer demand and spending, including the impact of recessionary fears, inflation, interest rates, regional labor market constraints, world events, the rate of growth of the Internet, online commerce cloud services, and new and emerging technologies, and the various factors detailed in our filings with the SEC. Our guidance assumes, among other things, that we don't conclude any additional business acquisitions, restructurings or legal settlements. It's not possible to accurately predict demand for our goods and services, and therefore, our actual results could differ materially from our guidance. And now I'll turn the call over to Andy.\n\n**Andy Jassy** (President &amp; CEO)\nThanks, Dave. Today, we're reporting $167,700,000,000 in revenue, up 12% year over year, excluding the impact from foreign exchange rates. Operating income was 19,200,000,000.0 up 31% year over year and trailing twelve month free cash flow was $18,200,000,000 We saw good progress across our various customer experiences and businesses this past quarter. Starting with stores, we feel good about both the inputs and outputs of the business. At Amazon, we think of our business in terms of inputs and outputs.\n\n**Andy Jassy** (President &amp; CEO)\nOutputs are metrics like revenue or operating margin, but, of course, you can't manage at the output level. It's the inputs that drive the outputs. So we spend virtually all of our time internally talking about and going against inputs. The inputs that matter most to customers in our stores business are selection, low prices, and speed of delivery. We've taken another step forward in selection these past few months, headlined by the much requested return of Nike's products to Amazon's retail store.\n\n**Andy Jassy** (President &amp; CEO)\nWe've added premium brands like Away, Aveda, Marc Jacobs fragrances, and brands from Saks and Amazon like Dolce and Gabbana, Etro, Stella McCartney, Rosetta Getty, and La Prairie. And we started expanding our very successful perishables pilot, where we offer customers perishables at the point of purchase when they're ordering other items that will be delivered same day from our same day fulfillment nodes. We're seeing strong customer adoption as 75% of customers who've used the service this year are first time shoppers for perishables on Amazon, with 20% of customers who use the service returning multiple times within their first month. Our prices continue to be low and sharp for customers. It's one of the reasons our everyday essentials growth outpaced the rest of the business globally and represented one out of every three units sold.\n\n**Andy Jassy** (President &amp; CEO)\nIt's also why well known research firm, Perfidero, has concluded for eight years in a row that Amazon has the lowest prices of any US retailer. But perhaps the clearest outputs are the rate at which our stores business grew this past quarter and the success we saw in our recent Prime Day event. This year's Prime Day was our biggest ever with record sales, number of items sold, and number of Prime sign ups in the three weeks leading up to the Prime Day. Customers saved billions of dollars and independent sellers, most of which are small and medium sized businesses, saw their best sales performance of any Prime Day event yet. There continues to be a lot of noise about the impact that tariffs will have on retail prices and consumption.\n\n**Andy Jassy** (President &amp; CEO)\nMuch of it thus far has been wrong and misreported. As we said before, it's impossible to know what will happen. Where will tariffs finally settle, especially China? What happens when we deplete the inventory we forward bought or that our selling partners forward deployed in advance of the tariffs going into effect? If costs end up being higher, who will absorb them?\n\n**Andy Jassy** (President &amp; CEO)\nBut what we can share is what we've seen thus far, which is that through the first half of the year, we haven't yet seen diminishing demand nor prices meaningfully appreciating. We also have such diversity of sellers in our marketplace, over 2,000,000 sellers in total, with differing strategies of whether to pass on higher cost to consumers that customers are advantaged shopping at Amazon because they're more likely to find lower prices on the items they care about. Further improving delivery speed remains a key focus, and we continue to make progress. We've previously shared how we rearchitect our US inbound network into a regional structure, allowing us to place inventory and shift from locations closer to customers, improving speed and lowering costs. That work is delivering tangible results.\n\n**Andy Jassy** (President &amp; CEO)\nIn q two, we increased the share of orders moving through direct lanes where packages go straight from fulfillment delivery without extra stops by over 40% year over year. We've also reduced the average distance packages traveled by 12% and lowered handling touches per unit by nearly 15%. We've made progress on order consolidation. With more products positioned locally, we're able to pack more items into each box and send fewer packages per order. That has helped drive higher units per box and improved overall cost to serve.\n\n**Andy Jassy** (President &amp; CEO)\nTaken together, these improvements are making the network faster and structurally more efficient. We've also set another global speed record in q two, delivering to Prime members at our fastest speeds ever. In The US, we delivered 30% more items same day or next day than during the same period last year. Items customers used to pick up locally in nearby physical stores are now arriving at their door often within hours, and we're working to further improve delivery speeds no matter where customers live. We've recently announced plans to expand our same day and next day delivery to tens of millions of US customers in more than 4,000 smaller cities, towns, and rural communities by the end of the year.\n\n**Andy Jassy** (President &amp; CEO)\nToday, it's already available in more than a thousand of these communities across The US. The early response from customers in these areas have been very positive. They're shopping more frequently and purchasing household essentials at meaningfully higher rates. Automation and robotics are also important contributors to improving cost efficiencies and driving better customer experiences over time. We deployed our one millionth robot across our global fulfillment network and unveiled innovations at our last mile innovation center, such as automated package sorting and a transformative technology that brings packages directly to employees in an ergonomic height.\n\n**Andy Jassy** (President &amp; CEO)\nWe rolled out Deepfleet, our AI whose robot travel efficiency by 10%. At our scale, it's a big deal. Deepfleet acts like a traffic management system to coordinate robots' movements to find optimal paths and reduce bottlenecks. For customers, it means faster delivery times and lower costs. For our team members, our robots handle more of the physically demanding tasks, making our operations network even safer.\n\n**Andy Jassy** (President &amp; CEO)\nThis combination of robotics and generative AI is just getting started. And while we've made significant progress, it's still early with respect to what we'll roll out in the next few years. Moving on to Amazon Ads. We're pleased with the strong growth generating $15,700,000,000 of revenue in the quarter, growing 22% year over year. We continue to see strength across our broad portfolio of full funnel advertising offerings that in The US alone help advertisers reach an average ad support audience of more than 300,000,000 across our own properties.\n\n**Andy Jassy** (President &amp; CEO)\nThese are properties like our retail marketplace, Prime Video, Twitch, and Fire TV, in live sports such as NFL, NASCAR, and the NBA, as well as third party websites and apps. Another area we're excited about is our demand side platform or Amazon DSP. Our DSP enables advertisers to plan, activate, and measure full funnel investments. Our trillions of proprietary browsing, shopping, and streaming signals paired with extensive supply side relationships and our secure clean rooms provide advertisers the ability to optimize advertising, deliver greater precision, and drive efficient and effective advertising outcomes. And in June, we announced a momentous partnership with Roku, giving advertisers access to 80,000,000 connected TV households, the largest authenticated connected TV footprint in The US exclusively through Amazon DSP.\n\n**Andy Jassy** (President &amp; CEO)\nIt's a giant leap forward for advertisers bringing best in class planning, audience precision, and performance to TV advertising. We also announced an integration between Disney's real time ad exchange and Amazon DSP. This collaboration allows advertisers to gain direct access to Disney's premium inventory across platforms like Disney plus, ESPN, and Hulu, while allowing them to leverage insights from both companies. When advertisers work with Amazon, they're not just buying ad space. They're benefiting from exceptional programming, innovative technology, and unrivaled signals, measurement, and audience development that provides strong relevancy for consumers and return on investment for brands.\n\n**Andy Jassy** (President &amp; CEO)\nMoving on to AWS. In q two, AWS grew 17.5% year over year and now has over a 123,000,000,000 annualized revenue run rate. We continue to help organizations of all sizes accelerate their transition to the cloud, signing new agreements with companies including PepsiCo, Airbnb, Peloton, Nasdaq, London Stock Exchange, Nissan Motor, GitLab, SAP, Warner Brothers Discovery, Twelve Labs, FICO, Iberia Airlines, SK Telecom, and NatWest. In the rapidly evolving world of generative AI, AWS continues to build a large, fast growing, triple digit year over year percentage, multibillion dollar business with more demand than we have supplied for at the moment. A few points to make.\n\n**Andy Jassy** (President &amp; CEO)\nFirst, on the hardware side, our custom AI chip, Trainium two, is landing capacity in larger quantities and has impressively emerged as the backbone for Anthropic's newest generation cloud models and many of our most essential offerings like Amazon Bedrock. We've also launched Amazon EC two instances powered by NVIDIA Grace Blackwell Superchips, AWS' most powerful NVIDIA GPU accelerated instance. Second, in Bedrock, we've recently added Anthropix Cloud four, and it's the fastest growing model ever in Bedrock. We've also continued to see strong adoption of Amazon Nova, our own frontier model, and it's now the second most popular foundation model in Bedrock. New features in Nova allow customers to customize their Nova models in ways they can't on other foundation models, allowing organizations to infuse these models with their unique expertise while optimizing for cost and speed.\n\n**Andy Jassy** (President &amp; CEO)\nAs people have become excited about building agents, they're realizing they lack the tools to build them. In May, we released Strands, an open source way to more easily build agents that's taken off with a wide range of customers with already 2,500 stars on GitHub and over 300,000 downloads on Pipedrive. Are also struggling with deploying agents into production in a secure and scalable way. It's holding up enterprises scaling agents. To help solve that problem, Bedrock just released Agent Core.\n\n**Andy Jassy** (President &amp; CEO)\nAgent Core is a set of building blocks that gives customers the industry's first secure serverless runtime to provide both synchronous and asynchronous execution, agent identity and boundaries, a memory service, a gateway that translates services to MCP compatible interfaces, built in code execution and web browser tools, and an observability service. Customers are excited about agent core, and it frees them up to start deploying agents more expansively. Third, you're starting to see AWS release more powerful applications at the top layer of the AI stack. AWS Transform is an AWS agent that dramatically reduces mainframe modernization timelines from years to months, completes VMware to EC two conversions up to 80 times faster, and makes it simple to move from dot net Windows to dot net Linux implementations, reducing licensing costs for dot net applications by up to 40%. We've also just released Curo, our new agentic integrated development environment coding agent.\n\n**Andy Jassy** (President &amp; CEO)\nThere's a lot of buzz around Curo with several 100,000 developers using or requesting access in the first couple weeks, a 100,000 used in the first five days of the preview. What struck a chord for developers is that Cura allows them to do vibe coding where developers use natural language to chat with a coding agent to build code. But unlike other coding agents where developers don't really have any structure to build on top of, Cura allows developers to use natural language to build a spec and then automatically updates that spec as they continue to vibe code or interact with Kiro. This makes it much easier to go from prototyping to production. Customers also like Kiro's event driven agent hooks that act like an experienced developer catching things developers might miss.\n\n**Andy Jassy** (President &amp; CEO)\nWhen developers save a React component, hooks update the test file. When they modify API endpoints, hooks refresh read me files. When they're ready to commit, security hooks scan for leak credentials. It's still very early for Quiro, but it seems clear we're onto something customers love, and Quiro has a chance to transform how developers build software. I say this frequently, but remember that 85 to 90% of worldwide IT spend is still on premises versus in the cloud.\n\n**Andy Jassy** (President &amp; CEO)\nIn the next ten to fifteen years, that equation is going to flip, further accelerated by companies' excitement for leveraging AI. So AWS has significantly broader functionality, stronger security and operational performance, and much deeper experience helping enterprises modernize their infrastructure bodes well for the AWS business moving forward. We're also seeing momentum in a number of our other areas across Amazon. I'll mention just a few. We're excited about our progress with Alexa Plus, our next generation assistant powered by generative AI.\n\n**Andy Jassy** (President &amp; CEO)\nWe've been rolling out early access to US customers to start. Millions of customers have access now. We're seeing very positive feedback, and we'll continue to iterate on the experience. We've recently completed our third successful launch of Project Kuiper. We haven't launched this service commercially yet, but already have an impressive amount of enterprise and government customers who signed agreements to use Kuiper.\n\n**Andy Jassy** (President &amp; CEO)\nIn prime video live sports, our first season of NASCAR drew about 2,000,000 viewers per race and the youngest audience among NASCAR broadcasters in more than a decade. We've recently announced our stellar broadcasting crew for our upcoming first NBA season, including Iron Eagle, Stan Van Gundy, Kevin Harlan, Dwayne Wade, Taylor Rooks, Blake Griffin, Dirk Nowitzki, Steve Nash, and Candice Parker. We also announced Denis Villeneuve, an Academy Award nominee as the director for the next James Bond film. James Bond is in the hands of one of today's greatest filmmakers, and we cannot wait to get started on double o seven's next adventure. Finally, we continue to be very pleased with the growth and resonance of Amazon Pharmacy as it's grown 50% year over year, year to date on an already significant size base.\n\n**Andy Jassy** (President &amp; CEO)\nA lot of good things happening across the company. With that, I'll turn it over to Brian for a financial update.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nThanks, Andy. Let's start with our top line financial results. Worldwide revenue was a $167,700,000,000, a 12% increase year over year excluding the impact of foreign exchange. Foreign exchange had a $1,500,000,000 favorable impact to revenue in the quarter as foreign currencies generally strengthened versus the U. S.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nDollar. As a reminder, our Q2 revenue guidance had anticipated an unfavorable impact of approximately 10 basis points or $100,000,000 Although that operating income was $19,200,000,000 which is $1,700,000,000 above the high end of our guidance range. Across our segments, we continue to prioritize cost effective innovation that delivers value for our customers. In the North America segment, second quarter revenue was $100,100,000,000 an increase of 11% year over year. International segment revenue was $36,800,000,000 an increase of 11% year over year, excluding the impact of foreign exchange.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nWorldwide paid units grew 12% year over year. We remain focused on inputs that matter most to our customers. In the second quarter, we saw broad based strength across our key performance metrics. This includes sharp pricing and more in stock availability, as well as record delivery speeds for Prime members. Our millions of global sellers continue to be an important contributor to our vast selection.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nThis helps customers find the items they need and does so at a competitive price. Our investment in tools, services, and fast delivery speeds help our selling partners reach more customers and further scale their businesses. In q two, worldwide third party seller unit mix was 62%, the highest ever, up on 100 basis points from q two of last year. We're also closely monitoring the macroeconomic environment, including the impact of tariffs. As Andy mentioned, our Q2 plan factored in a range of assumptions, not all of which materialized.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nWe will continue to consider a range of assumptions going forward. Shifting to profitability, North America segment operating income was $7,500,000,000 an increase of $2,500,000,000 year on year. North America operating margin was 7.5%, up 190 basis points year over year. International segment operating income was $1,500,000,000 up $1,200,000,000 year over year. International operating margin was 4.1%, up three twenty basis points year over year.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nWe're pleased with the strong execution of our operations teams and the positive experience they delivered for customers. In q two, we saw productivity gains in our transportation network driven by improved inventory placement, strong leverage on high unit volumes, and higher levels of in demand inventory from both first party and third party selling partners. These factors contributed to faster delivery speeds and lower costs. Outbound shipping costs were up 6% year over year and continue to grow at a meaningfully slower pace than unit growth, which as I mentioned earlier was up 12% year over year. We're committed to initiatives that further improve our cost structure.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nStrategic inventory placement drives multiple benefits, including better in stock availability, shorter delivery routes, and faster customer delivery times. When we optimize inventory location, we can consolidate more items per package, reducing packaging materials and costs. To achieve this, we will continue to improve upon our inbound network, expand our US same day delivery facilities, including in rural communities, and implement robotics and automation across our facilities. While year over year improvements in operating margin may fluctuate, we have a purposeful strategy to achieve sustained progress over time. Shifting to advertising.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nAdvertising revenue grew 22% year over year, driven by sponsored products as we saw strong traffic in our stores. Advertising remains an important contributor to profitability in the North American international segments. Our full funnel advertising approach of connecting brands with customers is resonating. Moving next to our AWS segment. Revenue was $30,900,000,000 an increase of 17.5% year over year.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nAWS now has an annualized revenue run rate of more than a 123,000,000,000. During the second quarter, we continue to see growth in both our generative AI and non generative AI businesses. As companies turn their attention to newer initiatives, bring more workloads to the cloud, restart or accelerate existing migrations from on premise to the cloud, and tap into the power of generative AI. AWS operating income was $10,200,000,000. We did see AWS segment margins decline from a record high of 39.5% in q one to 32.9% in q two.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nThe largest quarter over quarter driver of the decrease for about half is due to the seasonal step up in stock based compensation expense driven by the timing of our annual compensation cycle. AWS margins also saw headwinds from higher depreciation expense as well as unfavorable impacts from year over year fluctuations in foreign exchange rates. The depreciation expense is a result of our growing investments in capital expenditures in AWS. As we've said in the past, we expect AWS operating margins to fluctuate over time, driven in part by the level of investments we are making at any point in time. We will continue to invest more capital in chips, data centers, and power to pursue this unusually large opportunity that we have in generative AI.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nNow turning to our cash CapEx, which was $31,400,000,000 in q two. We expect q two CapEx to be reasonably representative of our quarterly capital investment rate for the back half of this year. AWS continues to be the primary driver as we invest to support demand for our AI services and increasingly in custom silicon like Tranium, as well as tech infrastructure to support our North America and international segments. Additionally, we continue to invest in our fulfillment and transportation network to support growth of the business, improve delivery speeds, and lower our cost to serve by investing in same day delivery facilities as well as robotics and automation. Collectively, these investments will support growth for many years to come.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nMoving on to our third quarter financial guidance. As a reminder, our guidance considers a range of possibilities which take into consideration Q2 results, trends we see quarter to date, and expectations around the macroeconomic environment including tariffs. Q3 net sales are expected to be between $174,000,000,000 and $179,500,000,000 We estimate the year over year impact of changes in foreign exchange rates based on current rates, which we expect to be a favorable impact of approximately 130 basis points. As a reminder, global currencies can fluctuate during the quarter. Q3 operating income is expected to be between $15,500,000,000 and $20,500,000,000 In this dynamic environment, we'll focus on what matters most, delivering exceptional customer value through broad selection, competitive prices, and unmatched convenience.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nWe remain focused on driving a better customer experience and believe putting customers first is the only reliable way to create lasting value for our shareholders. With that, let's move on to your questions.\n\n**Operator**\nThank you. At this time, we will now open the call up for questions. Thank you. Our first question comes from Doug Anmuth with JPMorgan. Please proceed with your question.\n\n**Douglas Anmuth** (MD &amp; Internet Analyst)\nThanks so much for taking the questions. I have two. First, can you just help us understand with some more granularity how tariffs are being absorbed across suppliers, Amazon and consumers and whether you anticipate any change going forward? And then second on AWS, we're seeing significantly faster cloud growth among the number two and three players in the space. I totally appreciate that AWS is coming off of a bigger base. But beyond that, do you think the output gap is due more to customer demand or infrastructure supply or both? Thanks.\n\n**Andy Jassy** (President &amp; CEO)\nYes, I'll take both of those. I'll start with the tariffs. I think what we said a number of times and we still believe it is we just don't know what's going to happen moving forward. It's hard to know where the tariffs are going to settle particularly in China. It's hard to know what will happen when we deplete some of the pre buys that we did on our own first party retail and then some of the forward deploying that we saw of our third party selling partners.\n\n**Andy Jassy** (President &amp; CEO)\nAnd when, you know, if costs go up over time, it's, you know, we're unsure at this point who's gonna end up absorbing those higher costs. What we can tell you is what we've seen so far in the first half of the year. In the first half, we just haven't seen diminished demand and we haven't seen any kind of broad scale ASP increases. And, you know, so that that could change in the second half. There are a lot of things that we don't know, but that's what we've seen so far.\n\n**Andy Jassy** (President &amp; CEO)\nOn the question on AWS, you know, the first thing I'd say is, you know, it's as you said, Doug, in your question, know, year over year percentages and growth rates are always a function of the base in which you operate. And we have a, you know, a meaningfully larger business in the AWS segment than others. I think the second player is about 65% of the size of of a AWS. And we when we look at the results over the last number of quarters, there's sometimes where as far as we can tell, we're growing faster than others and sometimes others are growing faster than us. But it's still like if you if you look at second place player you're talking about, it's a pretty it's still a pretty significant segment, you know, market segment leadership position that we have.\n\n**Andy Jassy** (President &amp; CEO)\nAnd regardless, these are all really just moments in time. The last week is a moment in time too where the reality of what really matters is what customers' experiences are in operating on these platforms. And if if you look at what matters to customers, what they care they care a lot about what the operational performance is, you know, what the availability is, what the durability is, what the latency and throughput is of of the various services. And I think we have a pretty significant advantage in that area. They care a lot about security.\n\n**Andy Jassy** (President &amp; CEO)\nIf you have data that matters and for most companies, they're putting data that they really care about in the cloud. The security and the privacy of that data matters a lot, and there are very different results in security in AWS than you'll see in other players. And, yeah, you could just you just look at what's happened the last couple months. You can just see kind of adventures at some of these players almost every month. And so very big difference, I think, in security.\n\n**Andy Jassy** (President &amp; CEO)\nAnd then I I think a a really significant difference in functionality where not just in the core infrastructure do we have a lot more functionality in our services. But I think if you look at our end to end offering in AWS in in AI, it's you know, from the bottom of stack all the way to the top, it it's pretty different. So, you know, I feel good about the the the inputs and the services that we're offering to customers across AI as well as non AI. And, you know, we could we we have more demand than we have capacity right now. So we could be doing more revenue and helping customers more, and we're working very hard on on changing that outcome and how much capacity we have, but it's still like, you know, you go get the business, it's a $123,000,000,000 annual revenue run rate business, and it's still early.\n\n**Andy Jassy** (President &amp; CEO)\nI mean, how often do you have an opportunity that's a $123,000,000,000 of annual revenue run rate where you say it's still early? It's it's a very unusual opportunity that we're very bullish about.\n\n**Operator**\nThank you. Our next question comes from Mark Mahaney with Evercore. Please proceed with your question.\n\n**Mark Mahaney** (Senior MD)\nOkay. I'll stick with AWS to start it with. Could you just disclose the backlog number? And then in the past, I know you've talked about these supply constraints and hoping that they will sort of resolve themselves by the back half of the year. Is that still your intention?\n\n**Mark Mahaney** (Senior MD)\nAnything that suggests that the supply constraints are going to get resolved earlier or later? And then a long term question on Alexa Plus. And I've been experimenting with it for a while. Andy, when you think about the potential that that has in terms of increasing engagement, maybe tapping into some services revenue, advertising, maybe a little bit more retail sales per household, you're just reducing friction. Just talk about what from a financial perspective, how you think that could play out?\n\n**Mark Mahaney** (Senior MD)\nHow we would maybe see that in the numbers? Thank you very much.\n\n**Dave Fildes** (VP - IR)\nMark, this is Dave. I'll just start off to give you the backlog figure. So at the end of the quarter at June 30, that was $195,000,000,000 so that's up about 25% year over year.\n\n**Andy Jassy** (President &amp; CEO)\nOn the supply constraints as it relates to AWS and what we see there, You know, as I mentioned, well, we have more demand than we have capacity at this point. And I think that and and you see, you know, some of the constraints, and they kind of exist in multiple places. The single biggest constraint is power. But I you know, you also see constraints off and on with chips and then some of the components that, you know, once you have the chips to actually make the servers, you know, you there are you know, sometimes you have new generations of chips that are a little bit later than they're supposed to be and sometimes you get the chips and, you know, the yield you get in making servers isn't what you what you expect when you get to ramp. So there are a bunch of those pieces today that we're working on.\n\n**Andy Jassy** (President &amp; CEO)\nIt's really true across the industry today. I I don't believe that we will have fully resolved the amount of capacity we need for the amount of demand that we have in a couple quarters. I think it will take several quarters. But I do expect that it's gonna get better each quarter and I'm optimistic about that. I think on the Alexa question, you know, I I think what I'd start by saying the Alexa Plus experience is so much better than I think our prior Alexa experience.\n\n**Andy Jassy** (President &amp; CEO)\nShe's much more intelligent than her prior self. She's much more capable. And I would say unlike the the other chatbots that are out there today who are good at answering questions but really can't take any action for you, Alexa Plus can take a lot of action for you, which is very compelling. So I can ask Alexa to play music for me or play video for me or move my music from one device to another. Or if I'm listening to a a song that's on a that's in a movie, I can ask Alexa plus to actually put that movie scene on that of a song I'm playing, and it'll put it on my Prime Video on on Fire TV.\n\n**Andy Jassy** (President &amp; CEO)\nOr if I have guests coming over, I can say, you know, Alexa, draw the curtains, put the light on the porch and the driveway, increase the temperature by five degrees, and put on music that would be great for a dinner party. And and she does all that just for using natural language. So she could take a lot of actions, and it's compelling. And what we see so far, you know, we've we've been rolling out Alexa Plus starting in The US. It's it's with millions of customers now.\n\n**Andy Jassy** (President &amp; CEO)\nThe rest come the rest in The US coming in the next couple months and starting the international rollout more broadly later in the year. And customers really like the experience. They recognize how much better it is than what it was before. The ratings are very high. The usage is is much more expansive than what they were using before.\n\n**Andy Jassy** (President &amp; CEO)\nThe number calls they're making is is meaningfully higher. And I I think there are a number of different areas where we'll see benefit. I I think first, you know, if you if you build the world's best personal assistant, that has a lot of utility for customers and, therefore, it gets used a lot. So it means everything from people are excited about the devices that they can buy from us that has Alexa Plus enabled in it. People do a lot of shopping, and it's it's really it's a delightful shopping experience that will keep getting better.\n\n**Andy Jassy** (President &amp; CEO)\nI think over time, there will be opportunities, you know, as as people are engaging more multi turn conversations to have advertising play a role to help people find discovery and also as a lever to drive revenue. And I think over time, could also imagine as we keep adding functionality that there could be some sort of subscription element beyond what there is today. Today, Prime members get Alexa Plus for free and non Prime members pay $19.99 a month for Alexa Plus. So I think it's very it's still very early days, but we're very encouraged by the experience we're providing and you can bet we're gonna be iterating on it constantly.\n\n**Operator**\nThank you. And our next question comes from the line of Colin Sebastian with Baird. Please proceed with your question.\n\n**Colin Sebastian** (Senior Research Analyst)\nThanks for taking the questions. I guess first off with respect to the international segment and the progress in both revenues and margins, I was hoping you could add maybe some color on the drivers of each of those and the sustainability of the improved efficiency in those markets. And then Andy, you mentioned Kuiper. We haven't heard as much about that of late. So maybe if you could review where things stand relative to next year's launch target, timing of the service rollout and maybe any perspective you have on the longer term ambitions for the satellite network? Thank you.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nThanks, Colin. This is Brian. I'll start with the international segment question. So, yeah, very strong quarter for international segment both on revenue growth and also on operating margin. Operating margin was up three twenty basis points year over year to 4.1%.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nAnd if you look, that's the continuation of a strong progression we've seen quarter by quarter over the last ten quarters in total. We've seen an increase of close to 700 basis points during that time period. So really, it's a tale of two pieces of two segments or excuse me, sections within international. One is established countries like UK, Germany, and Japan already at similar margin profiles to The US. So we'll you know, as they continue to grow, their contribution and profit will grow over time, that's what we're seeing. In the quarter, we saw strong productivity in our transportation network in those countries, much like we saw in The US, and that's led to higher units for package and faster delivery speeds at lower cost. So again, the theme of lower cost to serve and also increased speed and, you know, better selection for customers continues, to grow in internationally as well. In our emerging countries, you know, we're pleased with the progress we're making there. We've launched eight countries, of course, in the last five years, and they're all varying degrees of upfront investment and, you know, different point times in their journey to profitability. But they're all making very nice improvements quarter over quarter in growing selection, adding prime members, and expanding our customer offerings.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nSo I think what you're saying again is sustained improvement in those areas. Feel very good about it. The established countries are continuing to grow and develop and very much look like The United States. And the emerging countries, again, all very different stages of growth right now.\n\n**Andy Jassy** (President &amp; CEO)\nOn the Project Kuiper question, so Project Kuiper is our low Earth orbit satellite constellation that we're putting up and launching. And, you know, there's 400 to 500,000,000 households worldwide who don't have broadband connectivity. And it means they can't do a lot of the things we take for granted like education online or business online or shopping or or entertainment. There is really a digital divide, and it's much needed. And it's also true for enterprises and for governments if they have assets or needs to have visibility or connectivity that they can't get today given the lack of broadband in a bunch of places around the world.\n\n**Andy Jassy** (President &amp; CEO)\nSo there's there's a high need. I would say that as we get our constellation into space, there will really be two players that have what I would consider the the modern technology in low earth orbit satellite. You know, one is is the incumbent in in the market today, and the second will be Project Kuiper. I think that we will have a a pretty meaningful differentiation here in performance. If you look at the performance of what I expect on the uplink and downlink, I think Project Kuiper will be advantaged.\n\n**Andy Jassy** (President &amp; CEO)\nI also think the pricing is gonna be very compelling for customers. And then I think if you think about the three key customer segments who want, low Earth orbit satellite, consumers, enterprises, and governments, We have very strong relationships with all three customer segments given our consumer businesses and our AWS business. And I think if you if you think about enterprises and governments, a lot of what they wanna do when they take the data down from space is they actually wanna put it into a cloud to do analysis, analytics, and and AI and and various operations on top of it. And the fact that Project Kuiper and AWS are so seamlessly connected is very attractive to enterprises and to governments. I'm kind of amazed.\n\n**Andy Jassy** (President &amp; CEO)\nWe we haven't launched Project Kuiper yet, but the number of enterprise and government agreements that have been signed already to use Project Kuiper is impressive. So we're we're working very hard to get the satellites into space. We have some delays with some of the rocket providers, but we we have most of the available rocket launches over the next couple of years. And we're very hopeful to get this service into commercial into commercial beta later this year or early next year.\n\n**Operator**\nThank you. And our next question comes from the line of Brian Novak with Morgan Stanley. Please proceed with your question.\n\n**Andy Jassy** (President &amp; CEO)\nThanks for taking my questions.\n\n**Brian Nowak** (Managing Director)\nAndy, I have two for you on AWS. They're a little tough, but I'm gonna throw them at you. So there is a Wall Street Finance person narrative right now that AWS is falling behind in GenAI with concerns about care loss to peers, etcetera. Can you just sort of address that? What what is your rebuttal to that?\n\n**Brian Nowak** (Managing Director)\nAnd talk to us about your and the team's most important focal points just to ensure that AWS stays on the knife's edge of innovation versus hyperscaler peers? And then secondly, I know AWS is a big business, but is there any reason to assume it shouldn't accelerate in the back half and into '26 given the size of the opportunity and all of the Gen AI capabilities gonna sort of come to us in the next next twelve months?\n\n**Andy Jassy** (President &amp; CEO)\nYeah. So on on the first one around AI, the first thing I would say is that I think it is so early right now in AI. If if you look at what's really happening in the space, you have it's it's very top heavy. So you have a a small number of very large frontier models that are being trained that's that spend a lot on computing. A couple of which are being trained on top of AWS and others are are being trained elsewhere.\n\n**Andy Jassy** (President &amp; CEO)\nAnd then you also have, I would say, a relatively small number of very large scale generative AI applications. You know, you know, the one category would be chatbots with the largest by a fair bit being ChatGPT, but the other category being really, I'll call it, coding agents. So these are companies like Cursor, Vercel, and Lovable, some of the companies like that. Again, several of which run significant chunks on top of AWS. And then you've got a very large number of Generve AI applications that are in pilot mode that are in pilots or that are being developed as we speak, and a very substantial number of agents that also people are starting to try to build and and figure out how to get into production in a broad way.\n\n**Andy Jassy** (President &amp; CEO)\nBut but they're all they're they're quite early. And many of them that are out there are you know, they're significant, but they're just smaller in terms of usage relative to some of those top heavy applications I mentioned earlier. We have a a very significant number of enterprises and startups who are running applications on top of AWS's AI services. And and then, you know but but they're all again, like, the the amount of usage and the expansiveness of the use cases and how much people are putting them into production and the number of agents that are gonna exist, it's still just earlier stage than it's gonna be. And so then when you think about what's gonna matter in AI, what's gonna what what are customers gonna care about when they're thinking about what what infrastructure to use, I think you kind of have to look at the different layers of the stack.\n\n**Andy Jassy** (President &amp; CEO)\nAnd, you know, I think for those that are, you know, both building models, but also just if you look at where the real costs are, they're gonna ultimately be an inference. Today, so much of the cost in training because customers are really training their models and trying to figure out how get applications into production. But in at scale, you know, 80 to 90% of the cost will be an inference because you only train periodically, but you're spitting out predictions and and inferences all the time. And so what they're gonna care a lot about is they're gonna care about the compute and the hardware they're using. And, know, you we have a very deep partnership with NVIDIA and and will for as long as I can foresee, but we we we saw this movie in the CPU space with Intel where customers are hankering for better price performance.\n\n**Andy Jassy** (President &amp; CEO)\nAnd so, you know, we built just like in in the CPU space where we built our own custom silicon and building Graviton, which is about 40% more price performance than the other leading x 86 processors. We've done the same thing on the custom silicon side in AI with Tranium. And our second version of Tranium two has really you know, it's it's become the backbone of Anthropix, you know, next cloud models they're trading on top of, and it's become the the backbone of of Bedrock and the inference that we do. So I think a lot of the inference, it's about 3040% better price performance than the other GPU providers out there right now. And we're already working on our third version of trading as well.\n\n**Andy Jassy** (President &amp; CEO)\nSo I think a lot of the you know, compute and the inference is gonna ultimately be run on top of Tranium too. And I think that that price performance is gonna matter to people as they get to scale. You know, then I would say that that middle layer of the stack are really it's it's a combination of services that customers care about to be able to build models and then to be able to leverage existing leading frontier models and then build, you know, high quality generate AI applications that do inference at scale. And, you know, we see it for people building models. They continue to use SageMaker AI very expansively.\n\n**Andy Jassy** (President &amp; CEO)\nAnd then Bedrock, you're leveraging leading frontier models, is also growing very substantially. And, you know, as I said in my opening comments, the the number of agents of scale is still really small in the scheme of what's gonna be the case. But part of the problem is it's actually hard to actually build agents, and it's it's hard to deploy these agents in a secure and scalable way. And so I think the launches we made recently in strands that make it much easier to build agents and then agent core that make it much easier to deploy at scale and in a secure way are are being very well received and customers are excited. It's gonna change what's possible on the agent side.\n\n**Andy Jassy** (President &amp; CEO)\nYeah. And then and then I think that it's you've got a very large number. I mean, remember, 85 to 90% of the global IT spend is still on premises. If you believe that equation is gonna flip, which I do and we do, you have a lot of legacy infrastructure that you've gotta move. These are mainframes.\n\n**Andy Jassy** (President &amp; CEO)\nThese are VMware's instances. And, you know, when we build agents like AWS transform to make it much easier to to move mainframes to the cloud, much easier to move VMware to the cloud, much easier to move dot net windows to dot net Linux to save money. Like, those are compelling for enterprises or things like Curo that allow customers to develop in a in a much easier way and in a much more structured way, which is why I think people are excited about. So I think I really like the inputs in the set of services that we're building in the in the AI space today. Customers really like them, and it's resonating with them.\n\n**Andy Jassy** (President &amp; CEO)\nI still think it's very early days in AI and in terms of adoption. But I the other thing I would just say is that, remember, because we're at a stage right now where so much of the activity is is training and figuring out how to get your generative AI applications into production, people aren't paying as close attention as they will in making sure that those generative AI applications are operating where the rest of their data and infrastructure is. Remember, a lot of generative AI, inference is just gonna be another building block like compute, storage, and database. And so people are gonna actually wanna run those applications close to where their other applications are running, where their data is. There's just so many more applications and data running in AWS than anywhere else.\n\n**Andy Jassy** (President &amp; CEO)\nAnd I'm very optimistic about as we get to a bigger scale, what's gonna happen for AWS on the AI side. And I think we have a set of services that is unique top to bottom in the stack. I think on the last part about what do we expect with respect to acceleration. You know, we don't we don't give guidance by segments. I'm not gonna try and give you guidance, but I I do I do believe that the combination of more enterprises who have resumed their march to modernize their infrastructure and move from on premises to the cloud, coupled with the fact that AI is going to accelerate in terms of more companies deploying more AI applications into production that start to scale, coupled with the fact that I do think that more capacity is gonna come online in the in the coming months and quarters, make me optimistic about the AWS business.\n\n**Operator**\nThank you. And the next question comes from the line of Ron Josey with Citi. Please proceed with your question.\n\n**Ron Josey** (Managing Director)\nGreat. Thanks. Thanks for that, Andy.\n\n**Ron Josey** (Managing Director)\nThat was really helpful. Maybe taking that same question, but focusing internally on Amazon. I think you penned an article or a blog post back in June just talking about the ability or potential with GenAI agents and improving efficiencies and speed to market internally. So would love to hear your thoughts as as you think about how Amazon is adopting gen.ai internally, how perhaps, you've seen improving speed to market as a result of of everything you've just talked about. Thank you.\n\n**Andy Jassy** (President &amp; CEO)\nYeah. I I think that AI is is the biggest technology transformation of our lifetime, which is saying a lot because, you know, even in in some of our relatively short lifetimes, we've we've been through, you know, the cloud, mobile, and the Internet itself. But I I think it's gonna be the biggest transformation technically in our lifetime. And I think it's gonna not not only change every customer experience that we know and enable customer experiences we really only dreamed about before, but it's also gonna change very substantially the way we work. And if you think about it, you know, the way that we do coding, the way that we do analytics, the way that we do research, the way that we do finance, you know, and and and measure fine I mean, really, the way we do business process automation, you know, the way we do customer service, every single area that I can think of in the way we work is likely gonna be impacted in some meaningful way by AI.\n\n**Andy Jassy** (President &amp; CEO)\nAnd I think when you have a big shift like that, you have two macro choices. You could you can either decide that you're gonna embrace it and you're gonna and you're gonna help shape it, and you're you're gonna figure out how to build the right tools to allow you to take advantage of the technology, or you can wish it away and have it shape you. And, you know, the the posting that you're referencing, Ron, that I that I made was just really being clear with the team that we're gonna pursue that former approach. We are going to embrace it. We're gonna try and shape it.\n\n**Andy Jassy** (President &amp; CEO)\nAnd so we have, you know, we have a number of of of tools and agents that we've built already inside the company. And, you know, these are things like if you think about Curo and and the opportunity to have coding agents do a lot of of of the coding that's that's very compelling. It's gonna allow our our teammates to be able to start from a more advanced starting spot and to be able to invent for customers much more quickly and much more expansively. If you think about services like Connect, which is our AWS service that does call center software, that has a lot of AI built into it that changes the productivity of all your customer service agents. And you can just imagine across the board the types of things we're gonna do to make it easier to get software out, to build high quality software, to to do operations, QA, to automate a lot of the business process coordination happens inside the cloud.\n\n**Andy Jassy** (President &amp; CEO)\nWe're gonna we're gonna work on a whole bunch of those areas to allow ourselves primarily to be able to invent for customers much more quickly and expansively. But, also, I think it's gonna make all of our teammates' jobs much more enjoyable because they won't have to do as many of the rote parts of the job that we all do right now. They're gonna be able to own more pieces of what they're trying to solve for customers, and and we want deep owners that wanna end own as much end to end as possible.\n\n**Operator**\nThank you. And our final question will come from the line of Justin Post with Bank of America. Please proceed with your question.\n\n**Justin post** (Managing Director)\nGreat. Thanks. I'll just ask on the revenue guidance. It looks pretty robust growth in the third quarter. I know you won't say whether AWS is expected to accelerate, but could you talk about some of the drivers and what kind of tariff and other contingencies you've put in there?\n\n**Justin post** (Managing Director)\nAnd then maybe any thoughts on how you're thinking about how the Q4 is shaping up? Thank you.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nYes. Hi, Justin. This is Brian.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nI'll take this one. Yes, we've got it to $174,000,000,000 to 175,000,000,000 and we excuse me. A 179,500,000,000.0. That's a typo. We, feel good about the growth rate, in q two that we had and the acceleration in a number of areas, including units.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nAnd, you know, we had a very successful Prime Day earlier this month. So, you know, there are is uncertainty on where tariffs will settle and maybe the ultimate impact on consumers, as Andy mentioned earlier. But, we feel really good about the key inputs we control, price selection and convenience. We've talked about delivery speeds increasing. We've talked about selection increasing, high end stock levels, well dispersed inventory close to customers.\n\n**Brian Olsavsky** (SVP &amp; CFO)\nSo we think that all works in our favor. So I would say we're cautiously optimistic. I'm not going to give any guidance for Q4 at this time, we'll talk about that next time.\n\n**Dave Fildes** (VP - IR)\nThanks for joining us on the call today and for your questions. A replay will be available on our Investor Relations website for at least three months. We appreciate your interest in Amazon and look forward to speaking with you again with you next quarter.\n\n**Operator**\nLadies and gentlemen, that does conclude today's teleconference. You may disconnect your lines at this time. Thank you for your participation.",
      "fetched_at": "2026-02-04T15:37:51.803Z"
    },
    {
      "ticker": "AMZN",
      "title": "Amazon.com, Inc. (AMZN) Q1 FY2025 earnings call transcript",
      "published_date": "May 1, 2025, 5:00 PM EDT",
      "fiscal_year": "2025",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/AMZN/earnings/AMZN-Q1-2025-earnings_call-313773.html",
      "content": "**Operator**\nThank you for standing by. Good day, everyone, and welcome to the Amazon.com First Quarter 2025 Financial Results Teleconference. At this time, all participants are in a listen-only mode. After the presentation, we will conduct a question-and-answer session. Today's call is being recorded, and for opening remarks, I will be turning the call over to the Vice President of Investor Relations, Mr. Dave Fildes. Thank you, sir. Please go ahead.\n\n**Dave Fildes** (VP of Investor Relations)\nHello, and welcome to our Q1 2025 Financial Results Conference call. Joining us today to answer your questions is Andy Jassy, our CEO, and Brian Olsavsky, our CFO. As you listen to today's conference call, we encourage you to have a press release in front of you, which includes our financial results, as well as metrics and commentary on the quarter. Please note, unless otherwise stated, all comparisons in this call will be against our results for the comparable period of 2024. Our comments and responses to your questions reflect management's views as of today, May 1, 2025 only, and will include forward-looking statements. Actual results may differ materially. Additional information about factors that could potentially impact our financial results is included in today's press release and our filings with the SEC, including our most recent annual report on Form 10-K and subsequent filings.\n\n**Dave Fildes** (VP of Investor Relations)\nDuring this call, we may discuss certain non-GAAP financial measures in our press release, slides accompanying this webcast, and our filings with the SEC, each of which is posted on our IR website. You will find additional disclosures regarding these non-GAAP measures, including reconciliations of these measures with comparable GAAP measures. Our guidance incorporates the order trends that we've seen to date and what we believe today to be appropriate assumptions. Our results are inherently unpredictable and may be materially affected by many factors, including fluctuations in foreign exchange rates, changes in global economic and geopolitical conditions, tariff and trade policies, and customer demand and spending, including the impact of recessionary fears, inflation, interest rates, regional labor market constraints, world events, the rate of growth of the internet, online commerce, cloud services, and new and emerging technologies, and the various factors detailed in our filings with the SEC.\n\n**Dave Fildes** (VP of Investor Relations)\nOur guidance assumes, among other things, that we do not conclude any additional business acquisitions, restructurings, or legal settlements. It is not possible to accurately predict demand for our goods and services, and therefore our actual results could differ materially from our guidance. I will now turn the call over to Andy.\n\n**Andy Jassy** (CEO)\nThanks, Dave. Today we're reporting $155.7 billion in revenue, up 10% year-over-year, excluding the impact from foreign exchange rates. Operating income is $18.4 billion, up 20% year-over-year, and trailing 12-month free cash flow is $25.9 billion. We're pleased with our continued business progress, but more importantly, with our pace of innovation and additional improvement in our customer experiences. In our stores business, we once again saw strong consumer resonance in our continued work on selection, value, and shipping speed. Our broad selection offers customers choice across their shopping journeys. We welcome well-known brands such as Oura Rings, Michael Kors, and The Ordinary, as well as a new shopping experience with Saks that offers a refined luxury assortment of fashion and beauty items from brands like Dolce & Gabbana, Balmain, Burberry, Giambattista Valli, and Jason Wu Collection.\n\n**Andy Jassy** (CEO)\nAs always, we're working to keep prices low, and with this being an uncertain moment for consumers, it's even more important than it typically is. In Q1, we held deal events worldwide to help customers save over $500 million across the Big Spring Sale in the U.S. and Canada, Spring Deal Days in Europe, and Ramadan Eid Sale events in Egypt, Saudi Arabia, Turkey, and the UAE. Prime members will have more opportunities to save throughout the year, including at our 11th Prime Day event in July. Over the past-few-years, we've made significant progress in making our fulfillment network more efficient and cost-effective. We've shared many times that an important turning point was regionalizing our national fulfillment network into regional hubs. By stocking items closer to where customers live, we're able to deliver more orders faster, often in fewer packages and at lower delivery costs.\n\n**Andy Jassy** (CEO)\nThe next challenge was getting as many items as possible into these regional nodes. Our inbound network, which is how we get items to each fulfillment center, had not been architected to leverage this new regionalization structure, so we redesigned it and just rolled out a new inbound architecture that expands the share of products that we can place in each fulfillment center, improving delivery speeds and lowering our cost to serve. In the first quarter, we once again set new delivery speed records with our fastest delivery ever for Prime members around the world, and we delivered more items in the same day or next day in Q1 than any other quarter in our history. Looking ahead, we will continue to refine our newly redesigned inbound network, build out our same-day delivery sites, and add additional robotics and automation throughout our buildings.\n\n**Andy Jassy** (CEO)\nYou'll also see us expand the number of delivery stations that we have in rural areas of the U.S. so we can get items to people who live in less densely populated areas much more quickly. I thought I'd share a few thoughts on the prospect of heightened tariffs on our stores business. Obviously, none of us knows exactly where tariffs will settle or when. We haven't seen any attenuation of demand yet. To some extent, we've seen some heightened buying in certain categories that may indicate stocking up in advance of any potential tariff impact. We also have not seen the average selling price of retail items appreciably go up yet.\n\n**Andy Jassy** (CEO)\nSome of this reflects some forward buying we did in our first-party selling, and some of that reflects some advanced inbounding our third-party sellers have done, but a fair amount of this is that most sellers just have not changed pricing yet. Again, this could change depending on where tariffs settle. Amazon is not uniquely susceptible to tariffs. As it relates to China, retailers who are not buying directly from China are typically buying from companies who themselves are buying from China, marking these items up, rebranding, and selling to U.S. consumers. These retailers are buying the product at a higher price than Chinese sellers selling directly to U.S. consumers in our marketplace, so the total tariff will be higher for these retailers than for China direct sellers. It is also sometimes easy to forget what Amazon sells. We are not mostly selling high average selling price items, though we certainly sell a bunch.\n\n**Andy Jassy** (CEO)\nIn the first quarter, our everyday essentials grew more than twice as fast as the rest of our business and represented one out of every three units sold in the U.S. on Amazon. Even if you exclude Whole Foods Market and Amazon Fresh, Amazon is one of the largest grocers in the U.S. with over $100 billion in gross sales last year. People are buying a lot of their everyday essentials at Amazon. We also have an extremely large selection, hundreds of millions of unique SKUs, which means we're often able to weather challenging conditions better than others. When there are periods of discontinuity, substantial unexpected product trends emerge. Think about the pandemic, when items like masks and hand sanitizer became big sellers.\n\n**Andy Jassy** (CEO)\nWhen you have the broadest selection like we do and 2 million plus global sellers like we do, you're better positioned to help customers find whatever items matter to them at lower price points than elsewhere. Finally, when there are uncertain environments, customers tend to choose the provider they trust most. Given our really broad selection, low pricing, and speedy delivery, we have emerged from these uncertain eras with more relative market segment share than we started and better set up for the future. I'm optimistic this could happen again. Moving to a few words on Amazon ads. We're working hard to be the best place for brands of all sizes to grow their business. We are pleased with the strong growth on a very large base, generating $13.9 billion of revenue in the quarter and growing 19% year-over-year.\n\n**Andy Jassy** (CEO)\nWe're seeing strength across our broad portfolio of full-funnel advertising offerings that help advertisers reach an average ad-supported audience of more than 275 million in the U.S. alone. This includes our top-of-funnel efforts to drive brand awareness, the bottom-of-funnel offerings where we measure outcomes at the point of conversion. Amazon ads provides brands with tools to reach targeted audiences in our own entertainment properties such as Prime Video, Twitch, and IMDb, in live sports such as NFL, NBA, and NASCAR, audio content such as Amazon Music and Wondery, and of course in our store, as well as many other external sites such as Pinterest and BuzzFeed.\n\n**Andy Jassy** (CEO)\nAll of our audience and measurement capabilities work for the ads we deliver across premium third-party publishers through Amazon DSP, and our secure clean rooms provide advertisers the ability to analyze data, produce core marketing metrics, and understand how their marketing performs across various channels. We continue to see a lot of opportunity to further expand our full-funnel capabilities for brands. AWS grew 17% year-over-year in Q1 and now sits at a $117 billion annualized revenue run rate. We continue to help organizations of all sizes accelerate their move to the cloud, helping to modernize their infrastructure, lower costs, and speed up innovation. We signed new AWS agreements with companies including Adobe, Uber, Nasdaq, Ericsson, Fujitsu, Cargill, Mitsubishi Electric Corporation, General Dynamics Information Technology, GE Vernova, Booz Allen, Hamilton, NextEra Energy, Publicis Sapient, Elastic, NetSmart, and many others.\n\n**Andy Jassy** (CEO)\nIt's useful to remember that more than 85% of the global IT spend is still on premises, so not in the cloud yet. It seems pretty straightforward to me that this equation will flip in the next 10 years-20 years. Before this generation of AI, we thought AWS had the chance to ultimately be a multi-hundred billion dollar revenue run rate business. We now think it could be even larger. If you believe your mission is to make customers' lives easier and better every day, and you believe that every customer experience will be reinvented with AI, you're going to invest very aggressively in AI, and that's what we're doing. You can see that in the thousand-plus AI applications we're building across Amazon. You can see that with our next generation of Alexa named Alexa Plus.\n\n**Andy Jassy** (CEO)\nYou can see that in how we're using AI in our fulfillment network, robotics, shopping, Prime Video, and advertising experiences. You can see that in the building blocks AWS is constructing for external and internal builders to build their own AI solutions. We're not dabbling here. We're very intentionally giving builders the broadest possible capabilities at every level of the AI stack cost-effectively to use AI expansively across their businesses. At the bottom layer for those building models, our new custom AI chip, Trainium 2, is starting to lay in capacity in larger quantities with significant appeal and demand. While we offer customers the ability to do AI in multiple chip providers and will for as long as I can foresee, customers doing AI at any significant scale realize that it can get expensive quickly.\n\n**Andy Jassy** (CEO)\nThe 30%-40% better price performance that Trainium two offers versus other GPU-based instances is compelling. For AI to be as successful as we believe it can be, the price of inference needs to come down significantly. We consider this part of our mission and responsibility to help make it so. At the middle layer for those wanting to leverage frontier models to build generative AI apps, Amazon Bedrock is our fully managed service that offers a choice of high-performing foundation models with the most compelling set of features that make it easy to build high-quality generative AI applications. We continue to iterate quickly on Bedrock, adding Anthropic's Claude 3.7 Sonnet hybrid reasoning model, their most intelligent model to date, and Meta's Llama 4 family of models.\n\n**Andy Jassy** (CEO)\nWe were also the first cloud service provider to make DeepSeek R1 and Mistral AI's Pixtral Large generally available as a fully managed model. Of course, we offer our own Amazon Nova state-of-the-art foundation models in Bedrock with the latest premier model launching yesterday. They deliver frontier intelligence and industry-leading price performance, and we have thousands of customers already using them, including Slack, Siemens, Sumo Logic, Coinbase, FanDuel, Glean, and Blue Origin. A few weeks ago, we released Amazon Nova Sonic, a new speech-to-speech foundation model that enables developers to build voice-based AI applications that are highly accurate, expressive, and human-like. Nova Sonic has lower word error rates and higher win rates over other comparable models for speech interactions. The technology world is also abuzz about the potential of agents. To date, virtually all of the agentic use cases have been of the question-answer variety.\n\n**Andy Jassy** (CEO)\nOur intention is for agents to perform wide-ranging, complex, multi-step tasks like organizing a trip or setting the lighting, temperature, and music ambience in your house for dinner guests, or handling complex IT tasks to increase business productivity. There have not been action-oriented agents like this until Alexa Plus, but the technology to build these agents is still quite primitive and accurate and requires constant human supervision. We have just released a research preview of Amazon Nova Act, a new AI model trained to perform actions within a web browser. It enables developers to break down complex workflows into reliable atomic commands like search or checkout or answer questions about the screen. It also enables them to add more detailed instructions to these commands where needed, like do not accept the insurance upsell.\n\n**Andy Jassy** (CEO)\nNova Act aims to move the current state-of-the-art accuracy on multi-step agentic actions from 30%-60% to 90 plus percent with the right set of building blocks to build these action-oriented agents. At the very top of the stack are the applications. This past quarter, Amazon Q, the most capable generative AI-powered assistant for accelerating software development and leveraging your own data, launched a lightning-fast new agentic coding experience within the command line interface that can execute complex workflows autonomously. Customers are loving this. We also made generally available GitLab Duo with Amazon Q, enabling AI agents to assist multi-step tasks such as new feature development, code-based upgrades for Java 8 and 11, while also offering code review and unit testing, all within the same familiar GitLab platform.\n\n**Andy Jassy** (CEO)\nOur AI business has a multi-billion dollar annual revenue run rate, continues to grow triple-digit year-over-year percentages, and is still in its very early days. While there is good reason for the high optimism about AI, I conclude my AWS comments with a reminder that there is still so much on-premises infrastructure yet to be moved to the cloud. Infrastructure modernization is much less sexy to talk about than AI, but fundamental to any company's technology and invention capabilities, developer productivity, speed, and cost structure. If we're companies to realize the full potential of AI, they're going to need their infrastructure and data in the cloud. I want to briefly mention a few other items.\n\n**Andy Jassy** (CEO)\nAs I've referenced a couple of times in Q1, we introduced Alexa Plus, our next-generation Alexa personal assistant who's meaningfully smarter and more capable than her prior self, can both answer virtually any question and take actions, and is free with Prime or available to non-Prime customers for $19.99 a month. We're just starting to roll this out in the U.S., and we'll be expanding to additional countries later this-year. People are really liking Alexa Plus this far. We're excited and honored to be part of the joint venture that will be creating the next generation of the esteemed James Bond film franchise. We recently named acclaimed producer Amy Pascal and David Heyman to produce the next James Bond movie.\n\n**Andy Jassy** (CEO)\nAdditionally, just a couple of days ago, Project Kuiper reached a significant milestone by launching our first satellites into orbit, with more being launched soon, and we expect to begin offering service to customers later this year. I'm proud of what our teams around the world have delivered. We're excited about what we're inventing and working on as we speak, and with that, I'll turn it over to Brian for a financial update.\n\n**Brian Olsavsky** (CFO)\nThanks, Andy. I will begin with our top-line financial results. Worldwide revenue was $155.7 billion, a 10% increase year-over-year, excluding the impact of foreign exchange. This equates to a $1.4 billion headwind from foreign exchange year-over-year in the quarter. Worldwide operating income was $18.4 billion, approximately $400 million above the high end of our guidance range.\n\n**Brian Olsavsky** (CFO)\nThese results include one-time charges that impacted North America and international operating income that I will discuss in a moment. First, let's start with the net sales results for these segments. In the North America segment, first-quarter revenue was $92.9 billion, an increase of 8% year-over-year. Our international segment revenue was $33.5 billion, also an increase of 8% year-over-year, excluding the impact of foreign exchange. Worldwide paid units grew 8% year-over-year. Our priority is to provide value to our customers across our businesses. In the first quarter, we held multiple deal events around the world, which drove strong customer engagement. We saw broad-based strengths across our key business inputs, including record delivery speeds for Prime members, enabled by improved inventory placement. Our vast selection gives customers choice across various price points, particularly in categories like grocery, which includes everyday essentials.\n\n**Brian Olsavsky** (CFO)\nThese are the items that people purchase most frequently. We partner with millions of independent sellers from around the world. These selling partners are important contributors to our broad selection, and worldwide third-party seller unit mix was 61% in Q1, consistent with Q1 of last-year. Shifting to profitability, North America segment operating income was $5.8 billion, and international segment operating income was $1 billion, with operating margins of 6.3% in North America and 3% internationally. As I mentioned earlier, during the quarter, we recorded one-time charges related to some historical customer returns that have not yet been resolved, and some costs to receive inventory that was pulled forward into Q1 ahead of anticipated tariffs. Without these charges, North America and international operating margins would have been approximately 90 basis points and 70 basis points higher, or operating margins of 7.2% for North America and 3.7% for international.\n\n**Brian Olsavsky** (CFO)\nWe are pleased with how our teams continue to execute and deliver for customers. In Q1, our newly re-architected inbound network drove productivity in our fulfillment and transportation network, leading to better inventory placement and higher units per package, and as a result, lower delivery costs. Beyond Q1, we have a number of initiatives underway to continue improving our cost structure, such as fine-tuning our inbound network, building out our same-day delivery sites, expanding our rural delivery network, and adding robotics and automation to our facilities. Better inventory placement remains a top priority. Better placement drives more in-stock selection, reduces travel distances, and speeds up delivery. Having the inventory in the right place at the right time increases the likelihood that multiple items can be combined in a package, which helps reduce packaging and costs.\n\n**Brian Olsavsky** (CFO)\nAlthough progress will not always be linear, we have a good plan to continue to drive improvement over time. Shifting to advertising. Advertising remains an important contributor to profitability in the North America and international segments. Advertising revenue grew 19% year-over-year. We are pleased with the accelerating growth on an increasingly large base. We are seeing strong adoption across our full-funnel advertising offering as brands appreciate our ability to connect them with customers. We will also continue to invest in other long-term opportunities. These efforts have the potential to be important to customers and Amazon in the future, including Kuiper, where we had our first launch of our production design satellites earlier this week, and we will be launching more satellites throughout the year. We are closely monitoring the macroeconomic environment, including the impact of tariffs. We are planning for various outcomes, and we have taken a number of actions to protect the customer experience.\n\n**Brian Olsavsky** (CFO)\nWe're doing everything we can to keep our prices low for customers and in a way that makes economic sense. Moving next to our AWS segment, revenue was $29.3 billion in Q1, an increase of 17% year-over-year. AWS now has an annualized revenue run rate of more than $117 billion. During the first quarter, we continue to see growth in both generative AI business and non-generative AI offerings. As companies turn their attention to newer initiatives, bring more workloads to the cloud, restart or accelerate existing migrations from on-premises to the cloud, and tap into the power of generative AI. AWS operating income was $11.5 billion and reflects our continued growth, coupled with our focus on driving efficiencies across the business.\n\n**Brian Olsavsky** (CFO)\nAs we've said before, we expect AWS operating margins to fluctuate over time, driven in part by the level of investments we're making at any point in time. We plan to bring on an increasing amount of capacity in the back half of the year. Now turning to our cash CapEx, which was $24.3 billion in Q1. The majority of this spend is to support the growing need for technology infrastructure. It primarily relates to AWS as we invest to support demand for our AI services and increasingly in custom silicon like Trainium, as well as tech infrastructure to support our North America and international segments. We're also investing in our fulfillment and transportation network to support future growth and improve delivery speeds and our cost structure. This investment will support growth for many-years to come.\n\n**Brian Olsavsky** (CFO)\nWhile we primarily focus our comments on operating income, I'd like to point out that our first-quarter net income of $17.1 billion includes a pre-tax gain of $3.3 billion included in non-operating income, and it relates to our investment in Anthropic. This activity is not related to Amazon's ongoing operations, but rather the result of the conversion of a portion of our convertible notes to non-voting preferred stock. Turning to Q2 guidance. As a reminder, our guidance considers a range of possibilities and takes into account Q1 results, trends in quarter-day results, and expectations around the macroeconomic environment. Q2 net sales are expected to be between $159 billion and $164 billion. We estimate the year-over-year impact of changes in foreign exchange rates based on current rates, which we expect to be a headwind of approximately 10 basis points in the quarter.\n\n**Brian Olsavsky** (CFO)\nAs a reminder, global currencies can fluctuate during the quarter. Q2 operating income is expected to be between $13 billion and $17.5 billion. This estimate includes the impact of our seasonal step-up in stock-based compensation expense in Q2, driven by the timing of our annual compensation cycle. The external environment remains complex, and as we have done throughout our history, we are focused on the inputs that we can control to protect the customer experience. We will work hard to remain the place customers trust for sharp prices, broad selection, and convenience. We'll remain focused on driving a better customer experience, and we still believe putting customers first is the only reliable way to create lasting value for our shareholders. With that, let's move on to your questions.\n\n**Operator**\nThank you. At this time, we will now open the call up for questions. We ask each caller to please limit yourself to one question. If you would like to ask a question, please press star one on your keypad. We ask that when you pose your question, you pick up your handsets to provide optimum sound quality. Once again, to initiate a question, please press star, then one on your touchstone telephone at this time. Please hold while we pull for questions. The first question comes from the line of Ross Sandler with Barclays. Please proceed with your question.\n\n**Ross Sandler** (Analyst)\nGreat. I think I'm going to leave the China questions to others and focus on AWS and kind of AI. Andy, it seems like you've been bringing on a lot more P5 GPU instances since February from what it looks like to kind of support all these new AI workloads. How would you characterize in the first quarter and maybe here in the second quarter the kind of supply-demand imbalance that you talked about before around AI workloads? When do you think that AWS will be in a position to kind of capture enough AI revenue to drive acceleration? Is that something that could happen this year, or do you see that more like next year given your capacity constraints? Thank you very much.\n\n**Andy Jassy** (CEO)\nThanks, Ross. You know, I would say that we've been bringing on a lot of P5s, which is a form of NVIDIA chip instances, as well as landing more and more Trainium 2 instances as fast as we can. I would tell you that, you know, our AI business right now is a multi-billion dollar annual run rate business. It's growing triple-digit percentage year-over-year.\n\n**Andy Jassy** (CEO)\nAs fast as we actually put the capacity in, it's being consumed. You know, I think we could be helping more customers and driving more revenue for the business if we had more capacity. We have a lot more Trainium 2 instances and the next generation of NVIDIA's instances landing in the coming months. I expect that, you know, there are other parts of the supply chain that are a little bit jammed up as well, you know, motherboards and some other componentry. I do think—and some of that is just because there is so much demand right now—but I do believe that the supply chain issues and the capacity issues will continue to get better as the year proceeds.\n\n**Operator**\nThe next question comes from the line of Eric Sheridan with Goldman Sachs. Please proceed with your question.\n\n**Eric Sheridan** (Managing Director)\nThanks so much for taking the question. Maybe I could ask a two-parter. First, in terms of strategy, you know, Andy, how do you think about positioning the company for the medium term with given all the levels of uncertainty out there about how the global trade environment might shift in the coming months? What do you see as the key strategic priorities that will allow the company to sort of be able to capitalize one way or another depending on various elements of outcome? How do you prioritize those investments in the months ahead? With respect to the one-quarter forward operating income guide, is there anything in there from a cost side that we should be thinking about as purely aligned with those types of investments against the trade landscape that might not repeat either later into this year or next year? Thanks so much.\n\n**Andy Jassy** (CEO)\nThanks, Eric. You know, it's hard to tell what's going to happen with tariffs right now. It's hard to tell where they're going to settle and when they're going to settle. A lot of what we're thinking about short and medium term actually turns out to be what we think about long term too, which is how do we actually have the broadest possible selection for customers at the lowest possible prices? There's maybe never been a more important time in recent memory than, you know, trying to keep prices low, which we're heads down, pretty maniacally focused on, and then get things to people quickly and take care of customers. That is the heart of what we're doing. You can see different initiatives that we've taken within those priorities. We've done some forward buys of inventory where we're the first-party seller.\n\n**Andy Jassy** (CEO)\nOur third-party sellers have pulled forward a number of items so that they have inventory here as well. Those are all, you know, we're encouraging that because we're trying to keep prices as low as possible for customers. I think also when you have as broad a selection as we have, and we have much broader selection than other retailers, it means that when you've got this continuity like we may potentially have, you're better able to help customers find what they want no matter what those trends are. I mentioned in my opening comments about what happened in the pandemic, and you can bet there are going to be things that we don't anticipate that customers really value and want that are different.\n\n**Andy Jassy** (CEO)\nIt could be as simple, by the way, as just favoring other brands that maybe people did not know about before, but where they have a more favorable price equation for customers. I think when you have also got—another thing that people forget is that when you have got 2 million plus sellers, they are not all going to take the same strategy if there ends up being higher tariffs. I mean, there are going to be plenty of sellers that decide to pass on those higher costs to end consumers, but they are going to—you know, we have a lot of sellers in lots of different countries, and not all of them are going to pursue the same tack.\n\n**Andy Jassy** (CEO)\nI think when you've got larger diversity like we have, we have a better chance of some of those sellers deciding that they're going to capture share, and they're not going to pass on all or any of those tariffs to customers. I think customers are going to have a better chance of finding variety on selection and on lower prices when they come here. You know, the last thing I would say is that we have been in a number of our businesses, but just I'd say over the last six years or so, we have been diversifying where we produce things over a long period of time.\n\n**Andy Jassy** (CEO)\nWe had a, I would say, a meaningfully higher concentration of where we produced components for AWS or devices in China than we have now, where we've diversified meaningfully over that time, and we just thought that was wise to do so. Those are some of the ways that we're trying to make sure that we are protecting our customers over the short, medium, and long term. It turns out that most of those are the things that we focus most on, which is really broad selection for ultimate choice, really low prices, and very fast delivery.\n\n**Brian Olsavsky** (CFO)\nEric, I'll take your question on the guidance and especially on operating income. I think that was your question in the cost that might be in Q2. The thing I'd point to again is what I mentioned earlier.The stock-based comp always steps up generally in Q2 versus Q1 and then resets a rate that carries through for the next four quarters. You can look at historic trends to get an idea of that. Secondly, we do have some additional Kuiper launch costs in Q2. You saw a launch happen this week. A reminder that we expense those launch costs until the point of commercialization, which the plan is to have that be later in this-year.\n\n**Operator**\nThank you. The next question comes from the line of Justin Post with Bank of America. Please proceed with your question.\n\n**Justin Post** (Managing Director)\nGreat. Thanks. I'll go back to AWS. I know in the past you said revenues can be lumpy. Can you explain why they might fluctuate up and down if it's beyond just capacity? You see the competitors, you know, with some pretty good growth rates. How do you think about the difference there? Obviously, your dollar growth is very good, but how do you think about the difference there versus some of your competitors? Thank you.\n\n**Andy Jassy** (CEO)\nYou know, the first thing I would say is when we've historically said that revenue can be lumpy, this was, you know, we've been saying this well before what's happened with AI over the last couple of years. The reason for that is the sales cycle for, particularly for enterprises. It's true for startups. You know, what you really want is you want to have the type of capabilities where startups want to primarily choose to run on top of your platform. That's true. If you look in the startup space, you know, the vast majority of successful startups over the last 10 years-15 years have run on top of AWS.\n\n**Andy Jassy** (CEO)\nIt's unpredictable when those startups are going to find product-market fit and grow substantially. It's, you know, it's hard for them to predict and even harder for us to predict. The same thing goes on the enterprise side, but in a different way, when the sales cycle on the enterprise side is that you spend time trying to convince people that they should move from on-premises to the cloud, and then that you have the right solution for them, and then you pick a set of projects that you get experience on. Sometimes they use systems integrators, sometimes they use our own professional services, sometimes they're doing it themselves. There's a next tranche of migrations. Those migrations just take time. Some companies get through them really quickly, and some companies take longer to get through them.\n\n**Andy Jassy** (CEO)\nWhat happens a lot of times too is that they get excited and enthusiastic about the cost advantages and the speed of innovation advantages they get moving to the cloud. What was supposed to be a smaller next tranche turns into a much larger next tranche. All of that has been true for a long time. It's very hard for us to predict because it really is contingent on what enterprises, how they want to sequence it and resource it. You throw in AI, which has its own very fast growth cycle, particularly in certain types of use cases. Those change. I mean, I'll give you just some examples. You know, in the early days of, you know, the earliest days, I should say, of AI, what you've seen the most amount of has been initiatives that get you productivity and cost avoidance.\n\n**Andy Jassy** (CEO)\nWe've seen that from so many of our AWS customers. We're doing a lot of it ourselves inside of Amazon using AI. You've also seen, I would say, large-scale training, with a lot of those running on top of this as well. As you know, Anthropic is running their, you know, building their next few training models on top of our Trainium 2 chip on AWS. You've seen a couple really big chatbots. What you've seen just in the last few months is really kind of the explosion of coding agents. If you just look at the growth of these coding agents the last few months, these are companies like Cursor or Vercel, both of them run significantly on AWS. Just look at the growth of that over the last few months.\n\n**Andy Jassy** (CEO)\nYou just couldn't have predicted that sort of growth. That's why it's lumpy. You know, sometimes you'll have, you know, very significant increases that you didn't predict and you couldn't forecast. You know, they'll grow at a good rate, but maybe not the same rate before the next big kind of explosive growth. I would tell you that everything I just mentioned with interesting in AI is that we still haven't gotten to all the other customer experiences that are going to be reinvented and all the other agents that are going to be built. They're going to take, you know, the role of a lot of different functions today.\n\n**Andy Jassy** (CEO)\nYou know, those are, they're so, even though we have a lot of combined inference in those areas, I would say we're not even at the second strike of the first batter in the first inning. It is so early right now. I would just say on the how to think about relative growth rates, you always have to, you know, the year-over-year growth rate is really only a function of the percentage growth on the base with which you are operating from. We just have a very, you know, a meaningfully larger base on the technology infrastructure side than others. When, you know, it's still, you know, if you think about 17% year-over-year growth on a $117 billion revenue run rate, it's still pretty significant growth. As I said, I think we could be doing more if we had more capacity.\n\n**Andy Jassy** (CEO)\nI expect that to, you know, the capacity to ease in the coming months.\n\n**Operator**\nThank you. Our next question comes from the line of Doug Anmuth with JP Morgan. Please proceed with your question.\n\n**Doug Anmuth** (Managing Director)\nThanks for taking the questions. One for Brian, one for Andy. Brian, just maybe to follow up on AWS, but more on the margin side. We've seen a lot of fluctuation over the last couple of years and now hitting almost 40%. If you can just talk about what's driving the outperformance and then how we should think about normalized margins going forward. Andy, your comments on Alexa about moving to more complex tasks. Can you talk about that more? And just, you know, with Alexa, the products have been around for a long time, and they've had different use cases. How do you get users to shift their behavior more with Alexa? Thanks.\n\n**Brian Olsavsky** (CFO)\nThanks, Doug. I'll take your first question. Yeah, we did a strong quarter in AWS, as you mentioned, the margin performance. I would attribute it to the strong growth that we're seeing, coupled with, you know, the impact of some continued investment we're making in innovation and technology. Give you some examples. You know, we invest in software and process improvements, and it ends up optimizing our server capacity, which helps our infrastructure costs. Been developing more efficient network using our low-cost custom networking gear. We're working to maximize the power usage in our existing data centers, which both lowers our costs and also reclaims power for other newer workloads. We're also seeing the impact of advancing custom silicon like Graviton. It provides lower costs not only for us, but also for our customers, the better price performance for them.\n\n**Brian Olsavsky** (CFO)\nYou're right, margins are, you know, impacted by a lot of things, including our level of investment, competitive pricing, the mix of generative AI services as they're ramping up. We'll continue to evolve over the years to come. We do have a lot of investment in infrastructure going on and plan for the second half of the year. That will, you know, we'll start to see the impact of that. We're happy with the performance of the team with generating cost savings. It's a big focus as well as expanding the services and features for customers.\n\n**Andy Jassy** (CEO)\nOn the Alexa question, we're really excited about Alexa Plus. You know, as I mentioned earlier, it is, she's much more intelligent, much more capable, and able to take real action.\n\n**Andy Jassy** (CEO)\nYou know, today, most of the agents that have been out there have really just been able to answer questions, which, when it came out, was very remarkable. I think the future of agents is not just being intelligent, but also being able to take action. That actually requires a great model, but it also requires the ability to sync that model and to align that model with being able to take the right action and execute and implement the right APIs, or you can have very suboptimal results. We have worked hard on that in Alexa Plus. We have started rolling out over the last several weeks. It is now with over 100,000 users, with more rolling out in the coming months. So far, the response from our customers has been very, very positive.\n\n**Andy Jassy** (CEO)\nPeople are excited about it. I think that, you know, it does a lot more things than what Alexa did before. You know, we're very fortunate in that we have over a half billion devices out there in people's homes and offices and cars. We have a lot of distribution already. There will be, to some degree, a little bit of rewiring for people on what they can do because you get used to patterns. I mean, even the simple thing of not having to speak Alexa speak anymore, where we're all used to saying Alexa before we want every action to happen. What you find is you really only have to do it the first time. Then really the conversation is ongoing where you don't have to say Alexa anymore.\n\n**Andy Jassy** (CEO)\nI've been lucky enough to have, you know, the Alpha and the Beta that I've been playing with for several months. It took me a little bit of time to realize I didn't have to keep saying Alexa. It's very freeing when you don't have to do that. You know, I think it's just experience in trying things. You can do things like you have guests coming over on a Saturday night for dinner, and you can say, you know, Alexa, please open the shades, put the lights on in the driveway and on the porch, increase the temperature five degrees, and pick music that would be great for dinner that's mellow. She just does it. Like when you have those types of experiences, it makes you want to do more of it.\n\n**Andy Jassy** (CEO)\nYou know, when I was in New York when we were announcing it, I asked her what were the, you know, we did the event way downtown. I asked her what were great Italian restaurants or pizza restaurants. She gave me a list. She asked me if she wanted me to make a reservation. I said yes. She made the reservation and confirmed the time. Like that, when you get into those types of routines and you have those types of experience, they're very, very useful. It is really like having a great personal assistant, which most people in the world don't have. I think that the more and more that people get used to it, they will realize what she can do. We're not going to be standing still.\n\n**Andy Jassy** (CEO)\nWe have a lot more functionality that we plan to add in the coming months too.\n\n**Operator**\nThank you. Our next question comes from the line of Brian Nowak with Morgan Stanley. Please proceed with your question.\n\n**Brian Nowak** (Managing Director)\nThanks for taking my questions. Hey, Andy and Brian. I have one for each of you guys. Andy, you have a very complicated retail business with a lot of moving pieces to it. I imagine you have a lot of good data on what you expect demand to be over the course of the year and the holidays and things. As you kind of step back and analyze the business and the tariff uncertainty, can you just sort of walk us through the one or two key areas operationally that you're most focused on just to ensure that Prime Day, Thanksgiving, and the holidays go as smoothly as they possibly can?\n\n**Brian Nowak** (Managing Director)\nThen secondly, Brian, just to kind of go back to Eric's earlier question, as we think about the 2Q EBIT guide, are there any one-time costs or sort of tariff-related costs in there similar to that billion dollars that you called out in the first quarter? Thanks.\n\n**Brian Olsavsky** (CFO)\nThanks, Brian. On the retail question, I would say that the areas that maybe we're most focused on to make sure we have, you know, not just a great Prime Day, but Prime Day is just one event, as you know, and so is Peak. We're trying to be great all year long for customers. The obvious ones are making sure that we help our sellers however we can, because there's uncertainty for our sellers as well. We're trying to make sure we provide a great experience.\n\n**Brian Olsavsky** (CFO)\nWe're trying to make sure that we have the right diversity of sellers and low prices for our customers. I think all that you have to also be very thoughtful around how much inventory you bring into your fulfillment nodes at any one time. Because you can imagine scenarios where, you know, either on your own when you're the first-party seller or lots of third parties want to get as much inventory in as early as possible, you know, trying to beat a deadline on what may happen. If you end up with too much inventory in your fulfillment network, it really slows down your productivity and your ability to get things out as quickly as you want for customers at the cost structure you want. Being able to manage that thoughtfully, we've learned that over-the-years.\n\n**Brian Olsavsky** (CFO)\nI think the team is doing a really good job of balancing that right now. Brian, on your question about Q2, I guess I'll just reiterate what I had said earlier. You know, we had stock-based comp step up, which I think you can see the normal pattern for that if you look at our history. We have additional Kuiper expenses. Specifically, you asked about tariffs. We do have tariffs that we'll be paying on retail purchases based on current tariffs. It's not large in Q2. We had done a lot of pre-buying of inventory in Q1, as I mentioned earlier. You know, just generally, I think with the uncertainty, we've added a bit to the range that we've given you.\n\n**Brian Olsavsky** (CFO)\nWe generally have a wide range, but just the general uncertainty that we're seeing and uncertainty of consumer demand and all the everything else is causing us to increase the ranges a bit. We'll see. We've filled some an informed view of Q2 right now. As Andy mentioned earlier, we saw actually some strength in April based on what could end up being some pre-buys of a number of things. Advertising has been strong. We think there's a lot of positive trends, but, you know, certainly uncertainty right now for the quarter.\n\n**Operator**\nThank you. Our final question will come from the line of Brent Thill with Jefferies. Please proceed with your question.\n\n**Brent Thill** (Managing Director)\nThanks. On AWS, I'm curious if you could give us the backlog number. Andy, to your point about many of these core workloads still yet to come to cloud, can you just update us in what you're seeing? Are you seeing enterprise strength back? Are you seeing some confusion with AI clouding that transition and the timing of that? Just give us a perspective on what you're seeing on that migration. Thank you.\n\n**Dave Fildes** (VP of Investor Relations)\nHey, this is Dave. I'll just jump in on the backlog and turn it over to Andy. The backlog is $189 billion for Q1. That's up about 20% year-over-year. And the weighted average remaining life on that is 4.1 years.\n\n**Andy Jassy** (CEO)\nOn the AWS question, Brent, around what we're seeing on the workloads that haven't moved, you know, what I would say, the way I would characterize it is that we were on a very aggressive march that was methodical, but almost metronomic before the pandemic of enterprises deciding that they wanted to move off their on-premises infrastructure because of the speed of innovation, the developer productivity, and the cost advantages of the cloud. When you got into the pandemic and the economy looked uncertain in the second half of that couple of few years, you had everybody trying to cost optimize, including us, by the way. As we started to emerge from that trend, you saw generative AI explode. Everybody wanted to try to find a way to have a workload or a set of workloads there because people saw the potential.\n\n**Andy Jassy** (CEO)\nIt was also something that was generating a lot of interest publicly. What we've seen now over the last, call it 16 months-18 months or so, is that enterprises realize they need to do both. They want to do AI. They have all sorts of pilots at this point on AI, many of which will be successful, others of which will not be successful. The ones that are successful will scale. They also have a lot more initiatives that they haven't, you know, that they still haven't gotten to on the AI side, either because they're building that skill set or they're picking a first set to get experience with, or as they're waiting to see the cost of inference continue to go down, which it will.\n\n**Andy Jassy** (CEO)\nI mean, you will not get the expansiveness that we all know is coming in AI until we keep getting the cost of inference down, even though it's growing like crazy right now. At the same time, I would say that we see an increased resurgence and understanding for enterprises that they are dropping the low-hanging fruit if they don't move their infrastructure to the cloud. They just, you know, for all the reasons I mentioned earlier. You're starting to see those plans pick up again. As I mentioned earlier to one of the questions, you don't decide that you're going to transform your infrastructure from on-premises to the cloud and see it happen in three months.\n\n**Andy Jassy** (CEO)\nYou know, that is typically a multi-year process that some companies do it fast, some companies do it slower, but they do it in tranches and they do it thoughtfully because they can't afford for their applications not to work as they're making their transition. We're having meaningful success in those conversations and in companies choosing to transform their infrastructure on top of AWS. I think that, you know, you'll see that moving forward too.\n\n**Dave Fildes** (VP of Investor Relations)\nThank you for your time joining us today and for your questions. A replay will be available on our investor relations website for at least three months. We appreciate your interest in Amazon, and we look forward to talking with you again next quarter.\n\n**Operator**\nLadies and gentlemen, that does conclude today's teleconference. You may disconnect your lines at this time. Thank you for your participation.",
      "fetched_at": "2026-02-04T15:37:55.632Z"
    }
  ]
}