{
  "ticker": "ASML",
  "last_updated": "2026-02-04T15:47:06.432Z",
  "total_transcripts": 5,
  "transcripts": [
    {
      "ticker": "ASML",
      "title": "ASML Holding N.V. - New York Re (ASML) Q4 FY2025 Investor Call earnings call transcript",
      "published_date": "Jan 28, 2026, 9:00 AM EST",
      "fiscal_year": "2025",
      "quarter": "Q4",
      "url": "https://finance.yahoo.com/quote/ASML/earnings/ASML-Q4-2025-earnings_call-542404.html",
      "content": "**Operator**\nGood day, and thank you for standing by. Welcome to the ASML 2025 Fourth Quarter and Full Year Financial Results Conference Call on January 28th, 2026. At this time, all participants are in a listen-only mode. After the speaker's introduction, there will be a question-and-answer session. To ask a question during the session, you need to press star one one on your telephone. You will then hear an automated message advising your hand is raised. To withdraw your question, please press star one one again. Please be advised that today's conference is being recorded. I would now like to hand the conference over to Mr. Jim Kavanaugh. Please go ahead.\n\n**Jim Kavanagh** (Head of Investor Relations)\nThank you, operator. Welcome, everyone. This is Jim Kavanaugh, Head of Investor Relations at ASML. Joining me today on the call are ASML CEO, Christophe Fouquet, and our CFO, Roger Dassen. The subject of today's call is ASML's 2025 fourth quarter and full year results. The length of this call will be 60 minutes, and questions will be taken in the order that they are received. This call is also being broadcast live over the internet at www.asml.com. A transcript of management's opening remarks and a replay of the call will be available on our website shortly following the conclusion of this call. Before we begin, I would like to caution listeners that comments made by management during this conference call will include forward-looking statements within the meaning of the federal securities laws. These forward-looking statements involve material risks and uncertainties.\n\n**Jim Kavanagh** (Head of Investor Relations)\nFor a discussion of risk factors, I encourage you to review the safe harbor statement contained in today's press release and presentation found on our website at www.asml.com, and in our ASML's annual report on Form 20-F and in other documents as filed with the Securities and Exchange Commission. With that, I would like to turn the call over to Christophe Fouquet for a brief introduction.\n\n**Christophe Fouquet** (CEO)\nThank you, Jim. Welcome, everyone, and thank you for joining us for our fourth quarter and full year 2025 results conference call. Before we begin the Q&A session, Roger and I would like to provide an overview and some commentary on the fourth quarter results and full year 2025 results, as well as provide some additional comments on the current business environment and on our future business outlook. Roger?\n\n**Roger Dassen** (CFO)\nThank you, Christophe, and welcome everyone. I will first review the fourth quarter and full year 2025 financial accomplishments and then provide guidance for the first quarter of 2026. Let me start with our fourth quarter accomplishments. The fourth quarter of 2025, total net sales were EUR 9.7 billion, which is within our guidance. Net system sales were EUR 7.6 billion, which includes EUR 3.6 billion from EUV system sales, including 2 high NA systems, and EUR 4 billion from non-EUV system sales. Net system sales were driven by logic at 70%, with the remaining 30% coming from memory. Installed base management sales for the quarter came in at EUR 2.1 billion as guided. Gross margin for the quarter was also within guidance at 52.2%.\n\n**Roger Dassen** (CFO)\nOn operating expenses, our expenses were slightly higher than expected at rounded EUR 1.3 billion, mainly due to higher non-recurring personnel costs and the recognition of a grant that shifted into 2026. SG&A expenses also came in higher than guided at EUR 375 million, driven mostly by higher, mainly non-recurring salary-related costs, the sale of receivables, and pull-in of certain IT spending. The effective tax rate for Q4 was 18%. For the full year 2025, the annualized effective tax rate came in at 17.7%. Net income in Q4 was EUR 2.8 billion, representing 29.2% of total net sales, and resulting in earnings per share of EUR 7.35.\n\n**Roger Dassen** (CFO)\nTurning to the balance sheets, we ended the fourth quarter with cash, cash equivalents, and short-term investments at a level of EUR 13.3 billion. Our Q4 free cash flow was EUR 10.9 billion, which was significantly higher relative to the previous quarters of this year, with the majority of the cash coming in at the very end of the quarter. Moving to the order book, Q4 net bookings came in at EUR 13.2 billion, split between EUR 7.4 billion of EUV systems and EUR 5.8 billion of non-EUV systems. Net bookings in the quarter were slightly weighted towards memory, with 56% of bookings and logic accounting for the remaining 44%. Turning now to the full year, net sales came in at EUR 32.7 billion, with a gross margin of 52.8%.\n\n**Roger Dassen** (CFO)\nEUV system sales realized from 48 systems, including High NA, were EUR 11.6 billion, which was 39% higher than 2024. DUV system sales decreased 6% year-over-year to EUR 12 billion, while metrology and inspection system sales increased 28% from 2024 to EUR 825 million. Looking at the market segments for 2025, logic system revenue was EUR 16.1 billion, 22% higher than 2024. Memory system revenue was EUR 8.4 billion, 2% lower than 2024, and installed base management sales were EUR 8.2 billion, 26% higher than 2024. We concluded 2025 with a backlog of around EUR 38.8 billion.\n\n**Roger Dassen** (CFO)\nIn 2025, we continued to invest in innovation across our full product portfolio, increasing R&D spending to EUR 4.7 billion, or about 14% of sales. SG&A increased to EUR 1.3 billion in 2025, which was about 4%. Net income for the full year was EUR 9.6 billion, 29.4% of net sales, resulting in an earnings per share of EUR 24.73. In 2025, we generated free cash flow of EUR 11 billion. With that, I would like to turn to our expectations for the first quarter of 2026. We expect Q1 total net sales to be between EUR 8.2 billion and EUR 8.9 billion. We expect our Q1 installed base management sales to be around EUR 2.4 billion.\n\n**Roger Dassen** (CFO)\nGross margin for Q1 is expected to be between 51% and 53%. Expected R&D expenses for Q1 are around EUR 1.2 billion, and SG&A is expected to be around EUR 0.3 billion. For the full year 2026, we expect net sales to be between EUR 34 billion and EUR 39 billion, with a gross margin of between 51% and 53%. Regarding our cash return to our shareholders, in Q4, ASML's second interim dividend over 2025 of EUR 1.60 euro per ordinary share. ASML intends to declare a total dividend for the year 2025 of EUR 7.50 euro per ordinary share, which is a 17% increase compared to 2024. An interim dividend of EUR 1.60 euro per ordinary share will be made payable on February eighteenth, 2026.\n\n**Roger Dassen** (CFO)\nRecognizing this interim dividend and the two interim dividends of EUR 1.60 per ordinary share paid in 2025, this leads to a total dividend, a final dividend proposal to the annual general meeting of EUR 2.70 per ordinary share. In Q4 2025, we purchased shares for a total amount of around EUR 1.7 billion. This program finished in December 2025, with a total of EUR 7.6 billion we purchased out of the up to EUR 12 billion program. We returned EUR 8.5 billion to shareholders through a combination of dividends and share buybacks in 2025. ASML announced a new share buyback program, effective today, and to be executed by December 31st, 2028.\n\n**Roger Dassen** (CFO)\nWe intend to repurchase shares of an amount up to EUR 12 billion, of which we expect a total of up to EUR 2 million will be used to cover employee share plans. We intend to cancel the remainder of the shares repurchased. With that, I would like to turn the call back over to Christophe.\n\n**Christophe Fouquet** (CEO)\nThank you, Roger. As Roger has highlighted, we finished the year with a very strong quarter with good financial results. The market outlook has improved notably over the last months, especially as related to the continued buildup of data centers and AI-related infrastructure. This buildup is now translated into additional capacity needs at our advanced logic and DRAM customers, and in turn, an increased demand across our product portfolio, especially in our EUV business. Over the past quarters, we have seen a notable increase and acceleration of capacity expansion planning across a large majority of our customer base. In advanced logic, our foundry customers have become more positive on the long-term sustainability of demand on a number of fronts. Sorry. AI accelerators are migrating from the 4-nanometer node to the more litho-intensive 3-nanometer node.\n\n**Christophe Fouquet** (CEO)\nAt the same time, customers continue to ramp the 2nm node in support of next-generation HPC and mobile application. In memory, our customers are reporting very strong demand for both HBM and DDR products, with supply remaining very tight through at least 2026, as they ramp both their 1B and 1C nodes in support of the demand. In addition, DRAM customers continue to adopt more EUV layers on those nodes. This is expected to continue on their future nodes as they migrate more multi-patterning DUV to single expose EUV, resulting in an increase in litho intensity. As a result of these dynamics, we see our customer in both segments increasing and accelerating capacity expansion plans to support the very strong demand they are seeing. We expect these investments to generate business for ASML in 2026 and beyond.\n\n**Christophe Fouquet** (CEO)\nStarting first with EUV, we expect revenues to be up significantly this year as a result of the dynamics in both advanced logic and DRAM. In non-EUV, we expect revenues for 2026 to be similar to last year's, as our advanced logic and memory customer expand capacity. As part of the outlook for non-EUV, we expect the China region share in our total net sale in 2026 to be in line with our current system backlog, which is around 20%. We also expect our metrology and inspection businesses to grow significantly as customers increasingly invest in enhancing their process control strategy. For installed base management, we expect another year of revenue growth. This is primarily the result of increasing service revenue from our growing installed base of EUV systems and of our customer plans for performance upgrades to support their rapidly increasing capacity requirements.\n\n**Christophe Fouquet** (CEO)\nTurning to technology, in EUV, we continue to make progress, driving down the cost of technology on our customers' most advanced processes. We ramped our NXE:3800E for 2025, and its productivity gains support further replacement of complex multi-patterning with single expose EUV for multiple layers on current and future DRAM. We also expect both immersion and EUV litho intensity to increase as customers migrate from 6F² technology to 4F² architectures. With regard to High NA, our customers are reporting good progress on their qualification of the technology for logic and DRAM applications in their R&D facilities. Intel announced last month the qualification and acceptance of their EXE:5200B system, which will be used in high-volume manufacturing for their leading-edge nodes.\n\n**Christophe Fouquet** (CEO)\nWe expect more systems to be released to our customer in 2026, supporting their preparation for the insertion of High NA in high-volume manufacturing. With the continuing increase of 3D structure in advanced logic and memory, we see more adoption of our multi-beam e-beam inspection system to detect optically non-visible yield-limiting defects. Our progress on system maturity and productivity supports further use of this multi-beam system in high-volume manufacturing on the most advanced nodes. In summary, our product portfolio roadmap remains focused on supporting the roadmap requirements of our customers and driving our overall competitiveness. We look forward to sharing more performance data at the SPIE Advanced Lithography Conference in February. Looking longer term, the last few months have confirmed the positive impact of AI on customer demand for our advanced product, and especially for our EUV system.\n\n**Christophe Fouquet** (CEO)\nAs we shared during our Capital Markets Day in November 2024, we see the end market dynamics supporting a shift in product mix towards more demand for our advanced lithography products and an increase in litho intensity. The combination of our strong productivity roadmap on Low NA and the introduction of High NA supports further cost of technology reduction. It also supports the conversion of more multi-patterning DUV to single DUV exposure, especially on advanced DRAM nodes. In line with what we shared at the 2024 Capital Markets Day, we expect a 2025 revenue opportunity between EUR 44 billion and EUR 60 billion, with an expected gross margin between 56% and 60%. With that, we will be happy to take your question.\n\n**Jim Kavanagh** (Head of Investor Relations)\nThank you, Roger, and thank you, Christophe. Now, the operator will instruct everyone momentarily on the protocol for the Q&A session. Beforehand, I would like to ask that you kindly limit yourself to one question with one short follow-up, if necessary. This will allow us to get through as many callers as possible. Now, operator, could we have your final instruction and then the first question, please?\n\n**Operator**\nThank you. As a reminder, to ask a question, you need to press star one one on your telephone and wait for your name to be announced. To withdraw your question, please press star one one again. We are now going to proceed with our first question. Our first questions come from C.J. Muse from Cantor Fitzgerald. Please ask your question.\n\n**C.J. Muse** (Senior Managing Director)\nYeah, good afternoon. Good morning, thank you for taking the question. So I guess first question, trying to better understand your outlook for calendar 2026. Based on your EUV bookings, it looks like you're entering the year with about 114 Low-NA tools, and your implied guide is about 56, you know, give or take, Low-NA. Is this a function of lack of certainty around the precise timing of cleanroom space adds? Are you facing challenges in sourcing lenses from Carl Zeiss? Are you seeing extension of lead times? Would love to hear your thoughts around those moving parts.\n\n**Christophe Fouquet** (CEO)\nYeah, C.J., good morning to you. Indeed, I think it's a number of the things that just call out, right? So obviously we are, we are ramping, during the, during the year to accommodate the demand is there. But the demand is also a little bit, dependent on the progress that our customers are making in terms of the completion of their, of their fabs, during the, during the year. So that's an important element in, in the bandwidth, if you like, of the, of the guidance that we, that we provide. So to a large extent, it's driven by that. It's driven by our ability to execute and, you know, to continuously ramp, or, or move rate, you know, quarter on, quarter on quarter.\n\n**Christophe Fouquet** (CEO)\nThose, I would say, are the most important drivers of the corridor that you just alluded to.\n\n**C.J. Muse** (Senior Managing Director)\nGreat, thanks. And as a follow-up, I guess on the High-NA side, you know, is there any change in terms of your vision for revenuing 4-7 tools in calendar 2026? And then, more importantly, how are you thinking about adoption? Do you think there's an opportunity for follow-on High-NA orders in the second half? And could we be surprised by seeing DRAM adopt sooner than Logic? Thanks so much.\n\n**Christophe Fouquet** (CEO)\nWell, I think there's no major changes compared to what we discussed last quarter, C.J. So- ... I think that in term of adoption, I mentioned it, we continue to see good progress at both DRAM and logic customer. I think some of our customer are even starting to play with the limited product wafer to see the performance of the tool, which is a good news. We still expect, you know, a lot of those qualification data collection to last most of the year, which means that when it comes to decision for insertion new order, we indeed look at the second half of this year, 2027. On the question, you know, if it's going to be DRAM or logic first, I think, well, it, it's a bit of a neck-to-neck race right now, so hard to say.\n\n**Christophe Fouquet** (CEO)\nWe see really good progress on both and the appetite to test the technology, I would say, in the coming months, sorry, on the product, again, in both DRAM and logic customer.\n\n**C.J. Muse** (Senior Managing Director)\nThank you.\n\n**Roger Dassen** (CFO)\nMaybe a final comment to C.J., 'cause you referenced, I think, 114 tools in the backlog, if I-\n\n**Christophe Fouquet** (CEO)\nYeah\n\n**Roger Dassen** (CFO)\nIf I quote you correctly on EUV. I would tell you, I think that's a little bit on the high end. At EUR 25.5 billion of total value of EUV. I think, and that obviously includes also High NA. You might be a little bit on the high end of your unit number there.\n\n**Operator**\nWe are now going to proceed with our next question. The next questions come from the line of Joe Quatrochi from Wells Fargo. Please ask your question.\n\n**Joe Quatrochi** (Analyst)\nYeah, thanks for taking the questions. I guess I wanted to just go back to the 2026 kind of revenue growth guidance. If I look at the range, you know, between 4% and 19% growth, what type of those variables, I guess, are ASML controlled versus your customers controlled?\n\n**Roger Dassen** (CFO)\nJoe, I think I just said it, right? I mean, it's obviously to a very large extent driven by the progress that our customers are making in completing the fabs and their ability to take in the tools. So that's a significant one in terms of, you know, whether the demand falls in 2026 or whether it falls a little bit beyond 2026. And then, of course, there is our ability to execute. But it all starts with the ability of our customers to get the fabs in order and the capitals in order in due time. So it's a bit of a combination of both, I would argue.\n\n**Joe Quatrochi** (Analyst)\nOkay. So, I guess just, yeah, maybe as a follow-up, just can you remind us, just how do we think about the manufacturing capacity capabilities in terms of just, like, the number of Low NA EUV tools? I know you've had some targets out there, you know, from some analyst days previously, but maybe just an update there.\n\n**Roger Dassen** (CFO)\nYeah, Joe, so what we've done, and this is the way we talked about it in the past, we have put in, you know, infrastructure as such that we can respond, let's say, within a 12-month or a little over that to demand. So that means that what we call the long lead time items, anything that takes, you know, a lot longer than, let's say, 12 to 18 months, that is in place. So we have our cleanroom in place, we have the equipment in place, et cetera, et cetera. So now what we're doing, you know, based on the stronger demand signals as we've gotten them in the past couple of months, now we're ramping up our capacity.\n\n**Roger Dassen** (CFO)\nNow, you will appreciate, you won't move from 44 EUV tools in one year to, I'm just throwing it out, 80 tools in the year thereafter, right? So obviously, that's a gradual process, and that's a process that we're doing. So you will see an increase in our move rate quarter on quarter. So getting the people in, training the people, et cetera, et cetera. And then that way, quarter on quarter, you will see an increase in the move rate, and we will do that hand-in-hand with our supply chain. So you will see the move rate increase during 2026, and in all likelihood, what we're seeing today is sustainable. You will continue to see that also beyond 2026.\n\n**Joe Quatrochi** (Analyst)\nThank you.\n\n**Roger Dassen** (CFO)\nYou're welcome.\n\n**Operator**\nWe will now take our next question. The questions come from the line of Andrew Gardiner from Citi. Please ask your question.\n\n**Andrew Gardiner** (Managing Director and Senior Equity Analyst)\nThanks very much. Good afternoon, everybody. Christophe, Roger, you've spoken today about the customer's medium-term plans being revised up. I mean, we can see that too in their public statements around revenue growth and CapEx for the coming years, in particular from your biggest customer, TSMC, who said CapEx will be significantly higher for the next few years. I mean, some of that's quite clearly reflected in the record order intake that you just reported, but also quite clearly, not all of it. I'm just wondering, in terms of the plans you just outlined, Roger, in terms of increasing that move rate over the coming quarters, how much more visibility are the customers providing you in terms of the equipment needs for next year and the year after?\n\n**Christophe Fouquet** (CEO)\nI mean, no one wants to be the bottleneck in the kind of, you know, growth that we're seeing in this industry, and I presume that goes for you guys as well, and you must be having those conversations with the customers. So can you give us any insight as to how that visibility is improving into next year and the year after?\n\n**Roger Dassen** (CFO)\nI, I think the public commentary of, of customers on, you know, the sustainability of the, particularly the AI-related demand that they see on advanced logic and on memory, I think they, they also share that in the conversations with us. And of course, that also translates into, indications that they provide to us, either for very concrete orders or what we call from demand, so their indication of how they see, the demand, develop. You know, I, I think the order intake in Q4, I think, is strong evidence of that conversation and that it's not just a conversation, but that they're actually also, you know, putting, putting evidence and money, into, into that...\n\n**Roger Dassen** (CFO)\nBut they're also talking, you know, beyond this year, about what their expectations are, I would say, in particular for 27. So our move rate plans that we have also takes that element into consideration. So what they tell us, I think, directionally is very much in line with what they say publicly, but of course, they also, you know, give us a strong indication of how they see their demand develop year on year.\n\n**Christophe Fouquet** (CEO)\nAnd maybe the one thing I add to that, Andrew, I think you have to be aware that so you have seen indeed our customer moving, being far more vocal about their capacity planning. I think this has been also the results of many, many discussions with their customers, which are also providing, I would say, this midterm demand. So what we have seen really in the last three months in the alignment between the different parties that, you know, on the midterm, as Roger explained, we see basically a strong buildup of demand. And we have got many, many proof of that also in the last few weeks coming out of either logic or DRAM customers.\n\n**Christophe Fouquet** (CEO)\nSo I think it took a bit of while to really get to that point, but we really see that happening very strongly in the last few weeks. And I think this is aligned across a large part of the ecosystem.\n\n**Andrew Gardiner** (Managing Director and Senior Equity Analyst)\nThanks very much.\n\n**Operator**\nWe are now going to proceed with our next question. The question comes from the line of Alexander Duval from Goldman Sachs. Please ask your question.\n\n**Alexander Duval** (Analyst)\nYes, thank you very much, indeed, for the question. Firstly, on 2026, I wanted to just go back to assumptions for the top end of your sales guidance. I was curious to what extent that would assume that China is meaningfully down. And then going back to the discussion about long-term capacity, you've obviously talked about customers being more confident on midterm demand and the longer-term situation. I think in the capacity planning you've done in the past, you talked about 80-90 EUV tools, but if we think very much towards the 2030 timeframe, the kind of plans that the customers are talking about would imply something bigger than that.\n\n**Alexander Duval** (Analyst)\nSo what kind of lead time would be required for you to push beyond that kind of outcome? And would there be other means through which you could deliver the capacity needed, for example, making your tools more productive by investing in R&D? Thanks very much.\n\n**Roger Dassen** (CFO)\nSo when it comes to the top end of the expectation, you know, when we talk about China being at 20% of sales, I would argue that's across the entire range, right? So which obviously means that if we're talking about EUR 39 billion, you're looking at approximately EUR 8 billion of China. So I would say that probably our expectation on China probably moves with that. If you look at what are the key expectations on the upside of that?\n\n**Roger Dassen** (CFO)\nWell, A, as we just said, it means that our customers indeed, you know, are able to take our tools, that we're able to execute on as we currently plan, and probably also that the installed base business is running on all cylinders, particularly on upgrades. Which is not illogical, because upgrades obviously are in very high demand right now, because it's the easiest, fastest, and most effective way for customers to get additional capacity, which in the current market is obviously very, very important to them. So those would be the key elements that I would say that would drive that. And, you know, in that model, you could also envisage a China market at 20% of that total sales number.\n\n**Roger Dassen** (CFO)\nWhen you talk about the long-term demand, let me make a few comments, and then, Christophe, maybe you can weigh in. First, you should not forget that when we get to the 2030 timeframe, obviously at that stage, yes, we're looking at low NA, but we're also definitely looking at high NA. And, the low NA tools that we would be providing at that point in time would of course be low NA tools with, again, a higher throughput than what we have today. So back to your question on R&D, absolutely.\n\n**Roger Dassen** (CFO)\nYou know, we will continue to push the roadmap on our Low NA tools and continue to drive capacity such that per tool, you know, the customers get more productivity than what they get today. But also, at that stage, we expect, you know, a more meaningful number of High NA tools that would provide significant additional output capacity. And in that combination, you know, I think the numbers that you were just throwing out, I think will provide, you know, output capability to customers way ahead of the numbers that we're talking about today.\n\n**Christophe Fouquet** (CEO)\nYes, I think Roger said it all. I think the way I would summarize it is that we have, I would say, the flexibility to react to the development of the market. I think we talked about, you know, mid short term already. I think it's also true on the long term. And yeah, Roger is right. The contribution of High NA, the work we continue to do on productivity, we already planned for that, will give us even additional flexibility. So with the step we have done on our capability on EUV, DUV in the last few years, which you remember, we did execute despite the fact that maybe the demand was a bit lower at some point, we have created basically the right flexibility to see the market coming.\n\n**Alexander Duval** (Analyst)\nThanks very much.\n\n**Operator**\nWe are now going to proceed with our next question. The question comes from the line of Krish Sankar from TD Cowen. Please ask your question.\n\n**Krish Sankar** (Managing Director and Senior Equity Analyst)\n... So hi, thanks for taking my question. I have two of them. First one, Roger, for there to reconcile your bookings between EUV and memory, typically memory has been 30% of the EUV mix, so it looks like a big jump in the memory orders last quarter was driven by DUV. Is that fair? And then on EUV for memory, for the 1C node DDR5, are we talking about 7-8 EUV exposures or lower than that? And then I had a follow-up.\n\n**Roger Dassen** (CFO)\nLet me take the first one, and Christophe can take the second one. No, I think the order intake, you know, for memory is strong, but not just the DUV, also EUV. And in all likelihood, if we look at the composition of our sales in 2026, you will see a major memory play in there. So the demand in 2026 is far more balanced in terms of logic, logic versus memory than it was in 2025. So that's what you see. But this is not just DUV, this is definitely also EUV.\n\n**Christophe Fouquet** (CEO)\nYeah, and I think on the, on EUV, I think when it comes to DRAM, I think we are going to benefit both from, of course, the demand for capacity, which we already discussed, is very strong, you know, this year, most probably beyond that. And, you know, we have been talking about the number of EUV layers increasing on DRAM. This has been one of our focus. We have seen that happening in 2025. We continue to see that happening and mentioned it in the introduction, on 6F², but also on 4F². And this is a bit, what I would call the perfect storm, because when it comes to EUV, as a result, DRAM share most probably will increase over time.\n\n**Christophe Fouquet** (CEO)\nSo this, this is a very good dynamic on the, on DRAM, which again, based on all the work we do with our customer discussion we have, we don't see stopping. So there's still, some leeway for more EUV layers, for more litho intensity on, on DRAM for sure, and we should benefit from that in the, in the years to come.\n\n**Krish Sankar** (Managing Director and Senior Equity Analyst)\nGot it. Got it. And there's a quick follow-up. Sorry to get back to this manufacturing capacity. Is it fair to assume your EUV manufacturing capacity is around maybe 70 units? And does that potentially constrain your growth next year? The reason I'm asking is that is your manufacturing capacity limit causing movement of tools between this year and next year, leading to a wide range of revenue guides for 2026?\n\n**Roger Dassen** (CFO)\nYeah, Chris, as I said, our capacity is very dynamic because you can't-- we cannot move from one point to the other just like that in one quarter, right? So that's why I said, you know, we had 44 units, revenue units of EUV Low NA last year. You cannot go from one quarter to the other, even from one year to the other, from 44 to 80. So we will crank it up. Every quarter, you will see us increase ramp rate, you will see us increase capacity. And, you know, if the demand signals remain as strong as they are, that will continue into 2027 as well.\n\n**Roger Dassen** (CFO)\nThen I would say 70 would not be the limit that I would currently be looking at. I think that, that-\n\n**Krish Sankar** (Managing Director and Senior Equity Analyst)\nI look at-\n\n**Roger Dassen** (CFO)\nThat is higher.\n\n**Operator**\nWe are now going to proceed with our next question. The question comes from the line of Mehdi Hosseini from Susquehanna Financial Group. Please ask your question.\n\n**Mehdi Hosseini** (Senior Equity Research Analyst)\nYes, thanks for taking my question. My first one has to do with just the capacity that, Roger, you just highlighted. I want a better understanding in EUV capacity, and the topic has been around since 2021, when last time we had the shortages. I want to better understand what are the key factors. As you ramp the EUV capacity, is that gonna impact the booking trend? In other words, are your customers actually waiting to have a conviction of you adding committed capacity before they commit to booking or backlog that would be shippable in 2027 and beyond? And I have a follow-up.\n\n**Roger Dassen** (CFO)\nNo, I don't think, Mehdi, that's what is going on. Customers know what we're doing. We share pretty openly with customers, you know, how we're looking at our ability to increase. I think customers appreciate that we build in far more flexibility into our model than what we had before. If anything, you know, if customers start to smell that for a certain year, you might be supply constrained, actually the dynamic is the other way around. They wanna make sure that they get their booking in before they are too late, right?\n\n**Roger Dassen** (CFO)\nSo, as a matter of fact, I would say if they believe that the capacity might become a choke point, then they will jump to put in the order. So I think it's more that than that they are waiting for a definitive confirmation that the capacity is there. But we're very openly share with them what our plans are, and again, they appreciate the flexibility that we've built in and the significant reduction of response time that we have created as a result of creating the long lead time items.\n\n**Mehdi Hosseini** (Senior Equity Research Analyst)\nOkay, great. Thanks for clarification. I want to go back to the comments, and the transcript that was posted with the earnings report. There was a comment that some of the booking would be shippable in 2027. So the question that I have is: What would it take for you to hit the high end of revenue guide for this year? Is that the China? I'm assuming that China book backlog has a shorter lifetime, and to that extent, is that the China that is going to impact your ability to hit the high end of your revenue guide range?\n\n**Roger Dassen** (CFO)\nMehdi, I think I said it. I think first and foremost, it's the readiness of our customers to take tools. I think that is number one. So their ability to complete fab construction, put the pedestals in, and take our tools. I think that's constraint number one. Constraint number two, our ability to execute. So I just talked about what we're doing to increase the ramp. We're comfortable with that. But of course, you know, everyone needs to sing from the same song sheet, not just us, but also the supply chain. So we gotta make sure that everyone is tuned in to the same ramp that we have on pace. So that would be the second one, so that would be more of a supply factor.\n\n**Roger Dassen** (CFO)\nOn the demand side, I think it's the demand for upgrades, and I gave some color on that earlier on. As I mentioned on China, I think in our guidance, China is 20% of revenue, so China would breathe along with the corridor that we have given.\n\n**Mehdi Hosseini** (Senior Equity Research Analyst)\nThank you. Thank you.\n\n**Roger Dassen** (CFO)\nYou're welcome.\n\n**Operator**\nWe are now going to proceed with our next question. The questions come from the line of Didier Scemama from Bank of America. Please ask your question.\n\n**Didier Scemama** (Managing Director and Senior analyst)\nThank you. Good afternoon, gentlemen. I'm just asking about 4F² and the DRAM really. So I think, Christophe, you mentioned in your press release that you see new interaction with your own customers, that in fact, the EUV layer count could go up with 4F². So I'm just wondering, you know, obviously, there is a school of thought in the market that 4F² would lead to a cliff in EUV demand from DRAM customers whenever we see 4F² introduction, say, 2028. So is that a risk that you think is significantly diminishing because, you know, obviously, the view is reuse of tool capacity?\n\n**Didier Scemama** (Managing Director and Senior analyst)\nOr do you think that now as the NVIDIA account goes up and, you know, there is also a view that now wafer capacity in DRAM is gonna have to expand dramatically over the course of the next five years because of AGI and, you know, more complex LLMs, that effectively this, this risk of a cliff and significant reuse of EUV tools is, is effectively, really diminishing dramatically? I've got a follow-up as well. Thank you.\n\n**Roger Dassen** (CFO)\nYeah, I'll try to answer on the point. So I think the first thing to say is, if you look at 4F², the structure requires a more advanced litho mask. So that's the first thing. So you get basically to look at a more complex structure, and that structure is going to require more lithography. This is why we mentioned that both, in fact, the immersion and EUV will go up. Now, you talk about cliff a lot. Customer don't like cliff. Cliff are very bad for operation.\n\n**Roger Dassen** (CFO)\nWhat customer like is optimized technology over several nodes, and therefore, when we talk about EUV insertion with our customer, of course, the transition to 4F² is taken into account, because no one wants to buy a lot of tools and be stuck with them. So cliffy is never good for customer when it comes to operation. And what you see happening with DRAM is that EUV basically has become a very handy tool to simplify processes, to simplify the number of step, to simplify cycle time, to reduce cycle time, sorry, and even to bring more capacity, because if you have less mask, if you have less multi-patterning, you end up basically with more space in your fab.\n\n**Roger Dassen** (CFO)\nSo EUV, I would say that the more DRAM customer use it, the more they like it, because they get benefit on all those counts. And again, they want to include the cliff. So when we made the statement in our release, basically it's really out of many discussions with customer. And I think that... Well, I don't know if the risk is going down. We never thought that the risk was pretty high, but I think we're very confident that, again, litho intensity will grow with 4F², both on Deep UV and EUV. And as I said before, we see EUV number of layers continuing to grow, both before and after this transition.\n\n**Didier Scemama** (Managing Director and Senior analyst)\nVery clear. Thank you. So my follow-up is on the gross margin side. So I think perhaps one element of these appointments in the guide is the gross margin. And I think you mentioned, you know, the mix of EUV Low-NA. Obviously, you know, immersion probably gonna decline because of China, and then also the, let's say, the upgrades business and the sort of milestone payments that might not be as strong in 2026. I'm just wondering, if you look into 2027, do you think that your mix of Low-NA EUV will sort of revert back to, you know, what you had said before, which is the majority will be 3800E? Or is there any reason why, you know, 3nm capacity expansion will continue to grow into 2027?\n\n**Didier Scemama** (Managing Director and Senior analyst)\nI guess the immersion question on China is anyone's guess, but if you want to hazard into an answer, I'm very happy to hear it.\n\n**Roger Dassen** (CFO)\nDidier, on the mix for EUV, you know, customers liked our 3800 so much that they took as much as they could get in terms of 3800s rather than 3600s in 2025. But of course, you know, we had a number of 3600s that still needed to be completed, that we had all the parts for, and those will be shipped, in all likelihood, in 2026. So the 2027 mix in terms of EUV should be substantially better. And also at that point in time, we're probably looking at the next generation. So the EUV mix by 2027 should be better than 2026.\n\n**Roger Dassen** (CFO)\nYou're right, that is an important element, because if you look at how we plan towards the 56%-60% gross margin in 2030, it's pretty clear that new generations of low-NA EUV are critical in that regard. That the EUV mix in 2027 will be better than it is in 2026. Another mix effect that is in there, indeed, is on the DUV side, so quite a bit more dry rather than immersion. I would say in all likelihood, that is less a matter of demand, but it's supply, right?\n\n**Roger Dassen** (CFO)\nSo on the supply side, we are constrained in terms of immersion for 2026.\n\n**Didier Scemama** (Managing Director and Senior analyst)\nAh.\n\n**Roger Dassen** (CFO)\nSo it's in that result that that's you know with higher DUV business and restrictions on the immersion side that gives you a less favorable DUV mix that goes into the equation. And then an important swing factor 'cause you know you still have a 2% bandwidth in the gross margin. An important element of the swing factor will be installed base and will be upgrade business. That gives you the moving parts DJ.\n\n**Didier Scemama** (Managing Director and Senior analyst)\nNo, that's great. By the way, did you want to say what you think will be the rev rec on High NA in 2026?\n\n**Roger Dassen** (CFO)\nRev, rev rec on High NA.\n\n**Didier Scemama** (Managing Director and Senior analyst)\nWhat?\n\n**Roger Dassen** (CFO)\nThe amount of High NA units this year.\n\n**Didier Scemama** (Managing Director and Senior analyst)\nRight.\n\n**Roger Dassen** (CFO)\nOkay. Okay. Yeah. Probably a bit more than we had this year, but don't want to go into too much detail there.\n\n**Didier Scemama** (Managing Director and Senior analyst)\nOkay, fair enough. Thank you.\n\n**Operator**\nThank you. We are now going to proceed with our next question. The question comes from the line of François Bouvignies from UBS. Please ask your question.\n\n**François Bouvignies** (Research Analyst)\nThanks a lot. I have one for Christophe and one for Roger. I mean, the first one maybe is for Christophe on the High NA. I just wanted to, you know, get in more details in here. I mean, we see the industry moving into a rush in terms of capacity, both at TSMC and advanced logic, I should say, and the memory overall. I was wondering if you have a rush in this capacity, could that delay the High NA adoption? You know, do you see some risk happening of delay of High NA adoption because the industry is simply too busy to add capacity, that they don't want to add another risk in terms of transition? So I was just wondering if it's something that that's possible.\n\n**Roger Dassen** (CFO)\nWell, you know, I think from day one, I've been talking about three phases of High NA adoption with R&D qualification for high volume manufacturing, then insertion and high volume manufacturing with, you know, limited amount of layer and then the whole thing. And I would say that that plan always provide basically the time to have a real qualification. So, you know, the acceleration you see today on capacity, of course, is on existing nodes that are ramping with known technology, and those nodes will call for the use of the existing product we ship today. So that's Low NA, that's DUV, that's, you know, metrology inspection as we know it today.\n\n**Roger Dassen** (CFO)\nThe preparation of High NA for the next node is such that it does leave the time, if customer want to use it, to insert it properly. So sometimes, you know, maybe some of you could believe that 1, 2, 3 phase is a bit long, but this is, on the other end, the way to secure the insertion on the node, because once a decision is made to use it on the node, they really want to use it. They prepare the mask for it, they qualify the whole process with it. So it's very difficult to change your mind and say, \"Hey, I'm going to go back to the whole stuff.\" So I think customer try to do those things in such a way that they are not too sensitive to either a major acceleration or slowdown of their capacity.\n\n**Roger Dassen** (CFO)\nIt's a longer answer to say no, basically. We don't see a risk there.\n\n**François Bouvignies** (Research Analyst)\nPerfect. Thank you. And maybe, Roger, your question—my question is for 2026. I mean, if China is 20% of revenues, if we take the midpoint, it would imply China is down, what? 20%-25% year-on-year, which is mainly in DUV. And you guided DUV flat for 2026, which means non-China DUV needs to go up by 40% for 0% year-on-year, kind of, to get the flat DUV. And I remember, you know, last year, I guess it's kind of a déjà vu, where last year you said there is a strong correlation between the non-China DUV and EUV growth. But when I look at 2025, your non-China DUV was actually not growing much compared to EUV. You had a big disconnect between the two.\n\n**François Bouvignies** (Research Analyst)\nI was wondering if there was a catch-up, you know, somehow from 2025 to 2026, or just trying to understand why this year you would see this strong growth happening and we didn't see that in 2025.\n\n**Roger Dassen** (CFO)\nYeah, François, that's a really good question, and indeed, this is what we observed. So 2024 was strong. Also on the non-China business, 2024 was pretty strong, also in the dry business for customers across the board. 2025 disappointed a bit. If we look at 2026, we see the market come back with all our leading customers. Frankly, I think many of our customers are doing what we do, which is you put in the long lead time items, which in our case is more the EUV stuff, and you take a bit more flexibility in your shorter lead time items, which is the DUV business.\n\n**Roger Dassen** (CFO)\nI think that's what they've done for a significant part of the year. We actually could see the non-China DUV business come back in the last months of the year. And we frankly see that trajectory continue into 2026. So you're right in that we found the 2025 non-China DUV business disappointing. That is clearly the case. But we do see a you know a reversal of that trend in the last months of the year, and see that reversal continue into 2026.\n\n**François Bouvignies** (Research Analyst)\nGreat. Thank you very much, Christophe.\n\n**Operator**\nThank you. We are now going to proceed with our next question. The question comes from the line of Chris Caso from Wolfe Research. Please ask your question.\n\n**Chris Caso** (Managing Director and Senior Equity Analyst)\nYes, thank you. Good morning. My question is with regard to the expected timing of deliveries within the backlog, and you mentioned a few things in your earlier comments, you know, including, you know, customers recognizing that capacity may be tight, availability of customer cleanroom space. I'm not sure you wish to quantify, you know, how much of the backlog is expected to ship in 2026. But would you say that the timing of those expected deliveries is stretching out, you know, as compared to, you know, what's happened over the past few quarters?\n\n**Roger Dassen** (CFO)\nOur expectation is, Chris, that the second half will be stronger than the first half, but I would say that that's a function of what I just said, which is, A, the availability of fab space of our customers, and B, our continuous quarter-on-quarter ramp of our move rate. So as a result, that we expected to, for the second half to be stronger than the first half of this year. That's the way we currently model our shipments in, you know, in discussion with the customers. But clearly, you know, quite a bit of the order intake that we had in Q4, and clearly, you know, part of the backlog is for 2027. That is pretty clear.\n\n**Roger Dassen** (CFO)\nIt is 2027, right? So the majority, the lion's share of the orders that came in in Q4, some of it is 2026, but the lion's share really is for 2027.\n\n**Chris Caso** (Managing Director and Senior Equity Analyst)\nThank you. My follow-up question is with regard to gross margins, and you spoke about that a bit, but perhaps you could clarify, you know, what are the headwinds and tailwinds with respect to gross margin for this year? You know, I presume that the China is one factor, but you know, what are the factors that cause you to be on the upper ends or lower ends of gross margins as you go through the year?\n\n**Roger Dassen** (CFO)\nI wouldn't say it's China per se. I would say, I would say it's immersion, right? So immersion is a significant contributor to the gross margin. As I mentioned before, we do expect the immersion sales this year to be below 2025, which is not the result of demand, but it's the result of supply constraints on the immersion side. So that is a bit of a drag. Then you see quite a bit of dry sales. As we said, we also expect the dry sales, which was fairly low in 2025. We already saw that reverse itself in the last months of the year, and we see that reversal continue into this year.\n\n**Roger Dassen** (CFO)\nBut dry tools come with lower gross margins, so that's a drag on the gross margin. On the EUV side, there is a bit of a mix effect, because we have, you know, 3600s in the year that we didn't have that much in 2025. And then, you know, if we have a bit more High NA, then of course, that also comes with a slightly depressing effect on the gross margin. So that's all the negatives. In terms of all the positives, I would say, you know, higher EUV numbers, right?\n\n**Roger Dassen** (CFO)\nSo we're clearly looking at a significant step up in the number of EUV tools this year, and that is margin accretive. So that's on the positive side. And as I mentioned, the big swing factor as I look at it today is on installed base. And to the extent that the installed base will manifest itself in a positive way, high demand for upgrades, which, you know, at least theoretically, you could assume to be the case this year, with all the appetite for capacity additions that our customers have, that should be helpful on the gross margin. So those are all the puts and takes, as I could see it, for the gross margin this year, Chris.\n\n**Chris Caso** (Managing Director and Senior Equity Analyst)\nHelpful. Thank you.\n\n**Roger Dassen** (CFO)\nYou're welcome.\n\n**Operator**\nWe are now going to proceed with our next question. The question comes from the line of Tammy Qiu from Berenberg. Please ask your question.\n\n**Tammy Qiu** (Analyst)\nHi, thank you for taking my question. So the first one is on, logic roadmap. So over the next few years, we do have A16, A14, A14T, and A10. Can you confirm that for every single generation, are we still going to have EUV insertion of couple of layers, or some of the customers are really trying to minimize the, incremental EUV layers, please?\n\n**Roger Dassen** (CFO)\nWell, so let me try to answer that. So I think, if you look at, you know, the midterm, so we talked about 2nm. Indeed, we're going to go to A16, which is very similar to 2nm, to be honest. This is not a big difference, so I will skip that. We see then, basically, EUV layers increasing again at A14. As we discussed in the past, you know, most probably 10%-20%. We see that being even more true for A10, where the structure change could call for even more EUV layers. So that's a bit the view we have, all the way to A10.\n\n**Roger Dassen** (CFO)\nIn the discussion with our foundry customer, again, there's a lot of focus on that, because this is key in enabling their future technology. So that's a bit what we see today on the foundries.\n\n**Tammy Qiu** (Analyst)\n... Okay, thank you. And, I have a follow-up also on capacity issue. So I remember that back in 2021, you were very clear about, you will do 90 EUV tools, and that is a capacity we need. Then, of course, you know, the unfortunate 2022 happened, so we took a pause of that. And it sounds like today, your capacity addition plan has been more cautious than you were previously. Is there is any reason for that, or it just basically after 2022, it's better to take a cautious approach from a capacity perspective?\n\n**Roger Dassen** (CFO)\nI think I tried to explain, but I guess I didn't completely succeed in that. So what I said is what we did in the earlier years of this decade is to put in what we call the long lead time items, which means that's, you know, anything that takes more than, let's say, 12 to 18 months to get done, we did, right? So we build additional factory, we put in equipment, et cetera, et cetera. So we built cleanrooms. So all of the things that take time, we did. So that's good news, so that gives you more flexibility. But as I mentioned before, you cannot from one year to the other, move from a move rate, an annual move rate of 44 to 80 in one year time.\n\n**Roger Dassen** (CFO)\nSimply doesn't work, because you need to take in people, you need to hire people, you need to train those people, and you cannot double that in one year's time. That needs to be a gradual approach. So this is the process that we're in right now, because we also took a decision back in 2022, 2023. We're not gonna put in people for an output of 90, because that would make no sense. They would have nothing to do, and it would be very, very costly. So we're gradually moving our move rate up. So does our supply chain, same story there. They're also gradually, quarter on quarter, moving up their move rate.\n\n**Roger Dassen** (CFO)\nIn that way, you know, we will very meaningfully increase our capacity over what we had in last year. So that's what we're doing. So we have the structural big investments to get to 90, and now we're gradually moving our move rate up in order to move our integral capacity to cater to the demand. We think that our increase in capacity goes nicely hand in hand with the completion of fabs by our customers, such that we will not be the limiting factor in them being able to increase their capacity.\n\n**Christophe Fouquet** (CEO)\nYeah, maybe to add to that, to second Roger on that. So I think what we said, you know, back to 2026, so we said that the major factor, in fact, on tool delivery would be the execution of our customer, because you have to realize that a lot of decision have been done in the last few months, and this also means that they are extremely active in putting capacity in place, et cetera, et cetera. And, you know, in 2026, as Roger said, we can nicely follow basically right now their own ambition, which is good.\n\n**Christophe Fouquet** (CEO)\nWhen it comes to beyond 2026, as you know, the lead time on our EUV machine is at least 12 months, which means that as we speak, we are capable to have that discussion with our customer, looking at next year, basically. And as we do that, we can adjust basically our planning exactly in the way Roger mentioned it. But so far, you know, if you look at the short midterm, we are capable to nicely follow basically what our customer are asking for. So I think I sense a bit some concern that we may be the bottleneck basically for our customer. This is not the case. Certainly not this year. And again, for next year, we have plenty of time to continue to follow basically their demand.\n\n**Christophe Fouquet** (CEO)\nSo I just want to make that clear. I think what Roger described is the process and the flexibility we have, thanks to the investment we have made on our indeed 90 capability for EUV, 600 for DUV to follow basically very carefully what our customer are going to need in the next few quarters.\n\n**Tammy Qiu** (Analyst)\nThank you.\n\n**Roger Dassen** (CFO)\nOkay. Unfortunately, we've run out of time, but if you were unable to get through on this call and still have questions, please feel free to contact the ASML Investor Relations department with your question. So now, on behalf of ASML, I would like to thank you for joining the call with us today. Operator, if you could formally conclude the call, I would very much appreciate it. Thank you.\n\n**Operator**\n2025 fourth quarter and full year financial results conference call. Thank you for participating. You may now disconnect.",
      "fetched_at": "2026-02-04T15:46:47.906Z"
    },
    {
      "ticker": "ASML",
      "title": "ASML Holding N.V. - New York Re (ASML) Q4 FY2025 earnings call transcript",
      "published_date": "Jan 28, 2026, 5:00 AM EST",
      "fiscal_year": "2025",
      "quarter": "Q4",
      "url": "https://finance.yahoo.com/quote/ASML/earnings/ASML-Q4-2025-earnings_call-398732.html",
      "content": "**Monique Mols** (Head of Media Relations)\nGood morning, everyone. Good afternoon, depending on where you are, maybe even good night. Welcome to the Q4 full year 2025 financial results press conference. You may not see that when you're dialing in online and you're watching us online, but we are actually in a different location than we were last year. Today, we host the press conference in our training center in the ASML Academy, and that is located at the Brainport Industries Campus in Eindhoven. This is actually the place where we plan our expansion in the Netherlands, so we thought it would be a good idea to invite, you know, everyone here in the room, to see what our new location is gonna look like.\n\n**Monique Mols** (Head of Media Relations)\nThere's nothing there to see yet, but this is where we are planning our expansion, and Christophe will talk more about that later in the presentation. My name is Monique Mols. I'm Head of Media Relations, so welcome to you all. I'm really happy to see that there are people in the room and people online. For those online, if you have a question later on, you can fill out the form on the website, and we will take your question from here. If you're in the room, my colleague, Mark, will walk around with a microphone and pick up your question. So this is our annual results. Forward-looking statements for those who like it. So again, we are here at the academy. We have several of those training centers all around the world.\n\n**Monique Mols** (Head of Media Relations)\nHere we have quite a big center, where on average, 400 employees come here every day to get a training. So they actually work on the machines that our customers have in their fabs. And every year, we have about 26,500 people coming here to train. So this is a very important location for us, and we're very happy that we can host a press conference here today. With that, I'm not the only one who's gonna talk to you today. Of course, I have our CEO, Christophe Fouquet, and our CFO, Roger Dassen, and they will talk you through the numbers, through the developments, and everything that's happening at ASML. So I would like to invite on stage Christophe Fouquet.\n\n**Christophe Fouquet** (CEO)\nThank you very much, Monique. So Roger will be the one doing the good numbers later on. As you have noticed, we finished the year very, very, very strong with a record quarter, record year, record booking, and this is basically a sign of the direction this industry is taking. We are very happy, of course, with the work the ASML team has done, being able to execute on such a big quarter in Q4, and also prepare us basically for 2026. So a lot of good news today, and again, Roger will get into the number. I'd like to say that, you know, we welcome also that clarification. You know, in the course of 2025, you have seen that sometimes the business was still a bit uncertain.\n\n**Christophe Fouquet** (CEO)\nThe last three months have really clarified, basically, at least, the horizon for 2026, and most probably a bit beyond that. So before we go into the numbers, I'd like to provide you some context about what's happening in the industry, what is driving basically this type of news today. And of course, the very first thing is AI. You have been hearing about AI already for a couple of years. You have heard major, major announcement about AI infrastructure. I think from the very beginning in ASML, we have been a believer that AI will be a big thing, and this is true because, as we said it before, any major application moving forward will not only use semiconductor, but it will also use AI. And I put a few example of those application on this slide.\n\n**Christophe Fouquet** (CEO)\nIt's pretty much everything you can think about when it comes to technology, when it comes to the future of society, this will all rely on AI. If you look at the opportunity, this has been said also before, this will drive basically advanced technology, advanced logic, advanced DRAM. This will also basically drive the entire data infrastructure. And the effect AI can have on the overall GDP is pretty big. In fact, if you look at the US, even in 2025, AI was accounting for a very large part of the growth, and we expect that basically to be applied to the entire worldwide GDP. So the opportunity is there.\n\n**Christophe Fouquet** (CEO)\nWhat was a bit, I would say, frustrating for us for a while is that where we heard all those news, we heard about all those investment, but, basically, this was not yet translating into capacity addition at our customer. And I think what the last three months have done is change that. We have seen our customer basically moving forward. They start to really believe in the sustainability of the AI demand. That's true for memory, that's true for logic, and as a result, they started to invest, they started to plan for capacity, and of course, this will drive demand for our product at ASML. And when you look at the demand for our product, what's interesting with AI is that this basically touch on all product. Of course, AI is going to require very advanced chips, and this is going to drive EUV, for example.\n\n**Christophe Fouquet** (CEO)\nSo this year will be a big year for EUV, Roger will talk about that. It's going to drive advanced inspection tool, but at the same time, AI needs a lot of data generation, a lot of sensor, and this will be still created by the use of more mature technology, such as DUV. So AI will have also this, effect, basically to really drive our entire product portfolio in the coming years. This is a bit of a summary of, what our customer have told us. I talked already about the fact that they are more confident that AI is here to last, and therefore they are going to invest. I think, in fact, for a lot of our customer, in 2026, capacity will mean, will mean market share, so we will see them very eager to get the capacity as quickly as possible.\n\n**Christophe Fouquet** (CEO)\nThere's a few more good news when it comes to AI. AI also drive very advanced technology. This drive an increased use of EUV, and one of the things we've been talking in 2025 quite a bit is the fact basically that we have seen the number of layers of EUV increasing basically at our key customer. And this means practically that the overall litho intensity is going up, which means basically more use of our advanced lithography tool. 2026, you know, we expect, as you understand, as the number will show, an improvement of the business, a significant growth, especially on the advanced tool, EUV. I said before, will be a big year, and again, on the midterm, we expect that to continue.\n\n**Christophe Fouquet** (CEO)\nLong-term, we stick basically to what we have told the market already several times, which is what we shared basically at our capital market day in November 2024. We still expect for 2030, revenue between EUR 44 billion and EUR 60 billion, with a gross margin of 56%-60%. Going a bit now to the effect of AI on the market. So this graph is showing a bit what AI will do, and what you see here basically is the growth of the different segments of the semiconductor. At the bottom, you see the historical growth of memory logic, which is about 6-7% year-on-year. 6-7% year-on-year is pretty great already. You know, there are many, many industries that will wish to see this kind of number.\n\n**Christophe Fouquet** (CEO)\nBut what you see with AI is that when we look at advanced logic, when we looked at advanced memory, the growth on those segment is going to be more than 20% year-on-year for the foreseeable future. And this is really what is going to drive basically more demand, on lithography. Why is that? So we've talked in the past a lot about Moore's Law, of course, and Moore's Law is a law that say that every couple of years, we need to double the number of transistor per chips. And that law has been true for many, many years for PC, for mobile application. Now, when you look at AI, and this started to happen in 2010, the curve is far more aggressive.\n\n**Christophe Fouquet** (CEO)\nWhen you look at the most advanced AI product today, NVIDIA product, for example, the request is not to grow 2 times every 2 years, but in the last few years, to grow 16 times every 2 years. So you see a major acceleration, basically, of the need for silicon. And of course, we provide that in two different ways. We provide that with scaling. You know, by making transistors smaller, we can put more transistors per chip, and this has been a good way, basically, to provide more transistors and follow Moore's Law for many, many years. But that's not enough anymore. And if you cannot put enough transistors per unit of area, per chip, then the only option will be to make more wafers. And that's a bit what we see happening with AI, so the most advanced AI applications are going to drive up volume.\n\n**Christophe Fouquet** (CEO)\nThis is why when we look at DRAM customer today, when we look at logic customer today, they are building mega fabs. Some of them are talking about hypercycle because they have to be able basically to also provide this volume to the market. So just to illustrate that, I pick one example, and I picked it from NVIDIA, because all of you are, of course, very much aware of what's happening there. Today, on the Blackwell system, you need about 2.5 wafers to create the product. If you look at 2027 on the Rubin product, this number will go up to 10 wafers. So to provide the same product to their customer, NVIDIA will need four times more wafer than today. And this is one of the reason why, again, we will see capacity extension driven again by this type of application.\n\n**Christophe Fouquet** (CEO)\nThat's what you see here, and this is, again, I would say, a bit of a new dynamic we have in our market. AI, by this acceleration of the need for performance of power reduction, is going to drive both volume and technology a lot harder than any technology before. So what does it mean for technology? EUV is key. 2026 is going to be a good year for EUV. We are looking at more shipments, and this, despite the fact that we've increased the productivity of our tool by more than 40%, so we're going to ship a lot of capacity of EUV this year.\n\n**Christophe Fouquet** (CEO)\nIf you look at it historically, we have already been adding quite a bit of capacity, so the capacity added of EUV in the last few years have been on average, 25% year-over-year growth, which is quite significant. So we have seen all our customer basically already adopting this. It was Logic first, then DRAM, but we expect basically to see that even more moving forward. Then we have High-NA, and High-NA, of course, is not going to be the tool that provide the capacity of EUV in 2026, 2027, but that's the tool that will enable our customer to shift to even more advanced technology around 2028, 2029.\n\n**Christophe Fouquet** (CEO)\nThat's important for DRAM, that's important for Logic, and it's important for AI, because as I said before, AI is going to be looking for more advanced chips with lower power consumption, and High-NA is going to play into that very strongly. So good progress on High-NA in the last few months. Our customer are still qualifying the tools. This takes a bit of time. The results are good. This year is going to be used to prepare a bit for insertion, and again, you know, if we look at 2027, 2028, we are going to see the first product being manufactured using some High-NA system. Deep UV remains very important. As I said, you know, it's not all about advanced semiconductor.\n\n**Christophe Fouquet** (CEO)\nAs you know, a lot of technology still require Deep UV, so we continue to drive the roadmap, both on immersion, where we have launched our 2150, which basically give us sub-nanometer accuracy and more than 300 wafer per hours. Productivity is important. Productivity is, of course, a way to get capacity, so we continue to drive that on immersion. I think the example of the NXT:870B, which is a KrF system, is even more spectacular because there we have been capable to achieve more than 400 wafer per hours, and that tool today is creating a lot of interest at our customer because productivity, again, is capacity. We talked also, last quarter about us starting to help our customer with what we call 3D integration.\n\n**Christophe Fouquet** (CEO)\nSo I told you, you know, when you cannot put all the transistor in one chips, you just make more chips and bring them together with 3D integration. We have our first system, the TWINSCAN XT:260, that was shipped last quarter. Lot of interest from our customer. For us, this is the first product looking at this new market opportunity, and we will continue to work with our customer basically to define more product moving forward to support them also on that segment. A few words on metrology and inspection. So we don't talk always about metrology inspection, but when you drive technology, yield become very, very important, and yield can be improved by doing more metrology and more inspection. So in 2025, we have seen our metrology inspection business going up by almost 30%, which is a major gross number.\n\n**Christophe Fouquet** (CEO)\nIt has to do with the need for more metrology inspection. It has to do also with the quality of our product in optical over metrology for overlay, but also in E-beam. And one of the product where we have seen quite some progress in 2025 is multibeam. Multibeam is going to provide E-beam inspection at higher speed, and most probably in the next, I would say, couple of years, really enable our customer to move this technology to high-volume manufacturing. So a lot of good progress there as well. You all heard about Mistral, I think, back in the end of the summer when we announced our collaboration, but also our investment in Mistral.\n\n**Christophe Fouquet** (CEO)\nThe rationale there was to get AI in ASML and to get the very best people, the very best competence in ASML, in order to be able to first strengthen our core competencies, read, putting AI in our product, support the connected market, so offer some of those capability to our customers, and also create new opportunity, basically, moving forward. That's a project we are going to talk more about in 2026, in 2027. We are making great progress with Mistral, our partner. Our teams are working very, very closely together to basically execute on each one of those points. Going a bit into some of the other things we are very, very proud of at ASML, this is our engagement in the community.\n\n**Christophe Fouquet** (CEO)\nWe have been spending, I would say, both the time, talent, money, in order to work together with the community on a few very important topics. The first one is mobility. While we are here today, as you know, this is also close to our next campus, which I will explain in a minute. We plan to have a groundbreaking this year, in a few months. We want to continue basically to work with the Brainport community to improve the infrastructure, because we are very much aware also that as we grow, we can sometimes create more headache, and it's very important to address that. So we have major investment there, also, of course, through the Beethoven program. Affordable housing has been quite some progress in 2025 about some of the progress we have done there.\n\n**Christophe Fouquet** (CEO)\nThis is ongoing now for a few years. This remain very, very important, and we will continue to invest. You see the number there. I don't need to stress it to basically create more housing. We also understand that this is, you know, a broader challenge across the Netherlands, and we definitely wants to do our part, helping the community here. Culture. So we are, you know, very proud to be one of the, I would say, initial partner for the future Rijksmuseum here in Eindhoven. We love the city of Eindhoven. We love this place, but sometime we feel that if we can bring a bit more culture, a bit more activity, I think this will help our people to enjoy it even more, to attract even more people moving forward.\n\n**Christophe Fouquet** (CEO)\nThat's also why we stay very committed to the PSV, football club, as you know. But this we thought was a very, very nice initiative from, the city of Eindhoven, and we really wanted to, to be there. Finally, education. You know that we have a long-standing relationship with, the TU University here in Eindhoven. I could extend that to many other university across the Netherlands. This is key. We want to develop talent that will be able to work in semiconductor moving forward, and we will continue to do that, of course, very strongly.... One last word, we need to continue to grow. I will come back to some of the other announcement we had today about our, focus on innovation and engineering.\n\n**Christophe Fouquet** (CEO)\nAt the same time, we see more demand for our product, and therefore our footprint needs to continue to grow because we need to invest in customer service, we need to invest in manufacturing, we need to invest in space. So last year, we opened 2 major sites, one in Korea, one in the U.S., and that intends to support basically our activity here. The big event in 2026 will be the groundbreaking of the big campus, which is our second big campus in the community. We'll do that mostly in May, June, and I'm sure you will be invited to join us, with the idea that we can already start moving people as early as in 2028. So this will be very good for our people.\n\n**Christophe Fouquet** (CEO)\nIt will be very good also to debottleneck a bit, the campus in, in, in Veldhoven, of course, and this is a project, as you know, that is very, very important for ASML. This is my update. I will come back in a bit to talk a bit about, again, the action we are taking on our engineering team to strengthen our innovation. In the meantime, I'll give a chance to Roger to give us those very nice numbers. Thank you.\n\n**Roger Dassen** (CFO)\nThank you, Christophe, and good morning, good afternoon, everyone. So indeed, I will present the financials for 25 and the outlook. Christophe said it clearly Q4 2025, a record quarter by any standard. It was a record quarter in terms of sales. It was a record quarter in terms of order intake. It was a record quarter in terms of the cash flow generation on the back of all the good developments that Christophe just shared with you. So I won't call them out here, but just looking at the quarter, it's pretty clear that it was indeed a very strong quarter.\n\n**Roger Dassen** (CFO)\nIf we look at 2025, and if we look at the total business for ASML, we ended the year with EUR 32.7 billion in net revenue, 52.8% gross margin, and you see the key elements in here, a net income of EUR 9.6 billion, and an EPS, earnings per share of close to 25 euros per ordinary share. All in all, very, very strong year, in which we also, you know, paid back and returned quite some money to our shareholders, and also were able to do the participation in the Mistral that Christophe just alluded to.\n\n**Roger Dassen** (CFO)\nVery clearly, EUV was the main driver behind it, and you will see it in the pie chart that I will share with you in a moment. It will clarify that it is particularly the leading technology that really contributed to the growth, so both immersion, but first and foremost, also EUV. So EUV grew 39% in comparison to last year, to 2024.\n\n**Roger Dassen** (CFO)\nA mix of both more tools, significantly higher sales price of the tools, because most of the tools that we sold, most of the Low-NA tools that we sold in 2025 were 3800 tools, which, as you know, saw an increase in productivity from 160 wafers per hour to 220 wafers per hour, and of course, a commensurate increase in the sales price. And obviously, we also had the recognition of a number of EXE tools, high-NA tools. So it's in that combination that really EUV was the big driver of growth for us this year. Big moment indeed, and Christophe showed it as well, the revenue recognition of the first 5200B.\n\n**Roger Dassen** (CFO)\nReally a big moment for us because that is the high-volume manufacturing tool on High-NA, and the fact that we were able to not just ship it, but also get it installed and get accepted by the customer, and the customer are really looking at putting that tool into high-volume manufacturing for its leading nodes, is a very significant moment for the company. DUV went down a bit, decreased 6%. If you look at the geographies, you would see that most of the decline would actually come from China, so that's where most of the decline on DUV was. Immersion is still quite strong, but particularly on the dry side, it was lower than it was in 2024.\n\n**Roger Dassen** (CFO)\nBut there, the step into the 3D integration market with the introduction of the 260 obviously was another big moment. Applications, very strong. Christophe alluded to it, a 28% increase right there, with the need for more process control for our customers at the leading nodes. And finally, very strong, 26% increase in our installed base business, both on the back of service, you know, our installed base in EUV is obviously growing. Therefore, you know, you see a continuous step up of our service revenue from EUV, but also increased appetite in EUV in upgrades. I'll come back to that later.\n\n**Roger Dassen** (CFO)\nThis gives you some breakdowns, and I won't call them out all, but I think if you look at technology, it's interesting to see that the leading technology, so both EUV and immersion combined, give you 90% of our systems revenue, and I think that really talks volumes, I think, about the shift that Christophe was also talking about, the shift to more and more leading nodes, clearly represented here in the share of technology. In terms of end use, you see, you know, you see memory at 34%, logic at 66%. You see memory actually declining a little bit in terms of percentage. We actually see that flip in 2026. So in 2026, you will see that memory becomes more and more important.\n\n**Roger Dassen** (CFO)\nIn terms of regions, a lot to be said there, but I think, you know, China is still very, very big, but smaller than it than it was last time, both in terms of percentage of system sales and also in absolute numbers, you see a bit of a decline in the China market. We expect that decline to continue. As we said, we expect the China business for this year to be around 20% of our total sales. So here it was 33% of total of system sales, it was 29% in terms of total sales. We expect that 29% number to go down to approximately 20% this year. This gives you the net sales by end use over the years.\n\n**Roger Dassen** (CFO)\nI won't spend too much time on it. Just one fun fact, if you look at the installed base business at EUR 8.2 billion, that comes pretty close to the total revenue for ASML in 2017. That just tells you how unbelievably rapidly the company grew. The fact that we have such a big number in terms of installed base business, obviously also provides a lot of resilience for the company. So therefore, it's an important number for us to focus on and to continue to increase. This gives you the business over the years.\n\n**Roger Dassen** (CFO)\nSo if you just, you know, if you take the four-year increase from 2021 to 2025, you would see that the company has grown 75% at the top line. You also see that R&D increases from EUR 2.5 to EUR 4.7, which of course was absolutely critical in getting us, you know, prepared for all the beautiful products that we're currently shipping to our customers. But I think it's also fair to acknowledge that this huge increase in R&D number has also driven some organizational complexity that Christophe will talk about after my contribution.\n\n**Roger Dassen** (CFO)\nSo this gives you the overview, and as you see, earnings per share, an interesting number, rounded 25, 25 by 25 is something that you might easily recall on a go-forward basis. In terms of return to shareholders, if we look at dividends, the total dividend that we propose to the AGM for the year is 7.50 EUR. This quarter, we'll do 1.60 EUR per ordinary share as an interim dividend in Q1, and therefore, if the AGM accepts our proposal, we would have a final dividend of 2.70 EUR, and that's a significant increase over last year.\n\n**Roger Dassen** (CFO)\nIn terms of share buyback, we did not complete the full program of share buyback, as you see here, EUR 7.6 billion out of the total program of EUR 12 billion. We did announce a new program, EUR 12 billion over a three-year period. In terms of outlook for the quarter, we expect net revenue between EUR 8.2 billion and EUR 8.9 billion, with a gross margin between 51% and 53%. Look again at the installed base management sales, EUR 2.4 billion. So last quarter, EUR 2.1 billion, this goes up to EUR 2.4 billion. What it really tells you is that the appetite from customers when it comes to upgrades is very, very high.\n\n**Roger Dassen** (CFO)\nBecause in the climate that Christophe was describing, where customers really have a lot of appetite to increase their capacity as quickly as they can, of course, on the one hand, they will, you know, try and complete their fab building as soon as they can, such that they can take our new tools in. But in the meantime, once these fabs are still in construction, the fastest way to get extra capacity is really to make sure that the tools are, you know, squeezed to the max, and therefore, to put as much upgrades on the tool as possible. And that's what you see here, and that really contributes to very, very strong installed base sales going up again this quarter.\n\n**Roger Dassen** (CFO)\nSolid gross margin, 51%-53%, R&D and SG&A cost nicely under control. For the full year, EUR 34 billion-EUR 39 billion, really on the back of all the developments that Christophe talked about. So the real steam engine behind this growth is once again EUV. So we once again expect the EUV business to go up significantly this year. We also expect the installed base business to go up this year, and it will go a little bit at the detriment of the non-EUV business. We expect that to be about flattish. So non-EUV business is expected to flattish from EUR 25 billion-EUR 26 billion.\n\n**Roger Dassen** (CFO)\nWith those moving parts for the leading nodes, so for the, you know, the big customers, both in memory and advanced logic, we actually expect the DUV business to go up a bit. As I mentioned, in China, we expect the China business to go down. Metrology and inspection, we expect to be quite strong. So those are, you know, more or less the moving parts within the non-EUV business. Again, for the full year, EUR 34 billion-EUR 39 billion, which at the midpoint, after, you know, a growth of 16% in 2025, at the midpoint, you would be looking at a 12% increase in this year with, you know, good potential, as the bandwidth also suggests. Gross margin, 51%-53%, and annualized effective tax rate of 17%.\n\n**Roger Dassen** (CFO)\nFriends, that concludes my presentation, and as I mentioned, Christophe still has a part for you on the streamlining of our engineering and innovation function.\n\n**Christophe Fouquet** (CEO)\nThank you, Roger. So... I'm losing my mic. Yeah, we don't have AI everywhere, as you can see.\n\n**Roger Dassen** (CFO)\nPut it in the-\n\n**Christophe Fouquet** (CEO)\nGod!\n\n**Roger Dassen** (CFO)\nNo picture.\n\n**Christophe Fouquet** (CEO)\nGood. Yeah, I have one slide I want to share with you on the action we are taking basically to strengthen our innovation and engineering team. So I think that, you know, the net results of that, which is, you know, 1,700 people leaving the company, I think, has been picked up pretty clearly already this morning. What I want to do is to give you some background, and of course, you understand, listening to our outlook, listening to the numbers, we are not doing that in any case because we are in trouble or because we need to save money, et cetera, et cetera. Now, the reason we are doing that is that we have been growing very fast, and, you know, this is also true for our technology team, our innovation engine.\n\n**Christophe Fouquet** (CEO)\nAs you know, the technology team, the innovation engine of ASML, has been the reason for our success. It's been true for many, many years, and this is still going to be true for many, many years to come. And as we have said, in 2025, we want to continue to innovate more. This is why we engage in AI, this is why we engage in 3D integration, this is why we have a long roadmap on EUV, and we believe that innovation will, for many, many years to come, define our success. But when we listen to the feedback of many of our stakeholder, they have told us in the last years that we're not very agile, in fact, and we're not, I would say, responsive enough.\n\n**Christophe Fouquet** (CEO)\nSo our customer are pointing to the need for us on technology to be able to respond much faster, to work on quality, to work on new product. A very important feedback we got is from our own engineers, who told us, \"Well, a lot of the time we spend in ASML is not anymore on innovation, right? Because the organization has become so complex, we have so many people steering us in different direction that we have to spend a bigger part of our time just dealing with that.\" And this has been a very, very strong, and I would say, loud message from our people, and we felt the need, basically, to address that. Our supplier, if you talk to them, they also tell us the same, and therefore, we felt the need to move.\n\n**Christophe Fouquet** (CEO)\nSo you heard about the number 1,700. I'd like to give you a bit more color to this number. If you look at our technology organization today, we have about 4,500 leaders, which is quite a bit. When we look at a future organization where we simplify our processes, where we reduce the number of steering axes towards our engineers, we believe, basically, that we need about one thousand five hundred leaders to run this organization. So it's 3,000 less leaders needed if we are successful in simplifying. So out of the 3,000 people that we don't need basically to lead the team, we are going to create 1,400 engineering positions. So we are going to add, in fact, some engineering bandwidth to work on existing product, to work on future products.\n\n**Christophe Fouquet** (CEO)\nSo we want to, in fact, have out of this action, more engineers and less, I will say, leadership, so that engineers can be fully enabled to do their job. And as a result of that, if you do the math, we have 1,600 people out of the technology team that will not have a job in ASML anymore. Now, the difference between the 1,600 and 1,700 is 100 people coming out, out of IT, when we have a similar situation, similar feedback, and where there we believe that about 100 leading position are not needed. So this is a bit the math. We want to really boost again our engineering capability, our innovation engine. We want to improve, I would say, the satisfaction of our engineers, our customer, our supplier.\n\n**Christophe Fouquet** (CEO)\nOf course, this comes at the cost of a very difficult decision we had to make. You know, we explained our employees this morning, this is most probably the most difficult decision the management team ever had to make in ASML. But we do it because we truly believe that this is the right thing to do for the company, for our stakeholders, starting with our employees, and to basically continue to be this great company moving forward. So that's a bit more background, and with that, I think we'd like to take some questions from you. Thank you very much.\n\n**Monique Mols** (Head of Media Relations)\nOkay.\n\n**Christophe Fouquet** (CEO)\nOkay.\n\n**Monique Mols** (Head of Media Relations)\nThank you. So we have some questions online, and we have some people here in the room, and because you all came here, I think you should go first. So, let's ask some questions in the room first.\n\n**Sarah Jacob** (Reporter)\nThanks. Good morning, thanks for taking my-\n\n**Monique Mols** (Head of Media Relations)\nPlease state your name and your publication first, so everyone knows.\n\n**Sarah Jacob** (Reporter)\nYeah.\n\n**Christophe Fouquet** (CEO)\nIt's on, yeah.\n\n**Sarah Jacob** (Reporter)\nOkay, it's on. I'm Sarah Jacob, I'm from Bloomberg News. Regarding the job cuts that you announced today, what kind of restructuring costs or charges can we expect from this?\n\n**Christophe Fouquet** (CEO)\nThat's obviously a subject to the discussions that we're having with the Work Council and first and foremost, union, so cannot talk about that. But these costs in the grand scheme of ASML would not be considered material. So we'll, you know, the finalization of the number is very, very much subject to discussion, but, you know, not materially in our numbers.\n\n**Bert van Dijk** (Reporter)\nBert van Dijk, Financieele Dagblad. I got a question about, there's a lot of talk about capacity expansion from your customers. We've seen a lot of announcements, but how much of those announcements are or is related to real capacity expansion, and what part is CapEx inflation, so to speak? Because the cost of a wafer is increasing. How sustainable is that? Can you elaborate a little bit on that?\n\n**Christophe Fouquet** (CEO)\nWell, I think so. I talked about short and mid-term, so I think that the visibility we get from our customer is mostly for the next couple of years. And when we talk about capacity expansion, we talk about new systems. So that's why we said that if we look at 2026, we expect to ship quite a few more EUV tool. It's also true with metrology, with inspection. I think Roger was rightfully stressing the progress of our installed base business, which also include upgrades, and we will see also a lot of that. So I would say, when you hear our customer talking about capacity expansion, this translate directly into need for more tools.\n\n**Christophe Fouquet** (CEO)\nYou know, for a long time we heard our customers, sometimes our customers talking about expansion, and this was still a bit far away from us. In the last three months, if you have listened to TSMC, Samsung, Micron... Micron has been announcing, you know, groundbreaking almost every week for the last few weeks. There, you know, you have a direct translation basically into shipment for us, and we have not said that in our talk, but also build-up of capacity. So of course, a lot of that will affect positively not only ASML, but the entire supply chain here in the region.\n\n**Monique Mols** (Head of Media Relations)\nOkay, let's turn to an online question and get back to you then. So, a question from Financial Times: \"Please, can you talk a bit more about how the AI memory shortage is driving your business, and to what extent those customers are being more aggressive in their capacity expansion than logic?\n\n**Christophe Fouquet** (CEO)\nI will start. I think that, you know, it's difficult to say if logic or DRAM is the bottleneck for AI today. I would still pick most probably memory at this point of time, and the reason for that is that when it comes to memory, the demand for high-bandwidth memory, which is the AI memory, is extremely high. But the demand for DDR, memory, which is for mobile PC, is also very high, and as a result, we have seen basically the price of DRAM going up significantly in the last, few weeks. Therefore, there's a need for capacity, and our memory customer are moving very aggressively. I mentioned a few example, and the reason for that is, when you have such a demand for capacity, capacity is also market share.\n\n**Christophe Fouquet** (CEO)\nYou know, if we look at 2026, we know that the memory demand will be very, very tight because our customer are saying that publicly. So there is a huge appetite, and it started most probably end of last year, for our DRAM customer to really build up capacity as quickly as possible, and that's the dynamic we are in, which of course has a major positive benefit for ASML.\n\n**Monique Mols** (Head of Media Relations)\nOkay, thank you. Marc, in the room. I see some hands.\n\n**Silvester Klaasman** (Reporter)\nHi, Sylvester Klaasman, Studio040. How does the stabilizing AI market influence the perspective of the amount of jobs you're about growing in Eindhoven?\n\n**Christophe Fouquet** (CEO)\nWell, so if you look at the big picture, so I mention again, you know, our long-term forecast as we establish it in November 2024, where we still see us growing towards EUR 44 billion-60 billion revenue, which means that we see still need for more capacity. Even as we speak, this year we will be adding jobs in manufacturing, in customer service, in order to support basically that need. So I would say the long-term trajectory is still a trajectory of growth. We take today a very specific action on a very, very focused part of the organization, which is the technology team, and in fact, even focused specifically on the leadership of the technology team.\n\n**Christophe Fouquet** (CEO)\nBut it doesn't change fundamentally, and therefore our commitment to people, but also, as I've shown, to footprint, et cetera, et cetera. The supply chain, I could add to that. I think it's very important to understand that even as a company grow and is very successful, there's still a need once in a while to make sure that some of the key element of the company, and for us, that's the technology, technology is really our heart. We have to make sure that, you know, we keep the heart in the best possible shape. The action we are taking today is difficult, is painful, but the intention is to make sure that that innovation engine keeps going, so that, you know, as the market grow, we keep our very strong leadership position in the market.\n\n**Monique Mols** (Head of Media Relations)\nOkay. Sure.\n\n**Marc Hijink** (Reporter)\nHi, Marc Hijink, NRC. I have two questions, one relating to the reorganization, and the other one is to being prepared to this huge demand in new machines. First of all, the reorganization referred to the technology team. Does it mean that something changes within the internal structure as well regarding D&E or R&D? And the other question is, when it comes to being prepared for this new upcycle- ... is your supply chain also prepared? So did you do some stockpiling there or, does everybody have to expand?\n\n**Christophe Fouquet** (CEO)\nI'll take the first one, I'll leave you the second one. So I think the short answer to your first question is yes. I think that the transformation, the change in the organization will be mostly around D&E, not only, but mostly around D&E. The leadership I was referring to is mostly within D&E. That's also why Marco, our CTO, together with Joost Smits, are taking the lead also on that activity. But since, you know, innovation is the heart of the company, everything else is connected to that. And, you know, by improving the organization, the D&E organization, we also improve the interfaces with operation, we improve the interfaces with our customer, and we improve the interfaces with our supplier, right?\n\n**Christophe Fouquet** (CEO)\nSo all the people who told us, basically, \"You've got to do something better,\" should benefit from that. So a lot of the work will be focused on D&E. In fact, you know, what we talk about today, I would say practically doesn't concern the very large majority of the team ASML, but the impact, I think, will go beyond D&E.\n\n**Roger Dassen** (CFO)\nMark, on the capacity, what we've done, as you know, in the past couple of years, is to put in what we call the long lead time items, which means that everything that takes, let's say, longer than 12, 18 months to realize is in place in order to get to a much higher volume. So that means factory space, et cetera, et cetera. We've done that, and we've worked with our supply chain for them to do that as well. So what we're doing now, you know, based on the very strong signals that we're getting from our customers, and also them indicating that they believe this development is sustainable, we're now making sure that every quarter we increase our move rate.\n\n**Roger Dassen** (CFO)\nBecause, as you will appreciate, you cannot move from 44 units in 2025 to 80 units in 2026; doesn't work that way. So you gradually need to crank up your move rate, and that's exactly what we're doing right now. We're doing that. We have a very solid understanding also with our supply chain. They're doing the same thing, and that will lead to a, you know, a very, very meaningful increase in our capacity this year, but also moving forward.\n\n**Monique Mols** (Head of Media Relations)\nI'm gonna go to one online and then get back to you. Could you share how ASML's R&D spending is currently divided between EUV-related development and non-EUV technologies? This is a question from the Chemical Daily in Tokyo, and we have a lot of people from Japan online watching us, so that's really nice.\n\n**Roger Dassen** (CFO)\nThe lion's share of the R&D expense really is in EUV, right? Because on EUV we have, you know, both High-NA, we have the Low-NA platform that where we still see a lot of potential to develop that, and we're also working on what we call the high-perform platform. So we have three very significant work streams in the D&E organization to focus on EUV. So without a doubt, EUV is the lion's share of the development. But that said, we do have roadmaps for the other products as well. You heard us talked about the two sixty. You might have heard about the eight seventy, which is a platform that really significantly increases the output capability on the in the dry business, so we're working there as well.\n\n**Roger Dassen** (CFO)\nLion's share is really focused on EUV.\n\n**Monique Mols** (Head of Media Relations)\nOkay.\n\n**Christophe Fouquet** (CEO)\nHmm.\n\n**Niels Waarlo** (Reporter)\nNils Waarlo, Volkskrant. I had a question about the China business, which is going down quite dramatically. I was wondering whether it's also going down in absolute numbers, and if that's the case, what's driving that? Whether it's just still a backlog thing or whether something else is going on as well.\n\n**Roger Dassen** (CFO)\nWell, it is going down in absolute numbers as well, right? So if you do the math on the system sales, if you take the chart, you take the percentage, and you apply it to the total system sales, you would see that actually it goes down in system sales, I think something like EUR 850 million. But you can do the math yourself and verify whether my memory serves me well here. But it is clearly going down from 2024 to 2025, and also at the 20% number that we indicated for this year, it will go down further. What's going on there? Well, first of all, it's normalizing, right? Because I think the reality is, we should ask ourselves the question, what was going on in previous years?\n\n**Roger Dassen** (CFO)\nWhat was going on in previous years is that over the COVID period, we built up a huge backlog because we. And in fact, we underserved the Chinese market during the COVID days. As a result of that, a huge backlog has been built, and we have been executing on that backlog in the past couple of years. So at a certain point in time, we already expected China to normalize. Frankly, the very strong China sales still in 2025 surprised us a bit.\n\n**Roger Dassen** (CFO)\nGiven all the dynamics that we're looking at right now, we think 20% is probably the right number, which, by the way, still gives you, you know, at the midpoint, close to EUR 7.5 billion of sales. So it's not in any way falling off a cliff, right? But it is reduced in comparison to what it was last year. So it's more a normalization than that anything very spectacular is going on there.\n\n**Monique Mols** (Head of Media Relations)\nI saw a lot of interest in the room, so let's go back to the room. Dan?\n\n**Daan van Monsjou** (Reporter)\nYes, thank you. Daan van Monsjou from Tweakers. I have two questions. The first one is, you mentioned that the EUV business will grow quite rapidly this year. I was wondering what share of that will be High-NA. You know, I think you mentioned this is really a preparation year for the coming years for insertion. So I'm wondering, you know, how many machines do you plan to ship this year? And the second one is, do you have a progress update on High-NA, since the year you will make a firm decision on it,\n\n**Toby Sterling** (Reporter)\n... and maybe the common platform as well.\n\n**Roger Dassen** (CFO)\nI'll take the first one, you take the second one. So on the,\n\n**Toby Sterling** (Reporter)\nThe other way around.\n\n**Roger Dassen** (CFO)\nOh, the other way around. We're trained. So the vast share of the growth will clearly be in, will clearly be in, in Low-NA, right? So that's where, you know, because it's all-- it all goes into high-volume manufacturing because there is such a big need for our customers to grow there. So that's where the lion's share goes. High-NA will just continue to go along the lines of what Christophe has described earlier on, which is the three phases. And we're not yet in the high-volume manufacturing phase, although, as we did point out, you know, the fact that one customer has accepted, signed off, on the 5200B, our first high-volume manufacturing tool, of course, is an important step in that direction.\n\n**Roger Dassen** (CFO)\nBut the lion's share of the growth this year will be Low-NA.\n\n**Christophe Fouquet** (CEO)\nYeah, and on the High-NA, so before I go there, I, you know, I need to take a bit of step back. So we talk about Low-NA, we talk about High-NA. I think we talked about High-NA because we see that in the future there may be a need for even a more advanced litho system, and we could end up in a world, I'm talking 10 years from now, where, you know, customer use basically each one of those three system. Now, this being said, when you look 10 years ahead, it's very difficult to know exactly when this will happen, and in order to not have to answer that question today, what we did is develop a program which we call High Productivity Platform.\n\n**Christophe Fouquet** (CEO)\nSo Roger mentioned it as one of the key program in EUV, and that program basically consists in defining an EUV platform that will come to the market, you know, early next decade, and that will be able to support Low-NA with major productivity improvement. We look at more than 400 wafers per hour. High-NA, also with major improvement, and potentially High-NA. So we're designing a platform basically that will be able to receive ultimately Low-NA optics, High-NA optics, High-NA optics. And this give us basically the full flexibility over time to decide exactly when and how we should introduce, High-NA. So the team has done a lot of work, so if you talk to our engineers, they'll tell you we could do it tomorrow, but there's no need for it tomorrow. So what we will do is, again, just continue to prepare for it.\n\n**Christophe Fouquet** (CEO)\nIf you follow technical conference, there will be a presentation on that at SPA in a few weeks from now, so you get a bit more, a bit more. But the key is, you know, to be prepared, basically to serve the whole market with EUV and the high productivity platform program we have put in place and we're executing on, allow us to do that exactly.\n\n**Monique Mols** (Head of Media Relations)\nYep. I have a question from online, and then I'll get-\n\n**Christophe Fouquet** (CEO)\nMm-hmm\n\n**Monique Mols** (Head of Media Relations)\nto you, Toby. Maybe you can do this quickly, but I think it's a question that a lot of people ask themselves. This is from Lucine Nouvel in, France: \"You're going to cut 1,700-1,700 jobs, but you say you want more engineers. Are you planning to hire in 2026 and beyond? And if so, do you have a figure? Will this offset the 1,700 job cuts, or will ASML's workforce ultimately decrease?\n\n**Christophe Fouquet** (CEO)\nYeah, so-\n\n**Monique Mols** (Head of Media Relations)\nWell-\n\n**Christophe Fouquet** (CEO)\n... I think two steps. So first, as I explained, we, we free practically about 3,000 people out of the action we take on the leadership in the technology team. And out of those 3,000 people, we already create 1,400 positions. So that's the first thing. The second thing I've said is that a lot of that is done to enable, I would say, the full potential of our engineers. So our engineers tell us today, \"Well, you know, maybe we spend 20%-30% of our time not doing engineering, but doing meetings, talking to many different managers,\" et cetera, et cetera. Well, if we take that away from them, we give them also more bandwidth for development. So we also expect basically that our engineering workforce will be able to create more moving forward for the same amount of people.\n\n**Christophe Fouquet** (CEO)\nSo this means that as we go through this transformation, we get 1,400 more people, and we get a lot more of everyone else in the organization. How this will really play out, we don't know, but we believe that this could fuel quite a few of our program, basically moving forward. So we will continue to hire people based on our need, and we do that today, on operation. We'll do that if we need to on D&E, because we can afford it also, let's be honest. But we also expect that at least the next couple of years, the gain we could make by enabling our engineers to the full extent, will create a lot more bandwidth for us to develop.\n\n**Monique Mols** (Head of Media Relations)\nOkay, that's clear. Thank you. Toby?\n\n**Toby Sterling** (Reporter)\nHi, this is Toby from Reuters. Toby's, Toby Sterling. Oddball question: The only thing that did better than ASML's price in the past year is gold and silver. I'm wondering if you guys can maybe say, maybe not so much ASML, but how is this gonna affect your industry, the rise in price for gold and precious metals?\n\n**Christophe Fouquet** (CEO)\nGold and silver, I would say, our industry overall, I think it's very small. I think it's very, very small. I think from all the things we worry about... I tell you something, we worry a lot more about energy costs than gold or silver, because energy is, as we've discussed in the past, most probably, you know, we love AI, we love the opportunity. I think Elon Musk said that also, last week in Davos, but energy is most probably the one thing to watch to make sure that this industry keeps going. And now, the good news for us is, one way to reduce energy consumption is to move to more advanced chips, because they reduce basically power consumption. So that's also an opportunity.\n\n**Christophe Fouquet** (CEO)\nBut I think if there's one thing this industry has to worry about as a whole, is energy cost, and I would even say availability. Gold, silver, I say we're okay.\n\n**Monique Mols** (Head of Media Relations)\n... Go ahead.\n\n**Paul van Gerven** (Reporter)\nHi, Paul van Gerven from Bits&Chips. Do you expect to max out on capacity this year? And if so, what will be the bottleneck?\n\n**Roger Dassen** (CFO)\nI think the question is not necessarily just for us, whether we're going to be maxed out. I mean, it will be a very busy year, that's for sure. But I think in everyone trying to drive out, drive up capability, we also need to look at our customers. So I think everyone will be scrambling to get more, to get more capacity. It starts with our customers, because we can ship tools, but our customers also need to be in a position to receive them, and therefore, they need the fabs to be done. So I think that's what's going on. We will work extremely hard to get, you know, as much out as we can, and as our customers are asking for it.\n\n**Roger Dassen** (CFO)\nI think an important factor will be, you know, when will our customers have their fabs ready to really receive those tools?\n\n**Monique Mols** (Head of Media Relations)\nOkay. We have four minutes left, so let's go back to the room again.\n\n**Stan Hulsen** (Reporter)\nHi, Stan Hulson of Dutch Public Broadcaster, NOS. About the reorganization, I was wondering if you could share some insights on how did you end up in this situation in the first place? Why did you create so many leadership roles in the past months or years? And can you give us a timeframe on when the reorganization will be executed?\n\n**Christophe Fouquet** (CEO)\nYeah, it's always a good question, and, you know, if you look at, the growth of a company, I think at any point of time, you try to make the best decision for the company. And I think this has been done, but as any large company, you tend to add side job over time with the belief that they really help. And I think to some extent they do at the beginning, because you strengthen a certain axis, right? You strengthen, I don't know, quality, you strengthen maybe, you know, the execution of part of the, of the company. But there is a point of time where you add... If you add too many of different axes, then people get confused. And we started to get that signal, I would say, already for two, three years.\n\n**Christophe Fouquet** (CEO)\nWe spent quite some time, because the next question could be: You know, how do you know now that the next things would be better than the previous one? Which is another very good question. We didn't want to rush in that, and we spent more than 12 months designing, not in the board of management, but designing with the people that are working day, you know, after day in technology, but also in the sector, because of the connection I talked about. So we spent more than 12 months working with those people to try to drive an organization that they believed will fit better what they need. I think we need to, you know, make sure over time that we keep on scanning the organization so that, you know, if we made maybe some non-optimized move in the past, we can correct it.\n\n**Christophe Fouquet** (CEO)\nI think it's very normal in a company. What is not right is not to correct things if you feel they are not helping you anymore.\n\n**Roger Dassen** (CFO)\nI think if you look in any rapidly growing organization, where do organizations grow? They grow because the number of competencies grow or products become far more complex. As a result of that, also, the competencies that are necessary to get it done become more complex. 15 years ago, software, for instance, was not as important as it is, today, just to call out one. So you see an expansion of capability, and you see an expansion of a roadmap, many, many more products on the roadmap than we ever had before. The answer to something like that, that any rapidly, rapidly growing organization does, is a matrix organization, where the competencies and the products, meet each other. So that's, that's your answer, and that gives you scalability for a while.\n\n**Roger Dassen** (CFO)\nBut there is a point in time where a matrix organization, any matrix organization, becomes so complex that you've got to act. And I think that's, that's the journey that we've been on, that's the thing that we've now concluded, and hence the action that that Christophe calls out. And I think the worst thing you can do is not recognize the issue and just continue to go on as you did before.\n\n**Monique Mols** (Head of Media Relations)\nOkay.\n\n**Roger Dassen** (CFO)\nIn terms of, in terms of timing, 'cause that was, that was your other, question-\n\n**Christophe Fouquet** (CEO)\nTake a bit.\n\n**Roger Dassen** (CFO)\nI mean, that completely depends on the negotiations that are currently going on with the unions, with the workers' council, et cetera, but this will definitely be a number of months.\n\n**Monique Mols** (Head of Media Relations)\nOkay.\n\n**Roger Dassen** (CFO)\nFrom our vantage point, as soon as possible, because we want to be able to provide clarity to everyone in the organization and, you know, get rid of the uncertainty at the personal level. So that's why we would like to push, you know, as soon as we can in the interest of the people that are affected.\n\n**Monique Mols** (Head of Media Relations)\nOkay, our time is up. Thank you very much for coming. Thank you everyone online for watching. You can still, you know, send us your question. The media team is available for you. For those in the room, nice, you're here, there's coffee, and we have some chats with some of you, and we look forward to seeing you next year. Thank you very much.\n\n**Christophe Fouquet** (CEO)\nThank you.\n\n**Roger Dassen** (CFO)\nThank you.",
      "fetched_at": "2026-02-04T15:46:51.782Z"
    },
    {
      "ticker": "ASML",
      "title": "ASML Holding N.V. - New York Re (ASML) Q4 FY2025 Pre Recorded earnings call transcript",
      "published_date": "Jan 28, 2026, 1:00 AM EST",
      "fiscal_year": "2025",
      "quarter": "Q4",
      "url": "https://finance.yahoo.com/quote/ASML/earnings/ASML-Q4-2025-earnings_call-542405.html",
      "content": "**Monique Mols** (Head of Media Relations at ASML)\nHello, and welcome to ASML's Q4 2025 and full year 2025 results video. Roger, if I can start with you, and ask you to give us a summary of both Q4 2025 and the full year's results.\n\n**Roger Dassen** (CFO)\nSo Q4, net revenue came in at EUR 9.7 billion. That included the recognition of revenue for two High-NA systems. For the full year, revenue came in at EUR 32.7 billion, which was a 16% increase compared to 2024. Installed base business came in for the quarter at EUR 2.1 billion. If you take the full year, EUR 8.2 billion, quite strong. Quite strong, you know, first on the, on the basis of the service revenue for EUV. Obviously, with the expansion of the installed base for EUV, you see the service revenue increasing there. But also there was quite some appetite for, for upgrade business, so that led to, you know, quite a strong revenue for, for the installed base business.\n\n**Roger Dassen** (CFO)\nGross margin for the quarter, 52.2%. If you take it for the full year, that was 52.8%. Net income, again for the quarter, EUR 2.8 billion, for the full year, EUR 9.6 billion. In terms of net bookings, net bookings came in at EUR 13.2 billion. Included in there, EUR 7.4 billion for EUV. If you look at the backlog that we had at the end of last year, at the end of 2025, EUR 38.8 billion total backlog, of which EUR 25.5 billion for EUV.\n\n**Monique Mols** (Head of Media Relations at ASML)\nYeah. And then can you give us some color on what you saw in terms of the business in Q4 specifically?\n\n**Roger Dassen** (CFO)\nClearly, it was a strong quarter, right? A strong quarter. It was a record quarter in terms of revenue. It was a record quarter in terms of order intake. It was a record quarter in terms of free cash flow generation. So from that vantage point, clearly a very strong quarter. If you listen to our customers, both what they say publicly, but also what they told us, you know, it's pretty clear that customers over the past couple of months have actually become more positive in their assessment of the medium-term market perspectives as they see it.\n\n**Roger Dassen** (CFO)\nI think it's primarily on the basis of the more robust view that they have when it comes to to demand for AI, which, you know, seems to be more sustainable from their vantage point. That recognition has led, you know, some of our customers to really invest in capacity and gear up their plans for medium-term capacity expansion. So that's been clearly the case, and that perspective has obviously also led to a strong order intake for us.\n\n**Monique Mols** (Head of Media Relations at ASML)\nYeah.\n\n**Roger Dassen** (CFO)\nFinally, I would say, important for Q4 is also that we were actually able to demonstrate our ability to gear up our output, which, again, is going to be important also in light of the expectations that we have for 2026.\n\n**Monique Mols** (Head of Media Relations at ASML)\nThen moving to 2026, you know, how are you guiding both Q1 and the full year?\n\n**Roger Dassen** (CFO)\nSo Q1, we're looking at an expectation we expect net revenue to be somewhere between EUR 8.2 billion-EUR 8.9 billion. That's the expectation for the quarter in terms of revenue. We expect a gross margin between 51%-53%. When it comes to the installed base revenue, we expect around EUR 2.4 billion in Q1. For the total year, we're looking at total net revenue expected between EUR 34 billion-EUR 39 billion, with a gross margin between 51%-53%.\n\n**Monique Mols** (Head of Media Relations at ASML)\nChristophe, in terms of the market outlook that supports Roger's commentary there, can you give us a little bit of color on how you're seeing things?\n\n**Christophe Fouquet** (President)\nWell, I think that, Roger already mentioned very clearly that, the market outlook has notably improved in the last few months. And this is especially true when it comes to the build-up of the capacity for AI application, being data server or other infrastructure. Now, we start to see that this, build-up is also translating into need for capacity at our advanced customers. So this is true for logic, this is true for DRAM. And this start to translate also into orders for our most advanced technology, especially EUV. So in the last few months, we have seen our DRAM customer, our logic customer, starting to accelerate their planning capacity and having this discussion with us.\n\n**Christophe Fouquet** (President)\nIf I look at logic first, so there, I think we see our customers starting to be more comfortable about the sustainability of the long-term AI demand, and this means that they are more willing to accelerate their capacity planning. They are transitioning also from 4-nm technology to 3-nm technology, which is going to be more demanding in term of advanced technology. And finally, of course, the ramp of 2nm is going on, and I will say is accelerating in order to fulfill the future need of mobile and HPC application. When I look at, DRAM, there also the demand is very strong for HBM, of course, but also for DDR, and this most probably will lead to a very tight supply, at least in 2026, and most probably beyond that.\n\n**Christophe Fouquet** (President)\nSo we see our customer ramping 1b, 1c node, which are going to be critical for that demand. And on those nodes, we see them increasing basically the amount of, EUV layers. So we have talked about that in the past. I think we see that happening very strongly right now. So altogether, we see a very positive dynamic, I think a strong belief that the AI demand is real, and a preparation for that with, on the short term, a major addition of capacity. This will start in 2026 and will last beyond that.\n\n**Monique Mols** (Head of Media Relations at ASML)\nTurning back to you, Roger, how do you see that then translating into ASML's business?\n\n**Roger Dassen** (CFO)\nSo if we start with the EUV business, I think, you know, against the backdrop of the demand and the developments that Christophe was describing, we expect the EUV business to increase significantly. So EUV revenue to significantly go up in comparison to 2025. When it comes to the non-EUV system business, in total, we expect that to be kind of flattish in comparison to 2025, but with, you know, different moving parts in there. If you look at advanced logic, if you look at memory, we actually expect the demand also on the non-EUV business to go up there.\n\n**Roger Dassen** (CFO)\nOn the China business, we expect the China business for us to come in at approximately the percentage that China also has in our backlog, which is around 20% of our backlog, and therefore, 20% of our revenue is what we expect the China business to come in at. And then I would say on the very clearly also in the non-EUV business, it's pretty clear that the metrology and inspection business is quite strong. There is a lot of demand for process control, so therefore, we expect that business to go up as well. So those are the different moving parts, but all in all, we expect the non-EUV business to be sort of flattish, the non-EUV system business.\n\n**Roger Dassen** (CFO)\nAnd then the installed base business, I already told you that, we expect the installed base business in 2025 was quite strong. And we actually expect the same dynamics to also go into 2026. We actually expect that business to go up as well, so growth in installed base. On the back of, again, the growth of the installed base business for EUV, and also in the current climate, a significant appetite, we think, for upgrades and for upgrade business, because frankly, that's the easiest and fastest way for customers to get additional output capacity.\n\n**Monique Mols** (Head of Media Relations at ASML)\nIf, Christophe, if I can ask you to give us, you know, an update on how you're seeing the technology roadmap development, for ASML?\n\n**Christophe Fouquet** (President)\nWell, first, I'd like to say that the appetite for technology from our customer for those advanced node is very, very high, and that's true for almost all the product in ASML. If I start with Low-NA, 2025 has been a critical but also a good year to ramp our NXE 3800. This tool is now extremely important for our customer. They're going to rely on it for the next advanced DRAM logic nodes. And we have been able to mature the product, reach the final throughput of 220 wafers per hour, but even demonstrate at some customer that we could go on this tool up to 230 wafers per hour.\n\n**Christophe Fouquet** (President)\nRoger said it, upgrades, when, you know, you need capacity, upgrades become very, very important, so this would be good for the 3800. But we're also providing on EUV more upgrades for the installed base so that we help our customer on a very short term with capacity. We also expect Low-NA EUV to continue to see more utilization moving forward. We talked a lot about litho intensity. When we look at, for example, the transition from 6F² to 4F² on DRAM, we also expect both immersion and Low-NA to be used even more. So there also we expect good dynamic on litho intensity. Looking at High-NA, customers continue to make good progress on the qualification. I've talked about the three phases in the past. A lot of customers are finalizing their R&D phases with the 5000.\n\n**Christophe Fouquet** (President)\nIntel has reported that they have accepted their first 5200, which means basically they have the first tool that will be used in high volume manufacturing, and other customer are going to also get the tool in their hands very, very quickly. The qualification of the tool is going well. Imaging, performance, overlay performance, everything is looking good for our customer right now. Inspection, metrology, Roger touched on that. Almost 30% growth this year, which is significant.\n\n**Christophe Fouquet** (President)\nIt means that both the need for those product is high, but also the product we're offering are basically meeting our customer need, both on optical, overlay metrology, but also E-beam inspection. On E-beam inspection, multi-beam is becoming more and more critical. 2025 was also a good year for this product, allowing it to mature the technology, demonstrate initial value with our customer, and we expect also that product, I would say, to have more traction in 2026. So overall, huge appetite for technology, lot of project in ASML.\n\n**Monique Mols** (Head of Media Relations at ASML)\nYeah.\n\n**Christophe Fouquet** (President)\nSome of the key product should become, I would say, production worthy in the coming months.\n\n**Monique Mols** (Head of Media Relations at ASML)\nBack to you, Roger, would you be able to give us an update on dividend and buybacks, what we're doing on that front?\n\n**Roger Dassen** (CFO)\nYeah. So this quarter, we'll pay an interim dividend of EUR 1.60 per ordinary share. We're going to actually propose to the AGM to have a final payment as it pertains to last year, of EUR 2.70 per ordinary share. If you combine that with the interim dividends that would have been made at that point in time, then the total dividend, as it relates to 2025, would be at EUR 7.50 per ordinary share, which would actually be a 17% increase over the dividend over 2024.\n\n**Roger Dassen** (CFO)\nIn terms of a share buyback, the previous program ran until December. We didn't complete that, so we bought back shares for an amount of EUR 7.6 billion. You know, the maximum amount was EUR 12 billion. We're announcing. Actually, we announced today, a new program, a new program for, again, a three-year period, so it ends December 2028, and for an amount up to EUR 12 billion.\n\n**Monique Mols** (Head of Media Relations at ASML)\nChristophe, to finish, if you could give us a reminder on how you're seeing the, you know, maybe the longer-term demand and what that means for ASML.\n\n**Christophe Fouquet** (President)\nWell, I think one of the key points we made at our Capital Markets Day in November 2024 was that AI application will require more advanced technology in DRAM and logic, and will drive basically some of our most advanced product. And I think that this is being confirmed as we speak. The last few months have pointed basically exactly to that dynamic. We also see that the progress we continue to make on our cost of technology with EUV is driving for more litho intensity, and that's, again, something that has been confirmed in the last few months. So if we look in, to the long term, in line to what we said in November 2024, for 2030, we expect a revenue between EUR 44 billion and EUR 60 billion and a gross margin between 56% and 60%.\n\n**Monique Mols** (Head of Media Relations at ASML)\nVery clear. Thank you both, very much.\n\n**Roger Dassen** (CFO)\nThank you.\n\n**Christophe Fouquet** (President)\nYou're welcome.",
      "fetched_at": "2026-02-04T15:46:55.462Z"
    },
    {
      "ticker": "ASML",
      "title": "ASML Holding N.V. - New York Re (ASML) Q3 FY2025 Investor Call earnings call transcript",
      "published_date": "Oct 15, 2025, 9:00 AM EDT",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/ASML/earnings/ASML-Q3-2025-earnings_call-393823.html",
      "content": "**Operator**\nGood day, and thank you for standing by. Welcome to the ASML 2025 third quarter financial results conference call on October 15, 2025. At this time, all participants are in a listen-only mode. After the speaker's introduction, there will be a question and answer session. To ask a question during the session, you will need to press star one and one on your telephone. You will then hear an automated message advising your hand is raised. To withdraw your question, please press star one and one again. Please be advised that today's conference is being recorded. I would now like to turn the conference call over to Mr. Jim Kavanagh. Please go ahead.\n\n**Jim Kavanagh** (Head of Investor Relations)\nThank you, operator. Welcome, everyone. This is Jim Kavanagh, Head of Investor Relations at ASML. Joining me today at the call are ASML CEO, Christophe Fouquet, and CFO, Roger Dassen. The subject of today's call is ASML's 2025 third quarter results. The length of this call will be 60 minutes, and questions will be taken in the order that they were received. This call is also being broadcast live over the internet at www.asml.com. A transcript of management's opening remarks and a replay of the call will be available on our website shortly following the conclusion of this call. Before we begin, I would like to caution listeners that comments made by management during this conference call will include forward-looking statements within the meaning of the federal securities laws. These forward-looking statements involve material risks and uncertainties.\n\n**Jim Kavanagh** (Head of Investor Relations)\nFor a discussion of risk factors, I encourage you to review the safe harbor statement contained in today's press release and presentation found on our website at www.asml.com and in ASML's annual report on Form 20-F and other documents as filed with the Securities and Exchange Commission. With that, I would like to turn the call over to Christophe for a brief introduction.\n\n**Christophe Fouquet** (CEO)\nThank you, Jim. Welcome, everyone, and thank you for joining us for our third quarter 2025 results conference call. Let me start by saying how pleased I am with the recent announcement of the reappointment of Roger Dassen and Frédéric Schneider-Maunoury to the board of management. We also announced last week the appointment of Marco Pieters as our Chief Technology Officer. This appointment is part of our robust succession planning process, and with over 25 years of experience at ASML, Marco brings a proven track record in technology leadership. Marco will take on the responsibility of driving our technology roadmap forward in support of our customers, and I look forward to our continued collaboration. In addition, ASML's supervisory board announced that it intends to appoint Marco to the board of management as of the company's next annual general meeting to be held on April 22nd, 2026.\n\n**Christophe Fouquet** (CEO)\nBefore we begin the Q&A session, Roger and I would like to provide an overview and some commentary on the third quarter results, as well as provide some additional comments on the current business environment and on our future business outlook. Roger?\n\n**Roger Dassen** (CFO)\nThank you, Christophe, and welcome, everyone. Let me start with our third quarter accomplishments. In the third quarter of 2025, total net sales were EUR 7.5 billion, which is within our guidance. Net system sales were at EUR 5.6 billion, which includes EUR 2.1 billion from EUV system sales, including one High NA system, and EUR 3.4 billion from non-EUV system sales. Net system sales were driven by logic at 65%, with the remaining 35% coming from memory. Installed base management sales for the quarter came in as guided at EUR 2 billion. Gross margin for the quarter was also within guidance at 51.6%. For operating expenses, R&D expenses came in a bit below guidance at EUR 1.1 billion due to the timing of spending, and FG&A expenses basically came in as guided at EUR 303 million. The effective tax rate for Q3 was 17.8%.\n\n**Roger Dassen** (CFO)\nFor the full year 2025, we continue to expect an annualized effective tax rate of around 17%. Net income in Q3 was EUR 2.1 billion, representing 28.3% of total net sales and resulting in an EPS of EUR 5.49. Turning to the balance sheet, we ended the third quarter with cash, cash equivalents, and short-term investments at a level of EUR 5.1 billion. Moving to the order book, Q3 net system bookings came in at EUR 5.4 billion, split between EUR 3.6 billion of EUV systems and EUR 1.8 billion of non-EUV systems. Net system bookings in the quarter were slightly weighted towards logic at 53%, while memory accounted for the remaining 47%. In Q3, ASML paid the first interim dividend over 2025 of EUR 1.60 per ordinary share. The second quarterly interim dividend over 2025 will also be EUR 1.60 per ordinary share and will be made payable on November 6th, 2025.\n\n**Roger Dassen** (CFO)\nIn Q3 2025, we purchased shares for a total amount of around EUR 148 million. As of September 28th, 2025, ASML has acquired 9 million shares under this program for a total consolidation of EUR 5.9 billion. ASML does not expect to complete the EUR 12 billion share buyback program in full within the 2022-2025 timeframe. We intend to announce a new share buyback program in January 2026. With that, I would like to turn to our expectations for the fourth quarter of 2025. We expect Q4 total net sales to be between EUR 9.2 billion and EUR 9.8 billion. We expect our Q4 installed base management sales to be around EUR 2.1 billion. As previously discussed, we expect Q4 to be a very strong quarter, as was the case at Q4 of last year. Gross margin for Q4 is expected to be between 51% and 53%.\n\n**Roger Dassen** (CFO)\nThe expected R&D expenses for Q4 are around EUR 1.2 billion, and FG&A is expected to be around EUR 320 million. For the full year, we continue to expect total net sales to be around EUR 32.5 billion, with a gross margin of around 52%. With that, I would like to turn the call back over to Christophe.\n\n**Christophe Fouquet** (CEO)\nThank you, Roger. As Roger has highlighted, we finished the third quarter with good financial results. Looking now to the market, there's been a positive news flow across the industry in recent months that has helped to reduce the level of uncertainty that we were reporting last quarter. First, there were a number of announcements around the continued investment in AI infrastructure that supports demand in both leading edge logic and advanced DRAM. Second, the positive momentum around AI seems to extend to more customers in both logic and DRAM. Third, we see continued momentum around customers adopting more EUV layers in both logic and DRAM, migrating multi-patterning DUV to single exposure EUV, and continuing to support lithography intensity.\n\n**Christophe Fouquet** (CEO)\nOn the other hand, we expect to see China customer demand, and therefore our China total net sales in 2026, to decline significantly compared to our very strong business there in 2024 and 2025. We believe that the impact of these dynamics will only partially affect 2026. However, overall, we do not expect 2026 total net sales to be below 2025. In this environment, we also expect the 2026 EUV business to be up, driven by the dynamic in advanced DRAM and leading edge logic, and the DUV business to be down compared to 2025, driven by the dynamics with our Chinese customer. We will provide more details on our 2026 outlook in January.\n\n**Christophe Fouquet** (CEO)\nTurning to technology, there's been a lot of good progress this quarter with the latest achievement on EUV presented at industry conferences, the release of new 3D packaging lithography system, and the announcement of our strategic engagement with Mistral AI. For EUV, we presented a number of papers at recent SPIE and SEMICON events that highlighted the progress we have made in helping drive down the cost of technology on our customers' most advanced processes. With regards to the maturity of High NA, we shared data showing that we have now run cumulatively over 300,000 wafers on the system at our customer. Also, our customers have shared very positive data showing that the maturation level of the platform is well ahead of where low NA EUV was at the same stage in its introduction.\n\n**Christophe Fouquet** (CEO)\nFurther, SK Hynix announced this quarter that they started to take delivery of their first High NA system, the EXE:5200, positioning High NA as a critical enabler for future advanced DRAM devices. We are also happy to report that this quarter we shipped ASML's first 3D integration product, the XT260. The XT260 is an i-line scanner designed for applications that include advanced packaging and offer up to four times the productivity compared to existing solutions. 3D integration is of increasing importance to the roadmaps of our customer and the semiconductor industry, and our customers have been sharing with us a need to innovate in order to meet their future requirements. The discussion with our customers on those requirements points to a good opportunity to transfer some of our holistic lithography technology to 3D integration to meet their future needs.\n\n**Christophe Fouquet** (CEO)\nThe XT260 is the first example of several opportunities we are evaluating. With the XT260, we are able, as said, to multiply the existing productivity by up to a factor of four using a unique optical design. As mentioned, we shipped our first system this quarter and expect to ship this tool to quite a few more customers in the coming quarters, reflecting the strong interest in this technology solution. With that, I ask Roger to provide some insight into our recent engagement with Mistral AI. Roger?\n\n**Roger Dassen** (CFO)\nThanks, Christophe. In September, we announced that we closed a strategic partnership with Mistral AI, a pioneering company in generative artificial intelligence with a strong business-to-business focus and widely recognized for its leadership in large language models that assist in areas such as software coding development. ASML is normally associated with hardware. Software plays an increasing role in driving the precision and speed of our tools. Our partnership with Mistral AI allows us to embed AI across our entire holistic portfolio in order to increase the performance and productivity of our systems and the yield of our customers' processes. Also, we believe this collaboration will allow for faster innovation, resulting in improved time to market and lower development costs when delivering state-of-the-art solutions to our customers.\n\n**Roger Dassen** (CFO)\nIn addition to the collaboration agreement, ASML has invested EUR 1.3 billion in Mistral AI's Series C funding round as lead investor, resulting in ASML holding around an 11% share in Mistral AI and having a seat at their strategic committee. It allows us to become even more closely connected to the AI ecosystem.\n\n**Christophe Fouquet** (CEO)\nThank you, Roger. Looking longer term, as we shared in our capital market day, we start to see that the end market dynamics are leading to a product mix shift towards more advanced logic and DRAM. Those applications require a more intensive use of advanced lithography systems. We expect that to continue. The combination of our strong productivity roadmap on low NA and the introduction of INA supports further costs of technology reduction and the conversion of more multi-patterning layers to a single EUV exposure, especially on DRAM advanced nodes. In line with our 2024 capital market day, we expect a 2030 revenue opportunity between EUR 44 billion and EUR 60 billion, with gross margin expected between 56% and 60%. With that, Roger and I will be happy to take your question.\n\n**Jim Kavanagh** (Head of Investor Relations)\nThank you, Roger. Thank you, Christophe. Now, the operator will instruct you momentarily on the protocol for the Q&A session. Beforehand, I would like to ask that you kindly limit yourself to one question with one short follow-up if necessary. This will allow us to get through as many callers as possible. Now, operator, could we have your final instructions and then the first question, please?\n\n**Operator**\nThank you. As a reminder, to ask a question, you will need to press star one and one on your telephone and wait for your name to be announced. To withdraw your question, please press star one and one again. We will now take the first question. Your first question today comes from the line of François Bouvignies from UBS. Please go ahead.\n\n**François Bouvignies** (Head of Europe Tech Hardware and Semiconductor)\nThank you very much. My first question is on this, what you said, Christophe, that you saw positive news in the last months that helped you reduce the uncertainty. I was wondering, can you elaborate on this? Obviously, you get these $5 billion orders, which is helping, but I guess just one quarter of orders doesn't give you the full flexibility on 2026 completely. Do you have more visibility in terms of the full capacities they need for 2026 now? Do they give you more numbers around all of that or the layers? I'm just trying to understand what changed versus last month, or you just rely on positive news out there and you try to extrapolate, just trying to understand these dynamics. Thank you.\n\n**Christophe Fouquet** (CEO)\nYeah, François. I think first, I refer to a lot of positive news on AI infrastructure. I think you all know that usually this doesn't translate immediately into orders for us. This takes quite some time. If you look at the sum of the announcement, I would say this creates a pretty positive backlog of opportunity for AI moving forward. The second one is also quite important. I think we mentioned the fact that we see now that more customers will benefit from the AI opportunity. I think it's important for many reasons. The first one being that, in order to respond to this huge demand of good news, this huge amount of good news on AI infrastructure, you need to make sure that the market capacity will be high enough.\n\n**Christophe Fouquet** (CEO)\nI think that seeing more customers entering logic opportunity or DRAM opportunity is pretty good news for the long term. To know exactly how this will affect the next few years is still difficult to say. I think, as I said before, only part of that will be effective next year. For the rest, I think it's far too early to say on our side.\n\n**François Bouvignies** (Head of Europe Tech Hardware and Semiconductor)\nMakes sense. Thank you. The follow-up is on China. I mean, that has been a key driver of growth in the last few years, and you mentioned it will go down significantly. It's again a bit on the visibility side here. I guess you see the strong edge too. I would imagine three to six months lead times because it's DUV. I would expect you not to see much beyond Q1 2026. Is it some conservatism because you see the strong base and maybe a soft Q1 2026, or do you really have the full picture already on 2026, how it's looking?\n\n**Christophe Fouquet** (CEO)\nI think that we have about the same clarity that we had last year about this time. I think around that same time, we still try to provide you a bit of our view of the market. I think on China, we have been very consistent that we thought that, you know, the level of business in the last two, three years was very high and in no way normal. I think we have been experiencing a very high cycle in China, especially through the last couple of years. Again, our expectation and the visibility we have right now is that next year we go back to more reasonable business.\n\n**François Bouvignies** (Head of Europe Tech Hardware and Semiconductor)\nThank you very much for your answers.\n\n**Christophe Fouquet** (CEO)\nYou're welcome.\n\n**Operator**\nThank you. Your next question comes from the line of Krish Sankar from TD Cowen. Please go ahead.\n\n**Krish Sankar** (Managing Director)\nYeah, I was kind of thinking my question. I have two of them. Roger, you kind of mentioned about the recent AI investment strength. Some of it will come in 2026. I'm kind of curious, given your long lead times, how to think about linearity of your revenues or orders in 2026? Any early thoughts on what it implies for 2027?\n\n**Roger Dassen** (CFO)\nYeah, Krish, interesting question. I think we're, you know, we set what we set on 2026. I think it's way too early to make any comments on 2027. You will see that, you know, orders came in strongly in the last quarter. Actually, the quarter before that also came in strongly. I think linearity of orders is an anomaly. We said orders always come in lumpy. We've had a healthy run in the past two quarters, but I don't think you can talk about linearity. It's way too early to talk about what this means for 2027. Going back to Christophe's earlier answer, the news flow that you got in the past couple of months is a positive news flow and is a positive news flow, particularly in the medium term. To now translate that into concrete expectations for 2027 is really quite a bit too early.\n\n**Krish Sankar** (Managing Director)\nFair enough. Fair enough. A follow-up for Christophe. You know, clearly, you're seeing strength in DRAM. I'm kind of looking longer term. There's a view that when you go into 4F sq from 6F sq for DRAM architecture, that's actually a negative for EUV. The EUV layer count comes down. Can you just help us understand that, Christophe? Thank you.\n\n**Christophe Fouquet** (CEO)\nYeah, it's a good question. It's a question we get a lot. The short answer is no. If we look at the number of EUV layers going from 6F sq to 4F sq, we do not expect the number of layers to drop. In fact, as 4F sq roadmap continues after the transition, we, in fact, expect the number of EUV layers to continue to grow. I make that statement after many discussions with our customers. On top of that, what I'd like to add is, you know, 4F sq has a bit of a more complex structure. It's, in fact, heading overall more litho mask, more advanced litho mask. There is a benefit also to some extent to advanced DUV. In any case, if you still doubt about it, 4F sq is in no way bad news for ASML. We are looking forward to it.\n\n**Krish Sankar** (Managing Director)\nGot a sense of that, Christophe. Thank you.\n\n**Operator**\nThank you. Your next question comes from the line of Joe Quatrochi from Wells Fargo. Please go ahead.\n\n**Joe Quatrochi** (Executive Director and Equity Research Analyst)\nYeah, thanks for taking the question. I was wondering if you could talk a little bit more about just the updated commentary for 2026. Is that more that your more positive view, a bit more DRAM slanted or equally balanced with logic? Then same for, you know, more customers benefiting from AI infrastructure build-out. Is that more of a DRAM comment?\n\n**Roger Dassen** (CFO)\nJoe, I think it's related to both markets, actually. Last quarter, we talked about uncertainties. I think the uncertainties, and Christophe went into the positive flow that has happened thereafter. One element of the uncertainties that we called out at that point in time was also the uncertainty around tariffs. That was out there. I think there is more clarity on that front right now, but that unclarity also prevented customers from being very concrete as to what exactly they were going to do and where they were going to build their capacity. I think that has decreased, and I think that has given rise to the commentary that we now make on 2026.\n\n**Roger Dassen** (CFO)\nI would say in general, when we talk about the positive news flow on the leading edge, leading to our expectation that EUV is going up next year, that is related both to the DRAM and to advanced logic.\n\n**Joe Quatrochi** (Executive Director and Equity Research Analyst)\nThanks for that. As a follow-up, I was wondering if you could maybe just walk through some of the puts and takes in your gross margin guide. I think what you're guiding for for the December quarter is a bit better than what you were implying a quarter ago. Is that something related to tariffs or mix or something else?\n\n**Roger Dassen** (CFO)\nObviously, volume is quite high, right? That is a positive moving from Q3 to Q4. Mix has many elements to it. It's, of course, we expect two [EXEs] in this quarter in Q4, so that is a negative. On the other hand, we will also have a good low NA in there. We're a bit positive on upgrade business, as you could see, right? That business is a little bit up. If you then take it all in all, we see a slight improvement at the midpoint in comparison to what we had in last quarter. Those are the dynamics. I would say the fairly small movements, but all in all, leading at the midpoint to a slightly better gross margin than maybe we thought we were going to be forward.\n\n**Joe Quatrochi** (Executive Director and Equity Research Analyst)\nThank you.\n\n**Roger Dassen** (CFO)\nYou're welcome.\n\n**Operator**\nThank you. Your next question comes from the line of Didier Scemama from Bank of America. Please go ahead.\n\n**Didier Scemama** (Head of EMEA Tech Hardware and Semiconductor Research)\nOh, yes. Thank you for taking my question and good afternoon. My first question is about things that you talked about a little bit before, but I just wanted to press you a little bit more. We've all seen the press release of SK Hynix and Samsung, following the visit of Sam Altman to Korea, talking about a letter of intent of 900,000 with a start per month of HBM capacity, which is probably more than double the current HBM capacity. My question is this. My estimate would be that there are about 30 EUV tools in DRAM today, not all of them for HBM, but the majority, presumably. That would imply if we believe those numbers, and many people think those numbers are absolutely grotesque, but let's do it for the sake of the argument.\n\n**Didier Scemama** (Head of EMEA Tech Hardware and Semiconductor Research)\nYou would need something like 65 EUV tools just for HBM, and then comes on top whatever Samsung foundry intent and TSMC would need. I guess the question is, A, what do you think of those numbers? B, do you have enough capacity for EUV low NA, let's say, by 2030 to get to satisfy that potential demand?\n\n**Christophe Fouquet** (CEO)\nI think we won't get into the calculation because I think we said it already a couple of times. We are a bit careful with how the big announcement can translate into real capacity need on the ground. The one thing I'd still like to stress one more time is we see the broadening of the customer base, very important news in that matter because whatever you do is the first set of news. I think we can all agree that we need to make sure that the market will not be supply limited. This has always been a risk with a limited amount of customers supplying AI chips, both in logic and DRAM. The broadening of the install base is very good news there. On the last question, you know, we have said for a few quarters that we have been preparing for growth.\n\n**Christophe Fouquet** (CEO)\nWe were following those dynamics, and I think we know now that EUV most probably will be stronger next year. We've been preparing for that. We have, as you know, also worked on longer-term capacity. We continue to track basically the market carefully, having in mind that we want to be able to follow the demand. I would say we don't have any concern there at this point of time.\n\n**Didier Scemama** (Head of EMEA Tech Hardware and Semiconductor Research)\nOkay. Great. My follow-up for Roger, perhaps, just wanted to understand what I'm missing. If we look, if we assume, like, let's say you book $5 billion of orders in Q4, you know, give or take, that would imply you exit calendar year 2025 with a backlog just about $30 billion. Even if you strip out the High NA tools in there, expectations, I'm going to call it $1.5 billion, $2 billion, that makes me comfortably above, you know, let's say, modest growth for next year. Is there a large portion of the current backlog which has got maturity beyond 2026? Is that the reason why you're still hesitant at calling 2026 a, let's say, strong growth year or high single-digit growth year or even double-digit growth year? Thank you.\n\n**Roger Dassen** (CFO)\nOf course, that's the big question, right? The big question is what is in the backlog that pertains to beyond 2026. That is a reasonable number. As a result of that, your math doesn't work exactly right for 2026 because there is a pretty healthy number in there for beyond 2026. We also know that there's always a question about a bit of pull in here, a bit of push out there, and that makes it extremely hard to make at this stage any concrete projections on 2026. To your point, there is already a healthy order intake in the backlog that is beyond 2026. Also, as it relates to High NA, I think that the High NA contingent in there is actually pretty strong.\n\n**Didier Scemama** (Head of EMEA Tech Hardware and Semiconductor Research)\nWould you say how many you expect to recognize next year?\n\n**Roger Dassen** (CFO)\nHigh NA? No, that's a January topic, Didier.\n\n**Didier Scemama** (Head of EMEA Tech Hardware and Semiconductor Research)\nThank you, gentlemen.\n\n**Roger Dassen** (CFO)\nYou did.\n\n**Christophe Fouquet** (CEO)\nImpressive.\n\n**Didier Scemama** (Head of EMEA Tech Hardware and Semiconductor Research)\nThank you, guys.\n\n**Roger Dassen** (CFO)\nYou're welcome. Thanks.\n\n**Operator**\nThank you. Your next question comes from the line of Andrew Gardiner from Citi. Please go ahead.\n\n**Andrew Gardiner** (Head of European Technology Equity Research)\nGood afternoon. Thank you for taking the question. I might try Didier's question in a slightly different angle and see if I have any more luck. You've highlighted the news flow, Christophe. You know, we can all see it. It feels like you wake up every day to another massive announcement from somewhere within the AI food chain. You sort of spend a lot of time talking about how that could create a theoretical backlog for you, not yet orders. I'm just wondering, you are a critical supplier into this market. You have the potential to be a backlog, to be a bottleneck, rather, for the market. Of course, you don't want that to be the case. You're preparing for growth, etc. Do you feel like there's sufficient understanding through the chain, whether it's of where you sit or perhaps your customers?\n\n**Andrew Gardiner** (Head of European Technology Equity Research)\nHow can you, as a critical supplier, make sure that the broader market isn't supply limited come 2027, 2028, given the kind of announcements that we're seeing on a near-weekly basis?\n\n**Christophe Fouquet** (CEO)\nFirst, I think we wish we had a formula to translate all the announcements on what it means exactly for us in the next few years. I think no one has that. The experience also of 2022 has mostly taught us a lesson to be ready and to have maybe more flexibility because we know the market can swing. We've done a lot of work on that in the last few years. We have prepared a building, as we discussed before, which are usually the longer lead time items. For the rest, when it comes to defining exactly how many tools we want to produce, I think the lead time is a lot shorter, so we have more flexibility. I would say we have structurally maybe improved ourselves so that, because we cannot answer those questions after the announcement, we at least have the flexibility.\n\n**Christophe Fouquet** (CEO)\nThe other thing I would like to add is, of course, our customers, at the end of the day, tell us what they need. I think that's a constant dialogue, a dialogue we try to always reflect with you on a quarterly basis. I think we continue to do that. We are prepared. I think we stressed a few times we were preparing for growth. This was also in light of some of this activity we have seen. Come January, we will be most probably knowing even more about what's happened then. We will continue to monitor the market. I think we are, I would say, a lot more prepared than we were a few years ago.\n\n**Roger Dassen** (CFO)\nI think Christophe said it exactly right. We are very well prepared, particularly, you know, by having invested in the long lead time items. That still, by the way, means that when it comes to shorter lead time items, of course, you need to have a dialogue with your customer that gives you a timely heads up, right? Because, you know, of course, we need to kick our supply chain into gear. We need to hire the people, etc., etc. We have a lot more flexibility than we used to have. It is also critical for our customers to give us a timely heads up such that we can make sure that, you know, within the long-term infrastructure that we have, we're also able to get to higher output levels and, you know, get supply chain and people in place.\n\n**Andrew Gardiner** (Head of European Technology Equity Research)\nThank you, Roger. I suppose without naming names, do you feel like your customers are giving you that heads up, right? Is there a sufficient acknowledgement through the chain?\n\n**Christophe Fouquet** (CEO)\nI think they do their very best. I will say it this way because they have the same challenge as we do. I think they do their very best, and I think we're very happy with the transparency and the honesty around those discussions because over time, that's very helpful, also helpful in trying to really avoid the bigger surprise. I feel that this discussion really has improved in the last few years, and I think this is very helpful for them, for us, but also for their customers.\n\n**Andrew Gardiner** (Head of European Technology Equity Research)\nThat's great. Thank you very much, guys.\n\n**Christophe Fouquet** (CEO)\nYou're welcome.\n\n**Operator**\nThank you. Your next question comes from the line of Tammy Qiu from Berenberg. Please go ahead.\n\n**Tammy Qiu** (Head of Tech Equity Research)\nHi. Thank you for taking my question. The first one is the High NA kind of order pattern and demand ramp-up curve. From my understanding, there hasn't been High NA orders for about two-ish, two-plus quarters now. I understand that you're working on your backlog. Does that mean if orders are only coming in from end of next year, that you may actually have, let's say, somewhere like 2027 or 2028, a few quarters of or a year of zero High NA revenue? The ramp-up curve of revenue of High NA is going to be quite lumpy. Is that correct?\n\n**Christophe Fouquet** (CEO)\nI think you summarized to me the situation pretty well. We are indeed working on NA out of the pretty healthy backlog we have. I think I explained in the past that this backlog allows our customers to be covered for, of course, R&D, pretty much done with most of those shipments, but also with the system they want to use for qualification and the insertion. For the rest, the next wave of orders we expect to happen basically when the data coming out of the qualification can confirm that the maturity of the tool is there. I think when it comes to performance, most probably we have passed that milestone. As we discussed last quarter, we expect that to happen most probably towards the second half of next year and after that. This being said, we do more than just waiting for orders with our customers.\n\n**Christophe Fouquet** (CEO)\nIt's not like nothing is going to happen also in the next 18 months in terms of assessing the progress and therefore also assessing the likelihood of the type of insertion we're going to look at. As we did, we just talked about the way we were preparing for growth on EUV in the last few months. We did that without having necessarily the full clarity of the demand. We would be able to do that through the discussion with our customer. In terms of orders, you look, yes, towards the end of next year. In terms of shipments, you look at 2028 and beyond.\n\n**Tammy Qiu** (Head of Tech Equity Research)\nOkay, thank you. That's very clear.\n\n**Christophe Fouquet** (CEO)\nYou're welcome.\n\n**Tammy Qiu** (Head of Tech Equity Research)\nNow, the second question is on China. You mentioned that China revenue would be down significantly in 2026, and that's because of demand. I'm wondering if that's because the customers are not sure about the demand, so they wouldn't want to commit. Therefore, you've been conservative, or the customer told you for some reason their end market demand has been weak, so they're buying less. We don't actually currently see the Chinese market further weaken from where we are today. I wonder what's the reason for that comment to be weaker significantly on you?\n\n**Roger Dassen** (CFO)\nI mean, I think the comment that Christophe made, and I think he also said it goes back to also the comment that we made a year ago, right? For quite a while, we have been eating into our backlog. That's really what happened. For quite a while, the China sales were very high because we've been eating into a substantial backlog because of underserving the Chinese market. That was the reason why, in fact, a year ago, we said we expect the China sales to be more commensurate with the China percentage in the backlog, which at that stage was around 20% of the backlog. That's what we said. Actually, as Christophe said, we were quite surprised that the China sales this year are as strong as they are.\n\n**Roger Dassen** (CFO)\nThat is still the underlying assumption, and our underlying perspective on the Chinese market is still the way it was a year ago. That has to do with the fact that the Chinese market is a very specific one, right? It's focused on mainstream logic, as we call it. Simply given the dynamics of that market, it is our assessment that the sales level that we currently see this year is very high in comparison to what we would think is a normalized level for the mainstream market. That is the reason why we've indicated this assumption of a significant decline. That is based on our understanding of the market. It's based on the dialogues that we have with our customers. Could that change? Absolutely. I think we've seen that this year that it could change in comparison to our perspective.\n\n**Roger Dassen** (CFO)\nIf you ask us for an honest assessment at this stage, how we think it's going to be in 2026, it is as we communicated.\n\n**Tammy Qiu** (Head of Tech Equity Research)\nOkay, thank you.\n\n**Roger Dassen** (CFO)\nYou're welcome.\n\n**Operator**\nThank you. Your next question comes from the line of Stephane Houri from ODDO BHF. Please go ahead.\n\n**Stephane Houri** (Head of Equity Research and Technology Analyst)\nYes. Good afternoon, everyone. Actually, I've got two questions. The first one is on the advanced packaging product that you're highlighting in your presentation, the XT260. Can you maybe say a little bit more about what it's doing, the price of the machine, type of clients, who you're competing with, and the market outlook if you have a few information? I have another one.\n\n**Christophe Fouquet** (CEO)\nYeah. Let me give you a bit of context. I think we mentioned that product in our press release, also in the call, not necessarily because of the high price, high value of the product, but because this is the first product ASML is providing to its customer to support 3D integration. I think that's mostly where the important news is. I think we all know that when it comes to Moore's Law, our customers are asking us to drive transistor density, still doubling it basically a factor of two every two years. I think that we also know that over time, litho scaling slows down. That creates a need basically for more either stacking or packaging of transistors.\n\n**Christophe Fouquet** (CEO)\nOur customers are really asking us to help there because what they want is also speed, is also over time accuracy, and I would say some of the technology we have been developing for our litho portfolio. This is a bit the starting point. I think we also mentioned most probably we'll be looking at some more product there. I think what's very interesting is the interest we see from our customers on this product. It's an iLine scanner to answer your technology. This is based basically on iLine technology, which, of course, we have had at ASML for many years. In this case, we have a new optical design that really enables us to provide a 4x improvement on productivity. Competition are basically the people who do i-line scanners. I think you know them.\n\n**Christophe Fouquet** (CEO)\nWhat's very interesting is that if we look at next year, we have quite a few customers very eager to take this technology. Because we provide a nice technology, some good improvement, I will say that the business and the benefit we can get out of this product is quite a lot higher than we have done historically on i-line.\n\n**Stephane Houri** (Head of Equity Research and Technology Analyst)\nOkay. The follow-up would be about the gross margin in 2026. I know you're not giving guidance and you will say more in January, but given what you have described, i.e., less China, more EUV, but also at the same time, more EUV, High NA, can we expect some increase in the gross margin next year?\n\n**Roger Dassen** (CFO)\nYes, Stephane, indeed. We will give more clarity on that, obviously, in January. I think you're right. Our product mix, obviously, is very important in what drives it. As you know, what we ship to China today to a very large extent is immersion. Immersion comes with a very good gross margin. Less China business would be diluted on that front. You're right, EUV comes in with very strong gross margins. Therefore, if we predict that EUV, particularly low NA, goes up, that would be a positive again, on the other hand. There is the question on the number of tools that we're going to recognize for High NA, which, of course, is still diluted to the corporate gross margin. I think that's an important one. The other one is our expectation on the installed base business.\n\n**Roger Dassen** (CFO)\nWe know that typically the upgrade business is pretty important when it comes to gross margins. It's all those moving parts exactly where they land that will eventually, you know, determine what our expectation is. Those are indeed the moving parts. It's the product mix and it's the expectation on the composition of the installed base business, which, you know, first and foremost is going to drive that perspective.\n\n**Stephane Houri** (Head of Equity Research and Technology Analyst)\nOkay, thank you very much.\n\n**Roger Dassen** (CFO)\nYou're welcome.\n\n**Operator**\nThank you. Your next question comes from the line of Chris Caso from Wolfe Research. Please go ahead.\n\n**Chris Caso** (Managing Director)\nYes. Thank you. Good morning. I guess the first question is on installed base. If you could update us on your thinking as we go into calendar 2026. Previously, you had talked about having to back out some of the upgrade revenue as you go into 2026. What's the current thinking on installed base as we go into next year?\n\n**Roger Dassen** (CFO)\nI think you feel well, that's first over the installed base for this year, right? I think you will see that our expectation for the installed base this year has actually gone up a bit if you look at what we guide for, you know, for Q4. Originally, we thought that the first half was going to be, you know, quite a bit stronger than the second half. Now that the second half is as strong as the first half, what you see there is that actually the service business is developing quite nicely. While we might have had a bit more upgrade business in the first half, the second half is really benefiting from the service business. As you know, the service business is very much tied to the development of the installed base in EUV, right?\n\n**Roger Dassen** (CFO)\nWith the increase in the installed base in EUV, of course, that also, you know, further drives up the service business. That's an important one that I think you can sort of back of the envelope calculate what the impact of that is going to be for next year. The question indeed is how sustainable is the upgrade business? Clearly, it didn't fall off a cliff in the second half of this year. We'll give you an update in January what our expectation is for 2026.\n\n**Chris Caso** (Managing Director)\nThat's helpful. Thank you. Just as a follow-up and maybe summarizing some of the earlier comments about, you know, some of the more optimism, the optimism you had with regard to some of the AI developments. I mean, is it safe to say that the bookings, you know, the total bookings haven't really increased here? Is this more a function of, you know, your customers are telling you based on some of these developments, there's sort of an expectation for, you know, stronger bookings in coming quarters because of the capacity needed to provide that as compared to, you know, what's in the backlog right now? I guess this is an indicator of potentially stronger bookings if this comes to fruition.\n\n**Roger Dassen** (CFO)\nYeah. I think, Chris, that is indeed the way to look at it. You know our view on bookings, right? The bookings, we always say, are not necessarily a good proxy of the business momentum. I think the bookings that we had in this quarter are actually pretty decent, as they were pretty decent in the previous quarter, without being downright spectacular, but pretty decent for sure. I think most of the things, most of the positive developments that Christophe talked about, and Christophe actually said it, only partially affect 2026. Most of this, the AI investments, the fact that multiple customers of us are benefiting from AI, whilst in the past, we always said it's only a limited number of customers that are benefiting from AI. The technology progress that Christophe referred to, the fact that we see more and more layer transitioning to EUV.\n\n**Roger Dassen** (CFO)\nAll that is good stuff. All of that, I would say, is good stuff, not necessarily being cashed in for 2026, but primarily beyond that. I think that's the way to look at it. All good stuff. Definitely, some of those having a partial impact on 2026. The great optimism is also, I would say, for what it does to the business in the longer term.\n\n**Chris Caso** (Managing Director)\nHelpful. Thank you.\n\n**Roger Dassen** (CFO)\nYou're welcome.\n\n**Operator**\nThank you. Your next question comes from the line of Timm Schulze-Melander from Rothschild & Co. Redburn. Please go ahead.\n\n**Timm Schulze-Melander** (Head of Semiconductor and Technology Hardware Research)\nYeah. Hi. Thanks for taking my questions. Maybe to begin with, for Christophe, on the High NA technology maturity, could you maybe just talk a little bit about on what measures High NA is kind of ahead of 0.33 at a similar point in time? Just thinking out to sort of 2028 and that journey, are you kind of halfway there, three-quarters of the way there, and then add a quick follow-up for Roger?\n\n**Christophe Fouquet** (CEO)\nI think it's a good question. Typically, when we look at the maturity of the system, I think there's two elements to it. The first one is when do we demonstrate the final specification of the tool at our customer? When we look at the EXE:5200, we expect that to happen in the next few months, most probably this year. That means that we validate the overall capability of the system. That's point number one. Point number two is, you know, the availability of the tool, you know, how much, what percentage of the time the tool can be used to run wafer. I think there a major difference between low NA and High NA is that when we looked at low NA maturity back at the time we were ramping the product, the availability was really dragged down for many years by the source performance.\n\n**Christophe Fouquet** (CEO)\nThe source was by far the biggest detractor of our maturity on the low NA tool. Now, I think you're fully aware that the source of High NA is exactly the same as the one on low NA. If we look at the availability number of the source itself, we are exactly matching the performance of low NA. What is basically separating us from today to final maturity is just the platform itself. Our experience is that most probably in 12 months, 18 months from now, we will be in a very good shape. There's no showstopper in the way we look at it today when it comes to maturity of the tool. There's a few more months we have to work with our customer to validate that.\n\n**Christophe Fouquet** (CEO)\nWhen I look at the technology, when I look at the reason why we were struggling with low NA, those reasons are not with us with High NA. That's why I think our customers are also eager to report that maturity. That's also what they see. That's also their logic there.\n\n**Timm Schulze-Melander** (Head of Semiconductor and Technology Hardware Research)\nGreat. Very, very helpful. Maybe, Roger, just in terms of profitability, High NA that you recognize revenue on, could you just maybe talk about, I know gross margin is dilutive, but you know, are we positive? What's the sort of runway there? Maybe just thinking about the operating expenses. Given the maturity of the High NA platform, what's the outlook for the sort of cadence of R&D expense, of the R&D burden for the business going forward? Thank you.\n\n**Roger Dassen** (CFO)\nYes, indeed, High NA is dilutive. The key thing that will make it less dilutive, or the key thing that will drive up the gross margin is volume, right? You have a significant capability both in the factory and also in the field for High NA. That total cost base is only absorbed by a very limited number of tools. It is volume that is ultimately going to drive up the gross margin. As Christophe was saying, you're looking at taking stuff into high-volume manufacturing in the 2028, 2029 timeframe, right? In all likelihood, you're going to see meaningful numbers. At that stage, you will see the gross margin profile improving. I did say at the capital market today that even by 2030, I still expect High NA to be margin diluted, right?\n\n**Roger Dassen** (CFO)\nIt takes quite a long time before you get on the maturity curve and before you get significant volume for this to meaningfully contribute. At that timeframe, once you get meaningful numbers, at that stage, the dilutive nature of it will be limited. In terms of.\n\n**Timm Schulze-Melander** (Head of Semiconductor and Technology Hardware Research)\nAre we profitable?\n\n**Roger Dassen** (CFO)\nWhat was that?\n\n**Timm Schulze-Melander** (Head of Semiconductor and Technology Hardware Research)\nWas it profitable at the gross margin level in the quarter, or is it still loss-making, please?\n\n**Roger Dassen** (CFO)\nYou mean High NA?\n\n**Timm Schulze-Melander** (Head of Semiconductor and Technology Hardware Research)\nYes.\n\n**Roger Dassen** (CFO)\nHigh NA is very low margins. It's very low margins. You're talking very low positive margins. That's what you look at. In terms of operating expenses, R&D, I would say we still have a formidable roadmap ahead of us. In spite of the fact that we have High NA up and running, you hear us, if you look at the roadmap, if you look at the significant breakthroughs that we think we can still push in terms of low NA, in terms of productivity of those tools, in terms of imaging quality there, but also the progress that we continue to make on some of the DPV tools that we talked about, we still have a pretty formidable roadmap. I would say, however, that we are looking at further increasing the efficiency that we get out of the organization.\n\n**Roger Dassen** (CFO)\nFrom that vantage point, I do believe that you will continue to see us manage both our SG&A and/or R&D quite nicely because we do feel that out of the formidable team that we have here at ASML in our R&D department, we can get even more value and efficiency there. I think you will see us navigate those numbers quite diligently and keep the increases quite controlled.\n\n**Timm Schulze-Melander** (Head of Semiconductor and Technology Hardware Research)\nExtremely helpful. Thank you.\n\n**Roger Dassen** (CFO)\nYou're welcome.\n\n**Operator**\nThank you. Your next question comes from the line of Alex Duval from Goldman Sachs. Please go ahead.\n\n**Alex Duval** (Head of Europe Tech Hardware and Semiconductors Equity Research)\nYes. Hi, everyone. Thanks for the question. You talked today about lithography intensity inflecting positively. I just wondered if you could clarify the timeline you're thinking about here and to what extent this is a function of progress having been made in the gate all around transition versus other factors. Secondly, we've discussed on this call today about the degree of ambition around AI investment. We've also seen news items talking about AI chipmakers being more aggressive on the nodes they target for future chips. That seems to be somewhat different to how one had thought about where they would locate themselves relative to the bleeding edge. I wondered if you could talk about the implications for ASML of a faster cadence of these more powerful AI chips over time. Many thanks.\n\n**Christophe Fouquet** (CEO)\nMaybe on the first question, I think nothing really new there compared to the last few quarters. I think on the logic, we explained a few times, you know, the gate all around transition is happening without an increase on the number of EUV layers just because customers typically do first the transistor change before they start shrinking more aggressively again, which we still expect to happen at A14, A10. I think very consistent there in the previous view. In DRAM, we talked about 4F sq already today. Since the capital market day last year, we've got a lot of confirmation that indeed DRAM could get more aggressive in terms of EUV adoption for 6F sq, for 4F sq as well, as I mentioned. There, I would say the trajectory is very strong towards more use of advanced lithography moving forward. The second question is a good one.\n\n**Christophe Fouquet** (CEO)\nI think we also mentioned last year in November that more AI applications will drive more advanced logic and more advanced DRAM. Most probably that part is still to be seen because we're looking at 12 months, which is a fraction of a node in terms of timing. What you see happening is what you describe is those applications, the value people can extract out of those applications can justify most probably moving to new nodes that are more expensive, as you have noticed, looking at the price of the wafer. Today can be justified by the value of AI. This has changed indeed the way people used to look at the industry. When we look at the industry driving mobile only, there was a lot of doubt on does the next advanced logic node make sense. I think that those doubts have gone away quite a bit.\n\n**Christophe Fouquet** (CEO)\nThe size and the speed of the ramp of 2 nm node on logic are the very first proof of that. We would expect that trend to continue. We have not seen yet a real acceleration per se. We mentioned again the larger customer base for those products. As you know, also a larger customer base also means that you get more competition and potentially also more motivation to move faster on those advanced nodes. I think that question is a very good one and one that we all have to look at in the next 12 months.\n\n**Alex Duval** (Head of Europe Tech Hardware and Semiconductors Equity Research)\nSuper. Thank you so much.\n\n**Jim Kavanagh** (Head of Investor Relations)\nOkay. We have time for one last question. If you were unable to get through on this call and still have questions, please feel free to contact ASML Investor Relations with your question. Now, operator, can we have the last caller, please?\n\n**Operator**\nThank you. Your last question comes from the line of Mehdi Hosseini from Susquehanna Financial Group. Please go ahead.\n\n**Mehdi Hosseini** (Senior Equity Research Analyst)\nYes. Thanks for excusing me. Only good questions have been asked. I just have two follow-ups. One for Christophe. Obviously, we're all seeing the headlines with AI and everything. You have been highlighting how AI could drive incremental investment. The way I see it, you're also constrained with increased concentration of customers, especially on your logic. One customer is doing all the investment for the leading edge. That by itself drives more volatility in your booking, backlog, and even quarterly revenue. I'm not asking you to name that customer, but is that the right way of thinking about how AI is incremental, but it does limit your visibility? I don't know how to follow up.\n\n**Christophe Fouquet** (CEO)\nYeah. I don't think we need to mention the customer. Your point is clear. I think we discussed that. I don't think there was any concern in terms of either visibility or in terms of, you know, sometimes pricing power. That's a question we got a lot if we had only one customer. I think the only concern really when you have only one customer is, are we going to be supply limited? Are we going to look at a market that is supply limited? Because if you have one customer, you know, the market will have the size of what that market, that customer can deliver. I think this was a bit our bigger concern. I think that's a concern that most probably goes beyond ASML, right?\n\n**Christophe Fouquet** (CEO)\nThat's what we discussed before because it's great to get all those good news about AI infrastructure investment, but at some point of time, you have to get the chips out. You know, as we mentioned a few times already today, I think that the news in the last few months of most probably more customers being able to play in AI, both for logic and DRAM, I think is a very interesting development for the entire market. That applies also, of course, for us.\n\n**Mehdi Hosseini** (Senior Equity Research Analyst)\nSure. A follow-up for Roger. How should I think about working capital intensity over the past several quarters? Inventories have actually gone up, same with accounts receivable. As shipment strength improves, should I expect some improvement here with working capital and just overall cash room operation?\n\n**Roger Dassen** (CFO)\nYeah. I think working capital is going up. Inventory is going up to a large extent because of High NA, right? With High NA, it takes quite some time before a system is being installed. As a result of that, obviously, that drives up the inventory level there. I think that's the major element. The other element is down payments, right? That's the other side of the equation. To the extent that down payments kick in, and that obviously is related to order intake, that's an important negative. I would say those are probably the two most important elements in there. When it comes to High NA, an important element in there, obviously, is reducing cycle time. That's a very important driver of driving down the working capital that is tied up in High NA. That's something that we're very clearly working on.\n\n**Roger Dassen** (CFO)\nOf course, you need to have the volumes in order to make meaningful progress there. I think the working capital levels that you're currently looking at, I think, are sort of reasonable, I would say, for the business that we have today. To the extent that we're able to drive down cycle time, that I think is the single biggest driver of reducing working capital for us.\n\n**Mehdi Hosseini** (Senior Equity Research Analyst)\nAll right. Thank you.\n\n**Jim Kavanagh** (Head of Investor Relations)\nNow, on behalf of ASML, I would like to thank you all for joining us today. Operator, if you could formally conclude the call, I would appreciate it. Thank you.\n\n**Operator**\nThank you. This concludes the ASML 2025 third quarter financial results conference call. Thank you for participating. You may now disconnect.",
      "fetched_at": "2026-02-04T15:46:59.231Z"
    },
    {
      "ticker": "ASML",
      "title": "ASML Holding N.V. - New York Re (ASML) Q3 FY2025 Pre Recorded earnings call transcript",
      "published_date": "Oct 15, 2025, 1:00 AM EDT",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/ASML/earnings/ASML-Q3-2025-earnings_call-338647.html",
      "content": "**Operator**\nHello and welcome to ASML's Q3 2025 results video with Christophe Fouquet and Roger Dassen. Roger, if I can start with you, can I ask you to give us a summary of Q3 2025 results?\n\n**Roger Dassen** (EVP and CFO)\nSure. Net sales came in at EUR 7.5 billion. That included, by the way, the recognition of one high-end system. Also included in there, EUR 2 billion for install base revenue. Gross margin for the quarter came in at 51.6%. All of that, I would say, within guidance. Net income for the quarter came in at EUR 2.1 billion. We recorded net bookings for the quarter of EUR 5.4 billion, included in there, EUR 3.6 billion for EUV.\n\n**Operator**\nRoger, can I ask you to give us a guidance on Q4 2025 as well as the full year for 2025?\n\n**Roger Dassen** (EVP and CFO)\nSure. For the quarter, we're looking at revenue between EUR 9.2 billion and EUR 9.8 billion. It's a big quarter, a lot bigger than last quarter. Actually, that's as planned and also as we communicated before. It's also what we saw in 2024. We also had a very big Q4 there. Included in that number would be an install base revenue of approximately EUR 2.1 billion. The gross margin for the quarter is somewhere between 51% and 53%. If you then take that to the full year, we would be looking at a full year around EUR 32.5 billion in terms of net sales. The gross margin, we say, around 52%. As a matter of fact, if you take the midpoint of the guidance for the quarter, you get a little bit above the 52% for the full year.\n\n**Operator**\nChristophe, if I could ask you to give us your view on how you're seeing the market at the moment.\n\n**Christophe Fouquet** (CEO)\nYeah, I think we have seen a flow of positive news in the last few months that have helped to reduce some of the uncertainties we discussed last quarter. First, we continue to see strong news about commitment to AI, which means we think investment in advanced logic and DRAM. Second, and it's very important for us, it looks like AI is going to benefit a larger part of our customer base. Third, we continue to make very good progress with our lithography intensity, especially with EUV that continue to be adopted with DRAM and advanced logic customers. On the other hand, when we look at China, we believe that the demand of our Chinese customers is going to be significantly lower in 2026 than it has been in 2024 and 2025, where we had very strong business there.\n\n**Operator**\nWhat does that mean then for ASML in 2026?\n\n**Christophe Fouquet** (CEO)\nWe believe that the impact of these dynamics will only be effective partially in 2026. Still, for 2026, we expect our net sales to not be below 2025. If we look at our product mix, the dynamics are going to favor EUV, which we believe will increase, while the dynamic in China will most probably lower the business in DUV. We will provide more details about 2026 in our January call.\n\n**Operator**\nTurning to technology, Roger, can I ask you to give us your thoughts on the recent announcement that we had in terms of the collaboration with ASML and Mistral AI?\n\n**Roger Dassen** (EVP and CFO)\nYeah, indeed. We entered into a partnership with Mistral AI. I think Mistral is really recognized on a number of fronts. I think they're recognized for their business-to-business approach. They're also recognized for the quality of their large language model, particularly when it comes to software coding and software coding development. They're recognized for that. That's the reason why we entered into the partnership with them. Many people look at ASML, look at their products, and really look at hardware. I think increasingly, people appreciate the very significant software content that is within those systems. I think people really understand that if you get to the level of precision and the level of speed that we have in our scanners, but also quite frankly what we need in metrology and inspection, it's pretty clear that the software contingent therein becomes increasingly important.\n\n**Roger Dassen** (EVP and CFO)\nThat's the reason why this is very strategic to us, why it's very strategic to improving the performance, improving the precision, and the speed of our tools as we bring them to our customers. Therefore, this collaboration is truly a strategic choice for us. I would also say that on top of the significance that it has for our products, AI is also a great way to improve the speed of our product development, to improve the speed of our time to market of any product development to our customers. That's another big area that we're collaborating with Mistral on. All in all, we believe a very strategic partnership. We also underscore that strategic partnership, as you know, we were the lead investor for their Series C funding round. By being the lead investor, we took approximately an 11% share in Mistral.\n\n**Roger Dassen** (EVP and CFO)\nWe also have a seat on their strategic committee. We truly believe that by doing this, we also get closer and closer to the AI world, which we believe is so pivotal to what we do at ASML.\n\n**Operator**\nStaying on technology, Christophe, can you share then maybe some of the highlights over the last quarter in terms of our roadmap?\n\n**Christophe Fouquet** (CEO)\nYeah, I think we continue to see a very strong execution of our technology roadmap. I'll start with EUV. We had some very good papers presented at SPIE Semicon conferences, stressing the progress we are making, driving down the cost of technology for the most advanced nodes of our customer. On High NA, we shared the fact that at our customer, more than 300,000 wafers were now run. Some of our customers also reported the fact that the maturity of High NA today is quite ahead of what the maturity of Low NA was at a certain period of time. This was very positive. I think one important news also came from SK hynix, who announced the start of the installation of their first High NA system (model 5200) in their production fab, positioning this tool basically as one of the key enablers for the future of DRAM.\n\n**Christophe Fouquet** (CEO)\nOn top of that, I think we're also very happy to report that we have shipped our first advanced packaging product. We have said in the past that we'll be supporting our customer with 3D integration. We have shipped the XT260 advanced packaging scanner, which is a high productivity scanner that will support advanced packaging and provide up to 4x productivity compared to the existing product.\n\n**Operator**\nYou're mentioning then 3D integration. What's some of the rationale and maybe some of the opportunities you see for ASML in this space?\n\n**Christophe Fouquet** (CEO)\nI think 3D integration, of course, is the other way to drive Moore's Law. When it comes to 2D, we have our lithography roadmap. When it comes to 3D integration, I think we mentioned in Capital Markets Day that we would start helping our customer in this field. Our customers have told us that there is a need for innovation in 3D integration because their requirement will become more and more stringent. When we look at those requirements, we also see that a lot of the technology we have developed for holistic lithography can be transferred to 3D integration. This is why we are looking at several opportunities. The XT260 advanced packaging scanner is the first product. There will be more. Because of innovation, we are capable again to bring technology that can really make a difference.\n\n**Christophe Fouquet** (CEO)\nIf we look at next year, we see many customers that have shown interest in this tool, proving again, I would say, the future value of our technology there.\n\n**Operator**\nAs a final question, can I ask you to remind us of maybe the long-term opportunities for ASML and a little bit the market you see there?\n\n**Christophe Fouquet** (CEO)\nAs we mentioned in Capital Markets Day, we said that most probably AI will drive more advanced applications in semiconductors, so advanced DRAM, advanced logic. I think this is happening and this is driving more advanced lithography, higher lithography intensity. We expect that to continue. As we just discussed, we see that 3D integration will become a new opportunity, which we are going to pursue. As Roger explained very nicely, we also see that AI could create a lot of value in our product moving forward. We continue to see a very strong opportunity on our technology roadmap. Finally, to close on the number, as mentioned in Capital Markets Day, we expect 2030 to see an opportunity for revenue between EUR 44 billion and EUR 60 billion, and a gross margin between 56% and 60%.\n\n**Operator**\nGreat. Thank you very much. Thank you both, Christophe and Roger.\n\n**Christophe Fouquet** (CEO)\nThank you.",
      "fetched_at": "2026-02-04T15:47:03.414Z"
    }
  ]
}