{
  "ticker": "GOOGL",
  "last_updated": "2026-02-04T15:37:43.307Z",
  "total_transcripts": 3,
  "transcripts": [
    {
      "ticker": "GOOGL",
      "title": "Alphabet Inc. (GOOGL) Q3 FY2025 earnings call transcript",
      "published_date": "Oct 29, 2025, 5:30 PM EDT",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/GOOGL/earnings/GOOGL-Q3-2025-earnings_call-366282.html",
      "content": "**Operator**\nWelcome, everyone. Thank you for standing by for the Alphabet Third Quarter 2025 Earnings Conference Call. At this time, all participants are in a listen-only mode. After the speaker presentation, there will be a question-and-answer session. To ask a question during the session, you will need to press *1 on your telephone. I would now like to hand the conference over to your speaker today, Jim Friedland, Head of Investor Relations. Please go ahead.\n\n**Jim Friedland** (Head of Investor Relations)\nThank you. Good afternoon, everyone, and welcome to Alphabet's Third Quarter 2025 Earnings Conference Call. With us today are Sundar Pichai, Philipp Schindler, and Anat Ashkenazi. Now, I'll quickly cover the safe harbor. Some of the statements that we make today regarding our business, operations, and financial performance may be considered forward-looking. Such statements are based on current expectations and assumptions that are subject to a number of risks and uncertainties. Actual results could differ materially. Please refer to our Forms 10-K and 10-Q, including the risk factors. We undertake no obligation to update any forward-looking statement. During this call, we will present both GAAP and non-GAAP financial measures. A reconciliation of non-GAAP to GAAP measures is included in today's earnings press release, which is distributed and available to the public through our Investor Relations website located at abc.xyz/investor. Our comments will be on year-over-year comparisons unless we state otherwise.\n\n**Jim Friedland** (Head of Investor Relations)\nI'll turn the call over to Sundar.\n\n**Sundar Pichai** (CEO)\nThank you, Jim. Good afternoon, everyone, and thanks for joining us. This was a terrific quarter for Alphabet, driven by double-digit growth across every major part of our business. We are seeing AI now driving real business results across the company. We delivered our first-ever $100 billion quarter. Five years ago, our quarterly revenue was at $50 billion. Our revenue number has doubled since then, and we are firmly in the generative AI era. In parallel, we have built for the long term and diversified with successful businesses in Cloud, YouTube, and subscriptions. Our momentum is strong, and we are shipping at speed. As just a few examples, our first-party models like Gemini now process 7 billion tokens per minute via direct API use by our customers. The Gemini app now has over 650 million monthly active users, and queries increased by 3x from Q2.\n\n**Sundar Pichai** (CEO)\nCloud had another great quarter of accelerating growth with AI revenue as a key driver. Cloud backlog grew 46% quarter over quarter to $155 billion. We crossed 300 million paid subscriptions led by growth in Google One and YouTube Premium. Today, I'll discuss progress in our full-stack approach to AI and then share highlights from Search, Cloud, YouTube, and Waymo. As a reminder, our full-stack approach spans AI infrastructure, world-class research, including models and tooling, and our products and platforms that bring AI to people everywhere. First up, AI infrastructure. Our extensive and reliable infrastructure, which powers all of Google's products, is the foundation of our stack and a key differentiator. We are scaling the most advanced chips in our data centers, including GPUs from our partner NVIDIA, as well as our own purpose-built TPUs. We are the only company providing a wide range of both.\n\n**Sundar Pichai** (CEO)\nAs we announced yesterday at NVIDIA GTC, we are now shipping the new A4x Max instances powered by NVIDIA GB300 to our cloud customers. Our highly sought-after TPU portfolio is led by our seventh-generation TPU, Ironwood, which will be generally available soon. We are investing in TPU capacity to meet the tremendous demand we are seeing from customers and partners, and we are excited that Anthropic recently shared plans to access up to 1 million TPUs. Next, world-class AI research, including models and tooling. Our models are world-leading. Gemini 2.5 Pro, VO Genie 3, and our viral sensation Nano Banana are among the very best in class. Over 230 million videos have been generated with VO3, and more than 13 million developers have built with our generative models. We are looking forward to the release of Gemini 3 later this year. Our research leadership is advancing next frontier technologies.\n\n**Sundar Pichai** (CEO)\nLast week, we announced that our Willow quantum chip achieved a major breakthrough, running an algorithm 13,000 times faster than one of the world's best supercomputers. The result is verifiable, paving the way to future practical applications. Speaking of quantum, let me congratulate Michel Debray, our Chief Scientist for Quantum Hardware. He received a Nobel in Physics for early research he did in the 1980s. Three Nobels awarded to current Googlers in two years. Incredible. Third, our products and platforms. We are bringing AI to more people and developers than anyone else. In July, we announced that we processed 980 trillion monthly tokens across all our surfaces. We are now processing over 1.3 quadrillion monthly tokens, more than 20x growth in a year. Phenomenal.\n\n**Sundar Pichai** (CEO)\nThis quarter, we took big steps to reimagine Chrome as a browser powered by AI through deep integrations with Gemini and AI mode in Search, with more agentic capabilities coming soon. In August, at Made by Google, we unveiled our Pixel 10 series of devices. They are the first with our most powerful chip designed to run on Gemini Tensor G5. They are our best-reviewed devices ever. Last week, we launched Android XR, our new operating system, with Samsung's Galaxy XR device. It brings new ways to use headsets and glasses with Gemini at the core. Now, turning to highlights from Search. AI is driving an expansionary moment for Search. As people learn what they can do with our new AI experiences, they are increasingly coming back to Search more. Search and its AI experiences are built to highlight the web, sending billions of clicks to sites every day.\n\n**Sundar Pichai** (CEO)\nDuring the Q2 call, we shared that overall queries and commercial queries continue to grow year over year. This growth rate increased in Q3, largely driven by our AI investments in Search, most notably AI overviews and AI mode. Let me dive into the momentum we are seeing. As we have shared before, AI overviews drive meaningful query growth. This effect was even stronger in Q3 as users continue to learn that Google can answer more of their questions. It is particularly encouraging to see the effect was more pronounced with younger people. We are also seeing that AI mode is resonating well with users. In the U.S., we have seen strong and consistent week-over-week growth in usage since launch, and queries doubled over the quarter. Over the last quarter, we rolled out AI mode globally across 40 languages in record time.\n\n**Sundar Pichai** (CEO)\nIt now has over 75 million daily active users. We shipped over 100 improvements to the product in Q3, an incredibly fast pace. Most importantly, AI mode is already driving incremental total query growth for Search. Philipp will talk more about monetization and share how AI is helping people connect with businesses and shop on Search. Next, Google Cloud. Our complete enterprise AI product portfolio is accelerating growth in revenue, operating margins, and backlog. In Q3, customer demand strengthened in three ways. One, we are signing new customers faster. The number of new GCP customers increased by nearly 34% year over year. Two, we are signing larger deals. We have signed more deals over $1 billion through Q3 this year than we did in the previous two years combined. Third, we are deepening our relationships.\n\n**Sundar Pichai** (CEO)\nOver 70% of existing Google Cloud customers use our AI products, including Banco BV, Best Buy, and Fairprice Group. As we scale, we are diversifying revenue. Today, 13 product lines are each at an annual run rate over $1 billion. We are improving operating margin with highly differentiated products built with our own technology. This deep product differentiation starts with our AI infrastructure. We have a decade of experience building AI accelerators and today offer the widest array of chips. This leadership is winning customers like Hetsia Healthcare, LG AI Research, and Macquarie Bank. It is why nine of the top 10 AI labs choose Google Cloud. We are also the only cloud provider offering our own leading generative AI models, including Gemini, Imagen, Veo, Chirp, and Lyria. Adoption is rapidly accelerating. In Q3, revenue from products built on our generative AI models grew more than 200% year over year.\n\n**Sundar Pichai** (CEO)\nOver the past 12 months, nearly 150 Google Cloud customers each processed approximately 1 trillion tokens with our models for a wide range of applications. For example, WPP is creating campaigns with up to 70% efficiency gains. Swarovski has increased email open rates by 17% and accelerated campaign localization by 10 times. Earlier this month, we launched Gemini Enterprise, the new front door for AI in the workplace, and we are seeing strong adoption for agents built on this platform. Our packaged enterprise agents in Gemini Enterprise are optimized for a variety of domains, are highly differentiated, and offer significant out-of-box value to customers. We have already crossed 2 million subscribers across 700 companies. Next, YouTube. In the living room, YouTube has remained number one in streaming watch time in the U.S. for more than two years, according to Nielsen.\n\n**Sundar Pichai** (CEO)\nLast month marked YouTube's first time as a live NFL broadcaster. This exclusive global broadcast, live from Brazil, drew more than 19 million fans and set a new record for most concurrent viewers of a live stream on YouTube. YouTube Shorts also continues to perform well. In the U.S., Shorts now earn more revenue per watch hour than traditional in-stream on YouTube. At our Made on YouTube event, we rolled out a number of AI-powered features that are helping creators supercharge creation and build their businesses. AI is now streamlining the entire content creation workflow from generative video tools and more efficient editing to AI-powered insights that help creators optimize their channels. We are also using AI to expand monetization, automatically identifying products to make their videos more shoppable. Philipp will discuss in more detail. Finally, Waymo.\n\n**Sundar Pichai** (CEO)\nNext year, Waymo aims to open service in London, and they are working to bring service to Tokyo. They have also announced expansions to Dallas, Nashville, Denver, and Seattle, and secured permission to operate fully autonomously at San Jose and San Francisco airports. Autonomous testing continues to scale in New York City. The new Waymo for Business allows enterprises to offer Waymo as a work travel option. We launched Waymo Teens accounts in Phoenix this summer. We are pleased to see usage steadily increase with positive feedback from teens and their parents alike. Waymo's growth and momentum are strong, and 2026 is shaping up to be an exciting year. Overall, a milestone quarter. The incredible work of our teams is driving momentum across the board, and our leadership in AI positions us so well for the opportunity ahead.\n\n**Sundar Pichai** (CEO)\nI want to thank all of our partners and our employees for their hard work and an excellent Q3. With that, I'll turn it over to Philipp.\n\n**Philipp Schindler** (SVP and Chief Business Officer)\nThanks, Sundar, and hello, everyone. I'll quickly cover performance for Google Services for the quarter, then structure the rest of my remarks around the great progress we're delivering across Search, Ads, YouTube, and partnerships. Google Services revenues were $87 billion for the quarter, up 14% year-on-year, driven by accelerated growth in Search and YouTube, partially offset by year-on-year decline in network revenues, adding some further color to our results. The 15% increase in Search and Other was led by growth across all major verticals, with the largest contributions from retail and financial services. YouTube saw similar performance across verticals. Its 15% growth in advertising revenues was driven by direct response, followed by brand. Starting with Search and Other revenues, which delivered over $56 billion in revenue for the quarter. As Sundar mentioned, AI is driving an expansionary moment and transforming how people use Google Search.\n\n**Philipp Schindler** (SVP and Chief Business Officer)\nOur investments in new AI experiences, such as AI overviews in AI mode, continue to drive growth in overall queries, including commercial queries, creating more opportunities for monetization. These AI experiences are enhancing how people connect with businesses and shop on Search. We recently added shopping capabilities in AI mode, which now help people shop conversationally in Search, and we expanded try-on capabilities to more clothing items, now available to anyone in the U.S. Lastly, we're making it easier for consumers to benefit from deals through new loyalty offerings, like personalized annotations on organic results and ads. Looking at monetization, businesses can now tap into our most powerful AI search experiences. Using our most advanced AI models, we can understand and predict intent like never before, unlocking entirely new commercial pathways to provide valuable new consumer connections and helping us monetize even more efficiently.\n\n**Philipp Schindler** (SVP and Chief Business Officer)\nRolled out globally in September, AI Max in Search is already used by hundreds of thousands of advertisers, currently making it the fastest-growing AI-powered Search Ads product. In Q3 alone, AI Max unlocked billions of net new queries. By delivering the most relevant ad across surfaces and matching advertisers against additional queries they weren't reaching before, AI Max helps advertisers discover new customers at the exact moment they need their product or service. Kayak, for example, looked to grow conversions while staying within their ROAS goals. After turning on AI Max in Search, they grew the conversion value by 12% in early tests. We continue to infuse generative AI capabilities at every step of the marketing process. We rolled out Imagen for AssetStudio and Product Studio, helping businesses produce more and better creatives. On the measurement front, we enriched the model supporting Meridian, our marketing mix model, with additional variables.\n\n**Philipp Schindler** (SVP and Chief Business Officer)\nMore granular reporting in Performance Max is making bidding more effective. Financial services company SoFi has been using Performance Max to meet its ambitious growth targets and helped drive a 39% improvement in its conversion volume year over year. Moving to YouTube, where we saw accelerated revenue growth, our recommendation systems are driving robust watch time growth in our key monetization areas, like Shorts and Living Room. As we leverage Gemini models, we're seeing further discovery improvement. On direct response, we're excited about the growth in revenue we're seeing, especially from small and medium advertisers adopting Demand Gen. We also improved performance on Demand Gen, with over 100 launches helping to increase conversion value by more than 40% for advertisers using target-based bidding on YouTube. The retail vertical continues to lead our growth on YouTube, with Demand Gen helping us further monetize shopping-related categories.\n\n**Philipp Schindler** (SVP and Chief Business Officer)\nLooking at the Living Room, our long-term bet, more advertisers are adopting interactive direct response ads, leading to an annual revenue run rate exceeding $1 billion globally for this format. For our viewers, we continue to give fans greater access across sports while tapping into the best of YouTube's product innovation and creator-led content. Sundar mentioned that we expanded our NFL partnership with our first-ever exclusive global broadcast of an NFL game. Brands loved the opportunity, and we sold all our ad inventory within a couple of weeks. Looking at creators, a significant force behind a thriving YouTube creator economy is the collaboration between creators and brands. Tools like direct linking to deals, websites, and Shorts, and swappable brand segments in long form will soon help creators show how they deliver great value for brands.\n\n**Philipp Schindler** (SVP and Chief Business Officer)\nThanks to a collaboration with Dude Perfect, Comcast Xfinity drove an 8% search lift, beating other Xfinity ads' recall lift on Shorts by 34%. At the same time, it decreased the cost per lifted user by 50% when compared to the next most efficient ad. We continue to invest in AI-powered features that are helping creators supercharge creation and build their businesses. With VO3 integration and speech-to-song, creators go from idea to iteration quicker, and new channel insights help them better understand performance. Ending on YouTube with our subscriptions products, we're also seeing momentum with strong growth in offerings such as YouTube Music and Premium and YouTube TV. We're also applying Gemini internally to help us serve customers with increased speed, intelligence, and efficiency. Our sales teams use Gemini enriched with ads knowledge to streamline customer interactions.\n\n**Philipp Schindler** (SVP and Chief Business Officer)\nThis increased productivity by over 10%, led to hundreds of millions in incremental revenue, and frees up sellers to engage with more customers at a deeper, more strategic level. In our Customer Support division, Gemini-powered solutions have managed over 40 million customer sessions so far this year and resolved hundreds of thousands of customer inquiries. We're just getting started. As always, I'll wrap with the progress we're seeing across partnerships, where customers tap into the strength and breadth of Google's products to accelerate their transformation. Revolut, the global financial services company, leverages Google Cloud's Vertex AI platform and Gemini models to help power its advanced customer service chatbot, develop new hyper-personalized financial products, and offer predictive insights. Revolut is also increasing its presence on YouTube, adopting VO3 for personalized creatives, making Google a key ads partner for delivering growth and launching new markets.\n\n**Philipp Schindler** (SVP and Chief Business Officer)\nIn closing, I'd like to thank Googlers everywhere for their contributions to our success, and as always, to our customers and partners for their continued trust. Of course, a huge thanks to all of you as we celebrate 25 years of Google Ads. Anat, over to you.\n\n**Anat Ashkenazi** (CFO)\nThank you, Philipp. My comments will focus on year-over-year comparisons for the third quarter, unless I state otherwise. I will start with results at the Alphabet level and will then cover our segment results. I'll end with some commentary on our outlook for the fourth quarter of 2025. We had an outstanding quarter in Q3, continuing the strong momentum we've had throughout the year, delivering double-digit revenue growth across Search and YouTube advertising, subscriptions, platforms and devices, and Google Cloud. Consolidated revenue reached $102.3 billion, a 16% year-over-year increase, or 15% in constant currency. Total cost of revenue was $41.4 billion, up 13%. Tech was $14.9 billion, up 8%. Other cost of revenues was $26.5 billion, up 16%, with the increase primarily driven by content acquisition costs, largely for YouTube, followed by depreciation and other technical infrastructure operations costs. Total operating expenses increased 28% to $29.7 billion.\n\n**Anat Ashkenazi** (CFO)\nR&D expenses increased by 22%, driven by compensation and depreciation expenses related to our AI efforts. Sales and marketing expenses were flat. G&A expenses increased meaningfully, primarily due to the $3.5 billion charge related to the European Commission fine mentioned in the earnings press release. Operating income increased 9% this quarter to $31.2 billion, and operating margin was 30.5%. Excluding the EC fine, operating income increased 22%, and operating margin was 33.9%. Operating margin benefited from strong revenue growth and continued efficiencies in our expense space, offset by the legal charge and a significant increase in depreciation expense. Other income and expenses were $12.8 billion, primarily due to unrealized gains in our non-marketable equity securities portfolio. Net income increased 33% to $35 billion, and earnings per share increased 35% to $2.87.\n\n**Anat Ashkenazi** (CFO)\nWe generated free cash flow of $24.5 billion in the third quarter and $73.6 billion for the trailing 12 months. Free cash flow in Q3 benefited from strong operating cash flow and recent tax changes regarding the timing of when research and development costs are expensed and assets are depreciated. This was partially offset by higher capex. We ended the quarter with $98.5 billion in cash and marketable securities. Turning to segment results, Google Services revenues increased 14% to $87.1 billion, reflecting strength in Google Search, YouTube advertising, and subscriptions. Google Search and other advertising revenues increased by 15% to $56.6 billion, representing another robust quarter with continued growth across all major verticals, with the largest contributions from retail and financial services. YouTube advertising revenues increased 15% to $10.3 billion, driven by direct response advertising, followed by brand. Network advertising revenues of $7.4 billion were down 3%.\n\n**Anat Ashkenazi** (CFO)\nSubscriptions, platforms, and devices revenues increased 21% this quarter to $12.9 billion, driven by very strong growth in both YouTube and Google One subscriptions. Google Services operating income increased 9% to $33.5 billion. Operating margin declined year-over-year to 38.5%, as healthy revenue growth and continued efficiencies in our expense space were offset by the impact of the European Commission fine, which was fully reflected in the Google Services segment. Turning to the Google Cloud segment, which again delivered very strong results this quarter, as Cloud continued to benefit from our enterprise AI-optimized stack, including our own custom TPUs and our industry-leading AI models. Cloud revenue increased by 34% to $15.2 billion in the third quarter, driven by strong performance in Google Cloud Platform, which continued to grow at a rate that was much higher than Cloud's overall revenue growth rate.\n\n**Anat Ashkenazi** (CFO)\nGoogle Cloud Platform's growth was driven by enterprise AI products, which are generating billions in quarterly revenue. We had strong growth in enterprise AI infrastructure and enterprise AI solutions, which benefited from demand for our industry-leading models, including Gemini 2.5. Core Google Cloud Platform was also a meaningful contributor to growth. We had double-digit growth in Workspace, which was driven by an increase in average revenues per seat and the number of seats. Cloud operating income increased by 85% to $3.6 billion, and operating margin increased from 17.1% in the third quarter last year to 23.7% this quarter. The expansion in Cloud operating margin was driven by strong revenue performance and continued efficiencies in our expense space, partially offset by higher technical infrastructure usage costs, which includes depreciation expense and other operations costs, such as energy.\n\n**Anat Ashkenazi** (CFO)\nGoogle Cloud's backlog increased 46% sequentially and 82% year-over-year, reaching $155 billion at the end of the third quarter. The increase was driven primarily by strong demand for enterprise AI. As Sundar mentioned earlier, Cloud has signed more billion-dollar deals in the first nine months of 2025 than in the past two years combined. In Other Bets, revenues were $344 million, and operating loss was $1.4 billion in the third quarter. Within Other Bets, we continue to allocate more resources to businesses like Waymo, where we see opportunities to create substantial value. With respect to CapEx, in the third quarter, our CapEx was $24 billion. The vast majority of our CapEx was invested in technical infrastructure, with approximately 60% of that investment in servers and 40% in data centers and networking equipment.\n\n**Anat Ashkenazi** (CFO)\nIn Q3, we returned capital to shareholders through repurchases of stock of $11.5 billion and dividend payments of $2.5 billion. Turning to our outlook, I would like to provide some commentary on factors that will impact our business performance in the fourth quarter of 2025, as well as an updated outlook for CapEx for the year. First, in terms of revenues, we're pleased with the overall momentum of our business. At the current spot rates, we could see an FX tailwind to our revenues in Q4. However, the volatility in exchange rates could affect the impact of FX on Q4 revenues. As for our segments, in Google Services, year-over-year comparisons in advertising will be negatively impacted by the strong spend on U.S. elections in the fourth quarter of 2024, particularly on YouTube.\n\n**Anat Ashkenazi** (CFO)\nIn Cloud, demand for our products remains high, as evidenced by the accelerating revenue growth and the $49 billion sequential increase in Cloud backlog in Q3. In GCP, we see strong demand for enterprise AI infrastructure, including TPUs and GPUs, enterprise AI solutions driven by demand for Gemini 2.5 and our other AI models, and core GCP infrastructure and other services, such as cybersecurity and data analytics. As I've mentioned on previous earnings calls, while we have been working hard to increase capacity and have improved the pace of server deployments and data center construction, we still expect to remain in a tight demand-supply environment in Q4 and 2026. Moving to investments, we're continuing to invest aggressively due to the demand we're experiencing from Cloud customers, as well as the growth opportunities we see across the company.\n\n**Anat Ashkenazi** (CFO)\nWe now expect capex to be in the range of $91 billion to $93 billion in 2025, up from our previous estimate of $85 billion, keeping in mind that the timing of cash payments can cause variability in the reported capex number. Looking out to 2026, we expect a significant increase in capex and will provide more detail on our fourth quarter earnings call. In terms of expenses, first, as I've mentioned on previous earnings calls, the significant increase in our investments in technical infrastructure will continue to put pressure on the P&L in the form of higher depreciation expenses and related data center operations costs, such as energy. In the third quarter, depreciation increased $1.6 billion year-over-year to $5.6 billion, reflecting a growth rate of 41%. Given the overall increase in capex investments, we expect the growth rate in depreciation to accelerate slightly in Q4.\n\n**Anat Ashkenazi** (CFO)\nSecond, we expect sales and marketing expenses to be more heavily weighted to the end of the year, in part to support product launches and the holiday season. Q3 was a strong quarter, and we're excited with the adoption of our AI products, helped by a rapid pace of innovation and great execution by our teams. This translated into strong momentum in Search, YouTube Ads, subscription platforms and devices, and Cloud, resulting in our first $100 billion-plus quarter. Now, Sundar, Philipp, and I will now take your questions.\n\n**Operator**\nThank you. As a reminder, to ask a question, you will need to press star one on your telephone. To prevent any background noise, we ask that you please mute your line once your question has been stated. Our first question comes from Brian Nowak with Morgan Stanley. Your line is now open.\n\n**Brian Nowak** (Managing Director)\nGreat. Thanks for taking my questions, everyone. The first one, maybe for Philipp or Sundar, it's on agentic e-commerce and agentic travel. There's a lot of external Wall Street discussion about agentic e-commerce potentially monetizing at a lower rate than Search. The question is, what factors are you most focused on to sort of ensure a smooth transition for your Search business and for your advertisers as you move over to a more agentic world? The second one, Sundar, is on Waymo. How far are we from an integration of Waymo into more of the core Gemini capabilities and the users in the platform, taking your user data of where I'm going, what hotel I'm staying at, what airport I'm staying at, and having to integrate that into Waymo so you can actually have users use their profiles to pre-schedule Waymos? How far off is that? What do we have to do?\n\n**Philipp Schindler** (SVP and Chief Business Officer)\nHello, Brian. Great question. This is old early, but we see agentic experiences really as additive to the way people seek information. It helps us answer people's tough questions. It helps people get stuff done, and it helps businesses in the process. We're working on multiple agentic experiences across key verticals, such as travel, commerce, shopping, and so on. We're paying a lot of attention to creating a seamless user experience, but also to the fact that we need to integrate different partner ecosystems in a way that it creates value for them. By the way, we're also working closely with a lot of our partners on the other side through our Cloud services to improve their own agentic experiences. Maybe we go a little deeper on the shopping side, where we actually use AI already very actively to improve the shopping experience.\n\n**Philipp Schindler** (SVP and Chief Business Officer)\nAs you know, we launched a more visual experience on AI mode that gives people a much more intuitive conversational way to shop. You can simply describe what you're looking for now, like the way you would talk to a friend, and it will show you the visual shopping results. We think about building an agentic shopping future, and it has to be one, again, that benefits both users and merchants here. You know that at AIO, we also introduced new agentic checkout, which will let shoppers use agentic AI to buy products from merchant sites and so on. We have a partnership with PayPal to help merchants build agentic commerce experiences. We have a new open protocol for agent-to-agent transactions, and so on and so on.\n\n**Sundar Pichai** (CEO)\nBrian, on Waymo, a great question. I was reflecting, I think, on the exact same topic. I'm scheduled to meet with the team to do a review on it in a few weeks out. It is an exciting time. Waymo clearly is scaling up, particularly in 2026. I think the possibility, as you said, of Gemini, particularly with the multimodal experience, as well as services like YouTube, I think there's a real opportunity to make the in-car experience dramatically better. Definitely something we are excited about, and you'll see newer experiences in 2026, for sure.\n\n**Brian Nowak** (Managing Director)\nGreat. Thank you both.\n\n**Operator**\nOur next question comes from Doug Anmuth with JPMorgan. Your line is now open.\n\n**Doug Anmuth** (Analyst)\nThanks for taking the questions. Philipp, maybe you can just talk more about some of the drivers of the core search strength. I guess, in particular, when you think about AI overviews and AI mode, we know that query growth is accelerating, but can you help us understand from there kind of what happens in terms of clicks per query and conversion rates and pricing in these AI-driven search formats? Anat, can you talk about where you see opportunities in the core cost space as you look to make room to absorb the rapid growth in infrastructure and depreciation going forward? Thanks.\n\n**Philipp Schindler** (SVP and Chief Business Officer)\nLet me give you a bit of vertical color first. In Q3, search and other revenues, again, delivered growth across all major verticals, as we said. It was from retail and financial services. Health care was also a contributor to the growth here. Our new AI experiences, you mentioned them, AI overviews, AI mode, continue to drive growth in overall queries, including commercial queries, really creating more opportunities for monetization. AI overviews are scaling up and are working for our entire user base. We're now scaled to over 2 billion users here, and we're continuing to expand ads in AI overviews in English to more countries across desktop, mobile, and so on. As I've shared before, for AI overviews, even at our current baseline of ads, below and within the AI's response, overall, we see the monetization at approximately the same rate.\n\n**Philipp Schindler** (SVP and Chief Business Officer)\nOver time, we're excited about the opportunity of richer experiences in AI mode and AI overviews to basically open up then the opportunity for also much richer placements. I think, as I've said on a prior call, we manage the business to drive great outcomes for our users and an attractive ROI for our advertisers. We don't really manage to pay clicks and CPC targets. As you will see in the 10-Q, paid clicks were up 7% year-on-year, and CPCs were up 7% year-on-year.\n\n**Anat Ashkenazi** (CFO)\nDoug, to your question around where else can we see more opportunity for efficiency and productivity, I think you heard me say before, this is not a one-time type of effort, but rather an ongoing way in which we manage the business. The key here is that the more we drive productivity across our business, the more we can invest in the business for growth and obviously continue to drive improvement in the P&L. Some of the areas are things that you've heard us talk about in the past, such as moderating the pace of headcount growth, optimizing our real estate footprint, but also, as we invest more and more in our technical infrastructure, ensuring that we are optimizing that build-out and the overall technical infrastructure we have.\n\n**Anat Ashkenazi** (CFO)\nYou know that a lot of the data centers, for example, that we build ourselves, so they're optimized, and we make sure we do them in the most efficient way. Sundar mentioned on one of the previous calls the productivity associated with leveraging AI for Google. There's the example, the % of code, now nearly half of all code generated by AI. That's a way for us to leverage AI to drive further productivity across the business. Obviously, we always look at making sure that when we provide services or products, we get the right economics and the right value for what we provide. One good example is Shorts, which has a lower revenue share than InStream, that helps to improve some of our gross margins. This is an effort we have ongoing. I've mentioned in the past that we have headwind with depreciation, obviously increasing alongside our capex increase.\n\n**Anat Ashkenazi** (CFO)\nWe have efforts across the organization to ensure we run the business in the most disciplined and productive way while continuing to invest for future growth.\n\n**Doug Anmuth** (Analyst)\nThank you both.\n\n**Operator**\nOur next question comes from Eric Sheridan with Goldman Sachs. Your line is now open.\n\n**Eric Sheridan** (Managing Director)\nThank you so much for taking the questions. Maybe two, if I could. Sundar, when you think about your custom silicon efforts across the organization, can you reflect a little bit about the opportunity set you see with each passing generation of custom silicon, both in terms of driving operating efficiencies inside the organization and potentially increased monetization efforts around those outside of the organization? Second question would be for Philipp. Obviously, we can see the YouTube advertising revenue number in the reported results. Can you reflect a little bit about the scaling of the subscription side of YouTube offerings and how the two parts in together maybe represent an interesting framework in thinking about the monetization side of YouTube increasingly being a mix of both ads and subscription? Thank you.\n\n**Sundar Pichai** (CEO)\nEric, overall, I would say we are seeing a substantial demand for our AI infrastructure products, including TPU-based and GPU-based solutions. It is one of the key drivers of our growth over the past year. I think on a going-forward basis, we continue to see very strong demand, and we are investing to meet that. I do think a big part of what differentiates Google Cloud, effectively, we have taken a deep full-stack approach to AI, and that really plays out. We are the only hyperscaler who is really building offerings on our own models, and we are also highly differentiated on our own technology. To your question, I think that does give us the opportunity to continue driving growth in operating margins in Cloud, as we have done in the past.\n\n**Sundar Pichai** (CEO)\nI think from a revenue set, the infrastructure portion of our business will be a growth driver looking ahead as well.\n\n**Philipp Schindler** (SVP and Chief Business Officer)\nTo the second part of your question, just taking a quick step back, we often describe YouTube's business as a flywheel. Obviously, it first all starts with the creators, and we have significantly invested here to be the place that YouTube creators really call their home. That's a big piece of it, the number one piece. Viewers, of course, YouTube has billions of monthly logged-in users, and every day people watch billions of hours of video. We talked about how our recommendation systems are driving robust watch time growth, and so on. On the monetization side, YouTube's business is really powered, I would say, on it. Let's call it a twin-engine monetization strategy, combining its advertising business and its growing subscription services. Both YouTube ads and subscriptions saw strong growth this quarter.\n\n**Philipp Schindler** (SVP and Chief Business Officer)\nLooking at YouTube Music and Premium, users are on average delivering more value to creators, to music media partners, and YouTube itself than even ad-supported users do. In other words, on average, a YouTube Music and Premium subscriber generates a meaningful high gross profit than if they were simply an ad-supported user. Fans come from all over the world. You know this, and this engagement through ads and subscription generates YouTube's revenues and funds what I started with, these creators here. This then drives more viewership and engagement and so on. That's the flywheel. Our priority continues like this growth cycle. We're happy with this twin-engine monetization strategy.\n\n**Operator**\nOur next question comes from Mark Schmalich with Bernstein. Your line is now open.\n\n**Mark Shmulik** (Senior Analyst)\nYes, thanks for taking the questions. Sundar, with the strong adoption of Gemini AI mode and overviews across the user base, are there any meaningful differences to call out around the behavior and depth of engagement for those users across the entire Google ecosystem? Philip, I know we kind of ask this most quarters, but I'm curious with some of the adoption you've seen around AI overviews and mode, how you see the economics of search evolving with the higher commercial and total query volume and how it compares against the incremental cost to deliver these results. Thank you.\n\n**Sundar Pichai** (CEO)\nMark, look, I think obviously AI overviews are a natural part of a Google experience, and engagement is very, very high. I would say AI mode, you have varied cohorts. There are people who are casual users who are checking it out, but there is a core group which really likes AI mode and is passionate about it. You see the early adopters. The product is resonating very strongly, and they are seeking it out. I think that's how I would highlight the difference. With Gemini, again, a set of engaged user bases who are seeking out the product and so on.\n\n**Sundar Pichai** (CEO)\nAcross the board, I think the trajectory has been we are definitely seeing in each of those use cases a set of early adopters and then more people coming in, and the people who are using it continue to use it more over time and report high user satisfaction. I would say the underlying product metrics are pretty encouraging to see as well.\n\n**Philipp Schindler** (SVP and Chief Business Officer)\nLooking to the second part of your question, I think we covered before, Sundar covered the query development. As I've just said before, for the AI overviews, even at our current baseline of ads, whether above, below, and within the AI response, overall we see the monetization at approximately the same rate. This is a great baseline for further innovation. We talked about this. We're excited about where this can go. On the AI mode side, we're testing ads in AI mode, and we'll continue to test and learn before we expand this any further. This in combination with what we mentioned about the commercial query overall development, I think we're in a good place here.\n\n**Philipp Schindler** (SVP and Chief Business Officer)\nYou could also argue that on queries that historically have not been well monetized, we think there is a potential opportunity here where you can obviously imagine that we can build this out with smart AI integration.\n\n**Operator**\nOur next question comes from Michael Nathanson with MoffettNathanson. Your line is now open.\n\n**Michael Nathanson** (Analyst)\nThanks. I have two, one for Philipp, one for Anat. Philipp, it's clear that when people use AI mode, the query length is much longer. Can you talk about how that longer length may be impacting your abilities to drive ROAS and what you're seeing in terms of the early benefits of maybe longer query length? Anat, you came to Alphabet from a pharmaceutical company. You've been there more than a year. Can you talk a bit about how you're working to look at ROIC internally and what early signs are you seeing that give you confidence that this spending is really driving better returns longer term? Thanks.\n\n**Philipp Schindler** (SVP and Chief Business Officer)\nLook, as Sundar shared, AI mode now has over 75 million daily active users in the U.S., and we see strong and consistent week-over-week growth in usage since launch. The queries doubled over the quarter. As I also mentioned, we're testing ads in AI mode. We'll continue to test before we expand any further. It's really too early to tell and go into any of the details of that testing.\n\n**Michael Nathanson** (Analyst)\nOK.\n\n**Anat Ashkenazi** (CFO)\nYes, and the question related to ROI and how we look at just overall our business and where do we see early signs that are encouraging. First, I would say it's not just early signs because we're seeing returns, obviously, in the Cloud business. You've heard us talk about the fact that we already are generating billions of dollars from AI in the quarter. Across the board, we have a rigorous framework and approach by which we evaluate these long-term investments that are meant to do two things. One is to ensure we build a resilient growth profile for the company, but also that we meet the demand of the customers that we have here in the more near and midterm. We look at it across the business.\n\n**Anat Ashkenazi** (CFO)\nWe evaluate the potential return for each one of them, whether it's in Cloud, and I think that's more visible, obviously, externally, given that you see the revenue generated and the fact that we're unable to meet at this point customer demand. We have more demand than we have supply. In our ads business, you see the fact that we're investing to transform search, as you heard from Philipp and Sundar with AI overviews and AI mode. We're excited to see what our investments are, how the investments are helping advertisers as well. YouTube, where it's helping power recommendations.\n\n**Anat Ashkenazi** (CFO)\nWhen we make a decision on investment in the long term, we go through a very rigorous process of assessing what the return could be and over what time frame we will see that return to give us the high level of confidence to then invest and make those investments for the long term. It's a very rigorous approach.\n\n**Michael Nathanson** (Analyst)\nThanks.\n\n**Operator**\nOur next question comes from Ross Sandler with Barclays. Your line is now open.\n\n**Ross Sandler** (Analyst)\nGreat. About 20% of Google's search queries are commercial historically. You've talked a bunch on this call about how AI overviews are kind of expanding the breadth of queries. Could you talk about how new products on the monetization side, like AI Max, are potentially increasing the % of commercial queries?\n\n**Philipp Schindler** (SVP and Chief Business Officer)\nAI Max, and I mentioned this in my call before, improves the ability for advertisers to target a wider range of queries. Separately, there is the question of whether queries actually increase with AI mode. Sundar actually talked about it and mentioned the opportunity that he sees here. I think it's important to separate those two things. I personally also see, this is what I just said in my last remark, that I think over time there's an opportunity to actually take, let's say, queries that are not fully commercial but could have an adjacent commercial relationship to basically expand this into more attractive ads offerings while really creating a really interesting user experience at the same time.\n\n**Sundar Pichai** (CEO)\nThe only thing I would add is just stepping back broadly, I think AI overviews and AI mode are dramatically improving search. We can see it in user satisfaction, user quality, all our metrics. They are universal in nature. They apply across the universality of human needs. I think we are seeing it in breadth, and naturally, over time, that'll apply to commercial categories as well.\n\n**Operator**\nOur next question comes from Ken Goralski with Wells Fargo. Your line is now open.\n\n**Ken Gawrelski** (Analyst)\nThank you very much. Two questions, please. First, it appears more and more clear that all the new modes, whether at Google with Gemini overview, AI overviews, AI mode, even ChatGPT, is growing the addressable market for engagement in search-like behavior. Could you talk about what gives you confidence that it will also grow the addressable market for marketing activity and overall revenue associated with that behavior? That's question one. Question two is just more about, as you think about AI mode, AI overviews, and traditional Google Search, how do you think, do you see a world in 12 to 24 months those all coexist? Does the user eventually pick what mode they want? Does the algorithm pick the mode? Could you talk a little bit about how you think that will progress over the next 12 to 24 months? Thank you very much.\n\n**Sundar Pichai** (CEO)\nKen, thanks. I think it's a dynamic moment, and I think we are meeting people in the moment with what they are trying to do. Obviously, search is evolving. Between AI overviews and AI mode, I think we are able to kind of give that range of experience for people in this moment. Over time, you can expect us to make the experiences simpler in a way that, just like we did universal search many years ago, we may have done text search, image search, video search, etc., and then we kind of brought it together as universal search. You will see evolutions like that. I think we want to be sensitive to making sure we are meeting the users in terms of what they are looking for. I think Gemini allows us to build a more personal, proactive, powerful AI assistant for that moment.\n\n**Sundar Pichai** (CEO)\nI think having the two surfaces, search and Gemini, allows us to really serve users across the breadth of their needs. Over time, we will thoughtfully look for opportunities to make the experience better for users. To the first part, I would broadly say, as I do think we've been consistently saying for a while now, this is an expansionary moment, and we are seeing people engage more. I think when they do that, naturally, a portion of that information for users, those journeys are commercial in nature. I would expect that to play out over time as well.\n\n**Ken Gawrelski** (Analyst)\nThank you.\n\n**Operator**\nOur last question comes from Justin Post with BAML. Your line is now open.\n\n**Justin Post** (Internet Analyst)\nGreat. Just a couple. Sundar, I think you mentioned Gemini 3 is coming. Maybe a comment on the pace of innovation in frontier models. Is there still just a tremendous amount of innovation, or is it slowing at all? You mentioned a number of large deals signed in the last nine months for Cloud, which is great. Any changes in the economics of these deals as far as long-term profitability? Anything we should be aware of? Thank you.\n\n**Sundar Pichai** (CEO)\nThanks, Justin. The first on the pace of frontier model research and development. Look, I think two things are both simultaneously true. I'm incredibly impressed by the pace at which the teams are executing and the pace at which we are improving these models. It also is true, at the same time, that each of the prior models you're trying to get better over is now getting more and more capable. I think both the pace is increasing, but sometimes we are taking the time to put out a notably improved model. I think that may take slightly longer. I do think the underlying pace is phenomenal to see. I'm excited about our Gemini 3.0 release later this year.\n\n**Sundar Pichai** (CEO)\nOn Cloud, I would point out, as a sign of the momentum, I think the number of deals greater than $1 billion that we signed in the first three quarters of this year are greater than the two years prior. We are definitely seeing strong momentum, and we are executing at pace. In terms of long-term economics, I would say that, again, us being a full-stack AI player and the fact that we are developing highly differentiated products on our own technology, I think will help us drive a good trajectory here, as you have seen over the past few years.\n\n**Justin Post** (Internet Analyst)\nGreat. Thank you.\n\n**Operator**\nThank you. That concludes our question and answer session for today. I'd like to turn the conference back over to Jim Friedland for any further remarks.\n\n**Jim Friedland** (Head of Investor Relations)\nThanks, everyone, for joining us today. We look forward to speaking with you again on our fourth quarter 2025 call. Thank you, and have a good evening.\n\n**Operator**\nThank you, everyone. This concludes today's conference call. Thank you for participating. You may now disconnect.",
      "fetched_at": "2026-02-04T15:37:22.039Z"
    },
    {
      "ticker": "GOOGL",
      "title": "Alphabet Inc. (GOOGL) Q2 FY2025 earnings call transcript",
      "published_date": "Jul 23, 2025, 4:30 PM EDT",
      "fiscal_year": "2025",
      "quarter": "Q2",
      "url": "https://finance.yahoo.com/quote/GOOGL/earnings/GOOGL-Q2-2025-earnings_call-338340.html",
      "content": "**Operator**\nWelcome everyone. Thank you for standing by for the Alphabet Second Quarter twenty twenty five Earnings Conference Call. At this time, all participants are in a listen only mode. After the speaker presentation, there will be a question and answer I would now like to hand the conference over to your speaker today, Jim Friedland, Head of Investor Relations. Please go ahead.\n\n**Jim Friedland** (Senior Director - IR)\nThank you. Good afternoon, everyone, and welcome to Alphabet's second quarter twenty twenty five earnings conference call. With us today are Sundar Pichai, Philip Schindler and Anat Ashkenazi. Now, I'll quickly cover the Safe Harbor. Some of the statements that we make today regarding our business, operations, and financial performance may be considered forward looking.\n\n**Jim Friedland** (Senior Director - IR)\nSuch statements are based on current expectations and assumptions that are subject to a number of risks and uncertainties. Actual results could differ materially. Please refer to our Forms 10 ks and 10 Q, including the risk factors. We undertake no obligation to update any forward looking statement. During this call, we will present both GAAP and non GAAP financial measures.\n\n**Jim Friedland** (Senior Director - IR)\nA reconciliation of non GAAP to GAAP measures is included in today's earnings press release, which is distributed and available to the public through our Investor Relations website located at abc.xyzinvestor. Our comments will be on year over year comparisons unless we state otherwise. And now I'll turn the call over to Sundar.\n\n**Sundar Pichai** (Director &amp; CEO)\nThanks, Jim. Good afternoon, everyone. Q two was a standout quarter for us with robust growth across the company. As you saw at IO, we are leading at the frontier of AI and shipping at an incredible pace. AI is positively impacting every part of the business, driving strong momentum.\n\n**Sundar Pichai** (Director &amp; CEO)\nThis quarter, search delivered double digit revenue growth. Our new search features continue to perform well. AI mode has launched in The US and India and is going well. While AI overviews now has over 2,000,000 monthly users across more than 200 countries and territories and 40 languages. I'll give some more details on search in a moment.\n\n**Sundar Pichai** (Director &amp; CEO)\nWe continue to see strong performance in YouTube as well as subscriptions, reflecting great momentum across these high growth businesses. In The US, Shorts now earn as much revenue per watch hour as traditional in stream on YouTube. And in some countries, it now even exceeds in stream straight. Cloud had another great quarter of strong growth in revenues, backlog, and profitability. Its annual revenue run rate is now more than $50,000,000,000.\n\n**Sundar Pichai** (Director &amp; CEO)\nWe are seeing significant demand for our comprehensive AI product portfolio. Of course, this is all possible because of the long term investments we have made in our differentiated full stack approach to AI. This spans AI infrastructure, world class research, models and tooling, and our products and platforms that brings AI to people all over the world. I'll briefly touch on the AI stack before turning to quarterly highlights. First, AI infrastructure.\n\n**Sundar Pichai** (Director &amp; CEO)\nWe operate the leading global network of AI optimized data centers and cloud regions. We also offer the industry's widest range of TPUs and GPUs along with storage and software built on top. That's why nearly all GenAI unicorns use Google Cloud. And it's why a growing number, including leading AI research labs like SAFE Superintelligence and Physical Intelligence use TPU specifically. Our AI infrastructure investments are crucial to meeting the growth and demand from cloud customers.\n\n**Sundar Pichai** (Director &amp; CEO)\nNext, world class AI research including models and tooling. We continue to expand our Gemini 2.5 family of hybrid reasoning models, which provide industry leading performance in nearly every major benchmark. In addition to improving our popular workhorse model Flash, we debuted an extremely fast flashlight version. We achieved gold medal level performance in the International Math Olympiad using an advanced version of Gemini with DeepTing. We can't wait to bring DeepTing to users soon.\n\n**Sundar Pichai** (Director &amp; CEO)\nWe have some of the best models available today at every price point. Our 2.5 models have been a catalyst for growth, and 9,000,000 developers have now built with Gemini. I also want to mention v o three, our state of the art video generation model. It's been a viral hit with people sharing clips created in the Gemini app and with our new AI filmmaking tool, Flow. Since May, over 70,000,000 videos have been generated using v o three.\n\n**Sundar Pichai** (Director &amp; CEO)\nAnd we recently introduced a feature in the Gemini app to turn photos into videos, which people absolutely love. It's also rolling out to Google Photos users starting today. Third, our products and platforms. We are bringing AI to all our users and partners through surfaces like Workspace, Chrome, and more. The growth in usage has been incredible.\n\n**Sundar Pichai** (Director &amp; CEO)\nAt IO in May, we announced that we processed 480,000,000,000,000 monthly tokens across our surfaces. Since then, we have doubled that number, now processing over 980,000,000,000,000 monthly tokens, a remarkable increase. The Gemini app now has more than 450,000,000 monthly active users, and we continue to see strong growth in engagement with daily requests growing over 50% from q one. In June alone, over 50,000,000 people used AI powered meeting notes in Google Meet. And powered by v o three, our new short video product in Workspace called Google Vets reached nearly 1,000,000 monthly active users.\n\n**Sundar Pichai** (Director &amp; CEO)\nThis month at Samsung Galaxy unpacked, we announced new Android and AI features that are available on Samsung's latest devices. And we are really pleased with the growth in subscriptions, which got a boost from our Google AI Pro and Ultra plans. Now some key highlights from Search, Cloud, YouTube, and Waymo for the quarter. First up, this is an incredibly exciting moment for Search. We see AI powering an expansion in how people are searching for and accessing information, unlocking completely new kinds of questions you can ask Google.\n\n**Sundar Pichai** (Director &amp; CEO)\nOverall queries and commercial queries on search continue to grow year over year, our new AI experiences significantly contributed to this increase in usage. We are also seeing that our AI features cause users to search more as they learn that search can meet more of their needs. That's especially true for younger users. Let me go deeper on our new search experiences. We know how popular AI overviews are because they are now driving over 10% more queries globally for the types of queries that show them, and this growth continues to increase over time.\n\n**Sundar Pichai** (Director &amp; CEO)\nAI overviews are now powered by Gemini 2.5, delivering the fastest AI responses in the industry. We also saw strong growth in the use of multimodal search, particularly the combination of lens of circle to search together with AI overviews. This growth was most pronounced among younger users. Our new end to end AI search experience, AI mode, continues to receive very positive feedback, particularly for longer and more complex questions. It's still rolling out, but already has over 100,000,000 monthly active users in The US and India.\n\n**Sundar Pichai** (Director &amp; CEO)\nWe plan to keep enhancing the AI mode experience for users by shipping great features fast. That includes our advanced research tool, deep search, and more personalized responses. Next, Google Cloud. We see strong customer demand driven by our product differentiation and our comprehensive AI product portfolio. Four stats show this.\n\n**Sundar Pichai** (Director &amp; CEO)\nOne, the number of deals over $250,000,000 doubling year over year. Two, in the first half of twenty twenty five, we signed the same number of deals over $1,000,000 that we did in all of 2024. Three, the number of new GCP customers increased by nearly 28% quarter over quarter, or more than 85,000 enterprises, including LVMH, Salesforce, and Singapore's DBS Bank now built with Gemini, driving a 35 x growth in Gemini usage year over year. Our models have served on our AI infrastructure, which offers industry leading performance and cost efficiency for both training and inference. Along with our AI accelerators, we introduced new innovations in storage, including anywhere cache, which improves inference latency by up to 70%, and rapid storage, which delivers a five x improvement in latency compared to leading hyperscalers.\n\n**Sundar Pichai** (Director &amp; CEO)\nIn addition, we have optimized AI software packages, including PyTorch and JAKs with full open source supports for various AI training and serving demands. We've also integrated AI agents deeply into each of our cloud products. Wayfair is leveraging our databases integrated with AI to streamline data pipelines and deliver more personalized customer experiences. Vatel is leveraging our Gemini powered data agents and BigQuery to review and act on product feedback more quickly. Target is using our Gemini powered threat intelligence and security operations agents to improve cybersecurity.\n\n**Sundar Pichai** (Director &amp; CEO)\nCab Gemini is utilizing our AI software engineering agents to deliver higher quality software faster by automating tasks from cogeneration to testing. And BBVA says Gemini and Google Workspace is saving employees nearly three hours per week by automating repetitive tasks. It's now rolling it out to 100,000 employees globally. We're also focused on building a flourishing AI agent ecosystem. We introduced an open source agent development kit, now has over a million downloads in less than four months.\n\n**Sundar Pichai** (Director &amp; CEO)\nWe also introduced AgentSpace, an open and interoperable enterprise chat search and agent platform. GardenFoodservice is bringing AgentSpace to its US employees, which is enabling better, more efficient decision making. And over 1,000,000 subscriptions have been booked for agent space ahead of its general availability. Turning now to YouTube. Nielsen data shows YouTube has led US streaming watch time for over two years.\n\n**Sundar Pichai** (Director &amp; CEO)\nA generation that grew up with YouTube on their devices is now increasingly watching their favorite creators and content on their televisions. That includes millions of sports fans too. Globally, they consume more than forty million hours of sports content on YouTube annually. And in September, we'll stream the NFL's first Friday game of the season live from Brazil. From sports to shorts, we now average over 200,000,000 daily views on YouTube shorts.\n\n**Sundar Pichai** (Director &amp; CEO)\nAI is helping improve our recommendations and auto dubbing, which translates to better returns for creators and brands by dramatically increasing the potential audiences they can reach. And today, we began rolling out whole draft of new AI tools for creators on YouTube Shorts. Finally, YouTube continues to diversify its subscription options, recently expanding its premium light offerings to 15 new countries with more to come. And lastly, Waymo continues to scale and expand to safely serve more riders in more places. Last month, Waymo launched in Atlanta, more than doubled its Austin service territory, and expanded its Los Angeles and San Francisco Bay Area territories by approximately 50%.\n\n**Sundar Pichai** (Director &amp; CEO)\nWaymo also launched teen accounts starting with riders aged 14 to 17 in Phoenix. Overall, great momentum here. The Waymo Driver has now autonomously driven over 100,000,000 miles on public routes, and the team is testing across more than 10 cities this year, including New York and Philadelphia. We hope to serve riders in all 10 in the future. As I said, a standout quarter.\n\n**Sundar Pichai** (Director &amp; CEO)\nA big thank you as always to our employees and partners for an amazing q two. Caleb, over to you.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nThanks, Sundar, and hello, everyone. I'll quickly cover performance for Google services for the quarter, then structure the rest of my remarks around the great progress we're delivering across search, ads, YouTube, and partnerships. Google services revenues were 83,000,000,000 for the quarter, up 12% year on year, driven by strong growth in Search and YouTube, partially offset by year on year decline in network revenues. To add some further color to our results, the 12% increase in Search and Other revenues was led by growth across all verticals with the largest contributions from retail and financial services. YouTube saw similar performance across verticals.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nIts 13% growth in advertising revenues was driven by direct response followed by brand. Starting with search and other revenues, which delivered over 54,000,000,000 in revenue for the quarter. Shifts like AI are what propels our industry forward. Gemini's native multimodality is helping bring the offline audio and visual world back into the online world, creating a number of opportunities for search. Let me share a few examples.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nTake visual course. Google Lens searches are one of the fastest growing query types on search and grew 70% since this time last year. The majority of Lens searches are incremental, and we're seeing healthy growth for shopping queries using Lens. And you can obviously take this to the next level by moving from image to video based capabilities like Search Live. And then there's Circle to Search, which is now on over 300,000,000 Android devices.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nWe've been adding capabilities to help people explore complex topics and ask follow-up questions without switching apps. For example, gamers can now use Circle to search while playing mobile games to see an AI overview or answers. And just last week, we brought a new agentic capability directly into search for all US users with AI powered calling to local businesses. Finally, shopping. Where in Q2, we introduced a virtual tryout experience for Search Labs users in The US.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nNow people can try billions of clothing products on themselves virtually. Early results and engagement have been extremely positive, articulate with Gen Z users, and we'll be bringing this functionality to all US users imminently. All these innovations are opening up completely new ways for people to use technology, bringing the offline world into the online world in ways that simply have not been possible before. Add in our amazing AI translation capabilities and just imagine the possibilities. People can access more content in the language and businesses, large and small, international or local, can reach even more customers.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nI'm excited about how all of these elements will come together and the opportunities ahead of us in Search. Moving to ads, where our strategy to reinvent the entire marketing process with AI is delivering value for our customers and our business. Last quarter, we introduced AI Max and Search, a new suite of AI powered features in existing search campaigns. Advertisers that activate AI Max and Search campaigns typically see 14% more conversions. On media buying, smart bidding exploration, the biggest update to bidding strategy in a decade, brings better performance to advertisers by allowing them to bid on less obvious but potentially higher value queries more often.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nCampaigns using smart bidding exploration see a 19% increase in conversions on average. Demand Gen continues to drive revenue growth and deliver measurable impact for our customers. As an example, Depop, Etsy's resale clothing marketplace, used the Shorts only demand gen campaign to drive new customers to the site. Shorts drove 80% higher brand lift and double click through rates versus benchmarks. On creatives, we launched Asset Studio using our latest models to help businesses, large and small, generate creative assets.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nSmall businesses benefit from top quality assets and deployment scaling capabilities, while larger businesses can go faster from proof of concept to launch and resize at lower costs. Over 2,000,000 advertisers now use Google's AI powered asset generation tools to run ads, a 50% increase on this time last year. Turning to YouTube, where we saw continued strong revenue growth driven by direct response followed by brand. YouTube creators are connected to the global zeitgeist and trusted by their audiences like no others. As part of BrandConnect, we launched Creator Partnership Hub, which allows brands to more easily work with the right creators and tap into cultural moments.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nWe introduced VIO3 photo to video and generative effects to Shorts, making content creation easier and offering unexplored avenues for creativity. We're seeing both the volume and the price of ads in Shorts increase, particularly in developed markets. The feed based nature of the product allows for more ad opportunities on average, and this growth is further supported by ad formats native to Shorts, AI powered ad creative resizing tools, improved ad targeting, and the rise in viewer engagement. McDonald's USA harnessed the influence of YouTube creators to ignite awareness for the Minecraft movie meal. It leveraged YouTube Shorts partnership ads to increase its reach, generating a 3.3 times higher view through rate than the industry benchmark.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nFinally, on CTV where the momentum continues. According to the gauge report by Nielsen, YouTube has been number one in streaming watch time in The U. S. For more than two years, hitting a record high of 12.8% of total TV viewing in June 2025. In the past twelve months, YouTube ads viewed on CTV screens drove over 1,000,000,000 conversions.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nWe saw strong growth in retail, thanks to CTV shopping ads, which allows viewers to shop directly via QR codes, helping us leverage direct marketing opportunities. As always, I'll wrap up with the momentum we're seeing in partnerships, where our customers increasingly recognize the strength and breadth of Google's ability to help them transform their business with AI. For instance, a new partnership with PayPal will improve the digital commerce experience for their merchants and customers. PayPal will expand its Google Cloud adoption for AI driven recommendations, transaction processing, and enhanced security. The partnership also broadens the availability and functionality of PayPal's payment services and capabilities across a range of Google products.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nIn closing, I'd like to thank Googlers everywhere for their contributions and commitment to our success and to our customers and partners for their continued trust. Anat, over to you.\n\n**Anat Ashkenazi** (EVP &amp; CFO)\nThank you, Philip. My comments will focus on year over year comparisons for the second quarter, unless I state otherwise. I will start with results at the Alphabet level and will then cover our segment results. I'll end with some commentary on our outlook for the second half of twenty twenty five. We had another solid quarter in Q2.\n\n**Anat Ashkenazi** (EVP &amp; CFO)\nConsolidated revenue of $96,400,000,000 increased by 14% or 13% in constant currency. Search and YouTube advertising, subscription platforms and devices and Google Cloud each had double digit revenue growth this quarter, reflecting strong momentum across the business. Total cost of revenue was $39,000,000,000 up 10%. Tech was $14,700,000,000 up 10% and other costs of revenue was $24,300,000,000 up 10% with the increase primarily driven by content acquisition costs largely for YouTube followed by depreciation. Total operating expenses increased 20% to $26,100,000,000 The biggest driver of growth was expense for legal and other matters which reflected the impact of $1,400,000,000 charge related to a settlement in principle of certain legal matters.\n\n**Anat Ashkenazi** (EVP &amp; CFO)\nR and D investments increased by 16%, primarily driven by increases in compensation and depreciation expenses. Sales and marketing expenses increased 5%, primarily reflecting an increase in advertising and promotional expenses. Operating income increased 14% this quarter to $31,300,000,000 and operating margin was 32.4. Operating margin benefited from strong revenue growth and continued efficiencies in our expense base, partially offset by the legal charge I mentioned earlier and a significant increase in depreciation expense. Net income increased 19% to $28,200,000,000 and earnings per share increased 22% to $2.31 We generated free cash flow of $5,300,000,000 in the second quarter and $66,700,000,000 for the trailing twelve months.\n\n**Anat Ashkenazi** (EVP &amp; CFO)\nFree cash flow in the second quarter was affected by sizable sequential increase in CapEx and cash tax payments as we make federal tax payments in the second quarter for both Q1 and Q2. We ended the quarter with $95,000,000,000 in cash and marketable securities. Turning to segment results. Google services revenues increased 12% to 82,500,000,000 reflecting strength in Google Search and YouTube advertising and subscriptions. Google Search and other revenues increased by 12% to $54,200,000,000 Search and other revenues delivered growth across all verticals with the largest contributions coming from retail and financial services.\n\n**Anat Ashkenazi** (EVP &amp; CFO)\nYouTube advertising revenues increased 13% to $9,800,000,000 driven by direct response advertising followed by brand. Network advertising revenue of $7,400,000,000 were down 1%. Subscription, platforms and devices revenues increased 20% to $11,200,000,000 primarily reflecting growth in subscription revenues. This growth was driven by YouTube subscription offerings followed by Google One with growth in paid subscriptions being the biggest driver of revenue growth. Google service operating income increased 11% to $33,100,000,000 Operating margin was flat year on year at 40.1% as healthy revenue growth and continued efficiency in our expense base were partially offset by the legal charge I mentioned earlier.\n\n**Anat Ashkenazi** (EVP &amp; CFO)\nTurning to the Google Cloud segment, which delivered very strong results this quarter. Revenues increased by 32% to $13,600,000,000 in the second quarter, reflecting growth in GCP across core and AI products at the rate that was much higher than cloud's overall revenue growth and growth in Google Workspace driven by an increase in average revenue per seat and the number of seats. Google Cloud operating income increased to $2,800,000,000 and operating margin increased from 11.3% to 20.7%. The expansion in cloud operating margin was driven by strong revenue performance and continued efficiencies in our expense base, partially offset by higher technical infrastructure usage costs, which includes the associated depreciation. As we ramp our AI investments, we continue to focus on driving improvements in productivity and efficiency to offset growth in technical infrastructure related expenses, particularly from higher depreciation.\n\n**Anat Ashkenazi** (EVP &amp; CFO)\nGoogle Cloud backlog increased 18% sequentially in Q2 and 38% year over year, reaching $106,000,000,000 at the end of the quarter. This growth was driven by strong demand for our products and services from both new and existing customers. As Sundar mentioned, we have signed multiple billion dollar plus deals in the first half of the year. As for Other in the second quarter revenue were $373,000,000 and operating loss was 1,200,000,000.0 Within Other Bets, we're allocating more resources to businesses like Queimo, where we see opportunities to create additional value. With respect to CapEx, in the second quarter, our CapEx was $22,400,000,000 The vast majority of our CapEx was invested in technical infrastructure with approximately two third of investments in servers and one third in data centers and networking equipment.\n\n**Anat Ashkenazi** (EVP &amp; CFO)\nIn Q2, we returned capital to shareholders through repurchase of stock of $13,600,000,000 and dividend payments of $2,500,000,000 Turning to our outlook. I would like to provide some commentary on several factors that will impact our business performance in the 2025 as well as an updated outlook for full year CapEx. First, in terms of revenues, we're pleased with the overall momentum we're seeing across the business. At current spot rates, we could see a tailwind to our revenue in Q3. However, volatility in exchange rates could affect the impact of FX on Q3 revenue.\n\n**Anat Ashkenazi** (EVP &amp; CFO)\nAs for our segments, in Google Services, advertising revenues in the 2025 will be affected by the following: the continued lapping of the strength we experienced in financial service verticals throughout 2024 and year over year comparisons will be negatively impacted by the strong spend on U. S. Selection in the second half of twenty twenty four, particularly on YouTube. In cloud, as I mentioned, the demand for our products is high as evidenced by the continued revenue growth and the cloud backlog of $106,000,000,000 While we have been working hard to increase capacity and have improved the pace of server deployment, we expect to remain in a tight demand supply environment going into 2026. Moving to investments.\n\n**Anat Ashkenazi** (EVP &amp; CFO)\nGiven the strong demand for our cloud products and services, we now expect to invest approximately $85,000,000,000 in CapEx in 2025, up from a previous estimate of $75,000,000,000 Our updated outlook reflects additional investment in servers, the timing of delivery of servers and an acceleration in the pace of data center construction primarily to meet cloud customer demand. Looking out to 2026, we expect a further increase in CapEx due to the demand we're seeing from customers as well as growth opportunities across the company. We will provide more details on the 2026 CapEx outlook on a future earnings call. In terms of expenses, first, as I mentioned on our previous earnings call, the significant increase in our investments in CapEx over the past few years will continue to put pressure on the P and L, primarily in the form of higher depreciation. In the second quarter, depreciation increased $1,300,000,000 year over year to $5,000,000,000 reflecting a growth rate of 35%.\n\n**Anat Ashkenazi** (EVP &amp; CFO)\nGiven the recent increase in CapEx investments, we expect the growth rate in depreciation to accelerate further in Q3. Second, as we've previously said, we expect some headcount growth in 2025 in key investment areas. In the third quarter, we expect a sequential increase in total headcount additions due in part to the hiring of new graduates. And third, Q3 will reflect the expense associated with the upcoming August launch of the new Pixel family of products. In conclusion, as you heard from Sundar and Filip, we're pleased with the momentum in the business and excited about the pace of innovation.\n\n**Anat Ashkenazi** (EVP &amp; CFO)\nOur full stack approach, which combines AI infrastructure, AI research and AI products and platforms, position us well to deliver new products and services across the company. We're seeing great momentum with our AI efforts, as demonstrated by the increase cumulative token processed. Search revenues are seeing healthy growth with features like AI Overviews, AI Mode and Lens offering new ways for users to access information. Cloud has reached an annual revenue run rate of more than $50,000,000,000 and is delivering margin expansion while continuing to invest to meet customer demand. And YouTube has expanded its addressable market by building new services like Shorts, which now averages over 200,000,000,000 daily views.\n\n**Anat Ashkenazi** (EVP &amp; CFO)\nWe're excited to see the value our products and services are bringing to customers and partners around the globe. Now I'll turn the call over to the operator and Sundar and Phillip and I will take your questions.\n\n**Operator**\nThank you. Your first question comes from Eric Sheridan Your line is now open.\n\n**Eric Sheridan** (Managing Director)\nThank you so much for taking the question. Maybe one for Sundar and one for Philip. Sundar, when you think about the journey you're on with respect to the evolution of products and platforms, how do you think about some of the implications of changed consumer behavior and how investors should think about that from the volume perspective versus the monetization perspective? So I think there's a lot of long standing dynamics out there about clicks and click monetization that might be very different when you look out over the next three to five years. And Philip, you think about the evolution of YouTube, you made a number of comments there about subscription revenue.\n\n**Eric Sheridan** (Managing Director)\nI'm just curious how you think about the mix of advertising versus subscription and what some of your key learnings might have been as the subscription side of the business continues to scale? Thank you.\n\n**Sundar Pichai** (Director &amp; CEO)\nThanks, Eric. Appreciate the question. I do think look looking ahead, based on everything we are seeing, it's people are excited about AI. They are adopting it well across our products. For me, you know, just seeing multimodality, how people have modified their behavior to include images both through lens and circle to search seamlessly as part of interacting with Google.\n\n**Sundar Pichai** (Director &amp; CEO)\nYou know, are are early indications that people are gonna be adopting through these moments very, very well. I think I'm trying to understand your question in terms of about clicks and click monetization. Maybe that's something Philip can touch on. But overall, we expect as we build out our organic experiences, you know, we have a good understanding of how to continue training on monetization, so that'll work well with the organic experiences. And but we will lead with organic experience.\n\n**Sundar Pichai** (Director &amp; CEO)\nSo in terms of newer surfaces like Gemini app, etcetera, we'll focus on the organic experience for the near term. But just like we are doing with AI overviews and with AI more over time, you know, we'll we'll be able to bring very, very good commercial experiences there as well, and we think people will adapt to them as they've always done. Maybe Philip can add more. Philip?\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nYeah. So on your question on YouTube subscriptions versus ads, look, I mean, we love our ads business. We love our subscription business. YouTube subscriptions are an increasingly important for YouTube. We'll definitely continue our long term focus here.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nWe had a strong growth across YouTube subscription products, which includes, just to be clear, YouTube TV, YouTube Music and Premium. And I think one common theme for our subscription services in general is offering viewers more choice here. We also have a very deep understanding of the monetization side here, where are we monetizing more with ads, where can we potentially monetize more with subscriptions. So I think we will continue this as a double tier strategy actively going forward.\n\n**Eric Sheridan** (Managing Director)\nThank you.\n\n**Operator**\nOur next question comes from Doug Anous with JPMorgan. Your line is now open.\n\n**Douglas Anmuth** (MD &amp; Internet Analyst)\nThanks so much for taking the questions. One for Sundar and one for Philip. Sundar, can you just talk about how you're thinking about your current access to compute even as you spend $10,000,000,000 more this year in CapEx? You also said that you're still in a tight supply environment, you're just trying to marry those. And then, Philip, Philip perhaps on search growth, can you talk a little bit about paid click and pricing growth just within the 12% search growth and how we should think about volume versus monetization trends going forward? Thanks.\n\n**Sundar Pichai** (Director &amp; CEO)\nDoug, thanks. You know, on the on the CapEx stuff, you know, obviously, we are, you know, seeing strong momentum across across our portfolio and especially in cloud. You are right. It's a tight supply environment, and, you know, we are investing more to expand, but there is obviously a time delay between, you know, this additional investment will play out in future years. And so, you know, that's that's that's that's why both of them are, true at the same time.\n\n**Sundar Pichai** (Director &amp; CEO)\nAnd, but we are planning ahead, and we are investing. And, but, overall, it's exciting to see the traction, particularly in cloud. I think the the comprehensiveness of our AI portfolio, the breadth of our offerings, you know, both both providing our models on GPUs and TPUs for our customers. All of that has been really driving demand, and so we are investing to to match up to it.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nAnd on your paid click question, look, to be very clear, I think we said this before. We manage the business to drive great outcomes for our users and an attractive ROI for our advertisers. We actually don't manage to pay clicks and CPC targets. Some of the product and policy changes we make actually drive better monetization at the expense of paid clicks. You will actually see in the 10 Q, paid clicks were up 4% year on year.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nBut a number of factors affect these metrics from quarter to quarter, such as a few examples, advertiser spending, product changes, policy changes, user engagement and so on. So it's really important when it comes to pay clicks and CPCs to avoid drawing like overly broad conclusions solely based on these metrics.\n\n**Douglas Anmuth** (MD &amp; Internet Analyst)\nThank you both.\n\n**Operator**\nOur next question comes from Brian Nowak with Morgan Stanley. Your line is now open.\n\n**Brian Nowak** (Managing Director)\nThanks for taking my questions. I have two. First one, Sundar, there's a lot of discussion about agentic search for commercial activities and agents that can be broadly deployed. Maybe could you just from a technology perspective, when you sit down with the engineering teams working on some of these new agentic capabilities that could come, What are some of the predominant technological hurdles that you think need to be cleared in order to launch scalable agents for commercial queries is the first one. And the second one, I think in the past, you've updated us on stats on sources of internal efficiency you've seen from GenAI enabled capabilities.\n\n**Brian Nowak** (Managing Director)\nAny updates there? And then any sort of learnings on friction points that also need to be overcome for some of these internal tools with GenAI? Thanks.\n\n**Sundar Pichai** (Director &amp; CEO)\nThanks, Brian. On let me start with the first one on agentic capabilities. Look. Overall, we had definitely, in many ways, when we built 2.5 our series of 2.5 models, particularly with Pro, etcetera, you know, it's the direction where we are investing the most. There's definitely exciting progress, including in the models we haven't fully released yet.\n\n**Sundar Pichai** (Director &amp; CEO)\nAnd, you know, the main main gaps we are all trying to do is, you know, you're obviously chaining a sequence of events. And and so being able to do it reliably, the latency compounds, the cost compounds, And being able to do it reliably in a way for the users, all of this comes together. In each of this, we are making progress, and it all needs to kinda hang together. The good news is we are making robust progress. We think we are at the frontier there.\n\n**Sundar Pichai** (Director &amp; CEO)\nAnd, you know, in all of these areas, when you look back in a twelve month basis, you end up making the models much more efficient for any given capability. So the forward looking trajectory, I think, will really unlock these agentic experiences. We we see the potential. We're able to do them, but they're a bit slow and costly and takes time and sometimes are brittle. Right?\n\n**Sundar Pichai** (Director &amp; CEO)\nBut they're making progress on all of that. And I think that's what will really unlock, and I expect 2026, to be the year in which people kinda use agentic experiences more broadly. Right? And so it's an exciting opportunity ahead. On on the second part, I think when you say source of internalization, I presume you're talking about how we are using all of this internally.\n\n**Sundar Pichai** (Director &amp; CEO)\nYou know, again, given you've asked a question about agents, we are now beginning to roll out agentic coding journeys for our software engineers within the company. And it's been exciting to see just over the last few months, particularly over the last few weeks, people are definitely doing more agentic workflows in software engineering as well internally. And that's that's a good example of the kind of the same experiences a few months ago had a lot of friction points, but, you know, we we are overcoming it, and people are beginning to use internally on the coding side as well as in certain other areas of the company as well. So exciting progress. I expect it to be an active area where we will roll out Journeys for our users as well. So look forward to it.\n\n**Brian Nowak** (Managing Director)\nThanks, Sundar. That's great.\n\n**Operator**\nOur next question comes from Michael Nathanson with MuffettNathanson. Your line is now open.\n\n**Michael Nathanson** (Senior Research Analyst)\nThanks. Sundar, have two for you. At IO, you announced a partnership with Warby Parker to develop glasses. So I wonder if you share your view of how important a cycle of new devices will be to further scale AI? And do you envision a world in which the more functional or essential to our consumer experience?\n\n**Michael Nathanson** (Senior Research Analyst)\nThat's one. And secondly, how does Google Search with AI mode usage different different, sorry, versus Gemini standalone apps. I'm wondering, are you seeing any differences in usage or the types of consumers who go to the app versus who go to traditional search with AI? Thanks.\n\n**Sundar Pichai** (Director &amp; CEO)\nThanks, Michael. On on the first thing, look, I I think anytime IO changes, you know, you can drive new experiences, including on hardware experiences too. So I think AI will particularly enable we've long had the promise of glasses and other form factors. Right? You know, I think AI will spur a whole new wave of innovation there.\n\n**Sundar Pichai** (Director &amp; CEO)\nWe are super excited about our investment in glasses and, you know, found the experiences have taken a dramatic step up compared to the last compared to the last iteration. So I think it'll be an exciting new emerging category, but I still expect phones to be at the center of the experience, you know, for the next, two to three years at least. And and so I I I still think that's going to be phones would continue to be at the center of the consumer experience, But we are excited about the emerging categories as well. On your second question on AI mode versus Gemini standalone app, broadly, there are some use cases where you can you can get a great experience in both places. But there are use cases which are very specific.\n\n**Sundar Pichai** (Director &amp; CEO)\nI think where the queries are, you know, information oriented, but people really want to rely on the information, but have the full power of AI. I think AI mode really shines in that. You can go there and, you know, it's backed up. You know, the Gemini models are using search deeply as a tool, and so it's all grounded in that search experience. And I think I I think users are responding very positively to it.\n\n**Sundar Pichai** (Director &amp; CEO)\nAnd whereas in the Gemini standalone app, you know, you see everything from you know, people can have a long conversational chat just trying to pass time, right, in in the Gemini app. You know, you've seen early cases where people may get into it, you know, in a therapy like experience. Right? So these are all emerging experiences of what what people do. And I think this is why I'm glad we have both surfaces, and we can innovate in both of these areas.\n\n**Sundar Pichai** (Director &amp; CEO)\nAnd, of course, there'll be areas which will be commonly served by both applications. And over time, I think we can make the experience more seamless for our users.\n\n**Michael Nathanson** (Senior Research Analyst)\nThanks, Sundar.\n\n**Operator**\nOur next question comes from Mark Schmullich with Bernstein. Your line is now open.\n\n**Mark Shmulik** (MD &amp; Senior Analyst - US Internet)\nYes. Thanks for taking the question. Sundar, it seems there's almost like a daily news report about the AI talent war and high profile folks moving around, which is kind of like your perspective and how you think Google's been doing it both kind of attracting and retaining key AI talent? And along the similar lines, how do we think about AI related resourcing costs alongside kind of the step up in capital investments required to go build for AI? Thank you.\n\n**Sundar Pichai** (Director &amp; CEO)\nMark, on the, on the first question, look, I, I think, you know, we've we've gone through these moments before. We've obviously always deeply invested in, in in in talent, including an AI talent for well over a decade now. And I think we have an extraordinary both breadth and depth of the talent. In in my experience, you know, the top people look for a combination of they want to really be at the frontier driving progress and and so the mission and the and and how state of the art your workers matters. So that's super important to them.\n\n**Sundar Pichai** (Director &amp; CEO)\nAccess to compute resources and access to your peers, right, working with the best best people in the industry. And it's a combination of all of that and using it to drive impact. And I think we are pretty competitive on all those fronts. And, you know, through through this moment, we continue to I look at the both our retention metrics as well as the new talent coming in, and and both are healthy. You know, I I do know individual cases can make headlines, but when we look at look at numbers deeply, I think we are, doing very well, through this moment.\n\n**Sundar Pichai** (Director &amp; CEO)\nAnd we'll continue investing, in the people and the talent and the compute needed to make sure we are set up well for the opportunity ahead. And maybe I'll pass it on to Anant.\n\n**Anat Ashkenazi** (EVP &amp; CFO)\nYeah. And on the question on how we integrate this into our overall cost structure. And I've mentioned before, having the the benefit of having the full stack includes research, which is our people and one of our most critical resource. So, we make sure that we invest appropriately to have the best, brightest minds in the industry sitting here at Google and advancing our innovation to customers. It is part of what you're seeing now in our operating expense line across the organization, but we're also working hard to offset not just growth and investment across the business, but also to ensure that we can allocate resources appropriately.\n\n**Anat Ashkenazi** (EVP &amp; CFO)\nSo, Sundar mentioned earlier the use of AI tools within the company. So, that's another area where we can drive efficiency across the businesses to use these tools internally in terms of how we run the organizations. And then we're continuing on the same efforts that I've talked about before with regards to running the company with a high level of discipline and execution and driving efficiency across the business.\n\n**Operator**\nOur next question comes from Ross Sandler with Barclays. Your line is now open.\n\n**Ross Sandler** (Analyst)\nGreat. If I can ask two, that'd be great. So, the first one's on search click through rates as a driver of monetization. So you guys have done a great job over the past decade of driving better ad relevancy and higher click through rates in search. Just curious, as we look forward and we see lower ad impressions per SERP and all these things that are changing with AI overviews and different AI search formats, how do you feel about your ability to drive CTR going forward?\n\n**Ross Sandler** (Analyst)\nAnd then the second question is, it looks like you're now working with OpenAI for some aspect of cloud infrastructure. Just curious how that relationship might expand in the future? Thank you.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nI can take the first one. Look, referring to the area of reviews, if I understood your question correctly. Sundar mentioned it. They continue to drive higher satisfaction. They continue to drive higher search usage.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nThey're scaling up very nicely. And they're actually working for our entire user base now, scaled to over 2,000,000,000 users in over 200 countries. So very happy with this development. But when it comes specifically to the monetization of it, we talked about it before. We see monetization at approximately the same rate, which gives us actually a really strong base on which we can then innovate and and and drive actually more innovative and new and next generation ad formats.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nThat's how we look at it at this moment in time.\n\n**Sundar Pichai** (Director &amp; CEO)\nOn the second part, with respect to OpenAI, look, we are very excited to be partnering with them on Google Cloud. Google Cloud, you know, is a open platform, and, you know, we have a strong history of supporting great companies, startups, AI labs, etcetera. So super excited about our partnership there on the cloud side. And and, you know, we look forward to investing more in that relationship and growing it there.\n\n**Operator**\nOur next question comes from Mark Mahaney with Evercore. Your line is now open.\n\n**Mark Mahaney** (Senior MD)\nOkay. Two questions, please. First, can you just describe maybe Philip, you see in terms of the ad environment maybe for the back half of the year, maybe versus last year? Does it seem as certain or as uncertain as it was last year? The results seem pretty strong.\n\n**Mark Mahaney** (Senior MD)\nAre there unusual concerns you would have for the back half of the year? Then Sundar, I want to ask you again about the two surfaces approach to search. And you obviously got some you must have some internal metrics that could tell you that that's the optimal way for you to approach the market. But, you know, there's I I'm sure there's a counterargument that just having that unified search and being able to discern the intent of the search, whether it's pure information or commercial just from the query, that could give you a material advantage over other offerings in the market? Just talk a little bit about what metrics you've seen that make it that make the two surface solutions seem to be optimal. Thank you.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nSo let me start. Look, our we said our ads business performed strongly in Q2. Give you maybe some vertical color of it. In Q2, Search and Other performance was led by growth across all verticals. We mentioned the largest contributions from Retail and Financial Services, which was probably due actually to strength in Insurance.\n\n**Philipp Schindler** (Senior VP &amp; Chief Business Officer)\nWe saw Healthcare as a sizable contributor to growth as well. Look, we're only a few weeks into Q3, so I think it's really too early to comment on anything happened in the second half of the year.\n\n**Sundar Pichai** (Director &amp; CEO)\nAnd, Mark, on the second second part of the question, look, I I think, you know, the between between these two surfaces, you pretty much know, you're covering the entire breadth and depth of what, you know, humanity can possibly do. So I think there's plenty for two surfaces to tackle in this moment. Obviously, you know, you are right. You know, search is more information focused, and we think of the Gemini app as more your assistant, more personal, proactive, and powerful assistant for every aspect of your daily life. And so you can imagine wanting to call deeply or create a long video, etcetera.\n\n**Sundar Pichai** (Director &amp; CEO)\nLike, you know, those those things can be done by the Gemini app today better. Over time, like we've always done, we've gone through these evolutions before. Like, as you point out, you know, we can we can understand user intent better and abstract some of the complexity for our users. At one point, people used to go to, you know, query separately for text differently from images, differently from videos, etcetera, and we kinda made it all seamless with universal search. So we have the experience of being able to bring together experiences in a way that makes sense for users and do the heavy lifting for them.\n\n**Sundar Pichai** (Director &amp; CEO)\nBut but I think, you know, when you're in this early stage of new emerging paradigms, I think we wanna make sure, you know, we can meet them where where they're what they are expecting today. And over time, I think it'll give us an opportunity to serve them better. So I think that's how we are thinking about it.\n\n**Mark Mahaney** (Senior MD)\nOkay. Thank you.\n\n**Operator**\nOur next question comes from Ken Gorelski with Wells Fargo. Your line is now open.\n\n**Ken Gawrelski** (MD &amp; Senior Internet Analyst)\nThank you very much. Two if I may please. The first on cloud, I'm just hoping maybe you could clarify your back half outlook. Given last quarter you talked about some supply constraints that would ease towards the end of twenty twenty five, but yet you put up a really nice acceleration in 2Q. Now you're talking about some supply constraints easing into 2026.\n\n**Ken Gawrelski** (MD &amp; Senior Internet Analyst)\nIf you could just clarify a little bit on the back half outlook for cloud given the strong results in 2Q. And then the second is a bigger picture question which is an agentic experience. Does it democratize the web like search did two decades ago enabling discovery in the long tail? Or does it lead to more concentration with the smaller group of vertical winners? Would love it if you could opine on that. Thank you.\n\n**Anat Ashkenazi** (EVP &amp; CFO)\nOkay. On your first question on the cloud second half outlook and the comments I previously made on with regards to where we're going to see the capacity increase. So, obviously, we're working hard to bring more capacity online, which means data centers and servers are coming online. And we see more of an increase towards the back end of the year. But we're increasing capacity with every quarter that goes by, as you can see with the growth rates we've had both this quarter and in the previous quarter.\n\n**Anat Ashkenazi** (EVP &amp; CFO)\nAs Sundar mentioned earlier, this is not the type of investment that's a light switch. It takes time to make this investment. So, what you're seeing now is investment we made some time ago that's now translating to additional capacity coming online, but more of that towards the back end of the year. I will say it's important as you think about cloud growth not to think about this in a linear fashion, because the quarter on quarter growth rates could depend on the timing of capacity delivery and when that comes online, so that could move a little bit from quarter to quarter.\n\n**Sundar Pichai** (Director &amp; CEO)\nLook, on the agent experience, look, I think there was an earlier question on the technology aspects of it and how we are making progress. Obviously, there is the value proposition for all the players involved, and I think that's gonna be an equally important thing to create the unlock unlock here. And I do think, you know, over time, users will you know, it's clear to me as we make progress on the agentic experience, it's going to be a much better experience for users. Right? And so you'll you'll find savvier players leaning into these experiences, and that'll help them grow and meet this moment.\n\n**Sundar Pichai** (Director &amp; CEO)\nAnd I think I I I so I do think it's an opportunity for for some of the players. And so you are right. Just like the early early days of the web, there are aspects about it, which will expand access, grow grow the use cases, etcetera. And I think I think that elements are there. But I do think it's important.\n\n**Sundar Pichai** (Director &amp; CEO)\nIt's not just a technology play, but we have to solve the business models for the remaining players involved. So and I I think that's gonna be an important part of this, evolution as well.\n\n**Ken Gawrelski** (MD &amp; Senior Internet Analyst)\nThank you.\n\n**Operator**\nAnd our last question comes from Justin Post with BAML. Your line is now open.\n\n**Justin post** (Managing Director)\nGreat. Thank you. A couple for Sundar. First, looks like the subscription businesses are all tracking well and certainly Gemini 2.5 has got some much good reviews. How are you doing with Gemini subscriptions?\n\n**Justin post** (Managing Director)\nI know it's a focus area for the company and anything you can kind of do to accelerate the consumer subscriptions of Gemini within Google One? And secondly, just on the course change of CapEx, obviously a bigger increase, which appears to be because of cloud demand. But just your comments on cloud ROI and I'm sorry CapEx ROI, what gives you confidence that you're going to get good returns on that spend? Thank you.\n\n**Sundar Pichai** (Director &amp; CEO)\nGreat. Look, on the first thing on subscriptions, we've definitely Google One has been an attractive value proposition powered by storage. But now our AI plans, including both pro and ultra, and particularly with the 2.5 series of models, they've definitely seen accelerated traction. So it it was a very healthy quarter. And and and so we are definitely excited about the opportunities ahead.\n\n**Sundar Pichai** (Director &amp; CEO)\nAnd you will find, you know, through this moment, I think we'll be able to drive growth in that area based on our AI offerings. And so it's it's definitely area we are both excited by, and we are actually seeing traction, particularly in the last quarter ever since we introduced 2.5 Pro. So we are excited about about the trajectory there. On on on on the CapEx on the cloud side, look, I I I think we are definitely, investing because, we are delivering a lot of value through our cloud offerings. And I think it's important to understand, you know, as we build more and more of an installed base, with Google Cloud, you know, we have very high customer satisfaction.\n\n**Sundar Pichai** (Director &amp; CEO)\nOur churn rates are very low, and we are much more efficient in in in the investments needed to grow those lines of businesses. So you are seeing all that play out in our margin trajectory, particularly if you look at it annually, sequentially over the past few years. And so and, you know, so all that gives us confidence as we are investing in this. You know, we'll we'll be able to have a healthy ROI on our investments. And particularly in this AI moment, you know, there's definitely the value we are delivering to the customers is also growing pretty significantly on a forward looking basis.\n\n**Sundar Pichai** (Director &amp; CEO)\nAnd so I think all that, you know, will help us, you know, do well here.\n\n**Operator**\nThank you. And that concludes our question and answer session for today. I'd like to turn the conference back over to Jim Friedland for any further remarks.\n\n**Jim Friedland** (Senior Director - IR)\nThanks everyone for joining us today. We look forward to speaking with you again on our third quarter twenty twenty five call. Thank you and have a good evening.\n\n**Operator**\nThank you everyone. This concludes today's conference call. Thank you for participating. You may now disconnect.",
      "fetched_at": "2026-02-04T15:37:25.778Z"
    },
    {
      "ticker": "GOOGL",
      "title": "Alphabet Inc. (GOOGL) Q1 FY2025 earnings call transcript",
      "published_date": "Apr 24, 2025, 4:30 PM EDT",
      "fiscal_year": "2025",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/GOOGL/earnings/GOOGL-Q1-2025-earnings_call-312617.html",
      "content": "**Operator**\nThank you for standing by for the Alphabet First Quarter twenty twenty five Earnings Conference Call. At this time, all participants are in a listen only mode. After the speaker presentation, there will be a question and answer I would now like to hand the conference over to your speaker today, Jim Friedland, Senior Director of Investor Relations. Please go ahead.\n\n**Jim Friedland** (Senior Director - IR)\nThank you. Good afternoon, everyone, and welcome to Alphabet's first quarter twenty twenty five earnings conference call. With us today are Sundar Pichai, Philip Schindler and Anat Ashkenazi. Now, I'll quickly cover the Safe Harbor. Some of the statements that we make today regarding our business, operations and financial performance may be considered forward looking.\n\n**Jim Friedland** (Senior Director - IR)\nSuch statements are based on current expectations and assumptions that are subject to a number of risks and uncertainties. Actual results could differ materially. Please refer to our Forms 10 ks and 10 Q, including the risk factors. We undertake no obligation to update any forward looking statement. During this call, we will present both GAAP and non GAAP financial measures.\n\n**Jim Friedland** (Senior Director - IR)\nA reconciliation of non GAAP to GAAP measures is included in today's earnings press release, which is distributed and available to the public through our Investor Relations website located at abc.xyzinvestor. Our comments will be on year over year comparisons unless we state otherwise. And now, I'll turn the call over to Sundar.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nThanks, Jim. Good afternoon, everyone. We are pleased with our strong results this quarter. We continue to see healthy growth and momentum across the business, including AI powering new features. In Search, we saw continued double digit revenue growth. AI Overviews is going very well with over 1,500,000,000 users per month and we are excited by the early positive reaction to AI mode. There's a lot more to come ahead.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nIn subscriptions, we surpassed two seventy million subscriptions with YouTube and Google One as key drivers. And cloud grew rapidly with significant demand for our solutions and you saw our leadership in AI at Cloud Next across infrastructure, agents and more. Our differentiated full stack approach to AI continues to be central to our growth. This quarter was super exciting as we rolled out Gemini 2.5, our most intelligent AI model which is achieving breakthroughs in performance and it's widely recognized as the best model in the industry. That's an extraordinary foundation for our future innovation and we are focused on bringing this to people and customers everywhere.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nLooking ahead to IO, Brandcast and Google Marketing Live, I can't wait for our teams to showcase the innovations they've been working on. Turning to our AI progress this quarter, which continues to enable significant growth opportunities. The elements of the AI stack I've previously mentioned are AI infrastructure, world class research including models and tooling, and our products and platforms. Starting with AI infrastructure, our long term investments in our global network have positioned us well. Google's network is robust and resilient, supported by over 2,000,000 miles of fiber and 33 subsea cables.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nComplementing this, we offer the industry's widest range of TPUs and GPUs and continue to invest in next generation capabilities. Ironwood, our seventh generation TPU and most powerful to date, is the first designed specifically for inference at scale. It delivers more than 10x improvement in compute power over a recent high performance TPU while being nearly twice as power efficient. A strong relationship with NVIDIA continues to be a key advantage for us and our customers. We were the first cloud provider to offer NVIDIA's groundbreaking B200 and GB200 Blackwell GPUs and will be offering their next generation Vera Rubin GPUs.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nSecond, this infrastructure powers our world class research including our industry leading models. We released Gemini 2.5 Pro last month, receiving extremely positive feedback from both developers and consumers. 2.5 Pro is state of the art on a wide range of benchmarks and debuted at number one on the chatbot arena by a significant margin. 2.5 Pro achieved big leaps in reasoning, coding, science and math capabilities, opening up new possibilities for developers and customers. Active users in AI Studio and Gemini API have grown over 200 since the beginning of the year.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nAnd last week, we introduced 2.5 Flash, which enables developers to optimize quality and cost. Our latest image and video generation models, Imagine three and Vio2, are rolling out broadly and are powering incredible creativity. Turning to open models. We launched Gemma three last month delivering state of the art performance for its size. Gemma models have been downloaded more than 140,000,000 times.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nLastly, we are developing AI models in new areas where there's enormous opportunity. For example, our new Gemini robotics models. And in Health, we launched AI Coscientist, a multi agent AI research system, while AlphaFold has now been used by over 2,500,000 researchers. Third, turning to products and platforms. All 15 of our products with a half a billion users now use Gemini models.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nAndroid and Pixel are two examples of how we are putting the best AI in people's hands, making it super easy to use AI for a wide range of tasks just by using their camera, voice or taking a screenshot. We are upgrading Google Assistant on mobile devices to Gemini and later this year will upgrade tablets, cars and devices that connect to your phone such as headphones and watches. The Pixel 9a launched very strong reviews, providing the best of Google's AI offerings like Gemini Live and AI powered camera features. And Gemini Live camera and screen sharing is now rolling out to all Android devices, including Pixel and Samsung S25. Now moving on to key highlights from across Search, Cloud, YouTube and Waymo.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nFirst, Search. AI is one of the most revolutionary technologies for enabling and expanding our information mission. And for Search, we see it growing the number and types of questions we can answer. We are already seeing this with AI Overviews, which now has more than 1,500,000,000 users every month. Nearly a year after we launched AI Overviews in The U.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nS, we continue to see that usage growth is increasing as people learn that search is more useful for more of their queries. So we are leaning in heavily here, continuing to roll the feature out in new countries to more users and to more queries. Building on the positive feedback for AI overviews, in March we released AI Mode, an experiment in labs. It expands what AI overviews can do with more advanced reasoning, thinking and multimodal capabilities to help with questions that need further exploration and comparisons. On average AI mode queries are twice as long as traditional search queries.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nWe're getting really positive feedback from early users about its design, fast response time and ability to understand complex nuanced questions. We also continue to see significant growth in multimodal queries. Circle to Search is now available on more than two fifty million devices with usage increasing nearly 40% this quarter. And monthly visual searches with Lens have increased by 5,000,000,000 since October. Moving on to Cloud.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nAt Cloud Next, we announced major innovations and over 500 companies shared the business results they are achieving by working with us. We provide leading cost, performance and reliability for AI training and inference. This enables us to deliver the best value for AI leaders like AnyScale and contextual AI as well as global brands like Verizon. And for highly sensitive data and regulatory requirements, Google Distributed Cloud and our sovereign AI make Gemini available on premises or in country. Our Vertex AI platform makes over 200 foundation models available, helping customers like Lowe's integrate AI.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nWe offer industry leading models, including Gemini 2.5 Pro, 2.5 Flash, Imagine three, Vio2, Chirp and Liria, plus open source and third party models like Lama four and Anthropic. We are the leading cloud solution for companies looking to the new era of AI agents, a big opportunity. Our Agent Development Kit is a new open source framework to simplify the process of building sophisticated AI agents and multi agent systems. And Agent Designer is a low code tool to build AI agents and automate tasks in over 100 enterprise applications and systems. We are putting AI agents in the hands of employees at major global companies like KPMG.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nWith Google Agent Space, employees can find and synthesize information from within their organization, converse with AI agents and take action with their enterprise applications. It combines enterprise search, conversational AI or chat, and access to Gemini and third party agents. We also offer prepackaged agents across customer engagement, coding, creativity and more that are helping to provide conversational customer experiences, accelerate software development and improve decision making. And of course, Google Workspace. It delivers more than 2,000,000,000 AI assists monthly, including summarizing Gmail and refining docs.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nLastly, our cybersecurity products are helping organizations detect, investigate and respond to cybersecurity threats. Our expertise, coupled with integrated Gemini AI advances, detects malware, prioritizes threats and speeds up investigative workflows. This quarter, we were excited to announce our intent to acquire Wizz, a leading cloud security platform that protects all major clouds and cloud environments. Together, we can make it easier and faster for organizations of all types and sizes to protect themselves end to end and across all major clouds. We think this will help spur more multi cloud computing, something customers want.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nNext, YouTube. Yesterday marked a historic milestone, the twentieth anniversary of the first video uploaded to YouTube. From that single nineteen second upload, the platform has grown into a global phenomenon, fundamentally changing how billions of people create, share and experience content. Through all this growth, subscriptions are now a big part of the business. We continue to diversify subscription options, recently expanding our Premium Light pilot to The U.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nS, giving users a new way to enjoy most videos on YouTube ad free. TV is the primary device for YouTube viewing in The U. S. According to Nielsen, YouTube has been number one in streaming watch time in The U. S.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nFor the last two years and YouTube now has over 1,000,000,000 monthly active podcast users. Users. YouTube Music and Premium reached over 125,000,000 subscribers, including trials globally. And finally, Waymo is now safely serving over a quarter of million paid passenger trips each week. That's up 5x from a year ago.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nThis past quarter, Waymo opened up paid service in Silicon Valley. Through our partnership with Uber, we expanded in Austin and are preparing for our public launch in Atlanta later this summer. We recently announced Washington, D. C. As a future ride hailing city going live in 2026 alongside Miami.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nWaymo continues progressing on two important capabilities for riders: airport access and freeway driving. Thanks to all of our employees for their work this quarter. It was a great start to the year and Q2 will be even more exciting. With that, Filip, over to you.\n\n**Philipp Schindler** (SVP &amp; Chief Business Officer)\nThanks, Sundar, and hello everyone. I'll quickly cover performance for the quarter and then frame the rest of my remarks around the progress we're delivering across Search, Ads, YouTube and partnerships. Google services revenues were $77,000,000,000 for the quarter, up 10% year on year, driven by strong growth in Search and YouTube, partially offset by year on year decline in Network revenues. To add some further color to the performance, the 10% increase in Search and Other revenues was led by Financial Services, primarily due to strength in insurance followed by retail. YouTube saw a similar performance across verticals.\n\n**Philipp Schindler** (SVP &amp; Chief Business Officer)\nIts 10% growth in advertising revenues was driven by direct response followed by brand. So let's start with Search, where we've seen robust growth in revenues. All around the world, over 2,000,000,000 people use Search every day to find information, compare products or shop and there are more than 5,000,000,000,000 searches on Google annually. We've continued our efforts to help more people ask entirely new questions, bringing more opportunities for businesses to connect with consumers and as we've mentioned before, with the launch of AI Overviews, the volume of commercial queries has increased. Q1 marked our largest expansion to date for AI overviews, both in terms of launching to new users and providing responses for more questions.\n\n**Philipp Schindler** (SVP &amp; Chief Business Officer)\nThe feature is now available in more than 15 languages across 140 countries. For AI overviews overall, we continue to see monetization at approximately the same rate, which gives us a strong base on which we can innovate even more. Turning to visual queries. On the last earnings call, I mentioned the success we're seeing with Lens, where shoppers use their camera or images to quickly find information in ways they couldn't before. In Q1, the number of people shopping on Lens grew by over 10% and the majority of Lens queries are incremental.\n\n**Philipp Schindler** (SVP &amp; Chief Business Officer)\nSundar mentioned the significant growth we're also seeing with Circle to Search as multimodality continues to drive queries across search. Moving to ads, more businesses big and small are adopting AI powered campaigns and the deployment of AI across our Ads business is driving results for our customers and for our business. Throughout 2024, we launched several features that leverage LLMs to enhance advertiser value and we're seeing this work pay off. The combination of these launches now allows us to match ads to more relevant search queries and this helps advertisers reach customers in searches where we would not previously have shown their ads. Focusing on our customers, we continue to solve advertisers' pain points and find opportunities to help them create, distribute and measure more performed ads, infusing AI at every step of the marketing process.\n\n**Philipp Schindler** (SVP &amp; Chief Business Officer)\nOn audience insights, we released new asset audience recommendations, which tell businesses the themes that resonate most with their top audiences. On creatives, advertisers can now generate a broader variety of lifestyle imagery customized to their business to better engage their customers and use them across PMax, demand gen, display and app campaigns. Additionally, in PMax, advertisers can automatically source images from their landing pages and crop them, increasing the variety of their assets. On media buying, advertisers continue to see how AI powered campaigns help them find new customers. In DemandGen, advertisers can more precisely manage ad placements across YouTube, Gmail, Discover and Google Display Network globally and understand which assets work best at a channel level.\n\n**Philipp Schindler** (SVP &amp; Chief Business Officer)\nThanks to dozens of AI part improvements launched in 2024, businesses using DemandGen now see an average 26% year on year increase in conversions per dollar spent for goals like purchases and leads. And when using DemandGen with product feed, on average, they see more than double the conversion per dollar spent year over year. As an example, Royal Cannon combined DemandGen and Pmax campaigns to find more customers for its cat and dog food products. The integration resulted in a 2.7 times higher conversion rate, a 70% lower cost per acquisition for purchases and increased the value per user by 8%. Turning to YouTube, where we saw strong growth in revenues across ads and subscriptions.\n\n**Philipp Schindler** (SVP &amp; Chief Business Officer)\nThis week, we're celebrating YouTube's twentieth anniversary. We're proud of its leadership as a streaming destination where people come to watch everything they love, from live sports and creator produced content to shorts and podcasts. Creators are what drives viewership and on average, they upload 20,000,000 videos a day to YouTube. Our biggest creators generate a level of fandom and viewer engagement around large cultural moments on YouTube that brands can't find anywhere else. During March Madness, brands aligned not only with clips and highlights from the game, but also with the creators who drive basketball culture like Jesser and the Ringer's J.\n\n**Philipp Schindler** (SVP &amp; Chief Business Officer)\nKyle Mann. In Q1, the growth of our reservation based ads business more than doubled year over year. Brands and creators continue to use the opportunities that collaborations and partnerships offer. Toyota worked with Zach King, the king of short magical videos with over 42,000,000 followers to take over his channel. The creator takeover and accompanying creator ad lifted Toyota's brand awareness by 25% compared to a control group and 9% compared to the Toyota brand ad.\n\n**Philipp Schindler** (SVP &amp; Chief Business Officer)\nLooking at Shorts, engaged views grew by over 20% in the first quarter. We continue to be pleased with the progress we're making globally in Shorts monetization relative to in stream viewing and are particularly encouraged by the trend in The U. S. As always, I'll wrap up with a strong momentum we're seeing in partnerships where our customers increasingly recognize the strength and breadth of what Google has to offer. For instance, Roblox is partnering Google Ad Manager to bring immersive ads to gamers.\n\n**Philipp Schindler** (SVP &amp; Chief Business Officer)\nGen Z gamers are Roblox biggest users and thanks to our partnership, advertisers will be able to reach this audience with ads that blend seamlessly into the gaming experience. We also launched a YouTube shorts effect to help people release iconic Roblox ads and inspire fans to create content at scale. In closing, I'd like to thank Googlers everywhere for their contributions and commitment to our success and to our customers and partners for their continued trust. Anat, over to you.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nThank you, Philip. My comments will focus on year over year comparisons for the first quarter unless they state otherwise. I will start with results at the Alphabet level and will then cover our segment results. I'll end with some commentary on our outlook for the second quarter and 2025. We had another strong quarter in Q1.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nConsolidated revenues of $90,200,000,000 increased by 12% or 14% in constant currency. Search and YouTube advertising, subscription platforms and devices and Google Cloud each had double digit revenue growth this quarter, reflecting strong momentum across the business. Total cost of revenue was $36,400,000,000 up 8%. Tech was $13,700,000,000 up 6%. We continue to see a revenue mix shift with Google Search growth at double digit levels, while network revenues, which have much higher TAC rate, declined.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nOther costs of revenue was $22,600,000,000 up 9% with the increase primarily driven by content acquisition costs largely for YouTube followed by depreciation and other technical infrastructure operations costs. Total operating expenses increased 9% to $23,300,000,000 R and D investments increased by 14%, primarily driven by increases in compensation and depreciation expenses. Sales and marketing expenses decreased 4%, primarily reflecting a decline in compensation expenses. G and A expenses increased by 17%, reflecting the impact of charges for legal and other matters. Operating income increased 20% this quarter to $31,000,000,000 and operating margin increased to 33.9%, representing 2.3 points of margin expansion.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nOperating margin benefited from healthy revenue growth, a moderated pace of compensation growth and a favorable mix shift towards lower tech advertising revenues, partially offset by a year on year increase in depreciation expenses of just over $1,000,000,000 Other income and expenses was 11,200,000,000 primarily due to unrealized gain on our non marketable equity securities related to our investment in a private company, which we noted on our 10 ks as a subsequent event. Net income increased 46% to $34,500,000,000 and earnings per share increased 49% to $2.81 We delivered free cash flow of $19,000,000,000 in the first quarter and $74,900,000,000 for the trailing twelve months. We ended the quarter with $95,000,000,000 in cash and marketable securities. Turning to segment results, Google services revenues increased 10% to $77,300,000,000 reflecting strength in Google Search and YouTube advertising as subscription. Google Search and other advertising revenues increased by 10% to $50,700,000,000 The robust performance of Search was once again broad based across verticals led by financial services due primarily to strength in insurance, followed by retail.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nYouTube advertising revenues increased 10% to $8,900,000,000 driven by direct response advertising, followed by brand. Network advertising of $7,300,000,000 were down 2%. Subscription platforms and device revenues increased 19% to $10,400,000,000 primarily reflecting growth in subscription revenues. This growth was primarily driven by YouTube subscription offerings followed by Google One with growth in the number of subscribers being the biggest driver of revenue growth. Google services operating income increased 17% to $32,700,000,000 and operating margin increased from 39.6% to 42.3%.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nTurning to the Google Cloud segment, which continued to deliver very strong results this quarter. Revenue increased by 28% to 12,300,000,000 in the first quarter, reflecting growth in GCP across core and AI products at a rate that was much higher than cloud's overall revenue growth rate. Growth in Google Workspace was primarily driven by an increase in average revenue per seat. Google Cloud operating income increased to 2,200,000,000 and operating margin increased from 9.4% to 17.8%. As we scale our fleet, we continue to focus on driving improvements in productivity, efficiency and utilization to offset the growth in expenses, particularly from higher depreciation.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nAs for Other Bets, for the first quarter, revenues were $450,000,000 and operating loss was $1,200,000,000 The year on year decline in revenue and increase in operating loss primarily reflect the milestone payment received in the first quarter of twenty twenty four for one of our other bets. With respect to CapEx, our reported CapEx in the first quarter was $17,200,000,000 primarily reflecting investment in our technical infrastructure with the largest component being investment in servers, followed by data centers to support the growth of our business across Google services, Google Cloud and Google DeepMind. In Q1, we returned value to shareholders in the form of $15,100,000,000 in share repurchases and $2,400,000,000 in dividend payments. As we announced today, our Board of Directors declared a 5% increase in our quarterly dividend and also approved a new $70,000,000,000 share repurchase authorization. Turning to our outlook, I would like to provide some commentary on several factors that will impact our business performance in the second quarter and the remainder of 2025.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nFirst, in terms of revenue, I'll highlight a couple of items that we mentioned last quarter that will have an impact on second quarter and 2025 revenue. First, in Google services, advertising revenue in 2025 will be impacted by lapping the strength we experienced in the financial service vertical throughout 2024. Second, in cloud, we're in a tight demandsupply environment And given that revenues are correlated with the timing of deployment of new capacity, we could see variability in cloud revenue growth rates depending on capacity deployment each quarter. We expect relatively higher capacity deployment towards the end of twenty twenty five. Moving to investments, starting with our expectation for CapEx for the full year 2025.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nWe still expect to invest approximately $75,000,000,000 in CapEx this year. The expected CapEx investment level may fluctuate from quarter to quarter due to the impact of changes in the timing of deliveries and construction schedules. In terms of expenses, first, as I mentioned on our previous earnings call, the significant increase in our investments in CapEx over the past few years will continue to put pressure on the P and L, primarily in the form of higher depreciation. In the first quarter, we saw 31% year on year growth in depreciation from the increase in technical infrastructure assets placed in service. Given the increase in CapEx investments over the past few years, we expect the growth rate in depreciation to accelerate throughout 2025.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nSecond, as we've previously said, we expect some headcount growth in 2025 in key investment area. As we've disclosed previously, due to a shift in the timing of our annual employee stock based compensation award beginning in 2023, our first quarter stock based comp expenses is relatively lower compared to the remaining quarters of the year. In conclusion, as you heard from Sundar and Filip, we're pleased with the progress we're making across the organization, the results for the quarter and the opportunities ahead. Our success as a company is grounded in our experience driving advancements in deep computer science that enables us to create innovative new products and services for users, businesses and partners around the world. We have a strong track record of incubating and then building these offerings into new profitable businesses for Alphabet.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nAs we announced last quarter, YouTube and Cloud exited 2024 at a combined annual run rate of $110,000,000,000 And as you heard from Sundar earlier, Waymo is continuing to progress in building on its impressive technological achievements to scale rapidly and develop a sustainable business model. Thank you. Sundar, Philip and I will now take your questions.\n\n**Operator**\nThank you. And our first question comes from Brian Nowak from Morgan Stanley. Your line is now open.\n\n**Brian Nowak** (Managing Director)\nGreat. Thanks for taking my questions. I have two. The first one is sort of the macro advertising backdrop. Maybe, Anat, I know it's April 24 and you called out some factors as you're kind of thinking about the second quarter.\n\n**Brian Nowak** (Managing Director)\nAny other factors you're seeing in advertising verticals or regions or categories that could be showing any signs of weakness quarter to date so we should think through any other changes from typical seasonality in 2Q twenty twenty five versus prior quarters? Then the second one on Philip, I think I heard you mention now the volume of commercial queries has increased. Maybe can you just walk us through which of the products are driving that increase in Commercial Queries? And as you sort of think about the pipeline of Search products, are there any others that you're particularly excited about to kind of continue to drive further Commercial Query growth throughout 2025, '20 '20 '6? Thanks.\n\n**Philipp Schindler** (SVP &amp; Chief Business Officer)\nSo let me take the first one as well. We saw broad based strength across ad verticals in Q1 and we saw it give you a bit of vertical color here, search was led again by finance due primarily to ongoing strength in the insurance, retail, healthcare and travel were actually also sizable contributors here to growth. With regard to Q2, we're only a few weeks in, so it's really too early to comment. I mean, we're obviously not immune to the macro environment, but we wouldn't want to speculate about potential impacts beyond noting that the changes to the de minimis exemption will obviously cause a slight headwind to our ads business in 2025 primarily from APAC based retailers. And maybe to zoom out, I would say we have a lot of experience in managing through uncertain times and we focus on helping our customers by providing deep insights into changing consumer behavior that is relevant to their business.\n\n**Philipp Schindler** (SVP &amp; Chief Business Officer)\nExamples are auction dynamics, quarry trend insights on topics like replacement purchases and so on. So we have a lot of experience in this area. On the Commercial Query side, look, AI Overviews continue to drive higher satisfaction and search usage. And as I noticed Q1 was really our largest expansion to date for AI Overviews both in terms of launching to new users and providing responses for more questions. That's really the core already of the answer.\n\n**Philipp Schindler** (SVP &amp; Chief Business Officer)\nAI Overview sits at the center of your question here. And when it comes to other products, look, I don't want to speculate on this, but we're happy with what we're seeing here on AI overviews. And I'm confident we can expand this to more products over time.\n\n**Operator**\nThank you. Your next question is from Doug Drummond from JPMorgan. Your line is now open.\n\n**Douglas Anmuth** (Managing Director &amp; Internet Analyst)\nGreat. Thanks for taking the questions. Phil, maybe just to go back to AI overviews for a moment. Can you just tell us how we should think about the 1,500,000,000 AI overviews users just in terms of breadth of rollout? And I know you're saying monetization at approximately the same rate, but what does that mean in terms of click through rates and conversion? And then Anat, just curious if there have been any changes to Google's approach to durably reengineering the cost base since you've joined? And if macro weakens and you see more of a slowdown, would you expect to find additional opportunities to cut back more on costs? Thank you.\n\n**Philipp Schindler** (SVP &amp; Chief Business Officer)\nYes. Look, on the ads of in AI Overviews, late last year actually we launched them within the AI Overviews on mobile in The U. S. And this builds on our previous rollout of ads above and below. So this was a change we have.\n\n**Philipp Schindler** (SVP &amp; Chief Business Officer)\nBut as I talked about it before for AI overviews overall we see the monetization at approximately the same rate, which gives us a strong base on which we can innovate even more. So I'm very happy with this. I don't think this is the moment to go into the details of click through rates and conversion and so on. But overall, we're happy with what we're seeing.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nAnd to your question on our approach to productivity and efficiency, it hasn't really changed. I've mentioned my approach and our approach as a company on at the end of twenty twenty four. And we're still focused on driving efficiency and productivity throughout the organization, both in our operating expenses and in our CapEx. I've mentioned some of these during my prepared remarks. But certainly, this helps us as we think about the investments we need to make in innovation to drive long term sustainable growth profile for the company.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nWe're able to repurpose some of these efficiencies into these investments. As well as, as you think about the increase in CapEx we've seen over the past several years and what we're investing this year, this will put additional pressure on the income statement in the form of depreciation. So, we're working hard to try and offset some of these headwinds. As well as within the CapEx investments themselves, dollars 75,000,000,000, we're looking at how do we make sure every dollar is used efficiently. We have a highly rigorous process to determine the demand behind it and then the allocation of the compute associate with our technical infrastructure investments, ensuring that we're utilizing that appropriately and that we're highly efficient with everything we're doing.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nYou've seen some of the announcement and some of the changes, but we're focusing on continuing to moderate the pace of compensation growth, looking at our real estate footprint, and again, the build out and utilization of our technical infrastructure across the business.\n\n**Douglas Anmuth** (Managing Director &amp; Internet Analyst)\nGreat. Thank you, both.\n\n**Operator**\nThank you. Our next question comes from Eric Sheridan from Goldman Sachs. Your line is now open.\n\n**Eric Sheridan** (Managing Director)\nThank you for taking the questions. First, maybe for Sundar, when you look across the consumer AI landscape today, how are you thinking about continuing to drive differentiation for Gemini as a platform through the lens of usage, utility or putting product innovation at the forefront of driving consumer habits? And then the second one maybe for Anat. If the macro environment were to change and become more downwardly volatile, how should investors think about the investments that are must make this year almost fixed in nature versus where there might be more flexibility to alter the investment priorities of the company if the macro environment were to worsen? Thank you so much.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nThanks, Eric. Obviously, it's an exciting moment on the AI front. I think the foundation for everything is obviously the frontier model progress we are seeing. And particularly with 2.5 Pro and Flash, I think we are well positioned. We are seeing tremendous reception from developers, enterprises and consumers too.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nAnd obviously, we are delivering consumer AI experiences across our product portfolio, including the primary way people experience it is obviously in Search with AI overviews and very early days with AI mode, but that will be a consumer AI forward experience. And we're already seeing very positive feedback. Queries are people are typing in roughly 2x longer queries compared to traditional search. So there's a lot of excitement there. And in the Gemini app, which you asked about, we've really seen increased momentum, particularly over the last few weeks as we've rolled out not just the newer models, but we are seeing users are really responding well to all the innovation.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nGemini Live, which is based on Project Astra, has been very well received. Deep research, I think, based on 2.5 Pro is SOTA and that's been well received. And Canvas, we've had a lot of traction as well. And so we are definitely investing more. We recently organized ourselves better to capitalize on this momentum and I'm excited about our roadmap there.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nAnd on the investments this year and overall, should there be any macroeconomic changes, you know, as I said, we're still planning to invest approximately $75,000,000,000 in CapEx this year. We do see a tremendous opportunity ahead of us across the organization, whether it's to support Google services, Google Cloud, and Google DeepMind. Recall, I've stated on the q four call that we exited the year specifically with more customer demand than we had capacity. And that was the case this quarter as well. So we want to make sure we ramp up to support customer needs and customer demands.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nHaving said that, we're investing in long term and we're investing in innovation. That's the essence of our business. And we want to do it in a responsible fashion. So you've seen us over the past couple of years, and we're continuing to do this, and you're seeing this in our results, drive efficiency and productivity throughout the business. And we've announced things such as consolidation of teams, which helps not just with cost, but with velocity and speed.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nWe're able to get things to market faster. So that's one of the areas we're focused on. You heard from Sundar the last couple of calls on just a rapid pace of innovation we're bringing to the marketplace. So the way we're doing this across the business to drive productivity and efficiency should help us have a more resilient organization irrespective of macroeconomic condition. But certainly, we don't ignore that.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nWe always look at what's happening outside the organization as well as inside, but invest appropriately to drive both the short term growth as well as the long term growth.\n\n**Eric Sheridan** (Managing Director)\nThank you.\n\n**Operator**\nThank you. Our next question comes from Ross Sandler from Barclays. Your line is now open.\n\n**Ross Sandler** (Analyst)\nGreat, thanks. One for Sundar, one for Philip. Sundar, it was disclosed this week in the trial that's going on that Gemini has 35,000,000 DAUs. And just curious, that number obviously trails ChatGPT by a pretty wide margin. Could you just talk about the strategy to get that DAU figure much higher that you guys are deploying?\n\n**Ross Sandler** (Analyst)\nAnd then Philip, just curious to hear what you're seeing on the brand advertising side at YouTube in 1Q and into early 2Q. Are brands holding up relatively well like Direct Response or are they starting to react to some of these macro jitters that we're all experiencing? Any thoughts there? Thank you very much.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nThanks, Ross. I think I touched upon this to Eric's question as well, but we are definitely I think there's been a lot of momentum in terms of product features we've been introducing and we are definitely seeing reception including increased adoption and usage based on those features. So I think we are in a good positive cycle. The recent advances on the model frontier by many metrics, think we have the best model out there now and I think that's going to drive increased adoption as well. And again, I would reiterate, people are using obviously, we have 1,500,000,000 users through AI overviews interacting with AI in a deep way, in a very engaged way.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nObviously, are innovating with AI mode. And we have a very exciting road map ahead with the Gemini app as well. So across the board, super excited about what's ahead.\n\n**Philipp Schindler** (SVP &amp; Chief Business Officer)\nAnd on your Brand question, look Brand and by the way also Direct Response had a very solid growth in Q1. Brand advertisers really enjoyed cultural moments we had like Coachella, for example, or March Madness. We had strong contributions overall from the finance and retail verticals in Q1 on this side as well. The operating metrics for YouTube were strong in Q1. Watch time growth remains robust, particularly in key monetization opportunity areas such as shorts and living room.\n\n**Philipp Schindler** (SVP &amp; Chief Business Officer)\nIt's also, by the way, nice to see the strong position of our creators who obviously benefit from the brand piece, which gives us a lot of confidence when we look at it more closely. And on the Q2 side, I mentioned it's too early to really comment on that.\n\n**Operator**\nThank you. Your next question is from Mark Smolik from Bernstein. Your line is now open.\n\n**Mark Shmulik** (Analyst)\nGreat. Thanks for taking my questions. Sundar, appreciate the color on Gemini deployment across kind of the 15 products with 5,000,000,000 users or more. It would be great to hear more about where you're seeing the most usage and deployment of Gen AI internally at Google. Perhaps whether the capabilities, are they in a place today in terms of either supplementing or augmenting the workforce?\n\n**Mark Shmulik** (Analyst)\nAnd then just to build on that earlier AI mode type questions, appreciate AI mode has 2x longer queries than traditional search, but any color you can share perhaps on how AI mode behavior differs from how consumers are using the Gemini app? Thank you.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nLook on internally, I mean, this has been extraordinary amount of focus and excitement both because I think we are the early use cases have been transformative in nature and I think this still feels like early days and long ways to go. Obviously, I had mentioned a few months ago in terms of how we are using AI for coding, We are continuing to make a lot of progress there in terms of people using coding suggestions. I think the last time I had said the number was like 25% of code that's checked in. It involves people accepting AI solutions. That number is well over 30% now.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nBut more importantly, we have deployed more deeper flows. And particularly with the newer models, I think we are working on early agentic workflows and how we can get those coding experiences to be much deeper. We are deploying it across all parts of the company. Our customer service teams are deeply leading the way there. We've both dramatically enhanced our user experience as well as made it much more efficient to do so.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nAnd we are actually bringing all our learnings and expertise in our solutions through cloud to our other customers. But beyond that, all the way from the finance team preparing for this earnings call to everything, it's deeply embedded in everything we do, but I still see it as early days and there's going to be a lot more to do. On AI Mode, look, I think we are just leaning in on the early positive feedback well, as we scaled up AI overviews. It's been one of our most positive launches and but it's been clear people have wanted even more of it. And so with AI Mode, we are bringing the our state of the art Gemini models right into Search.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nAnd I mentioned people typing in longer queries. There's a lot more complex, nuanced questions. People are following through more. People are appreciating the clean design, the fast response time and the fact that they can kind of be much more open ended, can undertake more complicated tasks, product comparisons, for example, has been a positive one, exploring how tos, planning a trip. So those are the kinds of early feedback we are seeing.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nAnd I think we are obviously really focused on improving the product across all of AI, Mode, AI Overviews and the Gemini app, and we are seeing positive user traction as well.\n\n**Operator**\nThank you. Your next question is from Mark Mahaney from Evercore. Your line is now open.\n\n**Mark Mahaney** (Senior Managing Director)\nOkay. Thanks. One for Anat and one for Sundar. Anat, getting back to a question I think that Doug was asking earlier on. You just put up record high or multi year record high margins for both Google services and for Google Cloud.\n\n**Mark Mahaney** (Senior Managing Director)\nYou talked Phil about depreciation expenses accelerating rapidly throughout the year because all the investments you've already you'd warn people about. Back in the September, you seem relatively confident that you had enough levers to kind of offset kind of rising infrastructure costs. Was that still your six months later, is that still your view that you've got enough levers that even with the rising infrastructure costs you can there's enough in there to kind of counterbalance that? And then just briefly on Waymo that continues to rise aggressively the numbers Sundar. The long term business model for Waymo, is there a reason to make a decision on that soon?\n\n**Mark Mahaney** (Senior Managing Director)\nOr have you already made the decision of whether this is a long term licensing model or you really want to run this as a standalone ride sharing delivery in autonomous vehicle business? Thank you very much.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nThanks. On your first question on profitability and what levers do we have and do we still have levers to pull first, think every organization can always push a little further. I don't view productivity goals or efficiency as an episodic kind of project based effort, but rather a continuous effort that when you get to a certain place, you push a little further. Having said that, we do have significant investments we're making across the organization, and we have been making them for the past several quarters. And we've been able to do it because we were able to find efficiency to fund those investments across the organization.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nThose are for products and services that are going to drive long term growth for the company. So, while we're trying to offset as much of the headwind associated with the increase in infrastructure costs, it will become more difficult. As I said, the depreciation will accelerate. We had about a 31% year over year growth in depreciation this quarter and it will be higher as we go throughout the year. So think about that kind of as a headwind that we have to manage against.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nBut we're continuing with pushing across the organization, leveraging, Sundar mentioned, the use of AI and kind of an AI first Google across several of our functions to help us manage a larger scope of work using our AI, AI agents, and AI tools. As Sudar mentioned, we did deleverage it in preparation for the earnings call, and we're leveraging across several functions. So there are opportunities, but there are also great opportunities for investment, and we want to make sure that we make room for to make these investments to drive long term growth and ensure we have a very resilient long term growth profile for the company.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nAnd Marc, thanks. I think this is probably the first question I've got on our earnings call on Waymo, so thank you. And I think it's a sign of its progress. Look, the thing that excites me is I think we've been laser focused and we'll continue to be on building the world's best driver. And I think doing that well really gives you a variety of optionality and business models across geographies, etcetera.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nIt will also require a successful ecosystem of partners and we can't possibly do it all ourselves. And so I'm excited about the progress the teams have made through a variety of partnerships. Obviously, a highlight of it is a partnership with Uber. We are very pleased with what we are already seeing in Austin in terms of rider satisfaction. We look forward to offering the first paid rides in Atlanta via Uber later this year.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nBut we are also building up a network of partners, for example, for maintaining fleets of vehicles and doing all the operations related to that with the recently announced partnership with Moo in Phoenix and Miami, obviously partnerships with OEMs. There are future optionality around personal ownership as well. So we are widely exploring and but at the same time, staying focused and making progress both in terms of safety, the driver experience and progress on the business model and operationally scaling it up.\n\n**Mark Mahaney** (Senior Managing Director)\nOkay. Thank you very much.\n\n**Operator**\nThank you. Our next question comes from Ken Gorelsody from Wells Fargo. Your line is now open.\n\n**Ken Gawrelski** (Analyst)\nThank you. Two if I may please. First on AI powered search. You have a number of AI powered search interfaces including three most prominently AI Overviews, AI Mode and Gemini. In the future, should we think of these as distinct experiences that will be long lasting or more experimental now and Google will eventually focus on one approach going forward?\n\n**Ken Gawrelski** (Analyst)\nAnd the second one is more on the financial side. You continue to experience very healthy gross margin expansion. We see the TAC, sure, Anat, you also talked about the offsetting depreciation expense. Could you talk about beyond those two buckets where you're seeing the real savings on the COGS line and driving that gross margin expansion? And maybe even how we should be thinking about that going forward? Thank you.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nOkay. Now, maybe on AI powered Search and how do we see our consumer experiences. Look, do think Search and Gemini obviously will be two distinct efforts, right? I think there are obviously some areas of overlap, but they're also you know, like expose very, very different use cases. And so, for example, in Gemini, we see people iteratively coding and going much deeper on a coding workflow, as an example.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nSo I think both will be around. Within Search, would think of AI overviews scaling up and working for our entire user base, but an AI mode is the tip of the tree for us pushing forward on an AI forward experience. There will be things which we discover there which will make sense in the context of AI overviews, so I think will flow through to our user base. But you almost want to think of what are the most advanced 1,000,000 people using Search for, the most advanced 10,000,000 people, and then how do 1,000,000,000 people use Search for. And we want to innovate and so I think this allows us to do that.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nBut the true north through all of this is user feedback, user satisfaction, user experience. And so that will determine where this all works out in the future.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nAnd to your question on gross margin, a couple of trends to highlight there and I've mentioned this in the prepared remarks. You've seen improvement in tech that's really driven by the change in revenue mix with a continued search growth and then network revenue declines. Network revenue has a much higher tech rate. So that mix is helping us from a gross margin perspective. So think about that as well.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nNow we do have depreciation for technical infrastructure hits in two place primarily in two places in the income statement. One is in other costs of sales and the rest is in R and D. So it is in that line item that's impacting costs of sales. Now we've had some efficiencies there and I did mention the improvement in our overall cost of headcount growth and compensation kind of moderating those growth. So that helps us as well more than offset the depreciation increases in Q1.\n\n**Anat Ashkenazi** (Senior VP &amp; CFO)\nBut as I mentioned, this number will be higher in the coming quarters. Recall we have we said approximately $75,000,000,000 in CapEx, which is up from $55,000,000,000 or just over $50,000,000,000 last year. So, there is expected to be quite a significant increase in depreciation.\n\n**Operator**\nThank you. And our last question comes from Ron Josey from Citi. Your line is now open.\n\n**Ron Josey** (Managing Director)\nGreat. Thanks for taking the question. Philip, I wanted to touch a little bit more on your comments around Direct Response and YouTube. I think it's been improving and been a driver over the past couple of quarters. I'd love to hear more just about what's driving that.\n\n**Ron Josey** (Managing Director)\nIs that the demand gen and integration with Pmax? Or are users perhaps more involved on direct response now that Shorts usage is rising? Would love your thoughts there.\n\n**Philipp Schindler** (SVP &amp; Chief Business Officer)\nYes. I think there's a lot of different factors. Mostly, we continue to help our customers really using our AI powered tools. You mentioned a few of them to drive performance. That's a very big one.\n\n**Philipp Schindler** (SVP &amp; Chief Business Officer)\nAs I mentioned before, we're also happy with the progress we're seeing on Shorts and closing the monetization gap here to the overall business, which is actually really nice to see, especially in The U. S. So we're very happy with that.\n\n**Sundar Pichai** (Director &amp; Chief Executive Officer)\nYes. And I'll just chime in to say YouTube just celebrated its twentieth birthday and we now have more than 20,000,000,000 videos on YouTube and we get 20,000,000 videos uploaded every day. So I think it's a tremendous platform and thanks to all the creators and users who have supported us there over the years.\n\n**Ron Josey** (Managing Director)\nGreat. Thank you.\n\n**Operator**\nThank you. And that concludes our question and answer session for today. I would like to turn the conference back over to Jim Freeland for any further remarks.\n\n**Jim Friedland** (Senior Director - IR)\nThanks everyone for joining us today. We look forward to speaking with you again on our second quarter twenty twenty five call. Thank you and have a good evening.\n\n**Operator**\nThank you everyone. This concludes today's conference call. Thank you for participating. You may now disconnect.",
      "fetched_at": "2026-02-04T15:37:29.714Z"
    }
  ]
}