{
  "ticker": "MRVL",
  "last_updated": "2026-02-04T15:41:58.370Z",
  "total_transcripts": 5,
  "transcripts": [
    {
      "ticker": "MRVL",
      "title": "Marvell Technology, Inc. (MRVL) Q3 FY2026 & Acquisition earnings call transcript",
      "published_date": "Dec 2, 2025, 4:45 PM EST",
      "fiscal_year": "2026",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/MRVL/earnings/MRVL-Q3-2026-earnings_call-379997.html",
      "content": "**Operator**\nGood afternoon and welcome to the Marvell Technology Inc.'s third quarter of fiscal year 2026 earnings conference call. At this time, all participants are in a listen-only mode. If anyone should require operator assistance during the conference, please press star zero on your telephone keypad. A question-and-answer session will follow the formal presentation. Please note this event is being recorded. I will now turn the conference over to Mr. Ashish Saran, Senior Vice President of Investor Relations. Thank you. You may begin.\n\n**Ashish Saran** (SVP of Investor Relations)\nThank you and good afternoon, everyone. Welcome to Marvell's third quarter of fiscal year 2026 earnings call. Joining me today are Matt Murphy, Marvell's Chairman and CEO, Willem Meintjes, CFO, Chris Koopmans, President and COO, and Sandeep Bharathi, President, Data Center Group. Let me remind everyone that certain comments made today include forward-looking statements which are subject to significant risks and uncertainties that could cause our actual results to differ materially from management's current expectations. Please review the cautionary statements and risk factors contained in our earnings press release, which we filed with the SEC today and posted on our website, as well as our most recent 8-K, 10-K, 10-Q, and other documents filed by us from time to time with the SEC. We do not intend to update our forward-looking statements. During our call today, we will refer to certain non-GAAP financial measures.\n\n**Ashish Saran** (SVP of Investor Relations)\nA reconciliation between our GAAP and non-GAAP financial measures is available in our earnings press release. As we discussed in our second quarter earnings call, going forward, we are consolidating our non-data center end markets into a single new communications and other end market. The composition of our data center end market remains unchanged. Our earnings press release for the third quarter reports revenue by end market in both the prior format as well as the new go-forward format. Please note that today's call will be longer than typical as we will be discussing the acquisition announced today in addition to a number of extensive updates on our business. You may also find additional details on this transaction in the press release and Form 8-K filed with the SEC today, and a presentation posted on our website on the investor relations page.\n\n**Ashish Saran** (SVP of Investor Relations)\nLet me now turn the call over to Matt for his comments on the quarter. Matt.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, hey, thanks, Ashish. And good afternoon, everyone. Settle in, okay? We have a lot of good stuff to talk about today. For the third quarter of fiscal 2026, Marvell delivered record revenue of $2.075 billion, reflecting a 3% sequential increase and strong 37% year-over-year growth. Revenue was above the midpoint of guidance driven by stronger-than-forecast demand in our data center end market. As a result, non-GAAP earnings per share of $0.76 exceeded the midpoint of guidance by $0.02. Excluding revenue from the divested automotive Ethernet business, the implied revenue growth for Marvell's go-forward business was approximately 6% sequentially and 41% year-over-year. Momentum in our data center business remained strong, with revenue growing 38% year-over-year, fueled by robust AI demand. We also saw a strong recovery in our communications and other end market, where revenue grew 34% year-over-year as reported and nearly 50% year-over-year, excluding the automotive Ethernet business.\n\n**Matt Murphy** (Chairman and CEO)\nWe expect growth to continue in the fourth quarter, with total company revenue forecast at $2.2 billion at the midpoint. We expect this momentum to continue throughout next fiscal year and beyond. I will provide more context on our numerous growth drivers later in the call. Before discussing our end markets, I'm excited to share details on the strategic acquisition we announced today of Celestial AI, which brings an entirely new disruptive technology, a photonic fabric platform purpose-built for next-generation scale-up interconnect. This acquisition is the latest in a series of decisive moves to further strengthen our data center portfolio. Since 2019, we have continued to increase our focus on data center, divesting our Wi-Fi business and acquiring Avera, Aquantia, Inphi, and Innovium. These transactions have driven significant revenue growth and scale and have each proven to be an absolute home run.\n\n**Matt Murphy** (Chairman and CEO)\nThis year, following the divestiture of our automotive Ethernet business, we are continuing to double down on data center with the acquisition of Celestial AI. This positions us to further capitalize on the massive opportunity and accelerated infrastructure. The acquisition is expected to close in the first quarter of next year, subject to customary closing conditions, including regulatory reviews in the United States, and will remain a separate independent company through the regulatory process. AI is reshaping data center architecture at an unprecedented speed. Next-generation accelerated systems are no longer confined to a single rack. They are evolving into multi-rack scale-up fabrics that connect hundreds of XPUs in a high-bandwidth, ultra-low-latency any-to-any fashion. These advanced fabrics demand purpose-built switches and interconnects engineered to deliver the performance and efficiency required at scale, creating a new TAM for companies like Marvell.\n\n**Matt Murphy** (Chairman and CEO)\nIndustry analysts are forecasting the merchant portion of the scale-up switch market to approach $6 billion in revenue in 2030. On the interconnect side, we are seeing the dollar content for optics of the same magnitude as a scale-up switch. As the optical interconnect attaches to both the XPU and the switch, the opportunity actually doubles, meaning over $10 billion. These are both very large and exciting incremental opportunities for Marvell. As we first evaluated Celestial AI, it reminded us of our early look at Inphi and the promise we saw in their PAM technology to transform the scale-out interconnect market. We see even greater potential for Celestial AI's photonic fabric to transform the scale-up interconnect market. Interconnect technology is as critical as switching and scale-up networks to enable hundreds of XPUs to be tightly coupled together.\n\n**Matt Murphy** (Chairman and CEO)\nThis is driving a massive increase in the number of links in the network and overall system bandwidth, therefore creating the need for a fabric which can span across racks. Copper-based interconnects used in today's scale-up systems are approaching their fundamental limits in reach and bandwidth, creating a compelling need for optical solutions. Celestial AI's Photonic Fabric technology platform was purpose-built for this inflection. It enables large AI clusters that scale both within and across racks using a high bandwidth, low latency, low power, and cost-effective optical fabric. This breakthrough enables a true optical solution with greater than two times the power efficiency of copper interconnects, but with far longer reach and significantly higher bandwidth. In addition to exceptionally low power consumption, Celestial AI's solution provides nanosecond-class latency and excellent thermal stability, which enables deeper levels of optical interconnectivity into XPUs and switch systems.\n\n**Matt Murphy** (Chairman and CEO)\nThe thermal stability of Celestial AI's photonic fabric technology is a significant competitive differentiator. It enables reliable operation in the extreme thermal environments created by large, multi-kilowatt XPUs. This allows the photonics technology to be co-packaged vertically with the high-power XPUs and switches in a 3D package, enabling the photonic connection to be made directly into the XPU rather than from the edge of the die. This stands in sharp contrast to many other CPO implementations, where the photonics engine sits adjacent to the XPU and must connect at the die edge. Celestial AI's approach results in a more compact and integrated solution, freeing up highly valuable die edge beachfront, which can be repurposed to significantly increase the amount of HBM within the XPU package. Eliminating beachfront I/O constraints also significantly increases the amount of package bandwidth possible for XPUs and switch systems.\n\n**Matt Murphy** (Chairman and CEO)\nCelestial AI's first-generation product is a photonic fabric chiplet, or PF chiplet, which integrates all the required electrical and optical components, including drivers, TIAs, equalizers, SerDes, microcontrollers, modulators, photodiodes, and waveguides, all into a compact form factor. This is the industry's first scale-up optical solution delivering an unprecedented 16 TB per second of bandwidth in a single chiplet, 10 times the capacity of today's state-of-the-art 1.6T ports used in scale-out applications. Its compact form factor allows multiple PF chiplets to be co-packaged with XPUs and the scale-up switches on the other side of the link to further increase total bandwidth. Celestial AI is deeply engaged with multiple hyperscalers and ecosystem partners who recognize the disruptive potential of this technology. Notably, Celestial AI has already secured a major design win with one of the world's largest hyperscalers, who plans to use Celestial AI's PF chiplets in its next-generation scale-up architecture.\n\n**Matt Murphy** (Chairman and CEO)\nThese PF chiplets will be co-packaged into both the hyperscaler's custom XPUs and the scale-up switches providing connectivity. This is expected to be the industry's first large-scale commercial deployment of optical interconnects for scale-up connectivity. Beyond connecting XPUs and scale-up networks, the photonic fabric technology platform can enable a wide range of transformational applications over time. First is a pooled memory appliance that uses Celestial AI's photonic fabric to optically connect multiple XPUs to large shared external disaggregated memory banks. A second use case for Celestial AI's photonic fabric is to replace traditional electrical die-to-die connections in multi-die packages. This is just the beginning of a broad set of new applications which can be enabled from this technology. After close, we expect meaningful revenue contributions from Celestial AI to begin in the second half of fiscal 2028.\n\n**Matt Murphy** (Chairman and CEO)\nOur base case forecast shows Celestial AI's revenue reaching a $500 million annualized run rate in the fourth quarter of fiscal 2028, doubling to a $1 billion run rate by the fourth quarter of fiscal 2029. Following the close of the transaction, we look forward to welcoming the Celestial AI team to Marvell. Celestial AI brings one of the industry's strongest photonic interconnect engineering groups with deep expertise in optics, advanced packaging, and high-speed interconnect architecture and systems. In addition, the CEO, founders, and key executives from Celestial AI will assume leadership roles at Marvell, continuing our successful integration blueprint from prior acquisitions. These leaders have been at the forefront of innovation in scale-up switching and photonic interconnects, and their technical depth and strategic insight will play an important role in shaping Marvell's next phase of growth. Okay, now let me transition back to Marvell's current business and outlook.\n\n**Matt Murphy** (Chairman and CEO)\nAs you may recall, on September 24th, I hosted a virtual call with investors where I outlined a framework for Marvell's revenue growth for fiscal 2027. At that time, we indexed our data center growth potential to Cloud CapEx, which was expected to grow 18% next year. Since then, Cloud CapEx growth expectations have increased to over 30%. Additionally, we have seen strong demand increases for our products for next year. As a result, our outlook for next fiscal year is even stronger than the expectations we discussed in September. We expect our interconnect business, which is roughly half our overall data center revenue, to continue growing faster than Cloud CapEx next year, even with the higher outlook. We expect our custom business, roughly a quarter of our overall data center revenue, to grow by at least 20% next year, also from higher than prior expectations.\n\n**Matt Murphy** (Chairman and CEO)\nAs a reminder, in the near term, this business remains tied to a few specific sockets. We expect custom growth next fiscal year to be higher in the second half and do not expect any air pockets in custom revenue. Next year's custom revenue forecast comprehends a transition to a next-generation XPU at a large customer, and I would note that we already have purchase orders for the entirety of next fiscal year's current forecast for this next-generation program. Our revenue forecast for this program remains consistent with our prior expectations. As we look beyond fiscal 2027, we have several high-volume custom designs in development, meaningful revenue expected from these programs in fiscal 2028, consistent with our prior communications.\n\n**Matt Murphy** (Chairman and CEO)\nFor the remaining quarter of our data center business, which includes storage, switching, and other products, we now expect revenue to grow by at least 15% next year, up from our prior expectation of 10% growth, driven in particular from increased demand for our switching products. Adding all of this up, we now expect Marvell's data center revenue to grow year-over-year by more than 25% next fiscal year. Please note that this forecast does not include any revenue from the pending acquisition of Celestial AI. And for our communications and other end market, we continue to expect 10% revenue growth next year. Putting it all together, we are looking forward to a strong fiscal 2027. Let me provide more details for each of our end markets. In our data center end market, we delivered record third-quarter revenue of $1.52 billion, representing 2% sequential growth and 38% year-over-year growth.\n\n**Matt Murphy** (Chairman and CEO)\nRevenue exceeded our guidance for flat sequential performance, driven by increased demand across our networking portfolio. Our industry-leading PAM DSPs, TIAs, and drivers continue to see strong demand, with revenue from our optical interconnect businesses growing by double digits sequentially on a percentage basis. Our data center storage and switch businesses also posted double-digit sequential revenue growth on a percentage basis. As expected, this strength was partially offset by a sequential decline in our custom revenue due to lumpiness in demand. Looking ahead to the fourth quarter, we expect revenue growth from our data center end market to accelerate, growing sequentially in the high single digits on a percentage basis and approximately 20% year-over-year. This growth is expected to be driven by a rebound in custom and continued growth in interconnect, switching, and storage.\n\n**Matt Murphy** (Chairman and CEO)\nLet me now highlight broader trends we are seeing in both our established data center businesses and our newer growth initiatives. I'll start with our interconnect business, where we offer the industry's broadest and most comprehensive high-speed connectivity portfolio. As our PAM DSP products enter into their fifth year of 800-gig production, demand for our solutions continues to accelerate, underscoring the strength of the platform we have built through more than a decade of sustained investment in core technology. Our playbook is simple: first to market, first to ramp, with timely follow-up, optimized solutions to maintain leadership. We did this at 400-gig, 800-gig, and now at 1.6T, where we established early leadership with our first 5-nanometer solution, which sampled in February 2024. We then accelerated the launch of our optimized 1.6T solution and sampled our 3-nanometer product just one year later in February 2025.\n\n**Matt Murphy** (Chairman and CEO)\nAs a result, we are enabling volume production of pluggable 1.6T transceivers across the industry. We began shipping our 1.6T products in the second half of this fiscal year and are seeing exceptionally strong demand heading into next year. This consistent execution enables us to secure qualifications at major customers well ahead of competitors, reinforcing market leadership. While 1.6T has a long lifecycle ahead, we have already demonstrated at the Optical Fiber Conference this past April 400-gig per lane technology to drive the next industry transition to 3.2T. The demonstration was on 3-nanometer technology, but we expect production deployments, which are expected in calendar 2028, to require 2-nanometer solutions to optimize module power. In addition to our PAM portfolio, we are also enabling longer-reach connectivity with our coherent light solutions to support campus-wide data centers in the era of million GPU AI clusters.\n\n**Matt Murphy** (Chairman and CEO)\nWe introduced our 1.6T Coherent Light solution last year. We expect to start shipping next year, and we are on track to deliver our 3.2T solution the year after. Now, complementing our DSPs, our high-performance analog TIAs and drivers remain foundational to our electro-optics leadership. Our TIAs have a significant performance lead at 1.6T, and we are seeing strong broad-based demand for our products, which are enabling the entire ecosystem. We have also secured several LPO sockets across multiple hyperscalers and are leading this emerging category as well, although deployments remain relatively small today in the context of a very large transceiver market. Turning to two of our newer interconnect growth drivers, AECs and retimers. Both markets are undergoing a shift to high-speed PAM-based solutions, an inflection point that is perfectly aligned to Marvell's strengths.\n\n**Matt Murphy** (Chairman and CEO)\nFor the past year, we have been collaborating closely with the cable ecosystem to enable 100 and 200-gig per lane AECs, and we are now on the cusp of substantial product ramps. We have secured design wins with significant share positions at two Tier 1 U.S. hyperscalers, along with multiple wins at emerging hyperscalers. We are seeing strong demand for our AEC DSPs, and we expect our share to continue to grow as PAM-based 100 and 200-gig technology becomes dominant. Our PCIe Gen 6 retimers are also gaining broad traction. We are currently engaged with more than 30 customers and partners, including hyperscalers, cable partners, and system OEMs and ODMs. We are already designed into more than 10 sockets, and we expect to enter production in the second half of next year with full revenue contribution in fiscal 2028.\n\n**Matt Murphy** (Chairman and CEO)\nWe expect our AEC and retimer revenue in aggregate to more than double from this year to next year. Turning to our data center switching business, which continues to gain momentum, we expect revenue to exceed $300 million this fiscal year. We expect strong sustained demand for our 12.8T products, reflecting our key customers' plans to rely on 12.8T as a workhorse in their scale-out networks for several more years. In parallel, we've begun shipping our next-generation 51.2T products with a strong ramp expected next year. As a result, we now expect our data center switch revenue to surpass $500 million next fiscal year, faster than what I had indicated last quarter. We will also introduce our 100T products next year as we continue to execute our long-term roadmap. We are also accelerating our scale-up switch efforts.\n\n**Matt Murphy** (Chairman and CEO)\nThese next-generation solutions are as complex as 100T scale-out switches, with high radix supporting up to 576 ports. We are fast-tracking our scale-up switch development by leveraging our in-house, high-speed, low-power SerDes and experience in developing extremely large reticle-sized chips. We are deeply engaged with key customers and partners and are on track to sample our UALink 115T and 57T solutions in the second half of fiscal 2027, with volume production expected in fiscal 2028. In parallel with our UALink development, we are also collaborating closely with key customers under CXL solutions, completing our scale-up roadmap to address both standards. Turning to our custom business, we expect accelerated growth over the next several years, fueled by our growing portfolio of design wins. At our custom event in June, we disclosed a total of 18 XPU and XPU-attached socket design wins.\n\n**Matt Murphy** (Chairman and CEO)\nSeveral of these are already in volume production, with the remainder on track to ramp over the next couple of years. Since that event, our team has secured additional custom sockets, which represent more than 10% of the $75 billion lifetime revenue opportunity funnel we outlined in June. These new wins include multiple XPU-attached sockets, an XPU win at an emerging hyperscaler, and most recently, a design win for an electrical I/O chiplet inside an XPU. This is a new trend we see emerging where customers and partners are partnering with Marvell to gain access to our high-performance networking technology to be integrated along with their core compute engines within multi-die packages, which are becoming more prevalent in a reticle-sized constrained world. This provides Marvell another avenue for custom growth and sockets, which were otherwise not available to us as full XPUs.\n\n**Matt Murphy** (Chairman and CEO)\nNow, let me provide additional perspective on the rapidly developing XPU-attached market. These attached devices offload specific functions such as network I/O, memory expansion, and security from XPUs, GPUs, and CPUs, freeing them up to exclusively focus scarce compute resources on the primary AI workload. We now have more than 15 XPU-attached wins, and today, let me highlight two major use cases emerging across multiple hyperscalers as they architect their next-generation custom accelerated infrastructure. The first use case is for custom foundational and smart NICs, and Marvell has already secured multiple design wins across several hyperscalers. Our customers plan to attach these NICs not only to their custom accelerators, but increasingly to their broader AI server fleets, which at large hyperscalers can exceed 1 million units or more annually.\n\n**Matt Murphy** (Chairman and CEO)\nThe second use case we are seeing emerge in the XPU-attached market is for CXL-based products that enable memory expansion and acceleration to overcome the memory wall challenge. We made early strategic investments in CXL several years ago, and we have now secured five unique sockets across two Tier 1 hyperscalers, U.S. hyperscalers, and are deeply engaged with the third. The first custom CXL design win started shipping already in the first quarter of this year and is entering volume production now. A second socket focused on near-memory compute is expected to enter production a year from now. The remaining CXL design wins are slated for production in calendar 2027. Our solution's technical advantages include support for both DDR4 and DDR5, larger memory capacity and compression, along with deep partnerships with the leading memory and CPU providers.\n\n**Matt Murphy** (Chairman and CEO)\nWhile our initial win centered on offloading from CPUs, more recent wins attached directly to XPUs, which are deployed in far greater numbers. For several upcoming high-volume CXL production ramps, Marvell is leading the transition to next-generation memory architectures. We expect the XPU-attached market to continue to evolve at a rapid pace, and we are very encouraged to see the attach rate of our solutions exceeding our initial expectations. Now, based on designs we have already won just for the NIC and CXL use cases, we have line of sight to revenue exceeding $2 billion by fiscal 2029 and a significantly higher forecast in the following years. This is why we are so excited about our data center business.\n\n**Matt Murphy** (Chairman and CEO)\nInterconnect, switch, XPU, XPU-attached, storage, scale-up, scale-out, we are everywhere in the AI rack, and we are just getting started with what we expect to be a massive TAM ahead of us. All right, let me now move to our communications end market, where we delivered $557 million in third-quarter revenue, which grew 8% sequentially and 34% year-over-year. Excluding revenue from the divested automotive Ethernet business, the implied revenue growth for Marvell's communications end market for the third quarter would be closer to 20% sequentially and 50% year-over-year. These strong results were driven by normalizing customer inventory levels and strong adoption of our refreshed product portfolio at both our enterprise networking and carrier infrastructure customers.\n\n**Matt Murphy** (Chairman and CEO)\nLooking ahead to the fourth quarter, we expect revenue from our communications end market to grow sequentially in the low single digits on a percentage basis, with year-over-year growth of approximately 25% as reported and closer to 40% year-over-year, excluding our former automotive Ethernet business. We expect strong sequential growth from carrier and ongoing growth from enterprise to be partially offset by steep seasonal declines in our consumer business. We expect the enterprise networking portion of our communications end market to reach an annualized revenue run rate of approximately $1 billion in the fourth quarter, which would reflect the complete normalization of customer inventory levels in that business. Going forward from this $1 billion annualized revenue run rate, we expect this business to grow in line with enterprise IT spending.\n\n**Matt Murphy** (Chairman and CEO)\nWhile our carrier business has also been recovering and our fourth-quarter guidance implies this business to almost double from the year-ago quarter, we see continued recovery until this business also settles into its long-term growth trajectory, which would be in line with carrier CapEx. So, in summary, during the third quarter of fiscal 2026, we continue to expand operating margins, grow earnings per share, and set new revenue records. We executed our $1 billion accelerated stock repurchase program in addition to repurchasing $300 million of stock through our ongoing buyback program funded by our growing operating cash flow. Looking ahead, we expect momentum to continue in the fourth quarter, with total company revenue forecast at $2.2 billion at the midpoint, representing 6% sequential and 21% year-over-year growth.\n\n**Matt Murphy** (Chairman and CEO)\nExcluding revenue from our former automotive Ethernet business, implied year-over-year revenue growth from Marvell's go-forward business would be approximately 24% at the midpoint of our forecast for the fourth quarter. As I noted in my opening remarks, we are seeing robust demand signals and strong bookings across our entire portfolio, positioning us for a strong fiscal 2027 and even faster growth in fiscal 2028. Customers are planning to add substantial AI capacity over the next several years and are partnering closely with us on long-term technology roadmaps and coordinated capacity planning. In addition to benefiting from rapid market expansion, we have several of our own unique growth drivers. Taken together, we expect strong market tailwinds and new product cycles to drive significant growth inflections ahead of us.\n\n**Matt Murphy** (Chairman and CEO)\nAs a result, we see a path for our data center revenue growth in fiscal 2028 to accelerate meaningfully above the 25% growth we expect in fiscal 2027, so look, we covered a lot of ground today, and so before I close, let me just quickly highlight a few key takeaways. First, we have activated Marvell's M&A playbook and expect to close the transformational acquisition of Celestial AI in the first quarter of next fiscal year, enabling us to fully capitalize on the massive scale-up opportunity. Second, our interconnect business is firing on all cylinders. Our electro-optic interconnect platforms continue to lead the market with world-class roadmaps across the board and accelerating demand. Finally, when you put it all together, we are positioned for several years of exceptional performance, building on this fiscal year's projected revenue growth of more than 40%.\n\n**Matt Murphy** (Chairman and CEO)\nI look forward to updating you on our progress over the coming quarters, and with all of that, I'll turn the call over to Willem for more detail on our recent results and outlook.\n\n**Willem Meintjes** (CFO)\nThank you, Matt, and good afternoon, everyone. Let me start with a summary of financial results for the third quarter of fiscal 2026. Revenue in the third quarter was $2.075 billion, growing 37% year-over-year and 3% sequentially. Data centers were our largest end market, contributing 73% of total revenue. Our communications and other end market contributed the remaining 27% of revenue. GAAP gross margin was 51.6%. Non-GAAP gross margin was 59.7%, an increase of 30 basis points sequentially. Moving on to operating expenses. GAAP operating expenses were $712 million, including stock-based compensation, amortization of acquired intangible assets, restructuring costs, and acquisition-related costs. Non-GAAP operating expenses came in at $485 million, in line with our guidance.\n\n**Willem Meintjes** (CFO)\nOur GAAP operating margin was 17.2%, while our Non-GAAP operating margin was 36.3%. I'm pleased that we drove a 150 basis point sequential increase in Non-GAAP operating margin. For the third quarter, GAAP earnings per diluted share was $2.20, including the gain from the divestiture of the automotive Ethernet business. Non-GAAP earnings per diluted share was $0.76, reflecting year-over-year growth of 77%, which is more than double the pace of revenue growth, demonstrating the significant operating leverage in our model. Non-GAAP earnings per diluted share increased 13% sequentially. Now, turning to our cash flow and balance sheet. Cash flow from operations in the third quarter was a record $582 million, growing approximately $121 million from the prior quarter. Our inventory at the end of the third quarter was $1.01 billion, a decrease of $37 million from the prior quarter. During the quarter, we executed our $1 billion accelerated repurchase program.\n\n**Willem Meintjes** (CFO)\nIn addition, we repurchased $300 million of our stock through our ongoing capital return program and returned $51 million to shareholders through cash dividends in the quarter. As of the end of the third quarter, our total debt was $4.5 billion, with a gross debt-to-EBITDA ratio of 1.47 times and a net debt-to-EBITDA ratio of 0.58 times. Our debt ratios have continued to improve as we have driven an increase in our EBITDA. As of the end of the third fiscal quarter, our cash and cash equivalents were $2.7 billion, an increase of $1.5 billion from last quarter, reflecting the addition of proceeds from the divestiture of our automotive Ethernet business and ongoing cash generation from operations, offset by our capital return of $1.35 billion between stock repurchases and dividends.\n\n**Willem Meintjes** (CFO)\nTurning to our guidance for the fourth quarter of fiscal 2026, we're forecasting revenue to be in the range of $2.2 billion, plus or minus 5%. We expect our GAAP gross margin to be between 51.1% and 52.1%. We expect our Non-GAAP gross margin to be between 58.5% and 59.5%. Looking forward, we anticipate that the overall level of revenue and product mix will remain key determinants of our gross margin in any given quarter. For the fourth quarter, we project our GAAP operating expenses to be approximately $741 million. We anticipate our Non-GAAP operating expenses to be approximately $515 million, growing from the prior quarter as we continue to invest in the business and anticipate higher employee bonus payouts reflecting a strong expected finish to the fiscal year.\n\n**Willem Meintjes** (CFO)\nFor the fourth quarter, we expect GAAP and Non-GAAP other income and expense, including interest on our debt, to be approximately $30 million. We expect our Non-GAAP tax rate of 10% for the fourth quarter. We expect our basic weighted average shares outstanding to be 850 million and our diluted weighted average shares outstanding to be 857 million. We anticipate GAAP earnings per diluted share in the range of $0.31-$0.41. We expect Non-GAAP earnings per diluted share in the range of $0.74-$0.84. Looking ahead to fiscal 2027, Matt already provided an update on our strong revenue growth expectations. We intend to continue to invest in growing our business while driving operating leverage and expect our Non-GAAP operating expenses to increase at roughly half the rate of the revenue growth next fiscal year.\n\n**Willem Meintjes** (CFO)\nKeep in mind that we typically see a mid-single-digit sequential increase in OpEx on a percentage basis in the first quarter. This forecast for next year's OpEx does not include any additions from the acquisition we announced today. I will provide that forecast separately. Regarding taxes, we expect our Non-GAAP tax rate to move to approximately 12% next fiscal year. Turning to the acquisition we announced today, post-closing, we expect the addition of Celestial AI to add approximately $50 million in annual operating expenses. We expect Celestial AI to start generating meaningful revenue in the second half of fiscal 2028, at which point it is expected to become accretive to our Non-GAAP earnings. We plan to fund the acquisition through a combination of stock and cash on hand and do not intend to take on additional debt. We have a strong balance sheet and are generating robust operating cash flow.\n\n**Willem Meintjes** (CFO)\nAs a result, in parallel with paying for the acquisition, we plan on continuing to return capital to stockholders through dividends and buybacks. In summary, we're executing on our strategy to drive strong revenue growth while delivering operating leverage. In addition to organic investments, we are actively deploying our strong balance sheet to acquire a transformational asset that we expect to further strengthen our capabilities and increase our addressable market. With that, we're ready to start our Q&A session. Operator, please open the line and announce Q&A instructions. Thank you.\n\n**Operator**\nWe will now be conducting a question-and-answer session. If you would like to ask a question, please press star one on your telephone keypad. The confirmation tone will indicate your line is in the question queue. You may press star two to remove your question from the queue. In the interest of time, please restrict yourself to one question only.\n\n**Operator**\nIf you have additional questions, please rejoin the queue. At this time, we'll pause momentarily to assemble our roster. Thank you. Our first question is from Ross Seymore with Deutsche Bank.\n\n**Ross Seymore** (Managing Director)\nHi guys, thanks for letting me ask a question. Matt, I appreciate all the details you gave about how to think about next year. If I run through those numbers, basically, it sounds like you're implying somewhere around $10 billion in revenue for next year. So I guess, first of all, is that in the right ballpark? And then back in June, you gave a longer-term target for fiscal 2029 for your business, especially on the AI side of things. How does what you're looking for next year get you aligned to those long-term targets?\n\n**Matt Murphy** (Chairman and CEO)\nYeah, hey, thanks, Ross. I think that's actually a great way to tee up the Q&A here. So yeah, a couple of things.\n\n**Matt Murphy** (Chairman and CEO)\nI think you're absolutely in the ballpark when you add up the numbers I gave you on $10 billion for next year. I think that's a great target, actually, by the way, that is motivational for us as a team to go drive. Just as a reminder, this is just based on the Marvell organic plan, no M&A contribution. A couple of things about next year, and then I'll actually give you some commentary on how you think about that slope we're on. For next year, another thing I would note. I didn't say in my prepared remarks, but we do expect sequential revenue growth next year every quarter, so year-over-year. We see a nice growth throughout the year. I would say the second half of the year is stronger than the first and with, I think, a really compelling exit rate to fiscal 2027.\n\n**Matt Murphy** (Chairman and CEO)\nNow, it's a little far out to go all the way to 2029, let's say, but let me just give you a path sort of on where we're headed and how we think about fiscal 2028 and how we build on that strong second half we see next year. So a couple of things, maybe to talk about those same businesses. So first, on custom, and just as a reminder, I mean, basically, we quadrupled that business from calendar 2023 to 2024. We doubled it from calendar 2024 to 2025. We're saying it's going to be up about 20% this next year. But then when I look at the year after, with all this goodness from XPU Attach, plus a new meaningful XPU socket ramping and the other programs continuing, we see the custom business actually in fiscal 2028 doubling off of 2027.\n\n**Matt Murphy** (Chairman and CEO)\nWe see a re-acceleration big time in that year. And that puts us on a nice trajectory towards our growth targets in fiscal 2029 in custom, coming off strong second half next year and then in fiscal 2028. On interconnect, look, it's early, but we do expect that business should continue to outgrow CapEx. It's done that for a long time. Look, if you just said, \"Hey, 20% CapEx growth in fiscal 2028,\" and nobody knows what that number is, but just peg that in there for now, we'll definitely grow above that. And I would say our customer forecasts support a much higher number than that. But just as a base case, just assume CapEx is 20% that year and so OpEx would grow faster. And then for storage switch and the other part of data center, just assume 10% growth in fiscal 2028 over 2027.\n\n**Matt Murphy** (Chairman and CEO)\nI think that's a reasonable set of assumptions to use based on what we see. And so when you actually add all that together, you come up with a number bottoms up, which looks more like 40% growth in data center in fiscal 2028. So that's what I was talking about in my lead-in, which was strong data center, 45% growth basically this year in data center, targeting 25% next year, and then 40% the year after. And if you actually look at it over the cycle where we started back in calendar 2023, that's like a 50% kind of compounded growth rate we'll be growing our data center business. So the 2028 numbers I'm laying out for you are not totally crazy.\n\n**Matt Murphy** (Chairman and CEO)\nAnd then just for reference, if you just sort of plug in comms and other growing at GDP for fiscal 2028, just to keep it simple, again, it's too far out, you basically get Marvell growing like another 30% in fiscal 2028, which would be above where we're looking for 2027. So kind of a long answer, but maybe what's been on a lot of investors' mind is how do you get from where we are to where we're going. But certainly, we're very optimistic about our outlook over the next couple of years. And then things like Celestial AI and some of these other big growth drivers, those are going to kick in starting in fiscal 2028, but then really in 2029 and 2030 and beyond. And I think through the end of the decade, it's looking very bright for Marvell. Thanks for the question.\n\n**Ross Seymore** (Managing Director)\nThank you.\n\n**Operator**\nOur next question is from Harlan Sur with JPMorgan.\n\n**Harlan Sur** (Executive Director and Equity Research)\nYeah, good afternoon. Thanks for taking my question and congrats on the Celestial acquisition. Today, Matt, your lead AI customer announced their next-generation 3-nanometer AI XPU product. And I think you just said you have secured purchase orders for this program for the entirety of next year. But your lead customer also pre-announced their next-generation 2-nanometer XPU product today as well, which we believe you're also involved with, especially now with the Celestial team. I remember at the June custom AI event that the team talked about concurrent design programs. In other words, at the same time, you're towards the tail end of your customer's 3-nanometer design. You're already starting to work with customers on their next-generation 2-nanometer designs. During our fireside chat in September, you talked about the team being heads-down focused on 2-nanometer designs.\n\n**Harlan Sur** (Executive Director and Equity Research)\nYou even talked about next-generation A16 and A14 technologies. Can you just give us an update on your sub-3-nanometer design win pipeline? Does it include both XPU, XPU-attach programs, and what's the timeline for these programs to ramp into production?\n\n**Matt Murphy** (Chairman and CEO)\nYeah, thanks, Harlan, for the question. And yeah, just in the spirit of the customer confidentiality and details, you can't go into too much. But what I would say, which is incorporated into our numbers, is that our product transition from where we are today with our lead XPU customer to the next one is baked into all the numbers I gave you. And I got the backlog, and I got the orders, and we got great visibility there. On the 2-nanometer, very exciting. I mean, there's a number of programs that we're working on in this area, and that's going to be a workhorse process technology for us.\n\n**Matt Murphy** (Chairman and CEO)\nBut yeah, same as I said, and I would just say that the design funnel keeps increasing there, and the power benefits you see are compelling. And I think that'll continue. I mean, that's really where AI has sort of kicked in to keep the Moore's Law train running is really just the power savings are worth real OpEx dollars when you can save power dissipation from one generation to the other. So nothing really new to report there other than just heads-down execution. And we do see strong product ramps coming over this time period I gave you, especially into fiscal 2028, where you'll start seeing some of the 2-nanometer products ramp. And my team internally, just to give them a shout-out, is executing extremely well.\n\n**Matt Murphy** (Chairman and CEO)\nThe whole team you saw that got up there at the AI investor event in June by engineering leadership, executing extremely well across the board on the core IP, the nodes, the packaging, you name it. So we're really firing on all cylinders internally. Thanks, Harlan.\n\n**Harlan Sur** (Executive Director and Equity Research)\nNo, good execution. Thank you.\n\n**Matt Murphy** (Chairman and CEO)\nYep, thanks.\n\n**Operator**\nOur next question is from Tore Svanberg with Stifel.\n\n**Tore Svanberg** (Managing Director and Senior Semiconductor Analyst)\nYes, thank you, and congratulations on the acquisition. I had a question on Celestial AI, Matt. So when you gave those $500 million and $1 billion targets, would that be for the PFLink products only, or would that also include some of the potential businesses with memory?\n\n**Matt Murphy** (Chairman and CEO)\nYeah, yeah, a couple of things to note maybe at the highest level. The first is, yeah, the revenue targets and also the earnout that we're all going to drive for is all based on Celestial AI in totality.\n\n**Matt Murphy** (Chairman and CEO)\nNow, the reality is, from a lead perspective, the PF chiplet is sort of what's going to go first. But everything's on the table, and there's just tremendous activity that that team has driven, punching way above their weight in the industry in terms of the engagements they have. So those are all-in numbers, but clearly going to be driven more from the PF chiplet side in terms of the revenue build in end of fiscal 2028 and then the end of fiscal 2029.\n\n**Christopher Rolland** (Semiconductor Analyst)\nGreat, thank you.\n\n**Harlan Sur** (Executive Director and Equity Research)\nYeah.\n\n**Operator**\nOur next question is from Chris Caso with Wolfe Research.\n\n**Chris Caso** (Managing Diector)\nYes, thank you. Also a question about Celestial. And with that revenue ramp that you're expecting at the end of fiscal 2028, beginning of fiscal 2029, can you talk about the breadth of that?\n\n**Chris Caso** (Managing Diector)\nAnd obviously, I'm sure you're not willing to name the customers right now, but is it a fairly narrow customer base? What's the, and going over time, how diversified is that revenue stream?\n\n**Matt Murphy** (Chairman and CEO)\nYeah, no, great question, Chris. I think the engagement is certainly broad, but remember, there's a bold effort across the industry to really bring this product into volume-stable production. And it's going to take real big companies and a few of them to do that. And so yeah, we have strong engagement across the board, but there will be, and we're fortunate with this that we have, as I said on the call, we have one tier-one hyperscaler that we're engaged with on this that I think is a great partner and a great teaching customer and a great customer to collaborate with to really go make this happen.\n\n**Matt Murphy** (Chairman and CEO)\nIt's very exciting to see Celestial come into Marvell because just as a reminder, we have an incredibly strong internal silicon photonics organization. I mean, this team that we got from Inphi pioneered this technology. We drove it into high-volume production and market leadership in the 100 and then 400 gig ZR business, now 800 gig. All the DCI stuff they enabled, that's on the back of very, very innovative silicon photonics technology. We have a ton of know-how here. When we bring in Celestial, we're all going to benefit from that common set of learnings. Having a lead customer pulling us through is very exciting. I think this is just the first phase here, Chris, that you're going to see. Certainly, the interest is there across the industry.\n\n**Matt Murphy** (Chairman and CEO)\nThis is just so evident to us over the last couple of years and really pronounced at the last strategic review. It's a process I run every year where we do our capital allocation review with everybody. And that was a couple of months back. And we're just staring at this just giant transition to photonics inside the data center and that TAM. And we looked at, can we do it ourselves? Can we do it with a partner? And we just concluded this is a home run to bring them in with our internal team, plus really a lead customer to pull us through the first wave. But beyond that, we see very broad adoption beyond that timeframe.\n\n**Chris Caso** (Managing Diector)\nThank you.\n\n**Matt Murphy** (Chairman and CEO)\nYep.\n\n**Operator**\nOur next question is from Harsh Kumar with Piper.\n\n**Harsh Kumar** (Managing Director and Senior Research Analyst)\nYeah, hey, guys. Congratulations, Matt and the team, and a lot of good things happening.\n\n**Harsh Kumar** (Managing Director and Senior Research Analyst)\nMatt, I had two, so I'll just ask them both together. The first one is on custom. You specifically mentioned at least 20% growth for next year. Seems like you've got a lot of good things happening, a lot of good stuff ramping. And I was hoping that you could bookend that number for us. So at least 20% to me seems like that's what's in the bag. But maybe you could give us a sense of what, if everything worked out right for you, what could be a normalized 2027 FY growth rate for custom? And then the second question was, you gave us a lot of color all the way to FY 2028. And this is kind of not the norm on Wall Street. Most companies go out of quarter, as you well know.\n\n**Harsh Kumar** (Managing Director and Senior Research Analyst)\nSo my question is, and this we've been getting from a lot of investors already, is what is your comfort level and what is the visibility on some of this long-term revenue materializing that you're talking about?\n\n**Matt Murphy** (Chairman and CEO)\nYeah, sure. A lot in there, but let me unpack it. I think the first is you should definitely model the 20. And I think that's a-that is a good number. That's a good safe base case number. And remember, it's a handful of programs today. So I think I would just go for that for now. Clearly, we're going to be ready if people want to do more. But I am also mindful of some of the history on this custom business where either people got ahead of themselves or there's a lot of noise in the system. And it's just, look, we've got strong backlog. We got that covered. That's great.\n\n**Matt Murphy** (Chairman and CEO)\nIf we do better later, we'll definitely update you guys, but we got a very, very good outlook for next year in that business, and then obviously, the year after it really builds, and kind of part of your question is it's not 20% sort of linearly, meaning the second half, especially in custom and the exit rate, is much higher than where we are now, and that's simply because we're building all this momentum into fiscal 2028, and then, yeah, on the sort of guide quarter at a time, that's definitely been our MO historically. I think given the multi-year cycles we're looking at now in the AI infrastructure build, and also, quite frankly, just being sensitive to investor feedback about looking at some pretty ambitious targets we've set for the company several years out, and then wondering, well, how do you see yourselves getting there?\n\n**Matt Murphy** (Chairman and CEO)\nAnd I just view it as it's incumbent on me to paint the picture for folks and share what I see as kind of base case assumptions, as I mentioned. I mean, these are what I view as the base case, not dream the dream, not putting anything in that is sort of a maybe. I think it's very rational how we came up with our fiscal 2027 outlook. And even our fiscal 2028, if you just look at it bottoms up on the custom, we should definitely be able to do that because we know those programs. I mean, if I say CapEx is growing 20%, it certainly may do better. And our optics businesses are growing way above CapEx. So that has some legs to it. And then, look, even in a quarter, that other category in switching and storage and other has also floated up.\n\n**Matt Murphy** (Chairman and CEO)\nSo there's still a lot of goodness out there. But I think just from a modeling perspective, that's what you should think about. And I would say finally, it really, though, is tied to our customer planning. I mean, they're realizing to go get all this build to happen. They've got to provide visibility several years out. That's giving us increased confidence in our outlook because we're having to plan around that. Our R&D schedules, our capacity, our ramps, all that stuff has got to go kind of six to eight quarters out now to really be ready. So that's also part of why I felt it was worth sharing this perspective for investors. And again, I think it's timed well as well with Celestial because then that thing just kicks in beyond the timeframe I'm talking about, fiscal 2029.\n\n**Matt Murphy** (Chairman and CEO)\nI mean, some of it in 2020 and fiscal 2028, but then really 2029, 2030, and beyond. So hopefully that was helpful. Thank you so much for the question.\n\n**Harsh Kumar** (Managing Director and Senior Research Analyst)\nNo, very helpful. Thank you, Matt.\n\n**Operator**\nOur next question is from Blayne Curtis with Jefferies.\n\n**Blayne Curtis** (Managing Director and Equity Research)\nHey, guys. Thanks for taking my question. I wanted to ask you, Matt, I know it's always tough to talk about customers, but you did file an 8-K, and it says you granted Amazon a warrant for a million shares to buy photonic fabric. So I guess one very simply is that your lead customer. And if you can maybe talk about that expanding relationship, obviously, there's been a lot of back and forth, your status of that customer, but this seems like a positive in terms of your engagement for the next generation.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, and great job. Check out the EDGAR website, Blaine.\n\n**Matt Murphy** (Chairman and CEO)\nYou're always one step ahead. Yeah, I think it's great. So first, we did file a Form 8-K talking about really an extension, if you think about it, to the warrant agreement we have, which is effectively adding a new swim lane. And if you can believe it, it was only one year ago that we announced with AWS a warrant and strategic arrangement with them. Back then, a year ago, it was really bucketed between AI, custom products, and then networking products. And so think of this as just adding another swim lane of photonic fabric products to the mix. And all in, the potential of each of these is quite significant. So that's a positive on the first one that's out there. Also pleased to get a very, very strong support in our press release for the acquisition from AWS. That was positive.\n\n**Matt Murphy** (Chairman and CEO)\nWhen you sort of look at all the things we're saying and all the data that's out there, you can sort of figure out where we're headed with this and who is helping drive this technology forward. We're very, very excited about where we can go with this technology, especially with our lead tier-one hyperscaler, but then also the rest of the market, which I think will be shortly behind them once we can really put the full force of Marvell behind this. Thanks for catching that and giving me a chance to talk about it. It's pretty exciting to see. Really, if you think about it, we've got the warrant agreement. We've got an aggressive earnout that the team is driving, which is a $2 billion number, by the way, through the end of fiscal 2029.\n\n**Matt Murphy** (Chairman and CEO)\nSo all this adds up to just a great sort of set of incentives for everybody to go execute like crazy and bring this into production. Thanks, Blaine.\n\n**Blayne Curtis** (Managing Director and Equity Research)\nThanks, Matt.\n\n**Operator**\nOur next question is from Vivek Arya with Bank of America.\n\n**Vivek Arya** (Managing Director Senior Analyst)\nThanks for taking my question. Matt, I had two kind of questions on the data center, one on optics and one on custom. So on optics, why correlate it to cloud CapEx? Why not to growth of AI accelerators, which is expected to be much faster than the 30%? And then on the custom side, you mentioned 20% as the baseline growth. Is that because the second customer is supposed to come on board, or is it because you will grow with that first customer? And I ask about the second customer because they don't have a history of ramping big ASIC programs.\n\n**Vivek Arya** (Managing Director Senior Analyst)\nSo I just wanted to get your overall views on optics and why correlate it to CapEx. And then on the custom side, just kind of puts and takes of the second customer that's supposed to come on board. Thank you.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, hey, thanks, Vivek. Yeah. So on your first question, I mean, just the rationale was just to give just a broad proxy to the investment community about how to think about our business off sort of a very common metric, which is CapEx. I agree with you. The optics business is fundamentally driven by AI and AI acceleration, and that's why it's been growing so far above CapEx each year. But I think this was just in the interest of providing some pretty broad brushstrokes. But you should certainly assume that the optics piece is tied to AI, which is growing faster than CapEx.\n\n**Matt Murphy** (Chairman and CEO)\nSo that's a fair assumption. But just this was really in the spirit of making this a proxy. And then on the growth next year, yeah, that's all still driven by the way to think about it is mostly our current business today. So there's a product transition with our lead customer from one generation to another in there. There's some XPU attached that's kicking in in the second half that's going to lead to the 2028 and 2029 revenues I was talking about. But the next bigger XPU customer we have, not much of that really you should count on for next year. It's really the year after. And that's captured in the doubling from fiscal 2027 to 2028. But I think we've got a very rational base plan for that that we think is achievable.\n\n**Matt Murphy** (Chairman and CEO)\nThen, obviously, if things improve or get better, then we would up those numbers. I think what we're trying to do right now, Vivek, is just paint a very rational, clear picture for people. Then we'll obviously update along the way more on a granular basis as we go forward.\n\n**Vivek Arya** (Managing Director Senior Analyst)\nThank you, Matt.\n\n**Matt Murphy** (Chairman and CEO)\nYeah.\n\n**Operator**\nOur next question is from Christopher Rolland with Susquehanna.\n\n**Christopher Rolland** (Semiconductor Analyst)\nThanks for the question and congrats on the results. I think your main competitor in ASIC has moved to providing racks, not just silicon. With this acquisition and kind of given the increasing complexity we're seeing out there, might you be moving to systems and then perhaps even rack-level solutions as well? And do you have the capabilities to do that? Thanks so much, Matt.\n\n**Matt Murphy** (Chairman and CEO)\nYeah. Hey, thanks, Chris, for the question.\n\n**Matt Murphy** (Chairman and CEO)\nI would sort of answer the second part, which is we are very much looking at this as a rack-level solution in totality. That is all the various flavors of optical interconnect. I rattled through a bunch of those. We're the one-stop shop, right, from AECs, traditional DSPs, retimers, LPOs, photonic fabrics, and then scale-up and scale-out switching and XPU-attached sockets and circuits to go make all this work. Then working closely with our customers with that vision on how we enable that entire end-to-end and enable them to do that. That's our current strategy. Most of the people we're working with have that capability themselves today. They're very good at it. But we also add quite a bit of value in how to think about how to pull it all together. We absolutely have a rack-scale vision.\n\n**Matt Murphy** (Chairman and CEO)\nAnd this is where Celestial AI really fits in. But we don't have any system-level revenues comprehended in anything I've talked to you about over the next two years. But certainly, from a strategic standpoint, it's imperative, right, that we go to market in a very comprehensive way, Chris, and not in a point-solution way, but rather be able to provide all the fundamental pieces right from the biggest XPU chip all the way down to a retimer on the board.\n\n**Christopher Rolland** (Semiconductor Analyst)\nFantastic. Thank you, Matt, and congrats.\n\n**Matt Murphy** (Chairman and CEO)\nYeah. Thank you.\n\n**Operator**\nThis was our final question for the evening. I'd now like to hand the call back over to management for any closing comments.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, fantastic. And thanks for all the great questions. And appreciate everybody listening. I know it was a lot. I think this was the world record for the longest prepared remarks I've ever done.\n\n**Matt Murphy** (Chairman and CEO)\nBut, like I said at the beginning, settle in because there's a lot of good stuff. And there really is a lot of great things happening with Marvell. I'm just really pleased with how our team has executed. I want to say thank you to all of them. We have a phenomenal setup for next year, as I indicated. And even through the next year, we just have very good visibility. Programs are on track. We are playing offense in this company, okay? We're out doing strategic acquisitions like Celestial AI. And we're thrilled to welcome them to the Marvell team. And I think our future is very bright where we're headed. So appreciate everybody's interest. I look forward to the follow-up conversations and appreciate all the investor interest in following Marvell and our journey. Thank you, everybody. Have a great day.\n\n**Operator**\nThank you. This concludes today's conference.\n\n**Operator**\nYou may disconnect your lines at this time. Thank you again for your participation.",
      "fetched_at": "2026-02-04T15:41:37.772Z"
    },
    {
      "ticker": "MRVL",
      "title": "Marvell Technology, Inc. (MRVL) Q2 FY2026 earnings call transcript",
      "published_date": "Aug 28, 2025, 4:45 PM EDT",
      "fiscal_year": "2026",
      "quarter": "Q2",
      "url": "https://finance.yahoo.com/quote/MRVL/earnings/MRVL-Q2-2026-earnings_call-351768.html",
      "content": "**Operator**\nGood afternoon and welcome to Marvell Technology Inc's Second Quarter of Fiscal Year 2026 Earnings Conference Call. At this time, all participants are in a listen-only mode. If anyone should require operator assistance during the conference, please press star zero on your telephone keypad. A question and answer session will follow the formal presentation. Please note this event is being recorded. I will now turn the conference over to Mr. Ashish Saran, Senior Vice President of Investor Relations. Thank you. You may begin.\n\n**Ashish Saran** (SVP of IR)\nThank you and good afternoon, everyone. Welcome to Marvell's Second Quarter Fiscal Year 2026 Earnings Call. Joining me today are Matt Murphy, Marvell's Chairman and CEO, Willem Meintjes, CFO, Chris Koopmans, President and COO, and Sandeep Bharathi, President, Data Center Group. Let me remind everyone that certain comments made today include forward-looking statements, which are subject to significant risk and uncertainties that could cause our actual results to differ materially from management's current expectations. Please review the cautionary statements and risk factors contained in our earnings press release, which we filed with the SEC today and posted on our website, as well as our most recent 10-K and 10-Q filing. We do not intend to update our forward-looking statements. During our call today, we will refer to certain non-GAAP financial measures. A reconciliation between our GAAP and non-GAAP financial measures is available in our earnings press release.\n\n**Ashish Saran** (SVP of IR)\nLet me now turn the call over to Matt for his comments on the quarter. Matt?\n\n**Matt Murphy** (Chairman and CEO)\nThanks, Ashish, and good afternoon, everyone. For the second quarter of fiscal 2026, Marvell delivered record revenue of $2.006 billion, reflecting a 6% sequential increase and strong 58% year-over-year growth. Our data center end market continued its strong momentum, growing 69% year-over-year, fueled by robust AI demand. We also saw a solid recovery in our enterprise networking and carrier infrastructure end markets, which collectively grew 43% year-over-year. We expanded our non-GAAP operating margin by 870 basis points year-over-year to 34.8% and delivered record non-GAAP earnings per share of $0.67, up 123% year-over-year. We also delivered $462 million in operating cash flow, up significantly from the $333 million in the first quarter. Robust cash flow generation is enabling us to continue to return significant capital to our stockholders. We have repurchased $540 million of stock through the first half of the fiscal year, with approximately $2 billion remaining in our authorization.\n\n**Matt Murphy** (Chairman and CEO)\nAt the beginning of the third quarter, we completed the divestiture of our Automotive Ethernet business in a $2.5 billion all-cash transaction at a very compelling valuation. I'm pleased with our team's execution in closing this transaction ahead of schedule. The proceeds from this transaction provide us flexibility to continue to drive our ongoing stock repurchase program and deploy capital to further bolster our technology platform. The auto divestiture aligns with our strategy to focus the company on what we expect to continue to be a massive AI opportunity in front of us, by purposefully redirecting our investments towards data center relative to our other end markets. That strategy has been very successful, with data center alone now driving three-quarters of our total revenue. The auto divestiture further reduces the relative proportion of revenue from our non-data center end markets.\n\n**Matt Murphy** (Chairman and CEO)\nAs a result, starting in the third quarter, we will consolidate our non-data center end markets into a new single communications and other end market. Willem will cover this in more detail in his prepared remarks. During the quarter, we hosted a highly successful custom silicon investor event in June, where we outlined an expanded $94 billion data center TAM for calendar 2028, a 26% increase from our prior view. We also unveiled a new fast-growing custom silicon product category of XPU attach, updated our custom design win board to 18 multi-generational XPU and XPU attach sockets, and highlighted over 50 new pipeline opportunities with an estimated $75 billion of lifetime revenue potential.\n\n**Matt Murphy** (Chairman and CEO)\nBased on the sockets we have already won, we concluded with our plan to grow our data center market share from 13% of a $33 billion TAM in calendar 2024 to 20% of a $94 billion TAM in calendar 2028. Let me now take a moment to share how we are enhancing our leadership structure to further capitalize on significant opportunities in the large and fast-moving AI and cloud markets. We have promoted two exceptional leaders, Chris Koopmans to President and COO, and Sandeep Bharathi to President, Data Center Group, and consolidated substantial parts of the organization under their leadership. Their proven track record of innovation, execution, and results positions them to accelerate Marvell's growth. Chris joined Marvell nine years ago, and he has been a key enabler of our transformation to a leader in the data center market.\n\n**Matt Murphy** (Chairman and CEO)\nHe has successfully led sales, our networking business, and most recently, global business operations and marketing. I'm pleased to see Chris take on sales again, along with managing our non-data center businesses and corporate development. His expanded role now encompasses end-to-end revenue execution, from go-to-market strategy and customer engagement to operations and long-term strategic planning. Sandeep joined us in early 2019 to lead our central engineering team and accelerate development of our technology platform. He was instrumental in driving Marvell's leap to 5 nm process technology, leadership, and integrating Avera, the custom business we acquired that has since become our largest growth opportunity. Under Sandeep's guidance, our engineering teams have successfully delivered multiple highly complex custom XPU and XPU attach projects into high-volume production with first-time silicon success.\n\n**Matt Murphy** (Chairman and CEO)\nWith this promotion, Sandeep now has overall responsibility for our data center business, in addition to his continued leadership of data center engineering and central engineering. This unifies full ownership of our largest and most important business under a single leader, spanning the entire product lifecycle, from technology platform, IP, and roadmap to customer engagement, product definition, and chip development. Let me now discuss our results and expectations for each of our end markets. In our data center end market, we achieved record revenue of $1.49 billion in the second quarter, growing 3% sequentially and 69% year-over-year. The strong performance was led by our custom XPU and XPU attach products, as well as our electro-optics interconnect portfolio. AI and cloud continue to be the primary drivers, accounting for over 90% of our data center revenue, with the remainder coming from the on-premise portion of our data center end market.\n\n**Matt Murphy** (Chairman and CEO)\nWe expect on-premise revenue to remain stable at an annualized revenue run rate of approximately $500 million. Looking ahead to the third quarter, we expect revenue from our electro-optics products to grow double digits sequentially on a percentage basis, as we continue to benefit from our market-leading position in AI interconnect. Our custom business is also performing well and remains on track to grow in the second half of the fiscal year compared to the first. However, we expect growth to be non-linear in the custom business, with the fourth quarter substantially stronger than the third. As a result, we expect overall data center revenue in the third quarter to be flat sequentially, with electro-optics strength offset by lower custom revenue. On a year-over-year basis, we expect data center revenue to continue to deliver strong growth in the mid-30% range in the third quarter.\n\n**Matt Murphy** (Chairman and CEO)\nWe are very pleased with the progress of our 18 XPU and XPU attach sockets, several of which are already in volume production. We are making excellent progress on development of the remaining sockets, with all of them expected to ramp over the next couple of years. The success of our initial wave of custom programs, combined with rapidly growing industry interest in custom silicon, has expanded our design win pipeline to over 50 new opportunities. As next-generation XPU and XPU attach products increase in complexity, we believe it will become even more critical for customers to partner with a full-service custom silicon provider like Marvell. Since our event in June, our team has won additional sockets, adding to the 18 sockets we had already discussed.\n\n**Matt Murphy** (Chairman and CEO)\nCollectively, these new wins represent multi-billion dollar lifetime revenue potential, and we remain deeply engaged in advanced architectural discussions of many of the opportunities still in the funnel. As next-generation AI data centers evolve, scale-up networks are becoming essential to tightly interconnect tens, hundreds, and eventually thousands of XPUs within and across racks. These require ultra-low latency and multi-terabit bandwidth to meet the demands of training and inference workloads. Marvell's multi-generational custom engagements with the hyperscalers give us unique visibility into upcoming XPU architectures, enabling us to design scale-up switches, supporting both open standard Ethernet and UALink fabrics purpose-built for AI. Combined with Marvell's leadership in Ethernet switching and proprietary high-speed, low-power, low-latency SerDes IP, we are strongly positioned to lead this market inflection. We are investing in developing scale-up switches tailored to each customer's protocol of choice and look forward to updating you on our progress.\n\n**Matt Murphy** (Chairman and CEO)\nBeyond switching, our interconnect portfolio extends the opportunity. While copper dominates the scale-up links today, as networks expand and bandwidth grows, optics adoption will follow. This represents a large opportunity for Marvell's full suite of interconnect products and technologies, including DSPs for active electrical cables, or AECs, and active optical cables, or AOCs, retimers for PCIe, Ethernet, and UALink, and silicon photonics for near-packaged and co-packaged XPU optics. Our AEC and AOC DSPs are already in the market, and our retimers are in customer evaluation. We have demonstrated our 6.4 Tbps silicon photonics light engines and expect our technology to be a key enabler of NPO and CPO implementations once the industry is ready to adopt. Collectively, between switching and interconnect, we see a massive scale-up opportunity for Marvell over time.\n\n**Matt Murphy** (Chairman and CEO)\nTurning to our electro-optics interconnect portfolio, our PAM and DCI franchises continue to lead the industry in enabling the build-out of AI and cloud infrastructure. Demand for 800 Gbps PAM DSPs remains strong, with a long lifecycle still ahead. We have also begun volume shipments of our next-generation 200 Gbps per lane 1.6 Tbps PAM DSPs to multiple customers, and we expect adoption to accelerate in the next several quarters. Looking further ahead, we are driving the next optical technology transition. At this year's Optical Fiber Conference, we demonstrated our 400 Gbps per lane PAM technology, a critical innovation and step towards enabling 3.2 Tbps optical interconnects. This milestone underscores Marvell's leadership in pushing the boundaries of next-generation optical connectivity. Our data center interconnect business also continues to expand, with adoption proliferating across large hyperscalers.\n\n**Matt Murphy** (Chairman and CEO)\nCollectively, the custom and electro-optics product line that I just described now accounts for over three-quarters of our total data center revenue. The balance comes primarily from our data center storage, switching, and security portfolios, each of which is showing solid progress. Our data center storage revenue has improved significantly, reflecting a return to health in both the SSD and HDD markets. In AI and cloud switching, our 12.8 Tbps products continue to ship in high volume, while our next-generation 51.2 Tbps switches are now ramping. Adoption is accelerating, and we expect these products to be a major driver of switch revenue growth in the next fiscal year. In the security market, we recently expanded our collaboration with Microsoft Azure on our hardware security modules, building on a longstanding and trusted relationship with this customer. Now, let me turn to our enterprise networking and carrier infrastructure end markets.\n\n**Matt Murphy** (Chairman and CEO)\nIn the second quarter, enterprise networking revenue was $194 million, and carrier infrastructure revenue totaled $130 million. Combined revenue for these end markets grew 2% sequentially and 43% year-over-year. Looking ahead to the third quarter of fiscal 2026, we expect aggregate revenue from enterprise networking and carrier infrastructure to grow sequentially by approximately 30%. This growth is driven by normalizing customer inventory levels and strong adoption of our refreshed product portfolio. As a reminder, we recently migrated these products to advanced process nodes, an investment we expect to yield benefits for many years to come, given the long product life cycles in these markets. In the consumer end market, second quarter revenue was $116 million, up 84% sequentially and 30% year-over-year. Gaming demand and its seasonality continue to be the primary driver of this business.\n\n**Matt Murphy** (Chairman and CEO)\nFor the third quarter, we expect consumer revenue to be down sequentially in the low single digits on a percentage basis. Turning to our automotive and industrial end market, second quarter revenue was $76 million, flat both sequentially and year-over-year. For the third quarter of fiscal 2026, reflecting the divestiture of our Automotive Ethernet business, we anticipate overall revenue of approximately $35 million from this end market. This includes a mid-single-digit million-dollar contribution from our Automotive Ethernet business prior to the transaction closing. In summary, in the second quarter of fiscal 2026, we continue to deliver operating margin expansion, earnings per share growth, and new revenue records. Looking ahead, we expect momentum to continue in the third quarter, with total company revenue forecast at $2.06 billion at the midpoint, representing 36% year-over-year growth.\n\n**Matt Murphy** (Chairman and CEO)\nExcluding revenue from Automotive Ethernet, the implied revenue growth for Marvell's go-forward business would be closer to 40% year-over-year at the midpoint of our forecast for the third quarter. We also expect to continue driving operating leverage, with non-GAAP earnings per share forecast to grow 10% sequentially at the midpoint of guidance, more than double our projected revenue growth rate. Our second quarter results and third quarter guidance reflect robust contributions from our AI-driven data center end market, complemented by strong recovery in our enterprise networking and carrier infrastructure end markets. At the same time, our custom AI design engagements are at an all-time high, with customers showing very strong interest in our broad range of differentiated technologies.\n\n**Matt Murphy** (Chairman and CEO)\nAs I discussed earlier, our team continues to accumulate new wins, and we are pleased with the strong progress across both current and next-generation custom programs, which reinforces our confidence that we can achieve our long-term custom revenue goals. In addition, our market-leading electro-optics franchises continue to see strong demand for both current and next-generation solutions, and our scale-out switching platforms are positioned for strong growth. Over time, the emergence of scale-up networking for AI infrastructure should provide another strong tailwind for Marvell. With that, I'll turn the call over to Willem for more detail on our recent results and outlook.\n\n**Willem Meintjes** (CFO)\nThank you, Matt, and good afternoon, everyone. Let me start with a summary of financial results for the second quarter of fiscal 2026. Revenue in the second quarter was $2.006 billion, growing 58% year-over-year and 6% sequentially. Data center was our largest end market, contributing 74% of total revenue. GAAP gross margin was 50.4%. Non-GAAP gross margin was 59.4%. Moving on to operating expenses. GAAP operating expenses were $721 million, including stock-based compensation, amortization of acquired intangible assets, restructuring costs, and acquisition-related costs. Non-GAAP operating expenses came in at $493 million, slightly below our guidance. Our GAAP operating margin was 14.5%, while non-GAAP operating margin was 34.8%. For the second quarter, GAAP earnings per diluted share was $0.22. Non-GAAP earnings per diluted share was $0.67, reflecting year-over-year growth of 123%, which is more than double the pace of revenue growth, demonstrating the significant operating leverage in our model.\n\n**Willem Meintjes** (CFO)\nNow, turning to our cash flow and balance sheet. Cash flow from operations in the second quarter was approximately $462 million, growing by $129 million from the prior quarter. Our inventory at the end of the second quarter was $1.05 billion, a decrease of $20 million from the prior quarter. We returned $52 million to shareholders through cash dividends. In addition, we repurchased $200 million of our stock in the second quarter. In June, we completed the public offering of notes totaling $1 billion and used most of the proceeds to repay existing debt. As of the end of the second quarter, our total debt was $4.5 billion, with our gross debt-to-EBITDA ratio of 1.63x and a net debt-to-EBITDA ratio of 1.19x. Our debt ratios have continued to improve as we have driven an increase in our EBITDA.\n\n**Willem Meintjes** (CFO)\nAs of the end of the second fiscal quarter, our cash and cash equivalents were $1.2 billion. We recently completed the divestiture of our Automotive Ethernet business in a $2.5 billion all-cash transaction. Proceeds from this sale give us flexibility to continue to drive our ongoing stock repurchase program, as well as invest further in our technology capabilities. Turning to our guidance for the third quarter of fiscal 2026, we are forecasting revenue to be in the range of $2.06 billion, 5%. As a reminder, this forecast includes revenue in the mid-single-digit millions of dollars from the Automotive Ethernet business before the completion of the divestiture. If the divestiture had not taken place and we had operated the Automotive Ethernet business for the full quarter, we would have added approximately $60 million to our guidance. We expect our GAAP gross margin to be between 51.5% and 52%.\n\n**Willem Meintjes** (CFO)\nWe expect our non-GAAP gross margin to be between 59.5% and 60%. Looking forward, we anticipate that the overall level of revenue and product mix will remain key determinants of our gross margin in any given quarter. For the third quarter, we project our GAAP operating expenses to be approximately $719 million. We anticipate our non-GAAP operating expenses to be approximately $485 million. For the third quarter, we expect GAAP other income and expense, including interest on our debt and the gain from the divestiture of our Automotive Ethernet business, to be an income of approximately $1.8 billion. Non-GAAP other income and expense, including interest on our debt, is expected to be an expense of approximately $33 million. We expect a non-GAAP tax rate of 10% for the third quarter.\n\n**Willem Meintjes** (CFO)\nWe do not expect the recently passed tax bill act to have a material effect on our current year's non-GAAP tax rate. We expect our basic weighted average shares outstanding to be 863 million and our diluted weighted average shares outstanding to be 870 million. We anticipate GAAP earnings per diluted share in the range of $1.98-$2.08. We expect non-GAAP earnings per diluted share in the range of $0.69-$0.79. As Matt mentioned, we plan on updating our revenue by end market classification beginning next quarter. Over the past several years, our strategic focus on expanding revenue in the data center market has delivered strong results, driving significant growth in this end market.\n\n**Willem Meintjes** (CFO)\nOn a relative basis, data center revenue has more than doubled as a percentage of total company revenue, from 34% in the second quarter of fiscal 2024 to 74% in the second quarter of fiscal 2026. As a result, in our most recent quarter, our four other end markets collectively represented only 26% of total company revenue. The divestiture of our Automotive Ethernet business further reduces the relative contribution of our non-data center end markets. Looking ahead, we expect data center to continue outpacing all other end markets in both size and growth rate. As a result, our fiscal Q3 results will be the last quarter with the current classification, and our Q4 guide will reflect the streamlined revenue reporting. Results will be reported in two categories: data center and communications and other. The composition of our data center end market will remain unchanged.\n\n**Willem Meintjes** (CFO)\nThe new communications and other end market will consolidate revenue currently reported separately from our enterprise networking, carrier infrastructure, consumer, and auto industrial end markets. We will continue to provide qualitative commentary in our earnings discussions, highlighting notable developments within sub-markets in the consolidated communications and other end market. We expect most of the revenue in the new communications and other end markets to come from our current enterprise networking and carrier infrastructure end markets, which have both continued to recover. On a combined basis for these two end markets, our guidance for the third quarter of this fiscal year implies an annualized revenue run rate of approximately $1.7 billion, compared to the low point we saw in the first quarter of fiscal 2025 of approximately $900 million. Consistent with prior comments, we expect these two end markets to collectively generate approximately $2 billion in annual revenue over time.\n\n**Willem Meintjes** (CFO)\nAdditionally, as we have stated previously, we anticipate annual revenue of approximately $300 million from our consumer end market and, following the divestiture of our Automotive Ethernet business, approximately $100 million from our industrial end market. In conclusion, we are executing on our strategy, driving strong revenue growth, and expanding our operating margins towards our long-term target. In addition, our balance sheet has continued to strengthen and provides a solid foundation to support our growth opportunities. With that, we are ready to start our Q&A session. Operator, please open the line and announce Q&A instructions. Thank you.\n\n**Operator**\nThank you. We'll now be conducting a question and answer session. If you would like to ask a question, please press star one on your telephone keypad. A confirmation tone will indicate your line is in the question queue. You may press star two if you'd like to remove your question from the queue. In the interest of time, please restrict yourself to one question only. If you have additional questions, please rejoin the queue. At this time, we will pause momentarily to assemble our roster. Thank you. Our first question is from Ross Seymore with Deutsche Bank.\n\n**Ross Seymore** (Analyst)\nHi guys, thanks for letting me ask a question. I want to dive into the guidance for the custom business, Matt. I appreciate the lumpiness of it, but could you give any more color on what the headwinds are in the third quarter, and then what gives you the confidence and any sort of magnitudes on the increase in the fiscal fourth quarter?\n\n**Matt Murphy** (Chairman and CEO)\nYeah, thanks, Ross, and I think you captured the right phrase, which is lumpiness. I think this is normal to see, particularly with the large hyperscale builds that happen, especially as you ramp them into production, which we've done this year on a number of programs. This is not unusual. Fortunately, our optics business is quite strong in the coming quarter, and that's growing double digits. As I said in the prepared remarks, we see a demand increase again in custom. There's nothing unique there, Ross, other than we've spent the last couple of years ramping these into production, and we've got kind of a one-quarter digestion with the recovery in Q4. I will say that overall, we expect custom to be up in the second half over the first half, and you should expect a strong fourth quarter for custom. Thanks.\n\n**Ross Seymore** (Analyst)\nThank you.\n\n**Operator**\nOur next question is from Tore Svanberg with Stifel.\n\n**Operator**\nYes, good afternoon. This is Jeremy calling for Tore. Maybe if you could provide a little bit more clarity on the design wins that you're seeing. You know, how much of your custom products revenue that you expect in the second half is coming from some of these new programs, and how much is coming from some of your existing design wins? Any kind of color or clarity you can provide would be very helpful.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, hey, thanks, Jeremy. Good to hear from you. I'll actually turn this one over to Chris to talk about the design win momentum we're seeing and the opportunity set as it relates to your question. Thanks. Go ahead, Chris.\n\n**Chris Koopmans** (President and COO)\nYeah, thanks, Matt. It's truly an exciting time to be in the custom silicon business for data center. We have a tremendous amount of design activity, more than I've ever seen in my nine years at Marvell. Ultimately, we're seeing that across XPU, XPU attach, emerging and existing hyperscalers. I should say that, even since our event in June, where we said that the XPU attach opportunities were in the sort of several hundred million dollar design win lifetime, that's grown from there. Some of the ones we're chasing now are much, much larger than that, just as these hyperscalers build out these rack scale infrastructures. Since June, the design wins that we've added, these are very meaningful. Think in the billions of dollars for the new design wins.\n\n**Chris Koopmans** (President and COO)\nIf you put it all together, it just gives us even more confidence in our 20% share target in this incredibly fast-growing market.\n\n**Chris Koopmans** (President and COO)\nGreat, thank you. Maybe a follow-up in terms of, you know, is there any impact you're seeing from supply constraints anywhere along the supply chain? Any impact from tariffs that you can see from your end? Thank you.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, great. You know, Chris runs our global operations, so I'll have him cover that. Willem, maybe you can make a quick comment on the tariffs, and I'll add if needed.\n\n**Chris Koopmans** (President and COO)\nSure, yeah. Certainly, the supply chain is very tight, requires very tight coordination with our customers, and very strong execution by our team. I'm very proud of our team to have met this ramp over the last year and very confident in our ability going forward. We've really been able to meet everything that our customers have needed. It is tight, and we have very strong coordination and execution.\n\n**Willem Meintjes** (CFO)\nYeah, and Jeremy, on tariffs, it remains a very dynamic environment, but really, we haven't seen any impact on our business to date. We keep tracking it very, very closely. As we look across all the different end markets that we're addressing, we really haven't seen any significant impact.\n\n**Matt Murphy** (Chairman and CEO)\nThanks, Jeremy.\n\n**Matt Murphy** (Chairman and CEO)\nThank you very much.\n\n**Matt Murphy** (Chairman and CEO)\nThank you.\n\n**Operator**\nOur next question is from Aaron Rakers with Wells Fargo.\n\n**Aaron Rakers** (Managing Director and Technology Analyst)\nYeah, thanks for taking the question. Kind of building on the earlier question, just to level set, as we think about the lumpiness in the custom XPU business, I'm curious, you've had obviously a very talked-about lead customer. I'm curious, as you're looking at the business today, how concentrated are you amongst your lead customer? If we look out, let's say six months or even 12 months from now, how do we expect to see some of these additional design wins start to fold into the XPU revenue stream? I'm just trying to gauge the timing of some of these additional opportunities.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, thanks, Aaron. I think you said it right. We had started a few, just a few years back, a couple of AI Days ago, really talking about a handful of sockets that were going to be kind of our initial lead, and those have now ramped and are ramping, albeit lumpiness, we're seeing in the short term. Those are happening. On top of it, the 18 we talked about just a couple of months ago at the AI Day, those are all either starting now, next year, really in the next sort of, I'd call it between now and the next 18-24 months, those will all start to layer in. As Chris Koopmans mentioned, we've actually secured some incremental wins. Think of it as kind of 18+. There's a journey there from a handful to 18+ to beyond.\n\n**Matt Murphy** (Chairman and CEO)\nThat's really what we're focused on, driving our market share from where we were just a couple of years back at 10% share in 2023, 13% the year after, and driving to 20% over time. We're certainly getting a lot of confidence in that with just the recent design activity that Chris talked about. It's kind of unprecedented. It's almost episodic right now. Thanks.\n\n**Aaron Rakers** (Managing Director and Technology Analyst)\nYep. As a quick follow-up, I know NVIDIA this week talked about scale out or scale across networks. I'm curious how Marvell sees this opportunity, moving from just not scale out and scale up, but scale across DCI. Any framing of how big of an opportunity that might represent for Marvell?\n\n**Matt Murphy** (Chairman and CEO)\nYeah, maybe I'll comment and Sandeep will comment. It's certainly something we're aware of. There's a number of different opportunities that keep layering in that would leverage our networking and our connectivity technology. Sandeep, I don't know if you have any additional thoughts. This is something that is relatively new. Sandeep, go ahead if you've got some thoughts.\n\n**Sandeep Bharathi** (President of Data Center Group)\nYeah, thank you, Matt. In terms of scale-up opportunities, there is certainly, aside from, you know, the lead GPU player who has its own proprietary scale-up fabric, a huge demand for Ethernet and purpose-built fabrics such as the UALink. We see a lot of traction over the next couple of years for the scale-up requirements. We are investing heavily to bring our scale-up switches to the market, and we see momentum in the next couple of years. We will have standard products using our state-of-the-art low latency scale-up switching IP portfolio, some of which we acquired from Innovium, which has been a great asset for us. We are very confident of scale-up switches being a key growth driver for us in the next couple of years.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, more to come in the future, Aaron, on the other type of opportunities. Thanks for covering that, Sandeep. Appreciate it.\n\n**Operator**\nOur next question is from Vivek Arya with Bank of America.\n\n**Vivek Arya** (Managing Director and Senior Analyst)\nThanks for taking my question. Just a near and longer-term question on your custom business. Just near term, Matt, do you think Q4 your data center growth can accelerate year on year from the Q3 levels that you gave, just so that we kind of level set our models? As we look at 2026, you know, one of your XPU competitors has suggested their business can grow 60%. I think yesterday Jensen kind of threw a 50% or so. Whatever industry growth rate seems to be in this 50% or so zip code for next year, do you think Marvell has the visibility today around, you know, timing and magnitude of your large projects to kind of say that, you know, your business can sort of grow in line with what industry expectations are, or are there other puts and takes we should keep in mind? Thank you.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, thanks, Vivek. Yeah, a couple of things. I think one is our custom. You know, we don't do an annual guide. We typically just guide, you know, a quarter at a time. I'll get to Q4 in a minute, but just as a baseline. I would say on the annual stuff, we've only done that very, very rarely, and that's typically been later in the year as we have more visibility. Just to set the stage, I think the overall momentum in the business has been very strong for several quarters now. I think I gave you some of the data points, which is that, you know, custom would be up in the second half versus the first half. You can look at our optics performance, you know, Q2, Q3, especially the Q3 up double digits.\n\n**Matt Murphy** (Chairman and CEO)\nObviously, when you look at the big picture, we're very pleased, which no one's asked a question about yet, but it layers into the big picture on overall Marvell performance, is the very strong recovery in the core business and enterprise networking and carrier. Just for reference on that business, you know, we hit a low point during the inventory recovery cycle at about a $900 million annualized run rate. Implied in our Q3 guide, this business goes back up at like a $1.7 billion run rate. Very, very strong recovery both on inventory as well as on new programs that are kicking in and new products that are in the next technology node. That's all a positive in terms of the setup for Q3 and Q4.\n\n**Vivek Arya** (Managing Director and Senior Analyst)\nThank you.\n\n**Matt Murphy** (Chairman and CEO)\nThanks.\n\n**Operator**\nOur next question is from Tom O'Malley with Barclays.\n\n**Tom O'Malley** (Director of Equity Research)\nHey guys, thanks for taking my question. Matt, I'm going to hit on the ASIC topic again, so apologies, just want to dive in for a little more clarity. When you look at what the digestion that's occurring in the October quarter is, is that one project winding down while another is then winding back up in the fourth quarter? Is that just a temporary pause? Any color on what's happening there? Is that just traditionally you see certain pockets where customers take product and then they stop? Is there anything to do with a product transition there as well? Any help there would be useful.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, thanks Tom. No problem for the question. Yeah, no, at a high level, these are existing programs and it's really just a timing issue in terms of how we deliver the product and when the customers' builds are occurring and when they want the product from us. Given that this is, you know, as I said earlier, we're in the early stages of custom, this is really our first big, first year with the handful of sockets that will translate over to many more. It's really just a timing issue between the quarters. It's just more apparent. Now over time, we do see, you know, a lot more diversity in this part of the business in Marvell as additional programs ramp, but obviously we were starting from a pretty low base just a couple of years back. Thanks.\n\n**Tom O'Malley** (Director of Equity Research)\nHelpful. Just as a follow-up on the optical business, you're going to double-digit growth in the October quarter. You've heard others during this earnings period talk about supply constraints, particularly on the laser side. You're obviously a component provider that's going into these modules, but in terms of the ecosystem, are you seeing any stops and starts there in terms of product ramps as well? Are you hearing about any component issues or are you relatively immune from that in your ramp?\n\n**Matt Murphy** (Chairman and CEO)\nYeah, I'll lead off and I'll let Chris comment if it's appropriate. I mean, look, I think we've ramped this optics business just massively over the last few years and very successfully, by the way. I want to just echo what Chris said. Our business unit team, sales team, and operations team have done a great job. We have deep partnerships up and down the supply chain and with the key module companies to really plan our business together. There seems like there's always something going on, but I think we've been able to just manage through it and continue to grow quite dramatically if you look at the ramp over the last few years. I think there's always noise in the system, Tom, relative to different pieces of it, but I'd say overall we're tracking really well. Chris, do you have anything to add or did I capture that?\n\n**Chris Koopmans** (President and COO)\nI think you captured it. Just very strong partnerships with our customers and trying to stay one step ahead of all the changes and executing very well.\n\n**Operator**\nOur next question is from Timothy Arcuri with UBS.\n\n**Timothy Arcuri** (Managing Director)\nThanks a lot. Matt, you're guiding data center flat and optics is up double digits. Since you're guiding optics up double digits, can you give us a sense of what the baseline is for the optics business? I know you did provide that the AI revenue would cross over half of the total company revenue. Is that happening as soon as fiscal Q3? Is optics plus custom at 50% of the total company revenue? I'm just kind of wondering because you're guiding optical, I'd like to see if you can give us some sense of what the baseline was coming off fiscal Q2.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, let me just start off real quick and I'll see if Willem wants to add. I mean, we haven't updated that number, I don't think, since Q4 where optics was about half, custom was about a quarter, and then other was about 25%. Obviously, optics and custom have both come up since then, but we haven't exactly put a bead on that and updated that exact mix. Willem, anything, and any commentary that would be helpful? It's obviously something, Tim, we're probably not going to update on a quarterly basis. I totally get the question, but Willem, anything to add?\n\n**Willem Meintjes** (CFO)\nNo, that's the right framework and exactly what Matt said, right? Take that guidance we gave in Q4 and, you know, you can apply your growth rates and, you know, it's just not a number we're going to be sharing every quarter. That should give you a good sense of what it is.\n\n**Timothy Arcuri** (Managing Director)\nOkay, is the total, just because Matt, you did say last quarter that the total AI number would be half the company before the end of the fiscal year. I mean, can you at least provide a sort of a milepost that is that happening in fiscal Q3 or will that happen more in fiscal Q4?\n\n**Matt Murphy** (Chairman and CEO)\nI think I'd have to give you a follow-up, Tim. I don't have the spreadsheet right in front of me on that. It's clearly, I mean, with the puts and takes, custom up second half over first, strong optics, I don't have that number right at the tip of my fingers. It's definitely trending the same way. I wouldn't say there's any directional change there.\n\n**Timothy Arcuri** (Managing Director)\nYeah, okay. Awesome. Thank you.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, thanks.\n\n**Operator**\nOur next question is from Harsh Kumar with Piper Sandler.\n\n**Harsh Kumar** (Senior Analyst of Semiconductor Equity Research)\nYeah, hey guys, I had a question on the scale of the AI business. I think you mentioned you had 18 wins before you might have picked up. I think you suggested a couple of more wins. I wanted to understand, of all the custom and attached chips that Marvell is working on, how many of them are actually producing revenues today? I want to understand kind of like where we are today because we understand that you are aiming for 20% of $94 billion by 2028. I'm trying to understand where we stand today and kind of, you know, knowing where we're headed to.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, thanks, Harsh. Chris, you want to give some commentary on that one?\n\n**Chris Koopmans** (President and COO)\nSure. Yeah, certainly there are multiple, you know, several that are in production today and have been since late last year. Of those 18, they're all either sort of, they're all either going to production now or have gone to production this year or into next year. What you're seeing is pretty much every quarter you're seeing new parts of those programs moving into production. Ultimately, we see that just continuing to grow over time.\n\n**Harsh Kumar** (Senior Analyst of Semiconductor Equity Research)\nOkay, maybe broadly, very broadly, help us understand, and I'm not asking for any customer-specific customer, if most of your wins or all of your wins, largely speaking, are on track. The reason why I'm asking is when we talk to clients, investors, there's just a lot of controversy. Any kind of statement that you can make would be helpful.\n\n**Matt Murphy** (Chairman and CEO)\nThere is always controversy. I mean, I think that's why, at the end of the day, that was a big motivation for us with respect to you guys and the broader investor community around our AI Day, really trying to frame where we're driving the business, what the technology differentiation is, what the opportunity set is, breaking it down actually in a lot more granularity than I think we've done before relative to hyperscale versus emerging XPU, XPU attach, the relative size of those opportunities. We gave some commentary today just that we're tracking against those and have now closed some. That is going to be the focus of how we think about the go-forward. Given the design win momentum we're seeing, clearly we're continuing to garner new incremental business from really across the board, the traditional big hyperscalers as well as the emerging generation. Hopefully that's helpful. Thanks, Harsh.\n\n**Harsh Kumar** (Senior Analyst of Semiconductor Equity Research)\nYeah, thanks man of course.\n\n**Operator**\nOur next question is from Jim Schneider with Goldman Sachs.\n\n**Jim Schneider** (Senior Equity Analyst)\nGood afternoon, thanks for taking my question. I was wondering if you could maybe address capital allocation from a high level for a moment. If you look at your Automotive Ethernet business, that's a very attractive price you're able to get from that. Maybe you can talk a little bit about the intended use of the proceeds, whether your bias is more towards tuck-in acquisitions that allow you to pursue the AI strategy even faster or buybacks. More broadly, are you open to the potential sale of other components of the business at the right price, whether that be carrier, consumer, or otherwise? Thank you.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, thanks, Jim. It's a thoughtful question and I'll up-level it just for a second. This is a driving force, our capital allocation framework on how we run the company and it, you know, the automotive divestiture and then the proceeds are just kind of an output of that. In a minute, I'll just have Willem comment on that. As a background, you know, we have run since August 2016, so basically, you know, six weeks after I became CEO, we implemented a strategy process, which was really our capital allocation framework on how we think about investing our R&D dollars primarily. At that time, too, there were some opportunities around buybacks and so forth, given where Marvell was at that time. Primarily, we drive it from the strategy first. Our vision since, and by the way, we just completed our 10th strategic review a couple of weeks ago.\n\n**Matt Murphy** (Chairman and CEO)\nWe've been doing this kind of year in and year out. What you've hopefully seen is that over time, we've continued to evolve the company from really a consumer enterprise kind of focused company to a data center AI-first company. I'd say even in the last few years, as we made the pivot, we've now got our R&D spending, you know, well north of 80% of our total spending in AI and data center. That number has come up probably from, I don't know, 60% just a few years ago. Way back when, it was almost nothing because we had no business there. Around your question then, you know, when we looked at automotive as an example, it was just, it was a great business. We had built it up from scratch. It continued to stay a small portion of our total revenue.\n\n**Matt Murphy** (Chairman and CEO)\nAs the AI thing took off, it became even smaller. We had this opportunity to give it a great new home in Infineon, which they found. For Marvell, we obviously got significant and compelling valuation for that. We have the proceeds. Now we're looking at, you know, how to deploy those. I think it's going to be some, you know, it's not decided at the moment. We just closed this. By the way, great job to the team. I think this was, we had said end of the year and we closed it in early August. That was a huge, huge win for everybody involved. I'll let Willem comment in a moment, but I think the answer is probably some of both. We're definitely going to keep looking at our organic investments to figure out how to differentiate and win in AI.\n\n**Matt Murphy** (Chairman and CEO)\nIf there are tuck-ins and things we can do, that's obviously on the table. We've been consistent, really since, for probably the last four or five years, which was, you know, we invested early and heavy in M&A to build the portfolio we wanted. We've done a lot organically to build up our capability. We're in great shape there, but we're always going to look. Willem, maybe a little bit to add to this. I know it's a long answer, but I think it's helpful for investors to know how we think. Willem, anything to add?\n\n**Willem Meintjes** (CFO)\nI'll just add a couple and also call out to the team for doing a phenomenal job on getting this deal closed in effectively four months. A deal of this size and complexity is just a phenomenal job. When you look back at the last couple of quarters here, we've really driven an increased level of buybacks, really through much more consistent execution in our free cash flow. As a basis, you should expect for us to continue to drive that and having a focus on very consistent free cash flow execution, driving a higher level of buybacks. As Matt mentioned, I think this additional cash flow really gives us a lot of flexibility around being opportunistic on doing more buybacks.\n\n**Willem Meintjes** (CFO)\nAt the same time, we're at this historic moment in terms of the size of the AI market and where we do see tuck-ins that can accelerate our roadmap towards addressing that. We'll take advantage of that.\n\n**Operator**\nOur next question is from Harlan Sur with JPMorgan.\n\n**Harlan Sur** (Executive Director of Equity Research)\nGood afternoon, guys. Thanks for taking my question. This goes back to one of the previous questions. The noise level out of Asia on your lead customers' follow-on 3 nm XPU program continues at a deafening pace, right? With your Asia competitor, they're essentially claiming victory on 3 nm. What's the update with Marvell's 3 nm XPU follow-on program with your lead customer? I think last earnings call, Matt, you talked about securing 3 nm wafer capacity, packaging capacity for production in calendar 2026. Is this program still tracking? What's the confidence level on this program still driving growth next year? Maybe just an update on your third XPU customer win at 3 nm, which was supposed to ramp back half of calendar 2026. How is this program tracking as well?\n\n**Matt Murphy** (Chairman and CEO)\nYeah, thanks, Harlan. I appreciate the question. I understand the noise. As I said in my answer to the earlier question, we're at a point where the initial programs and wins we have are ramping. We've increased our opportunity set pretty significantly to, you know, from a handful of sockets to this 18+. We're really driving to the market share targets in the future. Given the massive sort of focus in this area and sensitivity, commenting on just the individual sockets at this point is only probably increasing the noise level. What we're really focused on is winning incremental designs, executing on the ones we've got, and driving the business forward, ultimately trying to get 20% of a $90+ billion TAM in the future. That's where that's at.\n\n**Operator**\nThank you. Our last question is from Quinn Bolton with Needham & Company.\n\n**Quinn Bolton** (Managing Director of Equity Research)\nHey guys, thanks for squeezing me in. Matt, I wanted to follow up just kind of on the scale-up switch fabric opportunity. It seems like it's, you know, a bigger part of the XPU attach market and, you know, there are different flavors, Ethernet, UALink. Just wondering, can you give us a sense when Marvell may have its first products, you know, ramping to revenue? Is that a calendar 2026 event or is it going to be more UALink-based and more likely a calendar 2027 event? I've got to follow up.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, thanks, Quinn. I think maybe I'll have Sandeep add a little bit more, but I think he did a good job framing it. I will just say, to maybe up-level it for a second, I think on the scale-up, it really is a great combination of key Marvell IPs all into one, especially our low latency switching IP, our SerDes, and just the ecosystem we're living in relative to XPUs. This being a key XPU attach, that's fundamentally almost a chipset type of a decision. Sandeep, anything else to add on that? I think we haven't really articulated a lot yet publicly on what we're doing, but there's a huge amount of momentum here and we're engaged very broadly in this area. Sandeep, any thoughts and closing remarks on this one?\n\n**Sandeep Bharathi** (President of Data Center Group)\nThank you, Matt. We are definitely investing to bring UALink and Ethernet-based products as we engage with our customers and working very closely with our customers' timeline. What I would say is product introductions in the UALink and Ethernet space for scale-up specifically will be in the next two years. Certainly with the assets that we have, not only are we looking at UALink-based products in interconnect, we're already starting to see the use of AECs in the near term and AOCs, which is active electrical cables and active optical cables, positioning us to participate in these markets. For UALink and Ethernet-based specifically, it'll be in the next two years.\n\n**Quinn Bolton** (Managing Director of Equity Research)\nGot it. Thank you. I just wanted to ask, you know, you guys obviously have a very substantial business in the DSP-based optical modules. A few of your peers have started to note that I believe three hyperscalers are beginning to ramp LPO modules. Can you just kind of frame for us, do you think that the, you know, are there substantial LPO developments beginning to occur? Are they pretty niche applications? I mean, just any sense of LPO penetration of the overall optical transceiver market? Is it, you know, likely to stay in the low single-digit percentage? Do you see it getting bigger than that over a couple of years? Just, you know, like to hear your thoughts since you guys are obviously the incumbent.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, thanks, Quinn. It's happening at a smaller scale. By the way, we're in some of those too. We have active, you know, wins and we're going to production in those types of modules as well. Just given the sheer scale of the DSP-based plugables, it just ends up being a very small number and more of a niche use case, but a valuable one if the customer really needs it and can implement it and get it working in production, it can be a benefit. The vast majority we see today still is, and for the foreseeable future, is plugables.\n\n**Quinn Bolton** (Managing Director of Equity Research)\nGot it. Thanks, Matt.\n\n**Matt Murphy** (Chairman and CEO)\nYep, cool. All right, operator, I think that's it. I'm just going to make some closing remarks. Okay, so anyway, thanks everyone for joining. I appreciate all of your interest in Marvell and joining the call and listening in. Just a couple of points. I think the first is, as I indicated and Chris and also Sandeep talked about, the design win momentum in custom has been very, very strong even since the AI Day. I feel really good about that $75 billion pipeline that we're really bringing to close some of those key opportunities within that. I think that pipeline, by the way, from what we can see, is probably going to just keep growing. By the way, this is across XPU, XPU attach. It's at the large hyperscalers and then continuing to increase around the emerging. Optics continues to be very strong.\n\n**Matt Murphy** (Chairman and CEO)\nWe're managing the execution quite well and growing the business there. The core business, which was a point of consternation in the past about when would that come back and what would that ramp look like, it's nice to see in Q3 the strong sequential in enterprise networking and carrier. I think it's like 30% sequential and 80%+ year-over-year. Very strong recovery there. Finally, it's showing up in the numbers. We're getting a lot of leverage here. I looked at Q2 EPS, it's up like 123% year-over-year. In Q3, if you look at the guide, EPS would be up like 70%. Much faster than revenue. Same thing on the sequential. Overall, we're very pleased with the performance of the company. We see a massive opportunity ahead. I appreciate everybody's interest in Marvell. We'll talk to you all soon. Thank you so much.\n\n**Operator**\nLadies and gentlemen, thank you for your participation. This does conclude today's conference. Please disconnect your lines and have a wonderful day.",
      "fetched_at": "2026-02-04T15:41:42.262Z"
    },
    {
      "ticker": "MRVL",
      "title": "Marvell Technology, Inc. (MRVL) Q1 FY2026 earnings call transcript",
      "published_date": "May 29, 2025, 4:45 PM EDT",
      "fiscal_year": "2026",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/MRVL/earnings/MRVL-Q1-2026-earnings_call-324946.html",
      "content": "**Operator**\nAfternoon, and welcome to Marvell Technology Inc. First Quarter of Fiscal Year twenty twenty six Earnings Conference Call. Please note that this event is being recorded. I would now like to turn the conference over to Mr. Ashish Sarvan, Senior Vice President of Investor Relations. Please go ahead, sir.\n\n**Ashish Saran** (Senior Vice President, Investor Relations)\nThank you, and good afternoon, everyone. Welcome to Marvell's first quarter fiscal year twenty twenty six earnings call. Joining me today are Matt Murphy, Marvell's Chairman and CEO and Willem Minkis, our CFO. Let me remind everyone that certain comments made today include forward looking statements, which are subject to significant risks and uncertainties that could cause our actual results to differ materially from management's current expectations. Please review the cautionary statements and risk factors contained in our earnings press release, which we filed with the SEC today and posted on our website, as well as our most recent 10 ks and 10 Q filing.\n\n**Ashish Saran** (Senior Vice President, Investor Relations)\nWe do not intend to update our forward looking statements. During our call today, we will refer to certain non GAAP financial measures. A reconciliation between our GAAP and non GAAP financial measures is also available in our earnings press release. Let me now turn the call over to Matt for his comments on the quarter. Matt?\n\n**Matt Murphy** (Chairman and CEO)\nThanks, Ashish, good afternoon, everyone. For the first quarter of fiscal twenty twenty six, Marvell delivered record revenue of $1,895,000,000 above the midpoint of guidance, reflecting a 4% sequential increase and strong 63% year over year growth. Data center end market continued to deliver strong growth, driven by robust AI demand. In addition, we were pleased to see ongoing revenue recovery in our carrier infrastructure and enterprise networking end markets. Higher revenue versus our forecast also resulted in record non GAAP earnings per share, which came in above the midpoint of guidance.\n\n**Matt Murphy** (Chairman and CEO)\nIn addition, we significantly increased our stock repurchases in the first quarter, buying back $340,000,000 a substantial step up from the $200,000,000 repurchased in the prior quarter. During the first quarter, we announced the sale of our Automotive Ethernet business to Infineon at an all cash transaction valued at $2,500,000,000 We are extremely proud of the progress we have made in organically building and expanding this business, which we expect will deliver a compelling financial outcome for Marvell's stockholders. The closing of this transaction, which we expect within calendar 2025, will provide us with additional flexibility in our capital allocation strategy. We started our new fiscal year on a strong note with Q1 results ahead of plan and are forecasting second quarter revenue of $2,000,000,000 at the midpoint of guidance. This represents 57% year over year growth and would set another record revenue level for Marvell.\n\n**Matt Murphy** (Chairman and CEO)\nLet me now discuss our results and expectations for each of our end markets. In our data center end market, we achieved record revenue of 1,440,000,000 in the first quarter, growing 5% sequentially and 76% year over year. Looking ahead to the second quarter, we expect this momentum to continue with data center revenue projected to grow sequentially in the mid single digit range on a percentage basis, while maintaining strong year over year growth. These strong results, along with our second quarter guidance, are being driven by the rapid scaling of our custom AI silicon programs to high volume production, along with robust shipments of our electro optics products for AI and cloud applications. We continue to expand the capabilities of our advanced technology platform to enable our customers to build full rack level custom infrastructure, including innovative technologies such as custom high bandwidth memory and pro package optics.\n\n**Matt Murphy** (Chairman and CEO)\nMarvell's custom HBM compute architecture enhances XPUs by optimizing the IO interfaces between accelerator silicon and the memory embedded in the package. This enables AI custom compute accelerators with much more efficient integration of main memory, which can increase performance and reduce run times resulting in increased utilization. We continue to see strong interest from multiple customers who are targeting the highest performance and optimized TCO for their upcoming AI solutions that leverage the most advanced HBMs. Marvell's breakthrough co package optics platform enables customers to integrate our silicon photonics light engine into future custom AI accelerators. Co package optics can drive a transition from copper interconnects to optical fiber for scale up AI clusters.\n\n**Matt Murphy** (Chairman and CEO)\nThis technology will enable larger AI servers with significantly higher total system memory capacity and processing capability, which we expect will provide the scaling headroom required for the next wave of AI models. We expect this transition from copper, which does not contain any active silicon, to optical interconnects to significantly expand Marvell's interconnect revenue and market opportunities. Earlier this month, we announced two new additions to our custom platform. First, we announced a partnership with NVIDIA, adding their NVLink Fusion technology to our expanding custom platform. Marvell Custom Silicon with NVLink Fusion provides customers with an accelerated path to custom scale up solutions, offering greater flexibility and choice in developing next generation AI infrastructure.\n\n**Matt Murphy** (Chairman and CEO)\nThis announcement further validates the proliferation of custom XPUs as a strong complement to merchant solutions. In addition, earlier today, we announced Marvell's new multi die packaging platform, the first of many advanced packaging innovations we are bringing to the market. Solution is already qualified and has entered production in support of a customer specific XPU program. The platform enables customers to realize multi die architectures utilizing differentiated Marvell design interposer technology. This approach can enable more efficient die to die interconnect, lower power consumption, increased yields and lower product cost.\n\n**Matt Murphy** (Chairman and CEO)\nOur Vault solution offers a compelling alternative to traditional silicon interposers for custom cloud applications. We expect to continue to proliferate this technology more broadly in next generation designs. Moving on to the progress we are making in our custom business, we are benefiting from revenue contributions across multiple programs, including XPUs and other accelerators. Our lead XPU program for a large U. S.\n\n**Matt Murphy** (Chairman and CEO)\nHyperscale data center customer is doing extremely well and has become a key revenue driver for our custom business. I'm incredibly proud of our team and the close collaboration with this customer to drive this program to volume production with A0 silicon and meet the customer's steep ramp. As I mentioned last quarter, we are fully engaged with this customer on the follow on generation and I'm pleased to report that we have now secured three nanometer wafer and advanced packaging capacity and expect to start production in calendar twenty twenty six. At the same time, our architecture team is working with the customer to support the definition of the generation after that. This is all consistent with the multi generational nature of these engagements, reflecting the benefit of working with Marvell over the long term.\n\n**Matt Murphy** (Chairman and CEO)\nAs a result, we anticipate that our revenue from custom AI XPUs for this customer will continue to grow next year, fiscal twenty twenty seven and beyond. At our AI Day last year, we also announced a significant design win for a custom AI XPU with another US Hyperscale. Joint development on this program continues to progress well, and we are already engaged with this same customer on the architecture for the follow on generation of this AI XPU program. I'm very pleased with the strong progress we are making across both our current and upcoming custom programs. This momentum reinforces our confidence in achieving our long term goals for custom revenue.\n\n**Matt Murphy** (Chairman and CEO)\nWe will be highlighting our broad and expanding range of opportunities at our custom AI investor event on June 17. I will share more details about this event in a moment. Turning to our interconnect portfolio, our PAM and DCI franchises continue to lead the industry in enabling the build out of AI and cloud infrastructure. At this year's Optical Fiber Conference, we showcased a broad range of products, technologies and ecosystem initiatives designed to power the next generation of scale up and scale out AI deployments, including the industry's first four hundred gig per lane PAM technology, a critical step towards 3.2T optical interconnects, enabling pluggable transceiver modules to remain the dominant solution for scale out connectivity for the foreseeable future. Co package optics and co package copper technologies providing greater interconnect densities and longer reach for scale up networking silicon photonics light engines scaling up to 6.4T consolidating hundreds of components into compact modules optimized for both pluggable and CPO applications.\n\n**Matt Murphy** (Chairman and CEO)\n1.6T linear drive pluggable optical modules using Marvell's silicon photonics light engine. The industry's first three nanometer 1.6T PAM4 DSP featuring 200 gig per lane electrical and optical interfaces, enabling customers to reduce module power consumption by more than 20% compared to its predecessor. Next generation 800 gig DCI modules supporting data transmission over distances up to 1,000 kilometers. Production ready 1.6 T AEC DSPs for emerging 200 gig per lane accelerated infrastructure. Coherent light DSPs enabling power and performance optimized solutions for the emerging market of distributed campus data center interconnects, spanning distances up to 20 kilometers and finally PCIe Gen six and Gen seven SerDes for end to end connectivity over optics.\n\n**Matt Murphy** (Chairman and CEO)\nWe received highly positive feedback from customers, partners and industry analysts during the event, making OFC twenty twenty five another home run for the Marvell team. Now let me turn to Marvell's enterprise networking and carrier infrastructure end markets. In the first quarter, enterprise networking revenue was $178,000,000 while carrier infrastructure revenue totaled $138,000,000 Collectively, revenue grew by 14% sequentially, exceeding the midpoint of our forecast and reflecting the ongoing recovery in both end markets. Looking ahead to the second quarter of fiscal twenty twenty six, we expect aggregate revenue from enterprise networking and carrier infrastructure to grow sequentially in the mid single digit range on a percentage basis. In the consumer end market, first quarter revenue was $63,000,000 representing a 29% sequential decline.\n\n**Matt Murphy** (Chairman and CEO)\nLooking ahead to the second quarter, we expect consumer revenue to grow by approximately 50% sequentially. These sequential changes are largely driven by seasonality and gaming demand, which continues to be the primary factor driving our consumer business. Turning to our automotive and industrial end market, first quarter revenue was $76,000,000 declining by 12% sequentially. While we saw sequential growth in our automotive end market, this was more than offset by a decline in our industrial end market, where order patterns can be lumpy in any given quarter. Looking ahead to the second quarter of fiscal twenty twenty six, we anticipate overall revenue from the auto and industrial end market to be flat on a sequential basis.\n\n**Matt Murphy** (Chairman and CEO)\nIn summary, in the first quarter of fiscal twenty twenty six, we continued to deliver operating margin expansion, earnings per share growth and new revenue records. These results reflect strong contributions from our AI driven data center end market and ongoing recovery in our enterprise networking and carrier infrastructure end. While there are ongoing macroeconomic uncertainties, we are guiding for continued growth in the second fiscal quarter. We continue to closely monitor the broader environment to assess potential long term impacts. As I mentioned during our March earnings call, AI now represents the majority of our data center revenue, and we expect the relative proportion of AI related revenue to grow further in the coming years, driven in large part by our custom silicon business.\n\n**Matt Murphy** (Chairman and CEO)\nWe've made tremendous progress since our AI era event last year, and in light of this momentum, we are hosting a dedicated forum on June 17 for investors to gain deeper insight into Marvell's unique position in the custom silicon market. This event will be broadcast live and provide an ideal setting to showcase our differentiated technology platform and provide an opportunity to hear directly from me and a broad cross section of Marvell's engineering leadership and members of my DIRECT staff. Presentations will be followed by a Q and A session providing investors and analysts an opportunity to ask questions. During the event, we will highlight our expertise in system and semiconductor design, our advanced process and package roadmap, and our comprehensive portfolio of semiconductor platform solutions and IP. Complementing this technical deep dive, the agenda will include a market focused section with updates on the expanding market opportunity for custom silicon, a robust design win pipeline and the growing role of custom silicon in AI infrastructure.\n\n**Matt Murphy** (Chairman and CEO)\nWe will also share our progress towards the market share goals we set at our AI era event last year, along with our vision for significant growth in the years ahead. We are excited to share more details about this incredible custom silicon opportunity on June 17. Looking more broadly, we continue to see strong tailwinds in AI, including robust capital expenditure plans from hyperscalers, an increasing number of sovereign data center announcements, and an emerging group of hyperscalers further expanding the market. These fast growing markets present us with a diverse set of opportunities, increasing our confidence in the long term potential of our data center business. In addition, we are seeing an encouraging recovery in carrier infrastructure and enterprise networking, their second quarter forecast representing the fifth straight quarter of sequential revenue growth for these combined end markets.\n\n**Matt Murphy** (Chairman and CEO)\nWith that, I'll turn the call over to Willem for more detail on our recent results and outlook.\n\n**Willem Meintjes** (Chief Financial Officer)\nThanks, Matt, and good afternoon, everyone. Let me start with a summary of financial results for first quarter of fiscal twenty twenty six. Revenue in the first quarter was $1,895,000,000 exceeding the midpoint of our guidance, growing 63% year over year and 4% sequentially. Data center was our largest end market, contributing 76% of total revenue. GAAP gross margin was 50.3%.\n\n**Willem Meintjes** (Chief Financial Officer)\nNon GAAP gross margin was 59.8%. Moving on to operating expenses. GAAP operating expenses were CAD682 million including stock based compensation, amortization of acquired intangible assets, restructuring costs and acquisition related costs. Non GAAP operating expenses came in at $486,000,000 slightly below guidance. Our GAAP operating margin was 14.3% while non GAAP operating margin was 34.2%.\n\n**Willem Meintjes** (Chief Financial Officer)\nFor the first quarter, GAAP earnings per diluted share was $0.20 Non GAAP earnings per diluted share was $0.62 reflecting year over year growth of 158%, which is more than double the pace of revenue growth, demonstrating the significant operating leverage in our model. Now turning to our cash flow and balance sheet. Cash flow from operations in the first quarter was CAD333 million. Our inventory at the end of the first quarter was CAD1.07 billion, an increase of CAD42 million from the prior quarter to support the growth in our business. We returned CAD52 million to shareholders through cash dividends.\n\n**Willem Meintjes** (Chief Financial Officer)\nIn addition, reflecting our strong belief in Marvell's future prospects, we significantly increased repurchases in the first quarter, buying back $340,000,000 of our stock, stepping up from the $200,000,000 we repurchased in the prior quarter. Our total debt was $4,200,000,000 with a gross debt to EBITDA ratio of 1.8 times and a net debt to EBITDA ratio of 1.42 times. Our debt ratios have continued to improve as we have driven an increase in our EBITDA. As of the end of the first fiscal quarter, our cash and cash equivalents were $886,000,000 Turning to our guidance for the second quarter of fiscal twenty twenty six. We are forecasting revenue to be in the range of $2,000,000,000 plus or minus 5%.\n\n**Willem Meintjes** (Chief Financial Officer)\nWe expect our GAAP gross margin to be between 5051%. We expect our non GAAP gross margin to be between 5960%. Looking forward, we anticipate that the overall level of revenue and product mix will remain key determinants of our gross margin in any given quarter. For the second quarter, we project our GAAP operating expenses to be approximately CAD735 million. We anticipate our non GAAP operating expenses to be approximately CAD495 million.\n\n**Willem Meintjes** (Chief Financial Officer)\nFor the second quarter, we expect other income and expense, including interest on our debt, to be approximately CAD49 million. We expect a non GAAP tax rate of 10% for the second quarter. We expect our basic weighted average shares outstanding to be $864,000,000 and our diluted weighted average shares outstanding to be $874,000,000 We anticipate GAAP earnings per diluted share in the range of $0.16 to $0.26 We expect non GAAP earnings per diluted share in the range of $0.62 to $0.72 In summary, we continue to drive strong revenue growth, expand our operating margins, generate strong cash flow and returning increasing amounts of capital to our stockholders. We are looking forward to completing the sale of our automotive Ethernet business to Infineon, which will provide us with even more flexibility to execute on our capital allocation strategy. With that, we are ready to start our Q and A session.\n\n**Willem Meintjes** (Chief Financial Officer)\nOperator, please open the line and announce Q and A instructions. Thank you.\n\n**Operator**\nThank you, sir. We will now begin the question and answer session. Star then one on your touch tone phone. If you are using a speakerphone, please pick up your handset before pressing the keys. And to withdraw your question, please press star then two.\n\n**Operator**\nAnd in the interest of time, please restrict yourself to one question only. And if you have additional questions, please rejoin the queue. At this time, we will pause momentarily to assemble our roster. And our first question comes from Vivek Arya at Bank of America. Please go ahead.\n\n**Vivek Arya** (Managing Director)\nThank you. And thanks, Matt, for clarifying that you have that three nanometer program at your large XVU customer and have the follow on program at the other large customer, just given all the Asia supply chain noise. I guess I had two related questions. One is, what is the direction of content in these next generation programs? You know, is it up, down flat?\n\n**Vivek Arya** (Managing Director)\nAnd number two, are you exclusive on these three nanometer XPUs? Or do you expect to share that program, given that your competition also seems to be convinced that they have the program? So just comments on content and exclusivity. Thank you.\n\n**Matt Murphy** (Chairman and CEO)\nHey, Vivek, thanks for the question. So first, yes, I'm glad you said it. I can certainly appreciate the challenge for investors given the news flow that is coming out on seemingly a weekly basis here. The fact is that these Asia supply chain sources have an incomplete view. We run a very tight ship here at Marvell.\n\n**Matt Murphy** (Chairman and CEO)\nWe don't share customer confidential information. We treat that with the highest priority. So they simply have no idea what we're doing for our customer. So let me state the facts as they exist today. We're the incumbent shipping the current generation of this AI XPU.\n\n**Matt Murphy** (Chairman and CEO)\nAnd as I've detailed, we've had a very successful and rapid ramp on this program from A0, which is first time success, to high volume production. I've talked about this for a couple of quarters. We've been engaged with this customer on the follow on generation of this XPU. This next generation program has continued to move forward. And this quarter, we have secured three nanometer wafer and advanced packaging capacity, and that's for 2026, where we expect to start production, and that would be subject to the typical completion of our customers' qualification cycles, which we now have some experience with.\n\n**Matt Murphy** (Chairman and CEO)\nAnd so assuming AI CapEx continues to grow, we expect our custom silicon revenue to continue to grow next year through program transitions at this customer. So look, our customers have relationships with many partners, and they do that to build out their whole silicon portfolio. The key point is that irrespective of any of these relationships, we expect our revenue to continue to grow on a multiyear, multigenerational basis with this customer. And given the volumes that have materialized for XPUs, it's certainly possible and likely that customers and our customer may be pursuing multiple paths to meet their requirements. So thank you for asking this important question, Vivek.\n\n**Matt Murphy** (Chairman and CEO)\nI think my answer is as clear as it could be. Thanks.\n\n**Vivek Arya** (Managing Director)\nThank you.\n\n**Operator**\nNext question will be from Ross Seymore at Deutsche Bank. Please go ahead.\n\n**Ross Seymore** (Managing Director)\nHi Matt, thanks for that color. Following on Vivek's question, one of your primary XPU competitors has talked about engagements at additional customers, not necessarily to front run anything you may or may not say on June 17, but how do you see Marvell's ability to support a broader customer base beyond the initial, I guess, threefour that you have depending upon if we're talking XPUs or connectivity?\n\n**Matt Murphy** (Chairman and CEO)\nYes. Thanks, Ross. Yes, we'll cover this certainly at the AI investor event we'll be holding. But just to give you some color, we absolutely have the capacity engineering wise to expand our portfolio and expand our engagements. If you look at Marvell's R and D spend over the last few years through cycle, we've made increases there.\n\n**Matt Murphy** (Chairman and CEO)\nAnd then within that, as part of our capital allocation strategy, we've aggressively repurposed and reallocated our talent and our teams to this massive data center and AI opportunity. So if you look at just the raw R and D spending, the investments we're making in next generation technologies, and again, we're going to cover all this at the AI Day, we are extremely well positioned to support and are supporting multiple increased engagements across a number of programs that we'll detail and we'll talk about and we'll frame at the AI investor event. But I think we're very well positioned to support designs that can really grow the company to even a much larger scale and level. And I would say also, by the way, it's not just the top sort of four, I think there's been a really interesting emergence over the last year or so of the next wave of hyperscale kind of class customers that can benefit from our technology relative to going custom. So we're going to talk about all that in just a couple of weeks out here. Look forward to talking to you then.\n\n**Ross Seymore** (Managing Director)\nThank you.\n\n**Operator**\nNext question will be from Thoros Van Berg at Stifel. Please go ahead.\n\n**Tore Svanberg** (Managing Director)\nYes. Thank you and congrats on the results. Maybe in the spirit of clarifying things, there's a lot of debates out there about your service technology, especially for 200 gig SerDes. So maybe you could talk a little bit about Marvell's positioning there. Maybe related to that, how this relationship with NVIDIA is gonna work out.\n\n**Tore Svanberg** (Managing Director)\nI'm sure there's a lot you can't share with us, but I tried anyway.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, sure. Yeah, on the first topic, and we'll actually be showcasing this at our AI event, our Surtees technology remains best in class, both from a performance standpoint as well as a time to market standpoint. If you recall, we've had now leadership announcements and production by the way on 200 gig, it's performing extremely well. And we just showed off at OFC the first and only 400 gig per lane demonstrations with very aggressive roadmap there. So that is in great shape, our technology across the board, both electrical and optical, SerDes. Tell me your second question?\n\n**Tore Svanberg** (Managing Director)\nYeah, it was the NVLink Fusion and how that's going to work out.\n\n**Matt Murphy** (Chairman and CEO)\nYeah. So so that's we're excited about that partnership. I think we're it's it's I think it's a sign that it kinda demonstrates how well, you know, we're deeply engaged in the ecosystem, Tore, with with key partners. And the second, think it's some validation as well that from a market standpoint, there is a complementary role for custom even as acknowledged by NVIDIA, who can leverage sort of the R and D investment they've already put in, in their RackScale solutions, but with people that want to do their own XPUs. And so we're part of that discussion and we're going to help enable that if that's the direction our customers want to go.\n\n**Matt Murphy** (Chairman and CEO)\nAnd we just view it as another key piece to the whole portfolio that we offer to customers kind of end to end. And detailed some of those in my prepared remarks as well around things like custom HBM, co package optics, advanced packaging and others. These are really just it's really part of a suite of technologies to give the broadest offerings to our customers with the best in class technology.\n\n**Tore Svanberg** (Managing Director)\nThanks for all that color, Matt.\n\n**Operator**\nNext question will be from Timothy Arcuri at UBS. Please go ahead.\n\n**Timothy Arcuri** (Managing Director)\nThanks a lot. Matt, I was wondering if you can break down data center revenue a little bit. I think last quarter you said that AI was about 55% of data center. I wonder if it was in the same range. I assume maybe custom silicon grew a little faster because the gross margin was a little bit lower.\n\n**Timothy Arcuri** (Managing Director)\nSo I guess that's the first part of the question. And then, and then, obviously, you're running way above this 2 and a half billion dollar number this year for AI revenue. Can you give us just a sense of where it's tracking for the year? Are we talking like 3,500,000,000.0 to $4,000,000,000 Maybe you'll talk about this at day here in a few weeks, but I'm wondering if you can sort of add some color to this for us. Thanks.\n\n**Matt Murphy** (Chairman and CEO)\nYeah. Thanks, Tim. Yeah, we didn't give an exact number when we talked about it relative to our Q4 was the data point we gave, but we did say that at that time that within data center AI had crossed and was now the majority of our data center revenue. And I think the way to think about it is, because we're not going to break it out on a sort of quarter by quarter basis, but as I've prepared for the call and been looking at the trajectory of the business, and I say this with also you got to factor in that we anticipate the mass market and the core business to continue to recover. We see a path here in the not too distant future where AI is not only the majority of the data center end market, but it becomes the majority of Holco.\n\n**Matt Murphy** (Chairman and CEO)\nAnd so where that line is exactly, we're not calling it, but that's the trajectory. So I think you the mental shift is like not sort of figuring out within data center what that exact number is, but you can do your own models. You guys are very, very capable there, drawing a line between here and when it can actually cross as a 50% contributor to the whole company. But that's coming.\n\n**Timothy Arcuri** (Managing Director)\nI guess then, is that why so did the customer think business grow a little faster than that, that's why the gross margin was a little lower?\n\n**Matt Murphy** (Chairman and CEO)\nYes, on that side of things. Yes, there's mix within the quarter and clearly the custom business we have does run at a fundamentally lower gross margin. So that is going to modulate our gross margins on a quarterly basis, and you've seen the impact. But we've also had, I think, strong recovery in some of the other businesses as well. That's always been fundamentally the custom business, a lower than company average gross margin.\n\n**Willem Meintjes** (Chief Financial Officer)\nMaybe I can add quickly. When you look at our Q2 guide, suddenly custom continues to grow really strongly and that's what you're seeing reflected in that. When we look forward to second half, clearly we're optimistic on custom demand. And that interplay between that and the rest of the business is really going to drive what gross margin will be in the second half. Right now, probably expect it to be in a similar range as what we guided for Q2.\n\n**Timothy Arcuri** (Managing Director)\nOkay, thank you, Will.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, thanks, Tim.\n\n**Operator**\nNext question will be from Chris Cassell at Wolfe Research. Please go ahead.\n\n**Chris Caso** (Managing Director)\nYes, thank you. Good evening. I guess the question is regarding the second half of the year. And I'm sure you're not ready to provide that guidance right now. But could you give us some puts and takes on what your expectations may be?\n\n**Chris Caso** (Managing Director)\nDo you expect the custom business to continue to grow in the second half of the year? What do you expect with regard to the carrier enterprise businesses? Is this kind of slow steady ramp in those businesses? Any kind of color in the second half, please?\n\n**Matt Murphy** (Chairman and CEO)\nYes. Thanks, Chris. Yes, maybe just at a higher level, I said this in some of my prepared remarks, but we're yes, we are monitoring the macro and the various dynamics going on out there. So that's always a factor. But at the moment, we see a couple of things happening.\n\n**Matt Murphy** (Chairman and CEO)\nThe first is, and just even recently as yesterday, see strong numbers out of NVIDIA and other announcements leading up to that. But we see the AI demand continuing and the data center demand continuing. And then on top of that, we have this nice recovery, strong recovery, actually, we've been driving in our core business, in particular, enterprise networking and carrier. So we expect that to continue to recover and grow throughout the rest of the year as well. So we're not calling on a quarter by quarter basis, but right now, we expect growth kind of across the board through the year with I think what can be a really nice setup for fiscal twenty twenty seven with some of the growth drivers we've articulated before.\n\n**Matt Murphy** (Chairman and CEO)\nSo that's where we're at right now, and feel good about it. Thanks.\n\n**Chris Caso** (Managing Director)\nGot it. Thank you.\n\n**Operator**\nNext question will be from Harsh Kumar at Piper Sandler. Please go ahead.\n\n**Harsh Kumar** (Managing Director &amp; Senior Research Analyst)\nYes. Hey, Matt. Congratulations on solid results. When we talk to investors, Matt, we find that there's a desire on part of investors for the data center business to grow faster than, let's say, what you've been putting up mid single in the April and then also the guidance. I know that in the last quarter, Matt, you had some moving parts with on prem, etcetera.\n\n**Harsh Kumar** (Managing Director &amp; Senior Research Analyst)\nI was hoping that you could clarify the growth of your AI business versus some of the non AI pieces like on prem or some other things that might be moving around and just help us understand how fast maybe your AI business is growing.\n\n**Matt Murphy** (Chairman and CEO)\nYeah. Thanks, Harsh. Yeah. And I think the way to think about it is is is helpful is to contextualize. You know, it's it's not a one a one quarter snapshot.\n\n**Matt Murphy** (Chairman and CEO)\nSo if you look at the last few quarters, we had a very dramatic step up from Q3 to Q4, '20 percent plus in the data center business. It grew 4%, we're guiding it up mid single. I just kind of gave some indication that it'll keep growing. And so if you look at the year so that's one way to think about it is we did have a significant step up. And Q2, as signaled, is looking like it's going to grow slightly faster than Q1, so that's a good sign.\n\n**Matt Murphy** (Chairman and CEO)\nBut also, I'd point you to the fact that, look, a year ago, we were in a very strong position relative to our data center and how it was growing. So the comparables are also telling, right, when you're talking about data center year over year revenues for a company at our scale growing 70% plus on a year over year basis, we feel good about that. So I think with that setup, if you look at just the last two, three quarters and you look at year over year, we feel really good about the trajectory of the business. And AI continues to be the fastest portion of that in terms of our data center business. And as I said earlier, to answer Tim's question, at some point that will just flip over and become you know, half half of Holco.\n\n**Matt Murphy** (Chairman and CEO)\nSo that I think that's that's that's the context I can give you at the moment. Thanks.\n\n**Harsh Kumar** (Managing Director &amp; Senior Research Analyst)\nSo so, Matt, hopefully, you can talk about the on prem piece if possible or other parts that are moving?\n\n**Matt Murphy** (Chairman and CEO)\nWell, yeah, the on prem is is pretty small at this point. So it it it has some effect and it's it's it's it's it's it's always, you know, continue to be a little bit of a drag. But but, the overall data center revenue is driven primarily by AI and the other stuff is performing pretty much in line. I don't think it's a drag going forward. I think if you're worried about like where does it land in the next few quarters, it's not as big a contributor as it used to be and it's probably where it is, maybe it comes back a little bit, but it's the spending has shifted just so dramatically, right, in the data center.\n\n**Matt Murphy** (Chairman and CEO)\nThe enterprise on prem piece is just not getting the spend anymore. So I think it was down a little bit in Q1, but it's relatively stable.\n\n**Harsh Kumar** (Managing Director &amp; Senior Research Analyst)\nThank you so much.\n\n**Operator**\nNext question will be from Tom O'Malley at Barclays. Please go ahead.\n\n**Thomas O'Malley** (Director - Equity Research)\nHey, guys. Thanks for taking my questions. I have two quick ones. First one's for Vilan. You are guiding data center up mid single digits into the out quarter, and you're saying custom silicon is growing quite strongly.\n\n**Thomas O'Malley** (Director - Equity Research)\nIs there something going on with optical? Is that flattening out a bit? Is there anything going on? Could you give us an update on the health of optical and what you're embedded in your guide? And then the second is, Matt, in your announcement with Amazon, you talked about a bunch of other products other than custom silicon that you guys were engaging with over the next couple of PCIe cables, PCIe retimers, AAC.\n\n**Thomas O'Malley** (Director - Equity Research)\nCould you maybe try to size what that impact is right now? Some of your competitors in that space are putting up some bigger numbers. Would love to see how significant that is for you guys. Thank you.\n\n**Matt Murphy** (Chairman and CEO)\nYes. Thanks, Tom. Maybe I'll take the second part first. Yes, I think those engagements are going very well. You're right, in our broader agreement, was there was actually a lot of different exciting opportunities on the networking connectivity side.\n\n**Matt Murphy** (Chairman and CEO)\nThose are progressing, no major updates there. And then with respect to how the optics business is doing, it's done quite well. And in fact, we see that business growing throughout the year, this year. So we see both growth from custom as well as optics, and then again on the Amazon agreement progressing well. I would say just at a high level too, we have in some of these new emerging categories, we do have AECs ramping this year, I wanted to note that, and as well as continued revenue growth in switching. So a lot of good things happening there, Tom.\n\n**Willem Meintjes** (Chief Financial Officer)\nYes, Tom, and I'll just add quickly in terms of the puts and takes on gross margin. The other one to take into account there is the strong snapback on consumer. That's seasonal and expected. But that's another area that's typically slightly below average when you look at the overall.\n\n**Ashish Saran** (Senior Vice President, Investor Relations)\nCan we have the next question, please?\n\n**Operator**\nFrom Harlan Sur at JPMorgan.\n\n**Harlan Sur** (Executive Director - Equity Research)\nHey. Good afternoon. Nice job on the quarterly execution, guys. The lead AI GPU vendor, I think, is getting ready to commence shipments of the next generation platform. And in parallel, they're rolling out their next gen x 800 InfiniBand and Ethernet scale out solutions that support 1.6 t optical connectivity.\n\n**Harlan Sur** (Executive Director - Equity Research)\nAnd typically, like, the optics start to ship ahead of the GPUs and wrap scale platforms. So do you anticipate a strong ramp of your 1.6 t solution starting now? And more importantly, your five nanometer solution, I think, is already qualified with this customer. Are you guys going be mapping your three nanometer DST solution into this next generation, next networking platform?\n\n**Matt Murphy** (Chairman and CEO)\nYeah, thanks Arlen. And you're right about the sequencing. And so we have commenced shipments on 1.6 T at five nanometer. We have very strong demand for three and we've executed very well on that product development so far. And so I think that's from a 1.6T kind of lifespan perspective, I think that's where the volume is gonna be.\n\n**Matt Murphy** (Chairman and CEO)\nAnd I think that's gonna be a much stronger ramp next year. And and some of that I say too because the 800 gig has continued to be so strong kind of across the board that just as a as a as a kind of a percentage of the total, it's still largely dominated this entire year by 800 gig. But yes, we're shipping now, the part works well, but there's just a lot of demand to initial ramps and customers will be on five nanometer, but there's a big push in the ecosystem to drive it to three nanometer given the compelling power savings and the performance of our product. So all that's going well. We're well positioned for the 1.6T ramp and ecosystem expansion.\n\n**Harlan Sur** (Executive Director - Equity Research)\nThanks for the update, Matt.\n\n**Matt Murphy** (Chairman and CEO)\nYes. Thanks, Harlan.\n\n**Operator**\nNext question will be from Blayne Curtis at Jefferies. Please go ahead.\n\n**Blayne Curtis** (Managing Director)\nHey, good afternoon. Thanks for taking the question and thanks for clarifying all that ASIC stuff. I just kind of wanted to ask, going back to the gross margin. So I think there's been a lot of discussions about what an ASIC vendor can charge for and not charge, whether they can charge for memory. I think you guys kind of put a line in the sand at a certain gross margin for ASIC. I'm curious if that's still the right level.\n\n**Blayne Curtis** (Managing Director)\nAnd when you look at these next generations, I'm glad you're involved with all those. How should we think about sustainable AI ASIC gross margins? Is it still in the original range you're looking at?\n\n**Matt Murphy** (Chairman and CEO)\nYes. Thanks, Blaine.\n\n**Matt Murphy** (Chairman and CEO)\nYes, when we look at our overall custom business as a whole, we've been able to manage the gross margins even with these ramps in the range we've talked about. But within custom, there is a range and it's like the old adage in semiconductors, the higher the volume, you're going to see lower gross margins, but you're going to see a lot more operating income. And so that's what we see. I wouldn't say that the percent change is really any different relative to how it stacks up on the opportunity set. Things that are a lot more Marvell contribution as an example, where we leverage a lot of the IP and maybe more outside the XPU, those tend to be a little higher.\n\n**Matt Murphy** (Chairman and CEO)\nAnd of course, they don't grab the limelight, but we're to talk about those at the AI Day because they actually, in aggregate, add up to a very nice revenue pipeline for us and opportunity set with also that same multigenerational aspect to it. But from a percent standpoint, we're managing the business fine and the AI portion, the XPU is always going to be lower. It's just that as the XPU, depending on the magnitude of that, that may move that mix around. But I there's a certain range for these programs and projects, and we haven't really seen that change. The magnitude of the volume has changed, but I'd say that's across the board, by the way, not only of the XPUs that we have going in flight or in production increased a lot from when we won them, but now these other types of accelerators or custom networking or custom NICs or things of that nature, those have also, quite frankly, those are a lot more volume than we had anticipated and those carry a little bit higher margin.\n\n**Matt Murphy** (Chairman and CEO)\nSo I hope that context is helpful, but we're still managing the business in the same way.\n\n**Willem Meintjes** (Chief Financial Officer)\nMatt. But maybe one additional add is just on operating margin. So I think the one thing that's consistent across all these programs is that we're driving accretive operating margin to our model. And so clearly, there is a range. But as you scale those programs, it's a finite investment.\n\n**Willem Meintjes** (Chief Financial Officer)\nAnd you've seen that leverage in our model over the last couple of quarters here.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, I think you're seeing it in operating margin dollars flowing in, Blaine, and also in EPS, right, which still continues to grow like twice the rate of revenue at this point. And we don't see that changing relative to the leverage we get on these big programs, very operating margin rich in terms of just the dollars.\n\n**Blayne Curtis** (Managing Director)\nThanks, guys.\n\n**Matt Murphy** (Chairman and CEO)\nYeah. Thanks.\n\n**Operator**\nNext question will be from Quinn Bolton at Needham and Company. Please go ahead.\n\n**Quinn Bolton** (Senior Analyst)\nHey. Thanks for taking my question. Matt, I wanted to follow-up on the VECS question or maybe just a clarification on whether these ASIC programs could potentially be dual sourced. I think towards the end of your answer, said that there could be multiple paths, I'm not sure if you're sort of suggesting there might be different versions of an XPU or whether they could actually be dual sourced. To the extent that they're dual sourced, you spent a couple years designing these programs.\n\n**Quinn Bolton** (Senior Analyst)\nDo you guys have guarantees that you don't get blanked at the end of the year if they take the other path?\n\n**Matt Murphy** (Chairman and CEO)\nQuinn, I appreciate the question. I was quite lengthy in my prepared remarks and even my, I think Vivek answer in terms of what I the perspective I can offer you on that. So I think I've said it and if I wasn't clear, I did say that given the volumes, it's certainly possible that there are multiple paths pursued. For us in our business, and what I said in the prepared remarks as well as we feel very confident and very good about our revenue continuity on the initial program and the revenue ramp on our additional program. We're planning production, we're tracking, we're doing that.\n\n**Matt Murphy** (Chairman and CEO)\nSo I see the noise coming in, but I'm also just need to kind of focus on what I'm hearing from my customer and what we need to go do to execute to to be a good Got it.\n\n**Quinn Bolton** (Senior Analyst)\nThe second question is just a follow-up on the NVIDIA Fusion. Are you guys NVIDIA sort of open up their NVLink and you design your SerDes to be compatible with that and you offer that out as an IP block to your ASIC customers? Or is there an IP transfer from NVIDIA to yourselves involved in that NVLink Fusion offering?\n\n**Matt Murphy** (Chairman and CEO)\nYeah. Yeah. The the the the initial intent is it's planned as a as a chiplet solution. And so we we could, for example, work with the customer, do the do the the XPU design with them, and then through IO chiplets, take die to die interface between the XPU and the NVLink chiplet, and then that interfaces the scale up network. There's probably other models that can exist.\n\n**Matt Murphy** (Chairman and CEO)\nI think the higher level notion that Jensen and the team are driving is really trying to open up and make sure that they that customers can take advantage of the investment they've made in their infrastructure, even if they have unique needs down at a more granular level like at the XPU. So we'll see how that all evolves, but we were very happy to be asked to participate and be a partner. And we've already received a whole bunch of interest from customers on what this engagement might look like. So we'll see where it goes, but I think that the high level concept is what is important.\n\n**Quinn Bolton** (Senior Analyst)\nGot it. Thank you.\n\n**Operator**\nNext question will be from Srini Pajjuri at Raymond James. Please go ahead.\n\n**Srini Pajjuri** (Managing Director)\nThank you, Matt. My question is on the optical side. I know you said your expectation for this year is for the optical business to grow. Obviously, you have the 1.6T ahead of you and you also said 800 gig demand is quite strong. But a couple of questions we get from investors.\n\n**Srini Pajjuri** (Managing Director)\nOne, can you speak to your market share as we go from 800 to 1.6T? Zero and also the potential impact from any technology transitions such as LPL? And then the second question is, can you speak to the extent you have visibility, what is the current inventory that you see at your customers? Because that question keeps coming up given how strong this cycle has been so far. Thank you.\n\n**Matt Murphy** (Chairman and CEO)\nYes, thanks. So yes, we see we've maintained very strong market share in the 800 gig wave. We let it a few others have come in, but we still have a very, very strong position, commanding position there. We were first to market at 1.6T, five nanometer, first to market at 1.63nm. We're driving 400 gig IO, which is going to enable 3.2T based on PAM.\n\n**Matt Murphy** (Chairman and CEO)\nSo I don't see any fundamental shift at all in the market share. And quite frankly, the faster we execute and the faster we ramp these ramp, the better because of the lead we have. So we feel good about that. Any impact any adoption, I should say, not impact of new technologies like LPO, I view this as very incremental, those would be for things like scale up. And we will participate in those.\n\n**Matt Murphy** (Chairman and CEO)\nWe have solutions based on our broadband analog technology and we'll participate in LPO when it happens. Our view still is that's going to be a smaller portion of the market, but we will be there and we're engaged right now. And then I think your last question was just about the broader inventory at our customers. So that looks pretty good. I mean, service this business direct.\n\n**Matt Murphy** (Chairman and CEO)\nWe through a number of channels, but key data points like distribution inventory and things like that, that's very low. We had strong sell through last quarter. We're looking at the whole year and it looks like a still looks like a good year. We got to wait and see. We're only doing one quarter at a time here, but high level this year and next year, especially with the 1.6 transition, we see continued strong growth in our optics business.\n\n**Srini Pajjuri** (Managing Director)\nGot it. Thank you.\n\n**Operator**\nWe will take our last question from Josh Buchalter at TD Cowen. Please go ahead.\n\n**Joshua Buchalter** (Director - Equity Research)\nHey, guys. Thank you for taking my question. I wanted to follow-up on a couple of previous ones. Can you maybe elaborate on on what you would expect to see from a potential customer who's exploring multiple tracks? Is that generally a performance skew and efficient skew?\n\n**Joshua Buchalter** (Director - Equity Research)\nOr or could you see instances where your HyperScale customers are engaged on completely different ASIC programs for completely different workloads? Thank you.\n\n**Matt Murphy** (Chairman and CEO)\nYes, thanks. Nice to meet you. Yes, I think for the I think I've covered kind of as much as I'm going to on the topics from today. But I do think there'll be some discussion probably at the AI Day around some of the different business models that are out there and different things customers are looking for. But at the moment, I think I've given kind of the max color we're going to do on this. So I but I appreciate the question. Thank you.\n\n**Operator**\nThank you. This concludes our question and answer session. I will now turn the call over to Matt Murphy, Marvell's CEO, for closing remarks.\n\n**Matt Murphy** (Chairman and CEO)\nGreat. Thank you, operator. And look, I'd just like to thank everybody for your interest in Marvell and for joining the call. We're off to a great start with our first quarter in fiscal twenty twenty six. I'm very excited to be guiding a $2,000,000,000 quarter for the second quarter and seeing that all the effort that the Marvell team has put in is coming to fruition relative to ramping some of these key programs and executing to meet our customer needs.\n\n**Matt Murphy** (Chairman and CEO)\nAnd I'm looking forward to connecting with everybody at the custom silicon event for investors in a couple of weeks and giving a deeper dive into this quite large opportunity in front of us. So thanks, everybody, and we'll talk soon. Bye.\n\n**Operator**\nThank you, sir. Ladies and gentlemen, this does indeed conclude our conference call for today. Once again, thank you for attending. And at this time, we do ask that you please disconnect your lines.",
      "fetched_at": "2026-02-04T15:41:47.292Z"
    },
    {
      "ticker": "MRVL",
      "title": "Marvell Technology, Inc. (MRVL) Q4 FY2025 earnings call transcript",
      "published_date": "Mar 5, 2025, 4:45 PM EST",
      "fiscal_year": "2025",
      "quarter": "Q4",
      "url": "https://finance.yahoo.com/quote/MRVL/earnings/MRVL-Q4-2025-earnings_call-253593.html",
      "content": "**Operator**\nGood afternoon, and welcome to Marvell Technology Inc.'s fourth quarter and fiscal year 2025 earnings conference call. All participants will be in a listen-only mode. Should you need assistance, please signal a conference specialist by pressing the star key followed by zero. After today's presentation, there will be an opportunity to ask questions. Please note this event is being recorded. I would now like to turn the conference over to Mr. Ashish Saran, Senior Vice President of Investor Relations. Please go ahead.\n\n**Ashish Saran** (SVP of Investor Relations)\nThank you, and good afternoon, everyone. Welcome to Marvell's fourth quarter and fiscal year 2025 earnings call. Joining me today are Matt Murphy, Marvell's Chairman and CEO, and Willem Meintjes, our CFO. Let me remind everyone that certain comments made today include forward-looking statements, which are subject to significant risks and uncertainties that could cause our actual results to differ materially from management's current expectations. Please review the cautionary statements and risk factors contained in our earnings press release, which we filed with the SEC today and posted on our website, as well as our most recent 10-K and 10-Q filings. We do not intend to update our forward-looking statements. During our call today, we will refer to certain non-GAAP financial measures. A reconciliation between our GAAP and non-GAAP financial measures is also available in our earnings press release.\n\n**Ashish Saran** (SVP of Investor Relations)\nLet me now turn the call over to Matt for his comments on the quarter. Matt.\n\n**Matt Murphy** (Chairman and CEO)\nThanks, Ashish, and good afternoon, everyone. For the fourth quarter of fiscal 2025, Marvell delivered record revenue of $1.817 billion, above the midpoint of guidance, growing 20% sequentially and 27% year-over-year. Our data center and market was the primary growth driver, fueled by strong AI demand and execution. In addition, we saw continued demand recovery across our multi-market businesses, including carrier, enterprise, networking, and automotive and industrial. I am pleased to report that we achieved GAAP profitability in the fourth quarter and expect this to continue in fiscal 2026. Our record non-GAAP earnings per share of $0.60 exceeded the midpoint of guidance, growing 40% sequentially. This earnings growth rate, double our top-line growth rate, underscores the substantial operating leverage in our business model. For the full fiscal year 2025, we delivered $5.77 billion in aggregate revenue, with our data center revenue growing 88% year-over-year.\n\n**Matt Murphy** (Chairman and CEO)\nWe ended the year with our AI revenue substantially above our $1.5 billion target from April 2024's AI Day, and we also expect to very significantly exceed our $2.5 billion target in fiscal 2026. Our overall revenue growth accelerated in the second half of the year, driven by our custom silicon program ramps, along with continued strong growth in electrical optics. In fiscal 2025, we also drove a record $1.68 billion in operating cash flow and significantly increased capital returns to our stockholders through stock repurchases and dividends, totaling $933 million in aggregate. I'm extremely pleased with our fiscal 2025 results and even more excited about our outlook for robust year-over-year revenue growth in fiscal 2026. We are poised for a strong start to the new year, forecasting revenue growth of over 60% year-over-year in the first quarter at the midpoint of guidance.\n\n**Matt Murphy** (Chairman and CEO)\nLet me now discuss our results and expectations for each of our end markets. In our data center end market for the fourth quarter, we achieved record revenue of $1.37 billion, growing 78% year-over-year and 24% sequentially. These strong results were driven by our custom AI silicon programs ramping to high-volume production. Additionally, we benefited from strong shipments of our electrical optics products and Teralynx Ethernet switches, with revenue from both product lines growing double digits sequentially on a percentage basis. Within our electrical optics franchises, we continue to see strong demand for our market-leading 800G PAM products and our 400ZR DCI products. We also began shipments of the industry's first 1.6T PAM DSP and 5nm process technology. To further optimize AI interconnect performance, we accelerated the cadence of next-generation products by introducing the industry's first 3nm 1.6T DSP, featuring 200G per lane electrical and optical interfaces.\n\n**Matt Murphy** (Chairman and CEO)\nThis new Marvell DSP enables customers to reduce 1.6T optical module power consumption by more than 20% compared to its predecessor, and we expect to go into production in the second half of this year as 1.6T adoption accelerates. While tremendous focus remains on GPUs and XPUs, the distributed nature of compute and AI makes connectivity just as critical as the individual processors. As a result, the design of the next generation of accelerated infrastructure is inexorably tied to how efficiently data can be moved on and off the accelerators and throughout the cluster. This increase in the role of high-speed networking and AI data centers is perfectly aligned to our strength as an industry leader and just like compute, hyperscalers are also customizing networking, and we are seeing similar momentum for flash-based storage, HBM, and CXL-based DRAM pooling.\n\n**Matt Murphy** (Chairman and CEO)\nWe'd announced the design win at Meta for a custom NIC at OCP last October, and we are seeing hyperscalers more broadly adopting similar strategies. This is evident in our recent design wins, which now include multiple custom NICs as well as a follow-on custom CXL memory solution. We are also enabling new interconnect technologies such as CPO and LPO for scale-up fabrics and CoherentLite DSPs for emerging campus-wide large-scale AI data centers. Earlier this year, we announced Marvell's breakthrough co-package optics architecture for custom XPUs, enabling customers to integrate optics into future custom accelerators. First demonstrated at OFC 2024, the heart of Marvell's CPO platform is our 6.4T 3D silicon photonics engine. It integrates hundreds of active and passive components in a single unified device and builds on multiple generations of silicon photonics innovations that we have been shipping in high volume in our DCI modules for several years.\n\n**Matt Murphy** (Chairman and CEO)\nCo-packaged optics can enable an increase in the size and scale of AI servers, which currently rely on passive copper interconnects. We expect this transition from copper to optical interconnects will significantly expand Marvell's interconnect revenue and market opportunities. We are engaged with customers to evaluate this advanced technology, and we anticipate a multi-year period of trial system development ahead of wide-scale industry adoption for CPO. Let me now turn to our current custom silicon programs. Marvell has successfully ramped highly complex 100 billion-plus transistor XPUs and CPUs from initial samples to high-volume production on first-pass silicon. Our custom business continues to gain momentum as customers increasingly rely on Marvell to help them achieve their custom silicon ambitions. As I mentioned, our two leading AI custom programs are in high-volume production, and we expect growth to continue.\n\n**Matt Murphy** (Chairman and CEO)\nOne of these is a custom ARM CPU, which we expect will see expanding adoption in our customers' data centers. The second program is for a custom AI XPU, which is also performing extremely well, with significant volume production ahead. In parallel, we are fully engaged with this customer on the follow-on generation of this XPU and planning for a production ramp once it completes its sampling and qualification cycles. As a result, we expect our revenue from custom XPUs for this customer to not only grow this year, fiscal 2026, but continue to grow next year, fiscal 2027, and beyond. Additionally, we are making tremendous progress with the new design win announced at our AI Day in April 2024 for a custom AI XPU with an additional U.S. hyperscaler.\n\n**Matt Murphy** (Chairman and CEO)\nMarvell's engineering team, in close partnership with the customer, has successfully completed a number of key technical milestones during the joint development process. As a result, we believe we are well on track to meet our customers' desired schedule to start production in calendar 2026. This engagement is also multi-generational, and we expect it to result in a very significant amount of incremental revenue for Marvell over the next several years. I'm very pleased with our custom revenue achievement for fiscal 2025, driven by multiple program ramps. This success, coupled with strong progress on upcoming custom programs, gives us even greater confidence in our ability to achieve our long-term market share targets for custom revenue. We are continuing to invest in all aspects of our technology platform, including advanced process nodes, electrical and optical SerDes, high-speed die-to-die interconnects, embedded memory, custom HBM, 2.5D and 3D packaging, and silicon photonics.\n\n**Matt Murphy** (Chairman and CEO)\nThis week, we announced the demonstration of the industry's first 2nm silicon IP for next-generation AI and cloud infrastructure. Produced on TSMC's 2nm process, this working silicon is a critical part of the Marvell platform for developing custom XPUs, CPUs, switches, and other technology critical for next-generation accelerated workloads. Now, let me turn to our outlook for our data center end market for the first quarter of fiscal 2026. We forecast that the cloud and AI portion of this end market will continue to drive sequential double-digit revenue growth. For the on-premise portion of our data center end market, we expect a seasonal sequential decline in revenue to partially offset growth from cloud and AI. As a result, we expect our overall data center revenue to grow sequentially in the mid-single digits on a percentage basis. Now, let me turn to Marvell's enterprise networking and carrier infrastructure end markets.\n\n**Matt Murphy** (Chairman and CEO)\nIn the fourth quarter, enterprise networking revenue was $171 million, and carrier infrastructure revenue totaled $106 million. In the fourth quarter, we saw a continued recovery in both of these end markets, with revenue collectively growing 18% sequentially. Looking ahead to the first quarter of fiscal 2026, we expect aggregate revenue from enterprise networking and carrier infrastructure to grow sequentially by approximately 10%. We are pleased with the continued recovery in these two end markets, although this forecast still anticipates Marvell products shipping below end market consumption. In the consumer end market, revenue in the fourth quarter was $89 million, declining 8% sequentially. For the first quarter of fiscal 2026, consistent with our prior comments, we expect seasonality in gaming demand to drive a sequential decline in revenue from our consumer end market of approximately 35%.\n\n**Matt Murphy** (Chairman and CEO)\nOver the next several years, we continue to anticipate our revenue from the consumer end market to be approximately $300 million on an annual basis. Turning to our automotive and industrial end market, fourth quarter revenue was $86 million, growing 3% sequentially as we continue to see a modest recovery in this end market. Looking ahead to the first quarter of fiscal 2026, we anticipate continued sequential growth in the automotive end market. However, we expect this to be more than offset by a decline in revenue from our industrial end market, where order patterns can be lumpy in any given quarter. As a result, we project our overall revenue from the auto and industrial end market to decline sequentially in the high single digits on a percentage basis.\n\n**Matt Murphy** (Chairman and CEO)\nIn summary, we drove tremendous revenue growth throughout fiscal 2025, significantly scaling the company from an annualized revenue run rate of $4.6 billion in the first quarter to over $7.2 billion by the fourth quarter. Building on this expanded base, we anticipate strong year-over-year revenue growth in fiscal 2026. Our AI-driven data center end market is expected to remain a key contributor, further supported by the ongoing recovery in our multi-market businesses. Marvell's data center end market accounted for 75% of consolidated revenue in the fourth quarter. Reflecting this rapid transformation during fiscal 2025, we purposefully redirected our investments towards data center relative to our other end markets to fully capitalize on the massive opportunity created by AI. We recently evolved our organizational structure to fully enable this strategic transformation.\n\n**Matt Murphy** (Chairman and CEO)\nAll products focused on hyperscale customers are now managed by a single cloud data center group led by Raghib Hussain, our President of Products and Technologies. We have merged the rest of our end markets into a single multi-market business group led by Chris Koopmans, our Chief Operating Officer. Marvell has solidified its position as a leading provider of data infrastructure semiconductors with a unique business model spanning full custom to full merchant solutions. We are seeing strong investment in accelerated infrastructure from both established hyperscalers and a number of well-funded new market entrants as they race to build million XPU training clusters. These customers are highly incentivized to increasingly use custom infrastructure to augment their merchant solutions. Recent developments in the AI market, such as the advent of reasoning models, are also expected to continue to drive strong demand for compute, networking, and storage semiconductors.\n\n**Matt Murphy** (Chairman and CEO)\nAs a result, we remain very optimistic about both our short and long-term growth prospects and our role in enabling accelerated infrastructure. We look forward to updating investors on our business model and the significant opportunities ahead of us at our investor day on June 10th in New York. With that, I'll turn the call over to Willem for more detail on our recent results and outlook.\n\n**Willem Meintjes** (CFO)\nThanks, Matt, and good afternoon, everyone. Let me start by summarizing our full fiscal year results. In fiscal 2025, Marvell delivered $5.767 billion in revenue, with strong 37% growth in second-half revenue compared to the first half. This growth was primarily driven by our AI programs in the data center end market, as well as continuing recovery in our other end markets. For the full year, on a GAAP basis, our gross margin was 41.3%.\n\n**Willem Meintjes** (CFO)\nOperating margin was negative 12.5%, and loss per diluted share was $1.02. On a non-GAAP basis, our gross margin was 61%, operating margin was 28.9%, and earnings per diluted share was $1.57. We delivered over a thousand basis point improvement in our non-GAAP operating margin through fiscal 2025, from 23.3% in the first quarter to 33.7% in the fourth quarter. We also drove a record $1.68 billion in operating cash flow and significantly increased capital returns to our stockholders, returning $933 million through dividends and buybacks. Moving on to our financial results for the fourth quarter of fiscal 2025. Revenue in the fourth quarter was $1.817 billion, exceeding the midpoint of our guidance, growing 27% year-over-year and 20% sequentially. Data center was our largest end market, contributing 75% of total revenue. GAAP gross margin was 50.5%. Non-GAAP gross margin was 60.1%. Moving on to operating expenses.\n\n**Willem Meintjes** (CFO)\nGAAP operating expenses were $682 million, including stock-based compensation, amortization of acquired intangible assets, restructuring costs, and acquisition-related costs. Non-GAAP operating expenses came in at $479 million, in line with our guidance. Our GAAP operating margin was 12.9%, while non-GAAP operating margin was 33.7%. For the fourth quarter, GAAP earnings per diluted share was $0.23. Non-GAAP income per diluted share was $0.60, reflecting sequential growth of 40%, which is double the pace of revenue growth, demonstrating the significant operating leverage in our model. Now, turning to our cash flow and balance sheet. Cash flow from operations in the fourth quarter was $514 million. Our inventory at the end of the fourth quarter was $1.03 billion, an increase of $170 million from the prior quarter, to support the strong growth we are experiencing in our business. Our DSO was 51 days, decreasing by nine days from the prior quarter.\n\n**Willem Meintjes** (CFO)\nWe returned $52 million to shareholders through cash dividends. In addition, we repurchased $200 million of our stock during the fourth quarter. Our total debt was $4.06 billion, with a gross debt-to-EBITDA ratio of 2.06 times and a net debt-to-EBITDA ratio of 1.58 times. We have seen continuous improvement in our debt ratios as we have driven an increase in our EBITDA through fiscal 2025. We were pleased to receive an upgrade to our investment-grade credit rating from Fitch in January, citing their positive outlook on Marvell's strong operating momentum from robust data center demand, structurally improved leverage metrics, strong market position, and strengthened cash flow profile. As of the end of the fourth fiscal quarter, our cash and cash equivalents were $948 million, increasing by $80 million from the prior quarter.\n\n**Willem Meintjes** (CFO)\nTurning to our guidance for the first quarter of fiscal 2026, we are forecasting revenue to be in the range of $1.875 billion, plus or minus 5%. We expect our GAAP gross margin to be approximately 50.5%. We expect our non-GAAP gross margin to be approximately 60%. Looking forward, we anticipate that the overall level of revenue and product mix will remain key determinants of our gross margin in any given quarter. For the first quarter, we project our GAAP operating expenses to be approximately $712 million. We anticipate our non-GAAP operating expenses to be approximately $490 million, a modest increase of approximately 2% from the prior quarter. It is worth noting that this step up in OpEx is lower than what we would normally expect due to the typical seasonality in payroll taxes and employee salary merit increases in the first quarter.\n\n**Willem Meintjes** (CFO)\nThis is because we expect more leverage from our custom model and expect higher NRE in the first quarter on a sequential basis. As a reminder, NRE is treated as contra-OpEx. For the first quarter, we expect other income and expense, including interest on our debt, to be approximately $43 million. We expect a non-GAAP tax rate of 10% for the first quarter. We expect our basic weighted average shares outstanding to be 867 million and our diluted weighted average shares outstanding to be 818 million. We anticipate GAAP earnings per diluted share in the range of $0.14-$0.24. We expect non-GAAP earnings per diluted share in the range of $0.56-$0.66. I am very pleased with Marvell's execution on all our key financial metrics throughout fiscal 2025.\n\n**Willem Meintjes** (CFO)\nAs we enter fiscal 2026, we intend to continue driving strong operating leverage and expect to make significant progress towards our long-term non-GAAP operating margin target of 38%-40%. We will also remain focused on generating strong cash flow and returning capital to our stockholders. I'm very excited about our future prospects and look forward to strong year-over-year revenue growth in fiscal 2026. With that, we are ready to start our Q&A session. Operator, please open the line and announce Q&A instructions. Thank you.\n\n**Operator**\nWe will now begin the question and answer session. To ask a question, you may press Star, then 1 on your touch-tone phone. If you are using a speakerphone, please pick up your handset before pressing any keys. To withdraw your question, please press Star, then 2. In the interest of time, please restrict yourself to one question only.\n\n**Operator**\nIf you have additional questions, please rejoin the queue. At this time, we will pause momentarily to assemble our roster. Your first question comes from Ross Seymour with Deutsche Bank. Your line is now open.\n\n**Ross Seymore** (Analyst)\nHey, guys. Thanks for letting me ask a question. Matt, I want to go back to the comments you had in your script about the confidence in growing with your lead XPU customer, not only this year but next year. There's, as I'm sure you appreciate, a ton of debate about a competitor taking sockets, etc., market share. How would you suggest we reconcile your confidence and their confidence simultaneously? It doesn't seem like both sides can be direct.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, hey, Ross, thanks for the question, and I very much understand the debate that's out there, and I appreciate a lot the significant interest from the analyst community and our investors on this topic.\n\n**Matt Murphy** (Chairman and CEO)\nLet me try to be as helpful as I can, given the constraints we've got around customer confidentiality and their concerns about their own programs and their confidentiality. Okay, so we're very pleased with the ramp of our current lead XPU program. We delivered this with first-pass silicon success. We see significant volume production on the current generation in front of us, and you can already see the ramp in our numbers starting in Q4. In parallel, we have been deeply engaged on the next generation of this AI XPU with this customer. I said this in my prepared remarks, but I'll just go over it again. We're planning for a production ramp once it completes its sampling and qualification cycles.\n\n**Matt Murphy** (Chairman and CEO)\nSo to be crystal clear, we do expect revenue from these custom XPUs with this customer not only to grow in fiscal 26, which is the year we're in, but to grow in fiscal 27 and beyond. And I just want to also note that I'm not including revenue here that would be from other products, such as networking or connectivity. That would be incremental to custom, and certainly, we've got a great setup, I think, overall with this account relative to the opportunity set, but it's really on both. And then with respect to the question that our customer may be working with someone other than Marvell on a next-generation XPU, it's just something we can't comment on. What I can comment on is visibility for the products that we will be building for the customer.\n\n**Matt Murphy** (Chairman and CEO)\nAnd as I said, this extends to the next generation of our current AI XPU program.\n\n**Ross Seymore** (Analyst)\nThank you.\n\n**Matt Murphy** (Chairman and CEO)\nYeah.\n\n**Operator**\nYour next question comes from Vivek Aria with Bank of America. Your line is now open.\n\n**Vivek Arya** (Analyst)\nThank you for taking my question. Matt, just one clarification. If you could help quantify the mix between AI and non-AI in your data center for Q4 and Q1, is it like two-thirds, one-third? So any quantification there would be helpful. And then a little more generic question, which is that when we look at Q4 and Q1 data center and AI, they are very strong on a year-over-year basis, but the extent of the beats is somewhat modest when we contrast that with the very strong spending at your largest customer. So any commentary there would be very helpful. Is it a supply issue? Is it just early days of the ramp?\n\n**Vivek Arya** (Analyst)\nSo any commentary there would be helpful. Thank you.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, thanks, Vivek. Maybe I'll answer the second part first, just on the overall setup. If you look at it, we've seen very strong growth the last few quarters, I think, really, really actually above overall market. I think we were up data center revenues 25% sequentially Q2 to Q3, 25% Q3 to Q4. As I said in the prepared remarks, our AI and cloud revenue, that portion of the data center business is up double digits from Q4 to Q1. So these are all sequential numbers, by the way. And of course, on the year-over-year, if you look at Q4, we're like up 77% or something in data center, and I think Q1 we're up pretty similar. So we're very pleased with the trajectory of this business in terms of just the sequential and year-over-year growth rates.\n\n**Matt Murphy** (Chairman and CEO)\nI think that's tracking really well. On the AI side and how we think about it is, and I'll just give you kind of a maybe a flashpoint just as we sort of exit the year, but a good overall proxy. So today, AI is more than half the revenue. So it's now the majority. It's crossed over. And I think as we go forward, that's going to just continue to increase. And so because overall, Marvell is now 75% of our revenue kind of plus going forward in data center, that's going to end up being a really good proxy.\n\n**Matt Murphy** (Chairman and CEO)\nUnderneath that, about half of that is, if you just look at overall data center now, just to provide a little more color, about half of that is in electrical optics, and custom now has grown to about 25%, about a quarter, a little bit more of the data center revenue. And then the balance is made up of everything else. So again, it's a nice trajectory here. We've got AI that's sort of outgrown the total. It's the majority driving the business. Data center is now a significant total portion of overall Marvell. And then the mix continues to grow nicely with custom really ramping. So hopefully, some of those data points are helpful, but we're very pleased overall with the trajectory of the business.\n\n**Vivek Arya** (Analyst)\nThanks, Matt.\n\n**Matt Murphy** (Chairman and CEO)\nYeah.\n\n**Ashish Saran** (SVP of Investor Relations)\nCan we get the next question, please? Operator. I'm checking. Folks, please hold while we get the operator back online.\n\n**Operator**\nYour next question comes from the line of Tim Arcuri from UBS. Your line is now open.\n\n**Timothy Arcuri** (Analyst)\nThanks a lot. Matt, I wanted to clarify the answer you just gave on the breakdown of AI revenue. You said more than half is AI, which I get of data center. And then you said half of data center is optics. Did you mean half of AI is optics? So that the AI breakdown is basically roughly half is optics and then half is custom ASIC. Is that what you meant?\n\n**Matt Murphy** (Chairman and CEO)\nYeah, yeah, sorry. Yeah, Tim, thanks for the clarification. To be precise, it's overall data center are those numbers I gave you.\n\n**Timothy Arcuri** (Analyst)\nOkay. And then you had guided AI to $2.5 billion this year. I think you said you used the word very significantly. You're going to exceed that in fiscal 2026. What does that mean?\n\n**Timothy Arcuri** (Analyst)\nI guess most of the sell side is thinking like $3.5 billion. So that certainly would qualify as very significantly. But is that what you mean when you say very significantly by like a billion dollars? Is that the type of thing that would qualify as that? Thanks.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, Tim, thanks for the question. Yeah, we're definitely leaving this year open-ended in terms of what we can go do. Last year, we had talked about $1.5 billion. We blew through that. This year, again, we anticipate being substantially above that. I'm not putting a number on it just yet. I think that there's a lot to go here in terms of the momentum in the business and the opportunity set in front of us.\n\n**Matt Murphy** (Chairman and CEO)\nAnd so right now, we're kind of keying off the last update we did, which was in the AI day from last year, and then we'll find the right appropriate time in the future. But right now, we're trending extremely well. And you can really start to see it in the numbers. As I mentioned earlier, at some point, this data center revenue is now 75% of Marvell. And I gave you the AI percent. So you can start using that as, I think, a really good proxy for where things are going.\n\n**Timothy Arcuri** (Analyst)\nOkay, Matt. Thanks.\n\n**Matt Murphy** (Chairman and CEO)\nYeah.\n\n**Operator**\nYour next question comes from the line of Harsh Kumar from Piper Sandler. Your line is now open.\n\n**Harsh Kumar** (Analyst)\nYeah, hi. Thanks for letting me ask a question. Matt, I think you mentioned that you have three kind of custom ASIC customers for you.\n\n**Harsh Kumar** (Analyst)\nI wanted some color on the stickiness of these customers. Kind of, what are some of the triggers that might cause some of these customers to go look for another design partner? Is it price, or is it just 100% performance if you can't produce or start looking? And what is the second part of the question? What is the possibility of you being able to attach your networking products to some of these custom ASIC players? Or if you do, could you just help us understand what's being attached today?\n\n**Matt Murphy** (Chairman and CEO)\nYeah, thanks for the question. I think the first is that we actually have custom engagements with all four of the major hyperscalers, and then two of them in compute with a third coming, just to clarify. And look, these are very complex chips.\n\n**Matt Murphy** (Chairman and CEO)\nOur view is consistent with sort of what we've been saying, which is when you look at the TAM that's out there, which is, I mean, we sized back in April of last year for Marvell at like a $75 billion data center TAM, which has probably, if anything, just gotten stronger, and a big portion of that coming from custom. The reality is to service that, the customer base is really looking for partners with a couple of key attributes. The first is technology leadership and technology investment and IP. We just announced, as an example, just a couple of days ago, our working two-nanometer platform. We've got a very competitive offering on custom HBM, die-to-die, advanced packaging. So that's part of it.\n\n**Matt Murphy** (Chairman and CEO)\nThe second is to have the manufacturing scale, the ability to go drive the right design methodology in terms of first-pass silicon success, and be able to actually ramp these highly complex, upwards of 100 billion transistor type of chips into production. And they're also looking for partners that have the relationships with their suppliers, like at Marvell, as an example. We've invested heavily in the supply chain. And then finally, partners that are flexible in their business model that can look at different approaches to different chips, all the way from traditional ASIC services to full-blown build-to-spec type of solutions. And we provide all those. So in the end, those are the types of different things. And when you sort of add all that up, really our view still is that it's ourselves and one other very large competitor of ours that can service that market.\n\n**Matt Murphy** (Chairman and CEO)\nSo these sockets are very sticky. At the same time, each generation, you've got to go bid, and you've got to go compete. But we've been very successful since we started winning these big custom silicon programs back in 2021, getting awarded those, and now taking those into production, and then looking at the next generation. We're very comfortable with where we stand. And so there is a high degree of stickiness. There's a high barrier to entry. But at the same time, you got to win them each time. And then the final thing I'd say is just from a design opportunity perspective, that pipeline just continues to expand. And within that, we continue to close very significant designs, as recently even as our fourth quarter. So those are the dynamics we still see. And it's competitive, and everybody's in a race.\n\n**Matt Murphy** (Chairman and CEO)\nBut we feel like we're in the best position we've ever been in, quite frankly, relative to the technology, the platform, and our ability to go really drive in a very, very focused manner the execution around what I think is the biggest opportunity I've seen in a very long time in the semiconductor industry, which is the AI supercycle that's still in front of us.\n\n**Harsh Kumar** (Analyst)\nThanks, Matt. And then for my follow-up, I was curious if you could expand on your comment around you said, \"I think growth in data center, cloud plus AI will be double digits. On-prem will be down.\" Can you help us think about what you mean by that? What is double digits? Is it teens or higher than that? Just because investors are super sensitive to growth rate in your cloud and AI business.\n\n**Matt Murphy** (Chairman and CEO)\nYeah.\n\n**Matt Murphy** (Chairman and CEO)\nI mean, we're getting a little more precise, and certainly, this is the guide. But double digits is double digits, and it's not 20% or something. I mean, it's above 10%, and that's the way you should think about it. And clearly, we'll see where the quarter lands, but that's what we're seeing at the moment. You also asked me about attaching networking, so I just wanted to cover that real quick, and we'll go to the next question. Yeah, that has proven to be extremely sticky, obviously. And that is probably the other leg that goes hand in hand with the custom designs is that I said some of this in my prepared remarks, but the value of the solution now is really moved just beyond who can do the best sort of individual compute piece of silicon.\n\n**Matt Murphy** (Chairman and CEO)\nI mean, that's critical, and you got to have the right sort of performance, and you got to take advantage of Moore's Law and all those things. But the way to get ultimately outsized performance in the solution is you've got to couple that with the networking and the connectivity. And I think the I/O from scale-up to scale-out to all the various different interconnect type of solutions we have is proving to be a very compelling reason for customers to use us because we can co-architect those together. And we actually get with the compute custom silicon opportunities. And when we do that, by the way, and especially when we engage on something like an accelerator or CPU, we get very early information and perspective on the customer architecture.\n\n**Matt Murphy** (Chairman and CEO)\nAgain, not just the piece of compute, but then all the IO that's required, and then we drive our solutions around that. So this is all by design in terms of how we've formulated our technology platform approach. But it is a much more compelling value prop for our customers versus maybe competitors of ours that only have one of those pieces.\n\n**Harsh Kumar** (Analyst)\nVery helpful, Matt. Thank you. Yeah.\n\n**Matt Murphy** (Chairman and CEO)\nThanks.\n\n**Operator**\nYour next question comes from the line of Aaron Rakers from Wells Fargo. Your line is now open.\n\n**Aaron Rakers** (Analyst)\nYeah. Thanks for taking the question. I'm going to stick with the AI question as well. Matt, you had mentioned that you had four customers in the hyperscalers where you engaged, and you mentioned two in compute and third one coming.\n\n**Aaron Rakers** (Analyst)\nThe fourth, I just want to be clear, is that also a compute opportunity, or is that referring to the NIC, custom NIC opportunity that you're currently engaged in? And then also in that same narrative, how do you think about the custom logic opportunity around HBM4 and the timing of when that might be impactful for Marvell? Thank you.\n\n**Matt Murphy** (Chairman and CEO)\nYeah. Thanks, Aaron. And great, two questions. So yeah, on the first one, I think you got it right. You actually nailed it. And that opportunity is bigger than just that product as an example. But yeah, the fourth customer, we have, we're in production, and we publicly announced with a custom NIC in that area. And then on custom HBM, yeah, that continues to be actually a critical IP for us, and I think a critical part of what we see the customer roadmaps aligning around.\n\n**Matt Murphy** (Chairman and CEO)\nAnd so we're very engaged right now, both with the key memory partners of ours who we work with jointly with our hyperscale customers. And the benefits are quite significant that we're able to propose in terms of the beachfront area reduction on the logic die, the ability for our customers to get significantly more compute packed into that die, and then also improving the throughput between the HBM and the compute, and then actually being able to have a higher density memory solution wrapped around our customer's compute die. So all those are still very valid, and I think that's going to be a significant sort of industry trend that we're going to see in the next generation of these high-end accelerator products. Thanks.\n\n**Aaron Rakers** (Analyst)\nThanks.\n\n**Operator**\nYour next question comes from the line of Tom O'Malley from Barclays. Your line is now open.\n\n**Thomas O'Malley** (Analyst)\nHey, guys. Thanks for taking the question.\n\n**Thomas O'Malley** (Analyst)\nAppreciate it. So I kind of wanted to pivot a little bit to the technology side. So Matt, in the script, you talked about increasingly optical connections taking over areas where electrical connections were today. So I kind of wanted to get your opinion. When you look at the world of just optics in general, and particularly co-packaged optics, do you see that at first happening kind of inside of the rack, or do you see that kind of happening in the aggregation layer? And then what does that mean for your DSP business? Obviously, your share of the optical world is a little bit different than your share of the switching world. I just would love your commentary on where you see kind of co-packaged optics coming first, and then kind of as it relates to your product set, where you feel like you have some strength.\n\n**Matt Murphy** (Chairman and CEO)\nYeah. Great.\n\n**Matt Murphy** (Chairman and CEO)\nHey, thanks, Tom. So yeah, maybe some perspective. So I think the first is in the history of CPO, and this is really prior to this sea change in the last few years of the growth in accelerated computing. The holy grail that's been out there for a decade plus, maybe close to 20 years, is that the aggregation layer or the scale-out could go to CPO. And there's been a lot of POCs in this area. There's been a lot of different efforts in the industry. I mean, I was at OFC last year, and that's kind of where a lot of the air really did come out of the balloon. I think not just from us, but our big cloud customers sort of have said that's a very long-term type of opportunity.\n\n**Matt Murphy** (Chairman and CEO)\nThat's been our view too, by the way, that it's something that we're paying attention to. We've got some investment there. What's really happened in the last and by the way, the same thing sort of happened with LPO, which was linear pluggable optics. 2023, there was a ton of noise on this topic that that would be able to replace DSP-based pluggables. That has not happened. What's emerged, as I mentioned in my prepared remarks, is that in the scale-up and the connectivity in the rack and between accelerators and inside the cluster, that's where there's a lot of opportunity to go active and accelerated in terms of the connectivity and to go optical from passive. That could be accomplished a couple of different ways. Co-packaged optics is a very interesting and compelling way to do that.\n\n**Matt Murphy** (Chairman and CEO)\nWe demoed our 6.4T product a year ago at OFC. We're definitely investing in this area, and we have a lot of traction here relative to us presenting that as a solution as part of our ASIC platform. And then also with LPO, same thing. I think that may find a home in some of these connection points, again, within the rack. But these will be important applications, especially in closed systems. There's a lot of technology that needs to get developed and a lot of work to do. But we're very much investing here, and we will be in this business to compete with best-in-class technology. The question is, when does it want to get adopted? What is the qualification process? What are all the manufacturing and yield issues we're going to have to deal with?\n\n**Matt Murphy** (Chairman and CEO)\nSo it's complex, Tom, but this is not something that we're backing off of. In fact, we think it's a critical part of our long-term technology investment to not only have best-in-class DSPs and pluggables, best-in-class AECs as an example, retimers, a whole suite of connectivity solutions, but also investing in the next generation where we can enable significant breakthroughs in power and performance. We just have to balance those off with the reality of this is very complex, new, and not traditional sort of basic CMOS technologies. These are more complex. So you'll see more from us at OFC on this, and certainly, this is an area to watch. But we think it's going to take some time for it to finally work its way through industry-wide into real high-volume production. Thanks.\n\n**Thomas O'Malley** (Analyst)\nSuper helpful.\n\n**Thomas O'Malley** (Analyst)\nAnd then just on the near term, obviously, on the optical side, it sounds like things are better there. But there's been noise, as there is about many things these days in relation to AI, about potentially some headwinds in terms of inventory at 800 gig or the pricing dynamic as you move to 1.6. Could you maybe comment on the health of both of those nodes and kind of what you're seeing in terms of the growth trajectory for the 800 gig world this year and just the health of pricing, etc., just because there's been a lot of noise there? Thank you, Matt.\n\n**Matt Murphy** (Chairman and CEO)\nYeah. Yeah. No, we feel really good. Optics has been very, very strong for us. We saw a big uptick in the second half of last year in terms of orders. We've been fulfilling those.\n\n**Matt Murphy** (Chairman and CEO)\nWe see demand very strong this year, particularly in 800 gig, very healthy demand. We do see 1.6T transition happening, but quite frankly, 800 gig continues to be the workhorse, and we'll be ready to support both our 5-nanometer 1.6T device, but we're very excited about our 3-nanometer product. It's getting a lot of great traction because of the power savings. I mean, it's 20% per link, so it really adds up when you talk about the massive scale and the number of interconnect points in these massive clusters that are being built, so all that looks very positive, Tom, and of course, there's always noise in the system. This is a very hot area. I'm saying AI overall, but from a Marvell perspective, sharing what we see, we see very healthy, strong demand continuing.\n\n**Operator**\nYour next question comes from the line of Harlan Sur from JPMorgan.\n\n**Operator**\nYour line is now open.\n\n**Harlan Sur** (Analyst)\nHey, good afternoon, guys. Thanks for taking my question. Great to see that you captured the follow-on AI XPU program after your current XPU program, which is ramping now with your major cloud and hyperscale customer. Matt, just to clarify, so is the new follow-on XPU program a training XPU as well? Is that a calendar 2026 ramp? And is that at 5-nanometer or 3-nanometer? Any more color there would be helpful. And then for Willem, your inventories were up 20% sequentially, which in a strong demand and product cycle environment typically implies strong future growth. But you compare that to the 3% sequential total revenue guide for April, there seems to be some disconnect. So the way to interpret this is that the 20% sequential growth in inventories is more reflective of the AI strong growth profile ahead for the team?\n\n**Matt Murphy** (Chairman and CEO)\nYeah.\n\n**Matt Murphy** (Chairman and CEO)\nI'll start off, Harlan. So yeah, so a couple of things. So again, given the confidentiality wrapper we've got, here we go. The first is you should assume this is a very high-volume program, and it's a continuation of what we're doing. On the time, and you should assume just in general on every next generation type of device, you're going to see no transitions and technology advancements as you go forward. So you should assume that. And then also on a timing perspective, all I can say there is we'll be ready to ramp when it's time, and we'll manage that transition. We're very confident in our ability to manage that transition successfully with our customer, but that timing is something that we're just going to have to see when that's ready, and we'll time it around that.\n\n**Matt Murphy** (Chairman and CEO)\nAnd I can't really comment on what my customer plans are in this kind of detail. They just don't like it, and I don't blame them. And I won't take the inventory question. Thanks.\n\n**Harlan Sur** (Analyst)\nYeah. Thank you.\n\n**Willem Meintjes** (CFO)\nHey, Harlan. On inventory, that's really in support of continuing growth in our custom programs that we see over this year, as well as very strong growth on the optics side. So it's really those two dynamics driving inventory. But if you look at it on a days', it's actually flat quarter over quarter.\n\n**Harlan Sur** (Analyst)\nGot it. Thanks for the input, guys.\n\n**Matt Murphy** (Chairman and CEO)\nYep.\n\n**Operator**\nYour next question comes from the line of Mark Lipacis from Evercore ISI. Your line is now open.\n\n**Mark Lipacis** (Analyst)\nGreat. Thanks for taking the question. Matt, I think there's always a concern in the market around this risk of a deceleration in spending or maybe even a digestion period.\n\n**Mark Lipacis** (Analyst)\nYou seem to express confidence in the visibility as you go through this year. I wonder if you can help us understand the tells that you look for on your dashboard that tell you that there's this risk of a digestion period. I think maybe as part of that, I guess I've always thought of Marvell as like a comms IC company. Now you just have this processor business that's really ramping. I wonder if you kind of try to deconstruct that risk assessment. Do you think about those two businesses differently?\n\n**Matt Murphy** (Chairman and CEO)\nYeah. Okay. Yeah. I'll break it into the two pieces. We do a lot of triangulation, Mark, as a company relative to how we forecast our data center business in particular. We do take a lot of the top-down data into account in terms of CapEx trends and things like that.\n\n**Matt Murphy** (Chairman and CEO)\nBut ultimately, we're so joined at the hip because of the key nature of these programs. And ultimately, our products, and especially where they're just completely sole sourced, being a potential gate for our customers, we plan our supply chains very carefully together. And I think you can see the evidence of that over the last two years as we've ramped with sort of the advent of ChatGPT. And it's amazing to think of where we were. I actually go back to this call two years ago, and the big breakthrough was we were saying we were going to do $200 million in AI revenue in calendar 2023 and $400 million in 2024. And now we just finished 2024, and we're talking about blowing through $1.5 billion and doing $2.5 billion plus. So just as a quick side note, it's just kind of remarkable.\n\n**Matt Murphy** (Chairman and CEO)\nBut we scaled right along with our customers and generally continue to sort of exceed expectations and be able to ramp with what they need. So when we look to the rest of the year, and even quite frankly, on a multi-year view, it's a very strong outlook. And some of that is our own specific things because we have new programs, let's say, in the custom area that are ramping, that are incremental. We also have now we just have additional sockets. We have customers transitioning from a technology perspective, let's say, an interconnect. So we have a lot of positive tailwinds. Now we're monitoring, and certainly the supply chain, it needs constant review.\n\n**Matt Murphy** (Chairman and CEO)\nBut at the moment, again, we see a very strong setup for strong growth in our fiscal 2026 and our fiscal 2027, driven by both the custom programs ramping as well as continued growth and strength in connectivity and in higher layer networking and in things like storage coming back. So all these look like a positive setup at the moment.\n\n**Mark Lipacis** (Analyst)\nGreat. Thank you. Very helpful.\n\n**Matt Murphy** (Chairman and CEO)\nYep.\n\n**Operator**\nYour next question comes from the line of Ben Reitzes from Melius Research. Your line is now open.\n\n**Ben Reitzes** (Analyst)\nHey, guys. Thanks for the question, and thanks for the intermission there in the middle. That was a nice break. The question that I have is with regard to sequential growth, Matt, and then a long-term question. Did you clarify that AI revenue could grow sequentially through the year? And did when Tim asked his question earlier? And if so, what's your confidence?\n\n**Ben Reitzes** (Analyst)\nThen if you could just kind of step back also, Matt, a lot of noise due to the speculation around that customer and content there. But when you step back, you have a goal of $15 billion for the data center long-term by calendar year 2028. Are you seeing the progress in your custom business still to hit that number? Because nobody on the street is even close to that. Thanks.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, Ben, thanks for the questions. So yeah, on the AI assumptions through the year, yeah, I think what I said was in Q1, our data center business, ex the on-prem stuff, was going to be up double digits coming off of overall data center, like 25% a quarter sequentially. So I didn't comment throughout the whole year, but you should just assume it's not a bad assumption, right?\n\n**Matt Murphy** (Chairman and CEO)\nOr it'd be a fair assumption to think that it's obviously going to continue given the strength in the business and the momentum that we're seeing and just from what we're looking at from a year-over-year perspective. On the long term, I think we're tracking extremely well to our 20% market share number. When we look back to kind of calendar 2023 and then 2024 and 2025, and you start bouncing it up against what we said at the AI day, I think it looks very favorable. We're definitely gaining share from 2023 to 2024, and we'll definitely gain more share from 2024 to 2025. And so to get to that revenue target, you got to get there both ways. You got to grow the share, right, from kind of 10%, let's call it to 20%. And then the market's got to develop, right?\n\n**Matt Murphy** (Chairman and CEO)\nObviously, you got to get to the sort of $75 billion TAM. But both of those are trending in a very positive direction. In fact, certainly in 2024 and even in 2025, it's just kind of big round numbers. It looks like both the market and our growth, if you just bounce it up against sort of what's the compounded growth rate you needed from 2023 to 2028, it's actually growing above that right now. So now we're in ramp phase, but that's going to continue. So I think we're in very good shape in terms of where we're tracking from a market share perspective. And certainly, if the market, by the way, is bigger, I mean, remember, we gave that point of view in April of last year.\n\n**Matt Murphy** (Chairman and CEO)\nAnd the world has changed, Ben, since then in terms of the absolute CapEx that's being deployed, certainly even in recent months, all of the various programs from all the different key players and the potential of what's out there, sovereign programs, government programs, programs from new entrants. So we just see this, quite frankly, the TAM and the opportunity for Marvell, if anything, being way larger than it was when we looked at it almost a year ago. So all those make me feel very good about the market size developing and then certainly our progression on the market share. And you're right. That would be an absolute home run to get there.\n\n**Matt Murphy** (Chairman and CEO)\nAnd that's what me and my team are absolutely driving in this company day in and day out, is drive the market share and help create the market, help make the TAM happen and execute like crazy and do it in a very focused manner, which is also why we reorganized the company with a dedicated data center engineering and business group to drive it. So I think the setup's really good. Thanks.\n\n**Ben Reitzes** (Analyst)\nThanks, Matt.\n\n**Operator**\nYour last question comes from the line of Christopher Rolland from Susquehanna. Your line is now open.\n\n**Christopher Rolland** (Analyst)\nHey, thanks for squeezing me in. And some of this was addressed, but scale up. You guys have a lot of opportunities here. Some of this could be optical. Some of it could be co-packaged. Some of it could be active copper. I think you might even have some UAL or NVLink-like alternatives, DSP throughout the system.\n\n**Christopher Rolland** (Analyst)\nI guess as we see changes in architecture, either GPU or XPU, where do you think your biggest opportunities are? And when might we see some of these wins? Thanks, Matt.\n\n**Matt Murphy** (Chairman and CEO)\nYeah. Excellent, Chris. And great question to end the session. So first of all, you've done your homework. And I think the key message is we are planning on participating and enabling all of the things you mentioned. We have programs underway and developments in all those different areas. The key thing I want to stress to you and to the investors on the call is this is incremental TAM. The scale-up opportunity, we flagged it a few different times as ripe for sort of a TAM expansion. And it looks like that's what's going to play out at some point here. So that is all incremental.\n\n**Matt Murphy** (Chairman and CEO)\nThat's not, \"Hey, if that happens, then all of a sudden, Marvell's DSP revenue goes down or something.\" Then the scale-up and this type of connectivity, that is a revenue upside, market upside type of opportunity. So that one, I think, we're very excited about. And I think you're going to hear a lot more about that from us, certainly at things like OFC and our investor day and so forth. But yeah, big opportunity there. No question.\n\n**Christopher Rolland** (Analyst)\nThanks, guys.\n\n**Matt Murphy** (Chairman and CEO)\nYep. Thanks, Chris.\n\n**Operator**\nLet me now turn the call over to Mr. Murphy for closing comments.\n\n**Matt Murphy** (Chairman and CEO)\nYeah. Thank you, Operator. And first of all, I appreciate everybody joining the call. I apologize for the gap there. Hope everybody enjoyed a quick coffee break, and we'll certainly figure out what happened. But appreciate the interest in the company.\n\n**Matt Murphy** (Chairman and CEO)\nI want to thank everybody for their interest and just kind of reflect on a few things. I think the first is we had really strong progress in fiscal 2025. We started off at a $4 billion-ish, $4.2-$4.3 billion type of run rate in the first half. We're now at the $1.875 billion kind of guide, well above $7.5 billion kind of a run rate. So that's, I think, really strong trajectory for the company heading into the year and a big change. We're also getting leverage in the model and the operating leverage, cash flow generation, operating margin expansion. And you can even see it in things like our Q4 to Q1 OpEx, which normally would go up, as Willem said, more than we're forecasting. But we're starting to see the benefit of these custom silicon programs kicking in and the NRE contribution.\n\n**Matt Murphy** (Chairman and CEO)\nAnd so we're seeing it both on the top-line revenue growth, but also on the expense line as well. And that is a great setup. We were GAAP profitable as well in Q4, which was great. We're going to keep driving that. It wasn't just AI. Our standard cloud infrastructure side of things in data center also had a very strong year. The programs that maybe there was some concern about going back a year ago, can you ramp? These products are going to get qualified. What's going to happen? I think our team, and I want to thank the Marvell team, did an excellent job of ramping these very complex devices into full-volume production, supporting our customers. Tom had a question about electrical optics. We had a banner year for our electrical optics business, and it looks very strong heading into next year.\n\n**Matt Murphy** (Chairman and CEO)\nAlso, the multi-market businesses, that was a source of concern over the past year, the enterprise and carrier and things like that. You're seeing very strong sequential growth now, sequential growth out of those businesses as they recover, and they sort of trend back towards their, at least the enterprise and carrier, their $2 billion run rate. And look, we had a beat and raise. We're guiding revenue and earnings growth to continue in the first quarter. Customer engagements really strong, as I mentioned, very strong design wins in the last year, great execution by our sales team and business units to win those key designs that are going to drive our future growth. And we're very optimistic about where this heads. So I appreciate everybody's interest. I look forward to seeing all of you in various investor meetings coming up and continue the discussion. So thanks, everybody.\n\n**Matt Murphy** (Chairman and CEO)\nI appreciate it.\n\n**Operator**\nLadies and gentlemen, this concludes today's conference call. Thank you for your participation. You may now disconnect.",
      "fetched_at": "2026-02-04T15:41:51.187Z"
    },
    {
      "ticker": "MRVL",
      "title": "Marvell Technology, Inc. (MRVL) Q3 FY2025 earnings call transcript",
      "published_date": "Dec 3, 2024, 4:45 PM EST",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/MRVL/earnings/MRVL-Q3-2025-earnings_call-225779.html",
      "content": "**Operator**\nAfter today's presentation, there will be an opportunity to ask questions. Please note this event is being recorded. I would now like to turn the conference over to Mr. Ashish Saran, Senior Vice President of Investor Relations. Please go ahead.\n\n**Ashish Saran** (SVP of Investor Relations)\nThank you, and good afternoon, everyone. Welcome to Marvell's Third Fiscal Quarter 2025 earnings call. Joining me today are Matt Murphy, Marvell's Chairman and CEO, and Willem Meintjes, our CFO. Let me remind everyone that certain comments made today include forward-looking statements, which are subject to significant risks and uncertainties that could cause our actual results to differ materially from management's current expectations. Please review the cautionary statements and risk factors contained in our earnings press release, which we filed with the SEC today and posted on our website, as well as our most recent 10-K and 10-Q filings. We do not intend to update our forward-looking statements. During our call today, we will refer to certain non-GAAP financial measures. A reconciliation between our GAAP and non-GAAP financial measures is also available in our earnings press release.\n\n**Ashish Saran** (SVP of Investor Relations)\nI am pleased to announce that our next Investor Day will be held in New York City on June 10, 2025. More details will be shared in an upcoming press release. Let me now turn the call over to Matt for his comments on the quarter. Matt.\n\n**Matt Murphy** (Chairman and CEO)\nThanks, Ashish, and good afternoon, everyone. For the third quarter of fiscal 2025, Marvell delivered revenue of $1.516 billion, $66 million above the midpoint of guidance, growing 19% sequentially, with the outperformance driven by strong AI demand and execution. As a result, our non-GAAP earnings per share of $0.43 was also well above the midpoint of guidance, growing by 43% sequentially. This earnings growth rate, which was more than double our top-line growth rate, highlights the substantial operating leverage in our business model. Stronger-than-forecast ramp in custom silicon was a key contributor to this performance. We believe that continued success in custom silicon will help accelerate our timeline to achieve our long-term target operating margin model. On a year-over-year basis, third-quarter revenue grew by 7%, marking a return to year-over-year growth for Marvell.\n\n**Matt Murphy** (Chairman and CEO)\nI'm very pleased with our results and even more excited about our outlook for the fourth quarter, where we project revenue growth to accelerate to 26% year-over-year growth at the midpoint of guidance. Marvell is entering a new era of growth, driven by the substantial volume production ramp of our custom silicon programs, along with continued strong growth in optics. Yesterday, we announced the expansion of our strategic relationship with Amazon Web Services through a comprehensive multi-generational five-year agreement. This multi-generational agreement encompasses a broad range of Marvell's data center semiconductors, including custom AI products, optical DSPs, active electrical cable DSPs, PCIe retimers, data center interconnect optical modules, and Ethernet switching silicon solutions. Additionally, Marvell will collaborate with AWS for EDA in the cloud, leveraging the advanced and scalable compute capabilities of AWS to accelerate silicon design.\n\n**Matt Murphy** (Chairman and CEO)\nThis agreement represents a significant step up in the expected volume of business between the two companies in the coming years, and we look forward to working with AWS on custom AI and networking semiconductors that meet the demanding needs of accelerated infrastructure. Let me now discuss our results and expectations for each of our end markets. In our data center end market for the third quarter, we achieved record revenue of $1.1 billion, growing 98% year-over-year and 25% sequentially. These strong results were driven by a significant step up in our custom AI silicon ramp, as our customers saw increasing demand for the differentiated capabilities offered by these new custom AI chips. We are seeing strong custom AI demand continue into the fourth quarter and have secured supply chain capacity to support our customers' growth forecasts.\n\n**Matt Murphy** (Chairman and CEO)\nOur success in ramping these highly complex, 100 billion-plus transistor chips, from initial samples to high-volume production on first-pass silicon without any respins, is a testament to Marvell's robust design methodology and world-class engineering team. Our seasoned operations team and deep partner relationships were key enablers of the rapid ramp we were able to drive in a constrained supply environment. The superb execution is a significant time-to-market advantage for our customers and has given them even more confidence to expand their collaboration with Marvell on their critical silicon projects. In the third quarter, we benefited from higher-than-forecasted revenue from our electro-optics products, which grew double digits sequentially on a percentage basis. We continue to see strong bookings for our market-leading 800GB PAM products, and we also began shipments of the industry's first 1.6T PAM DSP and 5nm process technology.\n\n**Matt Murphy** (Chairman and CEO)\nWe continue to see a strong design win momentum with leading customers for this product and expect the production ramp to accelerate next year. To meet AI's insatiable need for the highest bandwidth at the lowest power, Marvell is accelerating the cadence of next-generation products. Today, we announced the industry's first 3nm 1.6T DSP, featuring 200 GB per lane electrical and optical interfaces. By leveraging 3nm process technology and advances in electrical and optical SerDes, this next-generation platform is designed to reduce 1.6T optical module power consumption by more than 20% compared to its predecessor, marking a significant improvement in energy efficiency. Marvell's DSP team remains laser-focused on driving best-in-class performance, schedule, and time-to-market to continue to remain the leader in this large and fast-growing electro-optics market.\n\n**Matt Murphy** (Chairman and CEO)\nIn the active electrical cable market, we are starting to see an acceleration in the production ramp of our 100GB per lane 800GB DSPs with multiple module partners. We have also started sampling the industry's first 200GB per lane 1.6T AEC DSPs to address upcoming higher-speed, short-reach copper interconnect applications. Looking ahead to the fourth quarter of fiscal 2025 for our data center end market, we are forecasting strong sequential growth in the low to mid 20% range. We expect this growth to be driven by another significant step up in our custom AI revenue as these programs continue to ramp into high-volume production. This will be further augmented by strong growth from both our Ethernet switch products as well as our interconnect portfolio, which include optical DSPs, TIAs, drivers, AECs, and DCI products. Now let me turn to Marvell's enterprise networking and carrier end markets.\n\n**Matt Murphy** (Chairman and CEO)\nIn the third quarter, enterprise networking revenue was $151 million, while carrier revenue was $85 million. We began to see a recovery in both of these end markets, with revenue collectively growing 4% sequentially. We expect the pace of recovery to accelerate in the fourth quarter, with aggregate revenue from enterprise networking and carrier infrastructure forecasted to grow sequentially in the mid-teens on a percentage basis. We are pleased to see our revenue growth and order momentum continue to improve in these two end markets, although this forecast still anticipates Marvell products shipping below end market consumption. Turning to the consumer end market, revenue in the third quarter was $97 million, growing 9% sequentially. Looking ahead to the fourth quarter, we expect revenue from the consumer end market to decline sequentially in the mid-teens on a percentage basis.\n\n**Matt Murphy** (Chairman and CEO)\nThis is due to seasonality and gaming demand, which typically weakens in our fourth quarter, bottoms out in our first fiscal quarter, and then begins to rebound in the second quarter. Turning to our automotive and industrial end market, revenue in the third quarter was $83 million, growing 9% sequentially as we started to see a recovery in this end market. Looking ahead to the fourth fiscal quarter, we are projecting revenue from the auto and industrial end market to grow sequentially in the low- to mid-single digits on a percentage basis. In summary, the Marvell team delivered excellent results in the third fiscal quarter, achieving 19% sequential top-line growth and delivering both revenue and non-GAAP earnings per share well above the midpoint of guidance. For the fourth quarter, we are forecasting consolidated revenue to again grow 19% sequentially at the midpoint of guidance.\n\n**Matt Murphy** (Chairman and CEO)\nAI continues to lead the way, enabling our data center revenue to almost double year-over-year in the third quarter, and we expect it to continue driving strong growth in the fourth quarter. With three quarters of strong AI results under our belt for this fiscal year and an even stronger fourth quarter forecast, we are clearly set to significantly exceed the full-year AI revenue target of $1.5 billion outlined earlier this year at our AI event. Over the past several years, Marvell has strategically invested in technology, both organically and through acquisitions, to become a critical enabler of accelerated infrastructure. We have in place a full suite of solutions across data center interconnect, switching, and compute, and the ability to uniquely stitch these together into a unified platform.\n\n**Matt Murphy** (Chairman and CEO)\nMarvell's data center end market has grown to account for 73% of our consolidated revenue in the third quarter, driven by AI, and we expect this percentage to increase again in the fourth quarter. Marvell has rapidly transformed into an AI-first data center semiconductor company, and we are completely focused on taking full advantage of our strong position in the AI supercycle. In the third quarter, we made decisions to further solidify and purposefully redirect our investments towards data center relative to our other end markets. These actions resulted in a restructuring charge in the third quarter, which Willem will discuss in his section. The goal of these actions is to increase our R&D intensity towards the data center, our largest and fastest-growing opportunity, while continuing to drive significant operating leverage going forward. AI technology is advancing at a tremendous pace, and the opportunity is expanding rapidly.\n\n**Matt Murphy** (Chairman and CEO)\nWe are continuing to enhance all aspects of our comprehensive technology platform, including electrical and optical sureties, high-speed energy-efficient 2D and 3D, die-to-die interconnects, advanced packaging, and silicon photonics. In addition, we are optimizing interfaces for high-bandwidth memory, SoCs, and compute fabrics. Our 2nm platform is also progressing very well as we continue to lead the industry in cutting-edge process technology. Marvell's 2nm platform includes our broad suite of internally developed best-in-class IP to enhance performance, energy efficiency, density, and design flexibility. We are seeing tremendous interest from customers for next-generation 2nm designs. Turning to our non-data center multi-market businesses, which include carrier and enterprise networking, we are encouraged to see the recovery starting to gain momentum. As you may remember, we had invested heavily in these end markets over a long period to successfully gain share and have built an industry-leading portfolio of products.\n\n**Matt Murphy** (Chairman and CEO)\nWe plan to continue investing in a targeted manner to grow revenue in these multi-market businesses. The Marvell team is firing on all cylinders, and we see a very favorable setup to significantly scale up the company. In addition to strong revenue attainment, the Marvell team is also driving outstanding financial results. This fiscal year, our revenue has grown by 31% from the first quarter to the third quarter. Over that same time period, we have demonstrated tremendous operating leverage, growing our non-GAAP EPS by 79%, which is two and a half times our top-line growth rate. We have driven strong operating cash flows, enabling us to step up our stock repurchases throughout the year. This fiscal year, we have cumulatively bought back $525 million through the third quarter and have plenty of remaining authorization.\n\n**Matt Murphy** (Chairman and CEO)\nAs you may recall, earlier this year, our board authorized a $3 billion addition to our existing stock repurchase program. We are also focused on reducing our stock-based compensation expenses to 1% of revenue, and we expect significant improvement in this metric going forward. Given the strong revenue outlook for this fourth quarter and our expectations for robust growth in fiscal 2026, we believe we are well-positioned to deliver outstanding financial returns to our stockholders. Before I turn the call over to Willem, I would like to express my heartfelt thanks to Loi, a key member of my team and co-founder of Inphi. After a long and distinguished career in the semiconductor industry, Loi has announced his decision to retire in April of next year. Loi has made incredible contributions to Marvell over the past few years, including building a world-class team and deep bench of leadership talent.\n\n**Matt Murphy** (Chairman and CEO)\nHe was instrumental in the successful integration of Inphi into Marvell in 2021. With his characteristic integrity and thoughtfulness, Loi has already engaged in succession planning and ensuring a smooth transition. We are also looking forward to Loi staying connected with Marvell after he retires so we can continue to benefit from his insights and expertise. We wish him the very best in his well-deserved retirement, during which he looks forward to spending more quality time with his family. And with that, I'll turn the call over to Willem for more detail on our recent results and outlook.\n\n**Matt Murphy** (Chairman and CEO)\nThanks, Matt, and good afternoon, everyone. Let me start with a summary of Marvell's financial results for the third quarter of fiscal 2025. Revenue in the third quarter was $1.516 billion, well above the midpoint of our guidance, growing 7% year-over-year and 19% sequentially.\n\n**Matt Murphy** (Chairman and CEO)\nData center was our largest in-market, driving 73% of total revenue. The next largest was enterprise networking with 10%, followed by consumer and carrier infrastructure at 6% each and auto industrial at 5%. As Matt mentioned in his prepared remarks, in the third quarter, we made additional decisions to further redirect investments towards the data center. This resulted in an aggregate restructuring charge of $715 million, which is reflected in our GAAP results for the third quarter. The two largest components were impairment charges for acquired intangible assets and certain purchased technology licenses and their future contractual obligations. I would also note that approximately three-quarters of these restructuring charges are non-cash in nature and that the aggregate restructuring charges are now largely behind us.\n\n**Matt Murphy** (Chairman and CEO)\nThese charges are a reflection of the fact that we have invested significantly in updating our enterprise and carrier product portfolios over several years, and we plan on more targeted investments in these end markets going forward. Continuing to our results, GAAP gross margin was 23%. Non-GAAP gross margin was 60.5%, slightly below our guidance as we saw higher-than-forecast revenue from custom silicon. Moving on to operating expenses, GAAP operating expenses were $1.052 billion, including restructuring costs, stock-based compensation, and amortization of acquired intangible assets. Non-GAAP operating expenses were $467 million, in line with our guidance. GAAP operating margin was negative 46.4%, while non-GAAP operating margin was 29.7%. For the third quarter, GAAP loss per diluted share was $0.78. Non-GAAP income per diluted share was $0.43, three cents above the midpoint of guidance. Non-GAAP EPS grew by 43% sequentially, illustrative of the leverage in our business model.\n\n**Matt Murphy** (Chairman and CEO)\nNow turning to our cash flow and balance sheet. Cash flow from operations in the third quarter was $536 million, growing by a substantial $230 million from the prior quarter. Our inventory at the end of the third quarter was $859 million, increasing by $41 million from the prior quarter to support the significant growth we are seeing in our data center end market. We returned $52 million to our shareholders through cash dividends. In addition, we repurchased $200 million of our stock during the third quarter, an increase of $25 million from the prior quarter. Our total debt was $4.1 billion. Our gross debt-to-EBITDA ratio was 2.23 times, and net debt-to-EBITDA ratio was 1.76 times. As of the end of the third fiscal quarter, our cash and cash equivalents were $868 million, increasing by $59 million from the prior quarter.\n\n**Matt Murphy** (Chairman and CEO)\nTurning to our guidance for Marvell's fourth quarter of fiscal 2025, we are forecasting revenue to be in the range of $1.8 billion, plus or minus 5%. We expect our GAAP gross margin to be approximately 50%. We expect our non-GAAP gross margin to be approximately 60%. For the fourth quarter, we project our GAAP operating expenses to be approximately $710 million. We anticipate our non-GAAP operating expenses to be approximately $480 million. For the fourth quarter, we expect other income and expense, including interest on our debt, to be approximately $46 million. We expect a non-GAAP tax rate of 7% for the fourth quarter. Please note that we forecast our non-GAAP tax rate in fiscal 2026 to step up to be in the range of 10% to 11%, in anticipation of a meaningful year-over-year increase in our operating income.\n\n**Matt Murphy** (Chairman and CEO)\nWe expect our basic weighted average shares outstanding to be $867 million and our diluted weighted average shares outstanding to be $877 million. We anticipate GAAP income per diluted share in the range of $0.11-$0.21. We expect non-GAAP income per diluted share in the range of $0.54-$0.64. Marvell delivered strong third-quarter results, and we are guiding for significant acceleration in our year-over-year revenue growth in the fourth quarter. We see a strong setup for next fiscal year as well. We remain focused on continuing to drive strong operating leverage, expanding our operating margins, bringing down stock-based compensation as a percentage of revenue, and efficient cash flow generation to continue to return meaningful cash to shareholders. I'm also pleased with our guidance to return to GAAP profitability in the fourth quarter, and we are looking forward to continue to drive improvement in this metric.\n\n**Matt Murphy** (Chairman and CEO)\nOperator, please open the line and announce Q&A instructions. Thank you.\n\n**Operator**\nWe will now begin the question-and-answer session. To ask a question, you may press star, then one on your touch-tone phone. If you are using a speakerphone, please pick up your handset before pressing the keys. To withdraw your question, please press star, then two. In the interest of time, please restrict yourself to one question only. If you have additional questions, please rejoin the queue. At this time, we will pause momentarily to assemble our roster. Your first question comes from Vivek Arya with Bank of America. Your line is now open.\n\n**Vivek Arya** (Managing Director)\nThanks for taking my question. Matt, I was hoping you could help quantify the AI revenues for fiscal 2025 overall, and then how we should start thinking about fiscal 2026 given the upside in fiscal 2025. And when you look at that fiscal 26 funnel, what is that determined by? Is it demand visibility? Is it supply? So just more kind of quantification and color on these metrics would be very helpful. Thank you.\n\n**Vivek Arya** (Managing Director)\nYeah, hey, Vivek, thanks for the question. So just to calibrate everybody, we had our AI Day back several months back in April. We talked about $1.5 billion this year for AI and $2.5 billion for next year. Last quarter, we updated that and said we were tracking ahead. And as you can see from our third-quarter results and fourth-quarter guide, for this year, we're tracking significantly ahead now, both for this year and for next year. And this is for this year on the order of hundreds of millions of dollars. So the business has done fantastic. It's actually had stronger-than-expected results, I think, every quarter this year.\n\n**Vivek Arya** (Managing Director)\nAnd so again, a very strong outlook for next year. And to your question about the funnel and what's driving it, it's demand. I mean, on the supply side, we've done a great job of aligning with our partners. We're extremely well-positioned to capture the plan we have and upside to that. And the team is all in to drive and support what our customers need next year, which at the moment looks very, very strong, both on the custom AI side, but as well as our optical interconnect portfolio and switching as well on a year-over-year basis. So firing on all cylinders, Vivek. Thanks.\n\n**Operator**\nYour next question comes from Ross Seymour with Deutsche Bank. Your line is now open.\n\n**Ross Seymore** (Managing Director)\nHi, guys. Thanks for asking the question. I guess first, congratulations to Loi on the retirement. And then if I may, just a clarification and then the question. I guess the clarification is, Matt, obviously, you've been very successful at Marvell, but that seemingly is getting noticed in the press with some other management opportunities. So I'll ask both questions at once, but could you comment at all on kind of your commitment to Marvell or looking elsewhere? And then my second question is more on the customer diversification. How do we think that the business diversifies, whether it's by multiple products in the custom compute or by customers as we go through calendar 25 and 26? Is it still the same timetable that you talked about at your AI Day, or have things moved around?\n\n**Matt Murphy** (Chairman and CEO)\nYeah, thanks, Ross. And always appreciate your direct and frank nature of your questions. So a couple of thoughts. The first is, I've been CEO at Marvell now for eight years. And when I started here, this was a massive turnaround situation.\n\n**Matt Murphy** (Chairman and CEO)\nMany of you remember this. The enterprise value at that time, I think, had sunk to about $3 billion, and over the last eight years, me and my team have worked tirelessly, all out, to transform, drive growth, and position Marvell for what is now the biggest single TAM opportunity I've seen in my career, which is the AI supercycle and data center opportunity. I am all in, okay, on Marvell. We've got the best team at this company of people. The company's outstanding. The technology is best in class. I can't think of a better place to work than Marvell. Just let me be clear on this topic, Ross, for you and everyone that's listening. As the Chairman and CEO of this company, I am 100% focused on Marvell. Okay. With that said, customer diversification. Yeah, we're actually in great shape here.\n\n**Matt Murphy** (Chairman and CEO)\nIf you go back to the AI Day and you look, we presented actually a range of design wins we had, both on AI accelerators and compute, as well as a variety of other custom opportunities. So the breadth is very good across multiple customers, across all of them, actually, with custom solutions. And we have multiple large volume opportunities driving us right now, both, and we called these out the AI Day, both on the accelerator side as well as the compute side. Both are tracking well with two different customers. There's other programs going into production next year. And then we have our third large customer coming in the future. So that's, again, another proof point or data point that gives us a lot of confidence in our ability to drive our long-term ambitions in custom silicon. So everything's tracking well.\n\n**Matt Murphy** (Chairman and CEO)\nThe final thing I would say is on the technology front. I said in my prepared remarks, but very, very good progress on our 2-nanometer platform, extremely complex and broad suite of IP that's best in class. That's also getting a lot of attention from our customers about not just the current sort of designs they're thinking of, but even beyond. Thank you.\n\n**Ross Seymore** (Managing Director)\nThanks, Matt.\n\n**Operator**\nYour next question comes from Harlan Sur with JPMorgan. Your line is now open.\n\n**Harlan Sur** (Executive Director)\nHey, good afternoon, and congratulations on the strong results and outlook. Matt, great to see the strong ramp in execution on your 5-nanometer AI training custom solution at your large cloud customer. This customer has been articulating for several months now, right, the strong deployment strategy for these ASICs.\n\n**Harlan Sur** (Executive Director)\nThat same customer today announced its next-generation custom solution at 3 nanometers, which would be ramping, according to them, end of next year, so calendar 2025. Amazon, like many others, they're pulling in their AI program. So given what appears to be strong execution of your 5-nanometer program and the total ramp by Marvell team, the multi-year agreement with this customer that was announced a few days ago, your characterization of sort of multi-generational roadmap with them, is it fair to assume that you will be the ASIC vendor supporting your customer on this next-gen 3-nanometer training ASIC targeted to ramp late next year? The only reason why I ask is because there just continues to be a lot of competitive noise out there around this 3-nanometer program.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, thanks for the question, Harlan. So first, we're very excited to see the role that custom silicon is playing. It's obviously in the news all the time. It's gained tremendous momentum, I'd say, even since our AI Day in terms of where we think that can go. So we see that as a validation of our strategy that we started many years ago, and it continues to be in full swing.\n\n**Matt Murphy** (Chairman and CEO)\nFor everybody on the call, at our AI Day, we called a total TAM of $75 billion for data center, $40 billion of that being in custom silicon, and we set and the team set a 20% market share target on that $40 billion, so that's $8 billion. For context, we had said for this year, as part of our AI numbers, about $500 million from custom going to $1 billion next year, and of course, we're overshooting on those two right now.\n\n**Matt Murphy** (Chairman and CEO)\nSo the way I would think about this is take your $500 million plus this year, take your $1 billion plus next year, draw a line to that bogey of 20% market share in the future. That's what we're driving. And the announcement we made with AWS is very significant for both companies. For us as a supplier to them, as you pointed out, first of all, it's a five-year agreement. It covers AI custom products as well as a broad range of networking products. It's significant in the revenue that it's going to drive for us. And most importantly, it is multi-generational in nature. So with this agreement and with these kinds of relationships that we're building with these customers, we have even more confidence than before to achieve our goals that we're driving. Thanks.\n\n**Harlan Sur** (Executive Director)\nYep. Great insights. Thank you.\n\n**Matt Murphy** (Chairman and CEO)\nYep.\n\n**Operator**\nYour next question comes from Toshiya Hari with Goldman Sachs. Your line is now open.\n\n**Toshiya Hari** (Managing Director)\nHi. Thank you so much for taking the question. Matt, I had a two-part question on your electro-optics business within the context of AI. I'm curious how you would characterize customer inventory levels of optical DSPs in the marketplace today. And I ask the question because I think some investors are a little worried about inventory build at your customer sites, particularly with tariff fears coming up. And then part B is if you can kind of speak to the 1.6T transition over the coming quarters and years and what that means for your content or your ASP expansion going forward. Thanks so much.\n\n**Matt Murphy** (Chairman and CEO)\nThanks. Yeah. On the inventory side, look, the dynamic right now is we continue to have very strong demand, very strong bookings and order visibility, and a large quantity of orders continue to come in inside lead time. We built, through the pandemic and to today, a very robust supply chain capability, and so we're able to drive and meet the upsides of our customers. Look, on the overall picture, we always are mindful as best we can about optical module inventory, and this was even a concern if you go back a year ago as AI started to ramp, what was going to happen? Were people getting ahead of their skis, etc., so we continue to be diligent here and monitor, but as it appears right now, demand is strong, bookings continue to be strong, visibility is great. We expect that business to grow significantly for us next year.\n\n**Matt Murphy** (Chairman and CEO)\nOn the 1.6T, as it relates to that, that will be part of the growth we see next year. We're shipping that product now into production. It'll be a contributor next year. But I don't want to take away from the very strong 800-gig cycle that will continue to be driven through our fiscal 2026 next year. So far, so good.\n\n**Toshiya Hari** (Managing Director)\nThank you.\n\n**Operator**\nYour next question comes from Blaine Curtis with Jefferies. Your line is now open.\n\n**Blayne Curtis** (Managing Director)\nHey, thanks for taking my question and congrats on a great quarter. I actually want to ask on the enterprise and carrier. You've talked in the past, I think, about getting back to maybe 2 billion plus run rate. I mean, carriers have been up, I guess, with the guidance now. You're looking at double digits two quarters in a row. So I'm just curious how broad-based that recovery is and if you can kind of how quickly do you think you can get back to that $2 billion-plus run rate annually?\n\n**Matt Murphy** (Chairman and CEO)\nYeah, thanks, Blaine. Yeah, we're going to get back to the $2 billion run rate. The question is when. And certainly, we're very encouraged to see that combined enterprise and carrier up 4% in Q3. But then if you think about Q4, we've got it at up mid-teens, which, a quarter back, we were sort of talking about double digits. So net-net between sort of in the second half, both those end markets together have recovered and grown faster than we thought, albeit still shipping below end market consumption, which is your question. And so that's going to continue through next year, that recovery, as both inventory is corrected, some end market growth resumes.\n\n**Matt Murphy** (Chairman and CEO)\nBut also, we have some of our own unique drivers, which really is more pronounced in carrier than it is in enterprise. Enterprise would be more broad-based. In the carrier side, we're not really counting on a huge market recovery. It's really our own product cycles and specifically in base stations where we have a new socket that's ramping as a layer two processor. It's an incremental new socket. It's something we won a few years ago. It took a little bit longer than we thought to get into production, but it's in production now. So that's going to be a contributor, Blaine. And so between the two, we're just going to keep marching along and keep driving that business up. And really, as it recovers, it's really just a tailwind for us in terms of operating income and profitability and top line. And so we'll see how it goes.\n\n**Matt Murphy** (Chairman and CEO)\nWe'll keep updating everybody on a quarterly basis there. But so far, so good, especially the plus mid-teens on the Q4 guide.\n\n**Blayne Curtis** (Managing Director)\nThanks, Matt.\n\n**Matt Murphy** (Chairman and CEO)\nYep.\n\n**Operator**\nYour next question comes from Tom O'Malley with Barclays. Your line is now open.\n\n**Thomas O'Malley** (Equity Research Director)\nHey, Matt. Thanks for taking the question. Congrats on the great results. I wanted to ask on some of the parts of the Amazon announcement. So AEC was mentioned, PCIe retimers, switching products. So you're hearing just a lot from other smaller companies that are seeing some big, robust revenue ramps. Could you just do your best to maybe size how significant those are for you today? And then when you look out kind of over the next 12 months, what area of those non-optical DSP businesses are going to be the most significant for you? Just generally, where are you going to see the most growth outside of that core optical DSP business?\n\n**Matt Murphy** (Chairman and CEO)\nThanks, Tom. Yeah, so as part of the agreement, both the custom side and the networking side are extremely important. It's not massively swayed between the two. So on the networking side, all those product areas are in our wheelhouse, and they're all in various stages of maturity. Look, on the switching front, we had a great acquisition with Innovium. We announced our TL10 five-nanometer 51.2T switch. That's gone into production. Interest is very, very strong in that product. More to come there, and also our roadmap, which we think is very compelling, and our team there has done an excellent job.\n\n**Matt Murphy** (Chairman and CEO)\nSo that one, we think, has not only growth heading to next year, but on a long-term basis, we see that as being a very strong area for us. AECs is definitely a bright spot. That's an area that we're ramping now through our module partners. And we, again, see very strong take-up of Marvell Solutions into next year. And then some of the other more emerging categories are still to come, but those are areas we're investing in. So I think the way to think about it is as a five-year type of arrangement. There's just a lot of opportunity to drive innovation together, to drive new solutions, sometimes things we haven't even thought of. We're just very excited about what the two companies can do together.\n\n**Matt Murphy** (Chairman and CEO)\nAnd then with us as a customer of theirs, we've just seen great success in using AWS as our supplier for EDA cloud services. And it's allowed us to complete some very complex designs in very, very short time to market with very good burst capacity and performance. So the whole relationship is really a win-win. And it's really an honor for us to be associated with them. And the final thing I would say is I think it's also a testament to the all-in data center-first strategy that Marvell has put together. And to see that get recognized with a type of landmark agreement like this, I think, is really a good sign for us and for the team and for our investors. Thanks.\n\n**Operator**\nYour next question comes from Mark Lipacis with Evercore. Your line is now open.\n\n**Mark Lipacis** (Senior Managing Director)\nHi. Thanks for taking my question.\n\n**Mark Lipacis** (Senior Managing Director)\nI also had a clarification and a question, if I may. I think, Matt, did you suggest $40 billion of custom AI TAM out of $75 billion? So does that suggest you believe custom is about half of the market, roughly speaking? And then the question is, how would you characterize the landscape, the competitive landscape for what you're doing on the custom side? How many companies can do what you guys do on the custom side? And maybe as part of that, can you help us understand why this is happening, why the custom silicon is becoming a thing? It seems just like five years ago, everything was run on a standard, every workload was run on a standard x86 server chip. And now you're helping your customers do custom silicon. NVIDIA has a whole bunch of different SKUs for Blackwell. Why is custom becoming a thing? Thank you.\n\n**Matt Murphy** (Chairman and CEO)\nYeah. Thanks, Mark. So to refer back to the AI Day, so what we called out was a $40 billion custom TAM. Okay. And then of that, our goal is to drive 20% market share kind of plus. Okay. So that's the numbers. And then within that, we really see ourselves and one other very large, highly scaled-up competitor who can do these types of solutions. Now, there's going to be a lot of different ways that people are going to try to get there in terms of some of these custom approaches. There's already been a lot of noise in the system around these types of opportunities and applications.\n\n**Matt Murphy** (Chairman and CEO)\nOur strong view is that in the end, what's actually going to ship and represent the vast majority and bulk of the volume of shipments in custom silicon for accelerators is going to be from scaled-up companies like Marvell, the companies that have the IP, the combination of the IP roadmap internally, including CertiS and HBMFIs and the Compute Interconnect and packaging. I can go on and on, but the capabilities is first. The second is a team, a team that's experienced enough to execute the design with A0 quality. What A0 means is first-pass silicon, which is incredibly hard to do when you're talking about 100-billion-type of transistor designs in the most advanced nodes.\n\n**Matt Murphy** (Chairman and CEO)\nThe third part of that is you got to have the manufacturing capacity and capability and know-how to drive yield, to drive quality, and then be able to service the products once they get into the field to meet the dynamic needs that these customers have in terms of the supply chain. So when you stack all that up, the barrier to entry to actually ship one of these products is very high. And we know firsthand because we've done several of them now. So that's still the view we have on the competitive landscape despite what's out there. And then on the why, it really comes down to TCO. And it's not a zero-sum game. It doesn't mean that if somebody implements a custom silicon design, it's going to just completely usurp and take over whatever the merchant offering is.\n\n**Matt Murphy** (Chairman and CEO)\nThese are going to coexist where there's workloads that are big enough that are going to get the bang for the buck on the optimization. It makes a ton of sense to go to custom from a TCO basis, and TCO is obviously the cost of the product and what it takes to implement it, as well as the performance you get, and the other factor is when you're doing a custom silicon chip. It's not just the chip. It's also our customer's network and the way they implement the solution and the way that they know better than anyone else how to get the maximum performance out of their system with the accelerator being one piece of it.\n\n**Matt Murphy** (Chairman and CEO)\nWe try to be helpful to come in and not only be the partner of choice for the custom chips, but also come in with our point of view and our help around the interconnect and higher layer switching and ways to think about how to drive total cost of ownership at the lowest possible power. And so those are the dynamics, Mark, we see today. And we'll keep you updated, but it's only moving in this direction. And I think just based on the announcements this week and you can see in our revenues, the custom Trainium is definitely happening.\n\n**Operator**\nNext question.\n\n**Mark Lipacis** (Senior Managing Director)\nThank you.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, thanks.\n\n**Operator**\nYour next question comes from Tore Svanberg with Stifel. Your line is now open.\n\n**Tore Svanberg** (Managing Director and Senior Semiconductor Analyst)\nYes. Thanks, Matt. Congratulations on the strong execution and also congratulations to Loi on his retirement. So you announced the Ara 3-nanometer 1.6T DSP today. I think it's only about 18 months ago since you announced the Nova 5-nanometer. So I was a little bit surprised about the timing there. Am I reading into too much in there, or is there something going on in the marketplace where there's a big push now towards 3-nanometer and lower power? Any more color you can add on the timing of Ara would be great.\n\n**Matt Murphy** (Chairman and CEO)\nYeah. I think what you're seeing is obviously the need for lower power consumption solutions for all the reasons you can see if you look all the way back up to the data center level and the power consumption of the data centers themselves. But the reality is, Tore, we need to move at hyperscale speed.\n\n**Matt Murphy** (Chairman and CEO)\nI mean, the beat rate that we think we need to be at to be competitive and to lead the market means we have to be faster and faster on our time to market, and I've been doing this for 30 years, okay, in the semiconductor industry, and I can tell you when you enter an inflection in a growth market, the company with the best and leading technology that's available, you can sample it, it works, is going to win. It's that simple, and so our team, which is the best in the world at what they do, is heads down, focused on driving the best possible solutions, the best TCO, the best power, and highest performance in the latest process node, and you're going to see that continue across Marvell, but particularly in this area of DSPs and broadband analog and the chipsets that we sell.\n\n**Matt Murphy** (Chairman and CEO)\nWe intend to maintain our market share leadership and extend that and be the supplier of choice. It's as simple as that. We're going faster.\n\n**Tore Svanberg** (Managing Director and Senior Semiconductor Analyst)\nPerfect. Thank you.\n\n**Matt Murphy** (Chairman and CEO)\nYep.\n\n**Operator**\nYour next question comes from CJ Muse with Cisco. Your line is now open.\n\n**CJ Muse** (Senior Managing Director)\nCisco. Kenneth Fitzgerald, thank you for taking the question. Matt, I would add a question on overall custom silicon. I was hoping you could level set us. Where are we in terms of the total business versus just AI custom silicon? And is there any way to kind of size the total and the percentage for calendar 2025? And I know to an earlier question, you didn't want to give a growth rate for the AI portion, but perhaps you could speak to what kind of growth you foresee in calendar 2025 and 2026 for the non-AI part of the business.\n\n**Matt Murphy** (Chairman and CEO)\nYeah. Hey, thanks, CJ. Yeah, I'm pretty sure you didn't go to Cisco since I think you just got a new job, which you're doing great at. So congratulations on that. On the - sorry. On your question about - sorry, I lost the question. I was trying to make a joke there. Tell me your question again one more time.\n\n**CJ Muse** (Senior Managing Director)\nTotal custom silicon versus AI.\n\n**Matt Murphy** (Chairman and CEO)\nYeah, yeah. Got it. Yeah. Sorry. Look, for this year, we said this at the AI Day too, custom silicon this year and next year, it's largely driven by AI. It's the vast majority. But the other programs have come in, okay? So they're just - and what really happened is we have a number of programs. They've done well, but the magnitude of the AI and kind of the upside we've seen relative to the others has just been higher.\n\n**Matt Murphy** (Chairman and CEO)\nSo vast majority is AI for this year, vast majority is AI for next year. But I wouldn't, and we said at the AI Day, I wouldn't sort of write off the other design wins we have because some of those, like we showed off a custom NIC with Meta as an example. That was, I think, a really good showcase we did at OCP. Those types of solutions are also going to come into the market and help drive our growth. And then on the non-AI, AI kind of custom, non-custom for this year and next year, I'm not really breaking that out.\n\n**Matt Murphy** (Chairman and CEO)\nI just say that by default, the growth rate is going to be higher on the custom side because it is a lower base and it has been ramping kind of in the second half, whereas optics and switching in those other areas has already been in the revenue line. But both are going to grow quite a bit next year and drive the top line.\n\n**CJ Muse** (Senior Managing Director)\nThank you.\n\n**Operator**\nYour next question comes from Chris Caso with Wolfe Research. Your line is now open.\n\n**Chris Caso** (Managing Director)\nYes, thank you. Good evening. The question is on margins, and if you could help to level set us on the expectation for gross margins as we go into next year as that custom business ramps. And then I guess just as importantly on operating leverage as you go into next year. And I guess what you said in the past is that the custom business is very good on the operating margin side. How does that flow through the numbers as we go into next year?\n\n**Matt Murphy** (Chairman and CEO)\nYeah. Great. I'll let Willem take that one. Willem, go ahead.\n\n**Willem Meintjes** (CFO)\nYeah. Thanks, Matt. Hey, Chris. So let me just start by saying the team's done a great job driving gross margin at or above 60% here in the second half, even as we've been ramping the custom programs very significantly, right? And so when we look at next year, clearly the gross margin will continue to be dependent on mix. But we continue to see very strong optics growth next year, the recovery in our non-data center businesses, the leverage that we're getting from better overhead absorption on higher revenue on the manufacturing side.\n\n**Willem Meintjes** (CFO)\nAnd so when you add all that together, we do see a path to continue to be about 60% through next year. Now, obviously, if custom upsides even significantly more from what we're seeing today, that answer would be different. In terms of the leverage, when you look at our Q3 results, we came in at around 30% OM. And even with gross margin guide down about 0.5%, our operating margin is actually up to 33%, so up by 3%. And so when you look at our OpEx control, you should expect us to continue to have a very significant focus on leverage through next year with the top line outgrowing our OpEx right through next year. And so really should see a very nice increase in our operating margin through next year, really starting to approach the bottom end of our long-term range towards the end of next year.\n\n**Chris Caso** (Managing Director)\nVery helpful. Thank you.\n\n**Matt Murphy** (Chairman and CEO)\nThank you.\n\n**Operator**\nYour next question comes from Atif Malik with Citi. Your line is now open.\n\n**Atif Malik** (Analyst)\nHi. Thank you for taking my question. Congratulations on hitting the next growth phase. Matt, I was listening to the other Matt Garman, AWS CEO at Reinvent today, and he mentioned that the Trainium chip can do both training and inference. So my question to you is, has your thinking about the sales contribution mix from the two programs that this customer ramp changed from 90 days ago?\n\n**Matt Murphy** (Chairman and CEO)\nNo. No. I think we've been able to plan our business together very well with our key customers in this area, especially custom where you have to do that.\n\n**Matt Murphy** (Chairman and CEO)\nAnd so I would really defer to Matt and the team to talk about their dynamics, but we're prepared to completely support whatever they need. And we've got that in our manufacturing and supply plan, and we're going to go do it. That's probably all I can say. I usually stay away from any more detail about my customer's plan, so to speak. But thanks for the question. Appreciate it.\n\n**Atif Malik** (Analyst)\nThanks.\n\n**Operator**\nYour next question comes from Srini Pajjuri with Raymond James. Your line is now open.\n\n**Srini Pajjuri** (Managing Director)\nThank you. Hi, Matt. My question is also on the ASIC side. The Analyst Day you talked about a third, I think you called customer C ramping sometime in 2026. And I think you alluded to that opportunity being larger, potentially larger than customer A and customer B combined. And obviously, customer B seems to be doing quite well. So I'm just curious if there's any update on customer C, how the progress has been, and if you still expect that opportunity to be larger than the other two customers. Thank you.\n\n**Srini Pajjuri** (Managing Director)\nYeah. The short answer is yes. It continues to be the largest opportunity of the three. It's tracking well. There's great support from both teams, and we're executing. And unchanged from AI Day, other than I'd say just the whole, in general, custom silicon opportunity set just seems to have continued to gain momentum as each quarter goes on. And so we're very optimistic about what we can go achieve with that customer and also our other two customers we have and then their next-generation concepts. A lot to go do and go execute on, Srini. Thanks.\n\n**Srini Pajjuri** (Managing Director)\nThanks, Matt.\n\n**Operator**\nThere are no further questions at this time. I will now turn the call over to Matt Murphy, CEO, for closing remarks.\n\n**Matt Murphy** (Chairman and CEO)\nGreat. Thank you so much. And look, everybody, really appreciate all the thoughtful questions. Closing remarks. So as we finish the year here, we're very optimistic about our fiscal 2026. As we talked about, we have a full-year ramp of custom happening. You've got optics continuing to have a lot of momentum. Our switching business is growing, and then new areas like AECs are kind of just going into real volume production for the first time. We're also seeing a very strong recovery even in our fourth quarter and our multi-market kind of core base business. That's very encouraging in terms of profitability and top line and EPS contributions. We have a very targeted investment plan, and we're 100% focused on this AI supercycle opportunity and then really the capital allocation framework to support it.\n\n**Matt Murphy** (Chairman and CEO)\nI'm excited to have the investor day mid-next year to update all of you comprehensively with our updated long-term model given the sort of new era that we're entering into. As I said in the Q&A, me and the team are all in to drive outstanding service and support for our customers and also extremely strong financial returns for our stockholders. So I want to wish everybody on the call and who's listening a very happy holidays, and I look forward to seeing you all in the new year. Thanks, everybody. Take care.\n\n**Operator**\nThank you for attending today's presentation. You may now disconnect.",
      "fetched_at": "2026-02-04T15:41:55.346Z"
    }
  ]
}