{
  "ticker": "MU",
  "last_updated": "2026-02-04T15:48:48.429Z",
  "total_transcripts": 5,
  "transcripts": [
    {
      "ticker": "MU",
      "title": "Micron Technology, Inc. (MU) Q1 FY2026 Post Call earnings call transcript",
      "published_date": "Dec 17, 2025, 6:00 PM EST",
      "fiscal_year": "2026",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/MU/earnings/MU-Q1-2026-earnings_call-422932.html",
      "content": "**Operator**\nI would now like to hand the call over to Satya Kumar, Investor Relations. Please go ahead.\n\n**Satya Kumar** (VP of Investor Relations)\nThank you, and welcome to Micron Technology's Fiscal First Quarter 2026 Post-Earnings Analyst Call. On the call with me today are Sumit Sadana, Micron's Chief Business Officer, Manish Bhatia, EVP of Global Operations, and Mark Murphy, our CFO. As a reminder, the matters we're discussing today include forward-looking statements regarding market demand and supply, market trends and drivers, and our expected results and guidance in other matters. These forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from statements made today. We refer you to documents we have filed with the SEC, including our most recent Form 10-Q and our upcoming Form 10-Qs for discussion of risks that may affect our results. Although we believe that the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee future results, levels of activity, performance, and achievements.\n\n**Satya Kumar** (VP of Investor Relations)\nWe are under no duty to update any of the forward-looking statements to conform these statements to actual results. We can now open the call up for Q&A.\n\n**Operator**\nAs a reminder to ask a question, you will need to press star 11 on your telephone. To remove yourself from the queue, you may press star 11 again. Please stand by while we compile the Q&A roster. Our first question comes from the line of Aaron Rakers of Wells Fargo. Your line is open, Aaron.\n\n**Vivek Arya** (Managing Director)\nYeah, thanks. Thanks for taking the question and doing the group call. I guess my first question is, you know, Mark, you talked a lot about being constrained and unable to meet some of the demand out there. I know in the quarter you talked about kind of a slight increase in bit shipments of DRAM this quarter. I guess as part of that, did the non-HBM DRAM bits grow sequentially in this quarter? And how, you know, how has your guide, you know, factored in bit shipments between NAND and Flash in this current quarter? Thank you.\n\n**Mark Murphy** (CFO)\nSo I think, Aaron, one thing I wanted to mention was, you know, we are doing all we can to increase bit supply now. And we were able to provide additional bits to do 20% bit shipment growth in our fiscal 2026. And, you know, we're doing that through, you know, efforts within existing footprint and just efficiencies in the fabs. We're doing that with node transitions, as we've said, you know, 1-beta and, or I'm sorry, 1-gamma and G9 to get additional bits for DRAM and NAND. And, you know, we're pulling in what we can on construction that will help us largely in 2027, but we are able to provide growth, what we think will be in line with the market in fiscal 2026 or calendar 2026. You know, I think we did have very modest bit shipment growth sequentially in the first quarter.\n\n**Mark Murphy** (CFO)\nWe expect a little bit more in the second quarter, but it's again a quarter primarily driven by price as it relates to revenue growth.\n\n**Vivek Arya** (Managing Director)\nYeah, that's helpful, Mark. And then as a real quick follow-up, you know, as we look forward, I know you mentioned the 14-week period for fiscal four Q, but how would you have us think about the OPEX trajectory from here over the next couple of quarters? Thank you.\n\n**Mark Murphy** (CFO)\nYeah, I mean, we've guided the second quarter. It'll be sort of flattish in the third quarter relative to the second. Then it'll be up in the fourth quarter and up and plus the additional week.\n\n**Vivek Arya** (Managing Director)\nYep. Thanks, Mark.\n\n**Operator**\nThank you. Our next question comes from the line of Vijay Rakesh of Mizuho. Please go ahead, Vijay.\n\n**Vivek Arya** (Managing Director)\nYeah, hi, thanks. Great quarter. So just a quick question, Sumit, Mark, and Manish. When you look at the, you know, DRAM pricing, it was up pretty nicely, 20% sequentially, and NAND was up pretty nicely too. I was just wondering, when you look at the demand side, how do you decide to allocate capacity versus conventional DRAM versus HBM? Because it looks like conventional DRAM profitability is improving very significantly. So just wondering how that reasoning, how you look at that as you look through 2026, 2027. Thanks. I have a follow-up.\n\n**Sumit Sadana** (Chief Business Officer)\nYeah, so good question. I mean, we are in a very interesting environment where the aggregate demand for both DRAM and NAND is substantially higher than the ability to supply to it, not just from a Micron perspective, but, you know, even at an aggregate industry level. So we are not really able to meet the demand for customers across any segment. So all segments are short in terms of what they need from us versus what we are able to supply. And we are also short on the HBM side, non-HBM side, you know, all parts of the market. There is a mismatch between supply and demand, and that continues for the foreseeable future because over the course of the last few months, there has been a very significant and pervasive step-up in demand across the data center customer base.\n\n**Sumit Sadana** (Chief Business Officer)\nAnd so it has created a set of challenges in being able to meet the demand from our customers on a very broad level. So in terms of allocation, I can't get into too much specifics, but suffice to say that we are working very hard to find the threshold level of supply for all of our customers to minimize the impact to their businesses due to lack of adequate supply. And we are working hard to ensure, you know, adequate level of diversification in our business across segments, across customers, and focus on our strategic customers when it comes to, you know, doing some of these longer-term strategic deals that can improve foundationally our business model. So those are some of the things that we are attempting to do.\n\n**Sumit Sadana** (Chief Business Officer)\nIn the course of all of this, our mix over time will tilt more towards the data center, but we're also trying to remain focused on having diversification across all the other segments of the market as well.\n\n**Vivek Arya** (Managing Director)\nGot it. And then on the ESSD side, you know, you're seeing a very strong pickup with your QLC. It's in nine ESSDs, as you mentioned, 122-terabyte, 245-terabyte. Is there a way to kind of look at what is the attach rate that you're seeing now with ESSDs on AI servers versus last year, especially as some of these inferencing vectors with reasoning and answer and all that stuff to pick up? How do you see that attach rate growing year on year? Thanks.\n\n**Sumit Sadana** (Chief Business Officer)\nThe attach rate is certainly growing, and these AI servers do need more high-capacity SSDs. They also need a significant amount of high-performance SSDs. This is where our Gen 6 SSDs have come into the picture, so we have been the first company to supply qualified Gen 6 SSDs to the market, so that is gaining rapid market traction and contributing to our improved share position in the data center SSD space, and then these high-capacity SSDs that you mentioned, Micron has the leadership position in QLC workloads, and so overall, QLC bit mix is higher than the rest of the industry, so that's an additional capability that we have, and if you look at workloads like AV Cache, they do require a lot of higher-capacity SSDs.\n\n**Sumit Sadana** (Chief Business Officer)\nNow, one additional thing that has happened is that beyond the underlying growth trend of AI servers using more of these SSDs, we've also had our customers not have an adequate amount of HDDs as well. And because of that, there has been a lot of demand coming towards SSDs. And consequently, the ability to supply NAND to our customers has also been oversubscribed due to a combination of all of these trends.\n\n**Vivek Arya** (Managing Director)\nGreat. Thank you.\n\n**Mark Murphy** (CFO)\nI do want to note that on SSDs, that if you remember, our business was over $1 billion in the first quarter of 2025. And in the first quarter of 2026, the business did clear that. And as Sumit mentioned, as sort of the industry is able to get on top of the supply chain-related issues, we expect, and given the demand in that business, we expect that growth to accelerate through the year.\n\n**Vivek Arya** (Managing Director)\nAll right. Thanks, Mark.\n\n**Operator**\nOur next question comes from the line of Vivek Arya, Bank of America Securities. Your line is open, Vivek.\n\n**Vivek Arya** (Managing Director)\nThank you. I actually had two questions. First, back on the gross margin, I think you are at 68%. Is there a reasonable way to think about, you know, what can be the, you know, path forward? Like, is it 70%? Is it 75%? I know you have not given a specific number, but Mark, is there a way to logically think about where your margins can go in this, you know, in this cycle? Because this is well above the prior peak. So is there a certain business model you have in mind? And the reason I ask the question is because, you know, you have, you know, close to 70% gross margins, right? Your customers, NVIDIA, AMD, are also talking about, you know, very high gross margins or expanding gross margins for their business.\n\n**Vivek Arya** (Managing Director)\nI'm just curious to know how you think conceptually about the path forward for your gross margins?\n\n**Mark Murphy** (CFO)\nYeah, we're at record-setting levels, and that's positive. We guided to that, and there are a lot of favorable factors in that that are driving that. You know, first is, you know, the demand driven by this, you know, generational change in tech with AI. And, you know, that's a multi-year build-out done by well-capitalized companies. So we think that's sustainable, and fortunately, you know, AI needs more and better memory to perform better. So, you know, the underlying, you know, secular driver for memory is positive. You know, we're just in a fantastic position with leadership technology, best products in memory and storage, and then we're operating really well, yielding quickly. Cost performance is good. Capital discipline is good, and then you've got these general structural supply constraints.\n\n**Mark Murphy** (CFO)\nSo when combined with the demand from AI, data center to the edge, actually, you know, we've got this supply shortfall, and you see the price movement associated with that. And this is a not-insignificant, you know, supply gap that's not easy to address in the near term, given, you know, we can do a node transition, but you've got, you know, greenfield capacity needs to be put in place. You've got increasing HBM and the capital intensity associated with that, or silicon intensity associated with that. And these are, you know, putting on earth the most, you know, some of the largest and most complex factories, you know, on the planet. So we need partnership to do that, and we're going to do it carefully. So, you know, with all that, we do expect that margin can go up from second quarter.\n\n**Mark Murphy** (CFO)\nIt'll go up on the basis of, we believe, market conditions that should remain, you know, positive beyond 2026. We believe it's possible based on our ability to deploy bits to premium products in which we're best positioned, and we believe that our cost performance is such that it will help us sustain or expand these margins. Now, just the math of being at these levels for a, you know, equivalent increase in price, we're going to get less gross margin expansion. So, you know, there can be, you know, as we mentioned on the call, on the primary earnings call, there's, you know, the increase from here would be more gradual than you've seen in, you know, fourth to first or first to second quarter guide, but we do believe that margins can go up.\n\n**Vivek Arya** (Managing Director)\nGot it. And for my follow-up, you know, every time the customer, right, whether it's Nvidia or Broadcom or AMD, every time they report, they seem to be upsiding numbers for next year. So when you say you're sold out for HBM, does it mean that you don't have an ability to upside your production, or, you know, does it mean that you're sold out based on the current level of forecast and you have kind of unit and ASP certainty around that? I'm just trying to understand, you know, what scenarios let them continue to upside the numbers, unless it's just a sheer shift between you and your peers. Like, if they continue to upside the numbers, you know, can you help them, you know, do that? How much more flex is there in your production for HBM? Thank you.\n\n**Sumit Sadana** (Chief Business Officer)\nYeah. So I think the way to read what we are saying is that, you know, we have visibility to our supply. And of course, we're always trying to improve that. But we have a good understanding of what our supply is. The current situation, you know, when we say sold out for HBM, for example, the HBM supply for 2026, we have reached agreements on volume and price with our customers. Of course, if there are upsides to supply, we are able to very quickly be able to place that upside supply at our customers at, you know, good terms. But when it comes to the overall aggregate business, the demand on us is so much higher than the supply that even, you know, small increases in supply are not going to be able to make a dent in that demand.\n\n**Sumit Sadana** (Chief Business Officer)\nSo we are, you know, more than sold out. I mean, we have a significant amount of unmet demand in our models. And this is just consistent with an environment where the demand is substantially higher than supply for the foreseeable future.\n\n**Manish Bhatia** (EVP of Global Operations)\nVivek, I'll just add on, you know, HBM and DRAM, because the whole market is short, and, you know, HBM, you know, production in fab output is shared with DRAM production, right, all on our 1-beta node. So, you know, this constraint is kind of across the entire DRAM market, as Sumit mentioned, and as we said before, which is, you know, incredibly constrained. So we are working hard to try to increase supply for, you know, DRAM, HBM, and NAND. You know, yields have come up really well for both our 1-gamma and our gen nine. And those are going to be, as we gave color, the majority of the big growth for next year is coming from those transitions. And we're also, you know, going to have the majority of our DRAM bits on 1-gamma in the second half of next year.\n\n**Manish Bhatia** (EVP of Global Operations)\nGen 9, as we go through the year, will become the highest volume node for us in NAND. So, you know, technology transitions are moving aggressively. We're optimizing and looking to maximize production where we can. I just want to point out that we've also said that we expect HBM4 yield ramp to be faster than our HBM3E 12-high yield ramp was, which was already faster than our HBM 8-high yield ramp. So we're gaining confidence in our HBM capability at scale. So, you know, all those are things that we're continuing to work on, but just the demand environment is such that it's really, you know, way over supply, whatever we can or what the rest of the industry can supply.\n\n**Vivek Arya** (Managing Director)\nThank you.\n\n**Operator**\nComes from the line of Kevin Cassidy of Rosenblatt Securities. Your line is open, Kevin.\n\n**Kevin Cassidy** (Senior Research Analyst)\nThank you very much. My question, you know, along those lines, if you're saying the HBM4 yield is better than HBM3, how does this work with the process node? With the qualification time taking so much longer with HBM, does this change your cadence for process technology? You know, do they stay in production longer?\n\n**Manish Bhatia** (EVP of Global Operations)\nI'm not quite sure. I think both our HBM3E and HBM4 are on our one beta process technology. They both use the similar assembly architecture and process that we've had now from HBM3E 8-high, 12-high, and now at HBM4. So the reason I said that we expect our HBM4 yields to ramp faster than HBM3E 12-high did once we go to production in the, you know, early part of calendar year 2026 and start shipments in calendar second quarter is because of being able to leverage the learnings that we have both on one beta for HBM as well as on the packaging and test side because we have common architectures between those products.\n\n**Kevin Cassidy** (Senior Research Analyst)\nYeah. My question was more in a bigger picture. Will one gamma get qualified for HBM4, or will it always be one beta?\n\n**Manish Bhatia** (EVP of Global Operations)\nHBM4 is on 1-beta. I know we haven't given specific guidance on, you know, how future generations will be, but HBM4 will be on 1-gamma. You know, the cadence of platform.\n\n**Kevin Cassidy** (Senior Research Analyst)\nOne beta.\n\n**Manish Bhatia** (EVP of Global Operations)\nI'm sorry, one beta. And the cadence of our customers' platforms continues to be, you know, rapid every 12 months. So we are just going to be focused on delivering new memory, new high-bandwidth memory solutions for our customers on an approximately 12-month cadence. So, you know, that's not slowing down.\n\n**Kevin Cassidy** (Senior Research Analyst)\nOkay. Maybe another question. Just how quickly can you change your wafer allocation, you know, from HBM to low power to high performance? You know, I guess how far into the process technology can you change what the final product is?\n\n**Manish Bhatia** (EVP of Global Operations)\nSo they are shared process between the two, between the various different designs that we have on a given DRAM technology node. But the design itself is unique. So when you start one design, whether it's a low power design, a DDR design, or an HBM design, obviously, that's going to be the time frame. So the real time, the answer to your question is that basically it's one process cycle time that we can change between any of these different products.\n\n**Mark Murphy** (CFO)\nI think, Kevin, I just want to make sure it's clear that we have extensive planning that we do around all the products and the product roadmaps and, you know, what products go on what node at what time. And, you know, there are a lot of factors that go into that. Cost is not the only factor. And in fact, in HBM, it's such a complex product that stability and, you know, turning quickly with the customer is an important factor. So there's some value in one beta and as stable and strong a node as that is. And then, you know, one gamma is available at the right time, you know, that we can use that node. Otherwise, you know, we have plenty of other bet requirements that one gamma we're ramping that as quickly as we can to get that supply.\n\n**Sumit Sadana** (Chief Business Officer)\nI mean, generally speaking, we tell our customers that it takes us five months if they want to make changes that use different data in the fab, three months, three and a half months to get to the front end, and six to eight weeks, depending on the complexity of the product on the back end. So roughly speaking, five plus months of lead time. And our customers understand that. They know that these things take a long time.\n\n**Kevin Cassidy** (Senior Research Analyst)\nOkay. Great. Thank you.\n\n**Operator**\nThank you. Our next question comes from the line of Stephen Fox of Fox Advisors LLC. Your line is open. Stephen.\n\n**Steven Fox** (Research Analyst)\nHi. Good afternoon. I just had one question. On the CapEx spending that you talked about on the call, are you giving any sort of sense for the breakdown between facilities, equipment, construction, all of that, say, from now and how it might change between 2026 and 2027? That mix? Thanks.\n\n**Mark Murphy** (CFO)\nYeah. We've not indicated, you know, anything about 2027 other than that 2027 total CapEx will be up versus 2026. I did on the call, I believe, indicate that, you know, 2025 to 2026, the plans to, you know, our fiscal plans to roughly double, you know, the construction CapEx. And so that gives you sort of an indication on direction of travel. Now, we've got, you know, 2027, we'll have, you know, Idaho 1 finishing. We've got Idaho 2. We've got Japan. We've got, you know, we've got a lot of construction sites. So, you know, those are going to contribute to that sequential, you know, 2026 to 2027 CapEx increase. And Manish.\n\n**Manish Bhatia** (EVP of Global Operations)\nYeah. I mean, we'll be.\n\n**Mark Murphy** (CFO)\nHBM and Singapore.\n\n**Manish Bhatia** (EVP of Global Operations)\nWe do have a considerable amount of construction, I was going to say, in Singapore as well, where we've got that. And we're going to be equipping our India assembly site, which is just now going from pilot production to production ramp in the beginning of calendar 2026. So, yeah, there's going to be a mix of growth in terms of construction CapEx to fund the midterm and long-term equipment CapEx into, you know, existing clean room that we have right now. And then, of course, assembly investments for both HBM as well as conventional packaging that we'll be making as well.\n\n**Mark Murphy** (CFO)\nYeah. I'll just maybe add to this point. You know, Tim asked about capital intensity on the earlier call. You know, we had CapEx as a % of sales in the first quarter was, you know, below 35% that we talked about. And then on the second quarter, basically where our guide is to the both on the revenue and the CapEx guidance we gave you, you could tell it's in the mid-20s on CapEx as a % of sales. And, you know, and we've talked about strengthening free cash flow. So we're, you know, we're not only increasing investment in order to get the bit supply, we are generating a lot more cash. We had, you know, near 30% free cash flow margin in the first quarter. And we talked about free cash flow increasing through the year.\n\n**Mark Murphy** (CFO)\nWe paid down debt, you know, $2.7 billion of debt in the first quarter, bought back $300 million of shares, and went to net cash all in the quarter, and it was a record-setting free cash flow in the first quarter.\n\n**Steven Fox** (Research Analyst)\nGot it. That's all very helpful. Thank you.\n\n**Operator**\nThank you. Our next question comes from the line of Jim Schneider of Goldman Sachs. Your line is open, Jim.\n\n**Jim Schneider** (Senior Equity Research)\nGood evening. Thanks for taking my questions. First one would be just in terms of the capacity allocation question that came up earlier, maybe to put it a different way, can we be? I know you're, you know, sort of a key supplier in many embedded and other kind of mission-critical applications, automotive and the like. You know, can you give us a sense about, like, a floor level, a minimum floor level that some of those sort of legacy or embedded applications would reach or not below in terms of production, kind of giving your importance in that market? Or conversely, can we maybe talk a little bit about sort of, you know, what is the maximum level of data center capacity or data center exposure you feel comfortable having?\n\n**Sumit Sadana** (Chief Business Officer)\nYeah. I mean, I think there are a couple of things to keep in mind. First of all, the overall TAM is also shifting more towards data center. That's just how the dynamics of the industry are playing out. So certainly our portfolio and our mix is shifting towards data center. Our whole goal over time is to keep mixing our products within each segment and across segments towards, you know, higher ROI type of homes for our bits and for our output. And that just means that for some time now, the portfolio mix has been an important tailwind for Micron and continues to be a driver of our longer-term financial performance because we have over time shifted more and more of our revenue towards higher margin products and taken a bigger share of the industry profit pool based on that initiative. So that will continue.\n\n**Sumit Sadana** (Chief Business Officer)\nWith that said, you're right. I mean, we do have a large share in automotive and industrial and several mission-critical applications. So we are making investments in our Manassas, Virginia fab in the U.S. to modernize it, bring 1-alpha technology, DRAM technology into that fab. And so that is going to be an important initiative to continue the support of long lifecycle, legacy products. And we intend to continue to support them. Of course, we also support a lot of these products and customers and segments from our high-volume fabs. And certainly the demand environment and the structural challenges on supply for us as well as for the industry just make it very difficult to meet all of the demand for customers across different segments.\n\n**Sumit Sadana** (Chief Business Officer)\nSo a lot of work that we are doing is to try and assess the threshold level of supply that each of our customers need, encourage them to also, you know, figure out other sources of supply in this environment where we may not be able to meet all of the demand. Of course, we also continue to make sure that our commitments towards our customers are kept. We are certainly very big on that. So it's a delicate balancing act. It's a difficult environment to meet all of our customers' needs. We're working very, very hard to do the best we can on that front across the different segments of the market, including the ones that you mentioned.\n\n**Jim Schneider** (Senior Equity Research)\nThank you. And then just a quick clarification. Relative to the Hiroshima clean room expansion you referenced on the call, can you talk about when that kind of would turn into volume production capability? Thank you.\n\n**Manish Bhatia** (EVP of Global Operations)\nSure, Jim. You know, what we've said is that, you know, we are working to develop and deploy next-generation DRAM technologies there with the support of METI and, you know, our Boise R&D team working with our Hiroshima R&D team. So it will be future generations of technology we'll be deploying. And the clean room space will support those future technologies. So it will be timed to be able to support those, the space needed for those new nodes.\n\n**Jim Schneider** (Senior Equity Research)\nBut not in 2026, to be fair.\n\n**Manish Bhatia** (EVP of Global Operations)\nNo, not in 2026.\n\n**Jim Schneider** (Senior Equity Research)\nOkay. Thank you.\n\n**Operator**\nThank you. Our next question comes from the line of Joseph Moore of Morgan Stanley. Please go ahead, Joseph.\n\n**Joseph Moore** (Managing Director)\nGreat. Thank you. Along the same lines, you had talked about the PC market could be limited by DRAM availability. How do you make those kinds of allocation decisions? You know, is it kind of just highest gross margin is the focus? And, you know, how do you make sure that the mid-tier PC companies kind of have enough that their customers, when you need them down the road, just how are you kind of thinking about balancing the allocation across these different markets?\n\n**Sumit Sadana** (Chief Business Officer)\nWith a lot of difficulty. Certainly, there are competing requirements. We are not just focused on optimizing Gross Margin. Of course, when we think about pricing in different markets, we try to ensure that the pricing reflects the value of the product that we are selling, and so a lot of the margin performance of different segments starts to get very close to each other in situations like this. With that said, we have had customers of different sizes across different parts of the world for a number of years, decades sometimes, and so we are very mindful of our responsibility to them.\n\n**Sumit Sadana** (Chief Business Officer)\nWe try to do our best to manage the allocation in an appropriate way to ensure diversity across segments, ensure that we are supporting our strategic customers, and doing the best to maximize our supply towards these customers in times like this, as well as to minimize any impacts that could occur to our customers' business due to lack of adequate DRAM on that, as the case may be.\n\n**Joseph Moore** (Managing Director)\nThat's helpful. Thank you. And then just my follow-up. You mentioned a few minutes ago, you know, paying down some debt. I mean, it seems like you're going to generate a really large amount of cash here in the next few quarters if your view that gross margins continue to improve comes true. Just what are the priorities for that cash over time, you know, just between dividend, buybacks, you know, or other uses of cash that you might think about?\n\n**Mark Murphy** (CFO)\nYeah, Joe, the priority for our cash generation is always to reinvest in the business. So we're going to make sure that we're, you know, investing in this case the capacity we need to support the market and ensure that we're getting a clear line of sight to return on that. And, you know, and that includes in this case now looking to strike commercial arrangements with customers that reflect the value of our products and our assurance on supply. So that's priority. And also with that, you know, maintaining, you know, the technology leadership that we enjoy today and that we intend to maintain. You know, the balance sheet also will always be a priority. And, you know, that's moving the right direction. It was already strong and getting stronger every day. In fact, today on this call, we're record liquidity.\n\n**Mark Murphy** (CFO)\nYou know, we recently got put on positive watch by one of the agencies. You know, we effectively have no net leverage now. In fact, we're positive cash, net cash. Our gross leverage is very low. Now, we do have on an absolute basis more debt than we've had historically. So we would expect to bring that down some. You know, we would, as we've said before, intend to grow the dividend over time. You know, repurchase shares with excess liquidity that we believe we have. Now, we repurchased $300 million in the first quarter. If you recall, I mentioned a couple of quarters ago, I believe, that when we signed the definitive agreement for the CHIPS Program, our repurchases have some limitations. You know, for the first two years, we've ended that first year. We're in that limitation period the second year.\n\n**Mark Murphy** (CFO)\nWe are able to buy back some stocks this year a little bit more than what we bought back in the first quarter. But then we're this time next year, we're largely unconstrained. I mean, there are some requirements on CapEx and R&D, which we'll, you know, we believe we'll easily be able to surpass those. So I think that's the rough cut of the capital allocation.\n\n**Joseph Moore** (Managing Director)\nThanks so much.\n\n**Operator**\nOur next question comes from the line of Tom O'Malley of Barclays. Please go ahead, Tom.\n\n**Thomas O'Malley** (Director of Equity Research)\nHey, guys, I just have one. Could you remind us what's the mix of your CapEx this year? How much was construction CapEx? Or if you haven't given that, what are the trends on a normalized basis. Thanks.\n\n**Manish Bhatia** (EVP of Global Operations)\nYeah, Tom. So we haven't, but we did say, I think Mark did say that from fiscal year 2025 to 2026, we're doubling our construction CapEx. That gives you some sense. We got, you know.\n\n**Thomas O'Malley** (Director of Equity Research)\nYeah. Just looking for the base.\n\n**Manish Bhatia** (EVP of Global Operations)\nYeah. Higher. Yeah. Yeah.\n\n**Operator**\nThank you. And ladies and gentlemen, we have reached the end of our time. So that does conclude today's conference call. Thank you for participating. You may now disconnect.",
      "fetched_at": "2026-02-04T15:48:29.104Z"
    },
    {
      "ticker": "MU",
      "title": "Micron Technology, Inc. (MU) Q1 FY2026 earnings call transcript",
      "published_date": "Dec 17, 2025, 4:30 PM EST",
      "fiscal_year": "2026",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/MU/earnings/MU-Q1-2026-earnings_call-389074.html",
      "content": "**Operator**\nAs a reminder, today's program is being recorded. And now I'd like to introduce your host for today's program, Satya Kumar, Investor Relations. Please go ahead, sir.\n\n**Satya Kumar** (Head of Investor Relations)\nThank you, and welcome to Micron Technology's Fiscal First Quarter 2026 Financial Conference Call. On the call with me today are Sanjay Mehrotra, our Chairman, President, and CEO, and Mark Murphy, our CFO. Today's call is being webcast from our Investor Relations site at investors.micron.com, including audio and slides. In addition, a press release detailing our quarterly results has been posted on the website, along with the prepared remarks for this call. Today's discussion contains forward-looking statements that are subject to risks and uncertainties. These forward-looking statements include statements regarding our future financial and operating performance, as well as trends and expectations in our business, contractual terms, market, industry, products, and regulatory and other matters. These statements are based on our current assumptions, and we assume no obligation to update these statements.\n\n**Satya Kumar** (Head of Investor Relations)\nPlease refer to our most recent financial reports on Forms 10-K, Forms 10-Q, and our other filings with the SEC for more information on the risks and uncertainties that could cause actual results to differ materially from expectations. Today's discussion of financial results is presented on a non-GAAP financial basis unless otherwise specified. A reconciliation of GAAP to non-GAAP financial measures can be found on our website. I'll now turn the call over to Sanjay.\n\n**Sanjay Mehrotra** (CEO)\nThank you, Satya. Micron had an outstanding start to fiscal 2026, delivering fiscal Q1 revenue, gross margin, and EPS well above the high end of our guidance. This financial performance was driven by our strong execution across end markets and products in a tight supply environment. We achieved a number of records in fiscal Q1. Total company revenue, DRAM and NAND revenue, as well as HBM and data center revenue, and revenue in each of our business units also reached new records. We have completed agreements on price and volume for our entire calendar 2026 HBM supply, including Micron's industry-leading HBM4. We forecast an HBM TAM CAGR of approximately 40% through calendar 2028, from approximately $35 billion in 2025 to around $100 billion in 2028. This $100 billion HBM TAM milestone is now projected to arrive two years earlier than in our prior outlook.\n\n**Sanjay Mehrotra** (CEO)\nRemarkably, this 2028 HBM TAM projection is larger than the size of the entire DRAM market in calendar 2024. We are excited about our customized HBM4E customer engagements, which offer further differentiation opportunities to us, and we continue to make excellent progress on our HBM roadmap. Memory is now essential to AI's cognitive functions, fundamentally altering its role from a system component to a strategic asset that dictates product performance from data center to the edge. This structural shift means that system capabilities heavily rely on advanced memory for real-time contextual processing, which is vital for achieving autonomous and intelligent behaviors in AI data centers, as well as in applications ranging from self-driving cars to advanced medical diagnostics.\n\n**Sanjay Mehrotra** (CEO)\nWith our technology leadership, differentiated product portfolio, strong operational execution, and solid balance sheet, Micron is in the best competitive position in its history and is one of the semiconductor industry's biggest enablers of AI. We anticipate substantial new records in revenue, gross margin, EPS, and free cash flow for both the second quarter and the full fiscal year 2026, and we expect our business performance to continue to strengthen through the year. Sustained and strong industry demand, along with supply constraints, are contributing to tight market conditions, and we expect these conditions to persist beyond calendar 2026. We are making progress with customers in our discussions for multi-year contracts with specific commitments. Simultaneously, we are focused on maximizing our production output from our current footprint, ramping our industry-leading technology nodes, and investing in new cleanroom space to add to our supply capability.\n\n**Sanjay Mehrotra** (CEO)\nMicron's technology leadership is foundational to our strong competitive position. Micron has led the industry for four consecutive technology nodes in DRAM and three nodes in NAND, with progressively faster yield ramps in every node. Our 1 gamma DRAM node is ramping well. 1 gamma will be the primary driver of our DRAM bit growth in calendar 2026 and will be the majority of our bit output in the second half of the calendar year. Looking beyond 1 gamma, development is underway for 1 delta and 1 epsilon nodes, which will feature innovations that we expect to extend our differentiation and technology leadership. In NAND, we are ramping our G9 node with robust yield ramps across both data center and client SSDs. Our QLC NAND mix, including G9 QLC, reached a record high during the quarter.\n\n**Sanjay Mehrotra** (CEO)\nTechnology transitions to G9 will be the primary driver of our NAND bit growth in calendar 2026, and we expect it to become our largest NAND node later in fiscal 2026. I'm pleased to report that calendar 2025 is a record year for Micron in terms of both internal and customer quality measures, positioning us well to deliver for our customers as the memory industry's quality leader. As our products are increasingly integrated into higher value applications, our leadership in quality is becoming a more important differentiator. Turning to our end markets, as the world's leading technology companies advance toward artificial general intelligence and transform the global economy, our customers are committing to an extraordinary multi-year data center build-out. This growth in AI data center capacity is driving a significant increase in demand for high-performance and high-capacity memory and storage.\n\n**Sanjay Mehrotra** (CEO)\nServer unit demand has strengthened significantly, and we now expect calendar 2025 server unit growth in the high teens % range, higher than our last earnings call outlook of 10%. We expect server demand strength to continue in 2026. Server memory and storage content and performance requirements continue to increase generation to generation. Micron has a differentiated portfolio of high-value data center solutions to address these requirements, including our HBM, high-capacity server memory solutions, and data center SSDs. Micron's HBM4, with industry-leading speed over 11 gigabits per second, is on track to ramp with high yields in the second calendar quarter of 2026, consistent with our customers' product ramp plans. Our HBM4 uses advanced CMOS and advanced metalization process technologies on the base logic die and DRAM core dies, which are designed and manufactured in-house.\n\n**Sanjay Mehrotra** (CEO)\nThis, along with our unique HBM design, packaging, and test capability, enables Micron's industry-leading performance and low-power leadership. Micron pioneered the adoption of LPDRAM in the data center. Micron's low-power DRAM server modules consume one-third the power of DDR DRAM server modules. Building on this leadership, we have sampled our 192-gigabyte LPCAMM2 product, which enables a 50% increase in capacity per module and a rack-scale LPDRAM density of over 50 terabytes. Our data center NAND portfolio revenue exceeded $1 billion in fiscal Q1, and we are seeing strong momentum across our data center SSD portfolio, enabled by our leadership NAND technology. In the performance SSD category, Micron has introduced the world's first PCIe Gen 6 SSD, leveraging our G9 NAND. We are seeing rapidly increasing qualification commitments for this product, including at hyperscalers.\n\n**Sanjay Mehrotra** (CEO)\nIn mainstream storage, our SSDs based on G9 NAND are already seeing robust demand in the first quarter of calendar 2026. In capacity storage, our QLC-based 122- and 245-terabyte G9 SSDs are entering qualification at multiple hyperscale customers. PC demand continues to be driven by Windows 10 end-of-life and AI PCs. We forecast PC unit sales to grow high single-digit % range in calendar 2025, above our prior expectations provided in our last earnings call of mid-single digits. As we look ahead into 2026, we expect these demand drivers to continue, while memory supply constraints may affect some PC unit shipments. Micron has completed multiple OEM qualifications of our 16-gigabit 1-gamma-based DDR5 and our G9-based PCIe Gen 4 QLC SSDs. Turning to mobile, smartphone unit volumes in calendar 2025 are on track to grow in the low single-digit % range. AI is driving memory content growth.\n\n**Sanjay Mehrotra** (CEO)\nThe shipment mix of flagship smartphones with 12 gigabytes of DRAM increased to 59% in calendar Q3, more than twice the level from a year ago. Micron is accelerating innovation across our mobile DRAM portfolio. In fiscal Q1, we began sampling our breakthrough 1-gamma 16-gigabit LPDDR6 product to leading OEM and ecosystem partners, marking a major milestone in next-generation memory technology. LPDDR6 will power AI at the edge, delivering over 50% higher performance and improved power efficiency for flagship smartphones and AI PCs. Micron also sampled our 1-gamma LP5X 24-gigabit product and began volume shipments of the previously announced 1-gamma LP5X 16-gigabit product to multiple OEMs. Turning to auto, industrial, and embedded. In automotive, L2 plus and L3 adoption is driving robust demand today, and our customers' roadmaps indicate a significantly higher memory content in fully automated vehicles.\n\n**Sanjay Mehrotra** (CEO)\nMicron is uniquely positioned for growth with our differentiated product portfolio and automotive market share leadership. Our ASIL-rated LPDDR5X and UFS 4.1 NAND products, optimized for automotive and advanced robotics that include bandwidth-enhancing features, are seeing strong demand and have already secured billions of dollars in design wins. In industrial, demand continues to strengthen, driven by the growing adoption of autonomous systems across various applications. Long-term demand trend trajectory remains robust for memory and storage in industrial applications, such as in factory automation, aerospace and defense, humanoid robotics, edge networking, and video surveillance. Across both auto and industrial markets, LPDDR4X and DDR4 are also experiencing strong demand, and we are making investments to provide long-term supply from our Manassas, Virginia fab. Now turning to our market outlook.\n\n**Sanjay Mehrotra** (CEO)\nOver the last few months, our customers' AI data center build-out plans have driven a sharp increase in demand forecasts for memory and storage. We believe that the aggregate industry supply will remain substantially short of the demand for the foreseeable future. The dramatic increase in HBM demand is further challenging the supply environment due to the 3:1 trade ratio with DDR5, and this trade ratio only increases with future generations of HBM. Additional cleanroom space is necessary to address this increased demand and lead times for cleanroom build-out are lengthening across geographies. Together, these demand and supply factors are driving tight industry conditions across DRAM and NAND, and we expect tightness to persist through and beyond calendar 2026. Calendar 2025 DRAM and NAND industry bit demand growth expectations are higher than in our last earnings call outlook.\n\n**Sanjay Mehrotra** (CEO)\nWe now expect calendar 2025 DRAM bit demand growth to be in the low 20% range versus high teens previously. We expect 2025 NAND bit demand growth to be in the high teens percentage range versus low to mid teens previously. We expect calendar 2026 industry DRAM and NAND bit shipment growth to be constrained by industry supply. We expect both DRAM and NAND calendar 2026 industry bit shipments to increase around 20% from 2025 levels. Micron is working hard to support our customers' demand during this time, and we expect to grow our DRAM and NAND bit shipments approximately 20% in calendar 2026. Despite significant efforts, we are disappointed to be unable to meet demand from our customers across all market segments. Micron plans to increase our fiscal 2026 CapEx to approximately $20 billion versus our prior estimate of $18 billion.\n\n**Sanjay Mehrotra** (CEO)\nThis increase will primarily support our HBM supply capability and also our 1-gamma supply in calendar 2026. We are pulling in equipment orders and accelerating installation timelines to maximize output capability. Micron is also investing across our global manufacturing footprint to add supply to support longer-term demand. We are seeing an enthusiastic customer response to our planned U.S. supply. We are pulling in our first Idaho fab timeline, and we now expect first wafer output in mid-calendar 2027, earlier than our prior expectation of second half calendar 2027. Earlier this year, we announced our plans for the second Idaho fab, which will begin construction in 2026 and be operational by the end of 2028. We are making good progress on securing necessary permits for our New York site and appreciate the partnership with the state of New York and the Trump administration.\n\n**Sanjay Mehrotra** (CEO)\nWe plan to break ground on our first New York fab in early calendar 2026, which we expect will provide supply in 2030 and beyond. In Japan, with the support of METI, we are making technology and manufacturing investments. We are enabling future DRAM technology transition in coordination with our Boise R&D team. We are also adding cleanroom space in our Hiroshima fab to support these advanced nodes, which will increase production scale and optimize fab economics. In Singapore, our HBM advanced packaging facility is on track to contribute meaningfully to our HBM supply in calendar 2027. As HBM becomes a part of our Singapore manufacturing footprint, we expect opportunities for synergies between NAND and DRAM production. We are pleased with the progress on our assembly and test facility in India, which has initiated pilot production and will ramp in 2026.\n\n**Sanjay Mehrotra** (CEO)\nAs we make progress on our strategic manufacturing initiatives, we will continue to be responsive to the market environment and disciplined with our CapEx plans. I will now turn it over to Mark for our fiscal Q1 financial results and outlook.\n\n**Mark Murphy** (CFO)\nThank you, Sanjay, and good afternoon, everyone. Micron delivered strong financial results for the fiscal first quarter, with revenue, gross margin, and EPS all exceeding the high end of our guidance. During the quarter, we generated record-free cash flow, reduced our debt, and returned to net cash. Total fiscal Q1 revenue was $13.6 billion, up 21% sequentially and up 57% year over year, setting a quarterly record for the third consecutive quarter. We saw sequential revenue growth across all our business units. Fiscal Q1 DRAM revenue was a record $10.8 billion, up 69% year over year, and represented 79% of total revenue. Sequentially, DRAM revenue increased 20%.\n\n**Mark Murphy** (CFO)\nBit shipments were up slightly, and prices increased approximately 20%, driven by tight industry DRAM supply, pricing execution, and favorable mix. Fiscal Q1 NAND revenue was a record $2.7 billion, up 22% year over year, and represented 20% of Micron's total revenue. Sequentially, NAND revenue increased 22%. NAND bit shipments increased in the mid- to high single-digit % range, and prices increased in the mid-teens % range, driven by tight NAND industry supply, pricing execution, and favorable mix. The consolidated gross margin for fiscal Q1 was 56.8%, up 11 percentage points sequentially. This improvement was driven by higher pricing, with strong cost execution and favorable mix. Now turning to quarterly financial performance by business unit. Cloud memory business unit revenue was a record $5.3 billion and represented 39% of total company revenue. CMBU revenue was up 16% sequentially, driven by an increase in bit shipments and higher prices.\n\n**Mark Murphy** (CFO)\nCMBU gross margins were 66%, higher by 620 basis points sequentially, supported by cost execution and higher pricing. Core data center business unit revenue was a record $2.4 billion and represented 17% of total company revenue. CDBU revenue was up 51% sequentially, driven by robust bit shipments and higher pricing. CDBU gross margins were 51%, up 990 basis points sequentially, supported by higher pricing and cost execution. Mobile and client business unit revenue was a record $4.3 billion and represented 31% of total company revenue. MCBU revenue was up 13% sequentially, driven by higher pricing, partially offset by lower bit shipments. MCBU gross margins were 54%, up 17 percentage points sequentially, driven primarily by higher pricing. Automotive and embedded business unit revenue was a record $1.7 billion and represented 13% of total company revenue. AEBU revenue was up 20% sequentially, driven by higher bit shipments and higher pricing.\n\n**Mark Murphy** (CFO)\nAEBU gross margins were 45%, up 14 percentage points sequentially, driven primarily by higher pricing. Operating expenses in fiscal Q1 were $1.3 billion, up $120 million quarter over quarter and in line with our guidance range. The sequential increase was driven by higher R&D expenses in support of technology and product development on our new DRAM and NAND technology nodes. We generated operating income of $6.4 billion in fiscal Q1, resulting in an operating margin of 47%, up 12 percentage points sequentially and 20 percentage points year over year. Fiscal Q1 taxes were $977 million on an effective tax rate of 15.1%. Non-GAAP diluted earnings per share in fiscal Q1 was $4.78, with 58% sequential growth and 167% versus the year-ago quarter. Turning to cash flow and capital expenditures.\n\n**Mark Murphy** (CFO)\nIn fiscal Q1, operating cash flows were $8.4 billion, and capital expenditures were $4.5 billion, resulting in free cash flow of $3.9 billion. Fiscal Q1 free cash flow was a quarterly record, exceeding our prior record in fiscal Q4 2018 by over 20%. Ending inventory for fiscal Q1 was $8.2 billion, down $150 million sequentially, with days of inventory at 126 days. DRAM inventory days remained tight and below 120 days. On the balance sheet, we held $12 billion of cash and investments at quarter end and maintained $15.5 billion of liquidity when including our untapped credit facility. In fiscal Q1, we repurchased $300 million of shares as permitted by the terms of the CHIPS agreement. During the quarter, we also reduced debt by $2.7 billion, paying off a $1 billion balance of term loans and redeeming $1.7 billion of senior notes.\n\n**Mark Murphy** (CFO)\nWe closed the quarter with $11.8 billion of debt and a net cash balance over $250 million. Through the fiscal year, we expect to further strengthen our balance sheet as we generate additional free cash flow. Before turning to our outlook, I would like to share an update on how we are benefiting from AI use across Micron. Today, over 80% of our professional workforce actively uses GenAI, with total usage up tenfold since last year. In manufacturing, integrating AI into yield and quality management has cut root cause identification time by half in cases. Our coding teams are realizing productivity gains of 30% or more using agentic AI. In R&D, GenAI is accelerating development by reducing cycle times in design verification, product validation, issue triage, and root cause analysis. Across business functions, GenAI is broadening automation opportunities, and we are deploying conversational analytics to accelerate and improve decision-making.\n\n**Mark Murphy** (CFO)\nWe expect Micron's use of AI across the enterprise to further strengthen our competitiveness in the coming years. Now turning to our outlook for the fiscal second quarter. Industry demand is greater than supply for both DRAM and NAND. We expect higher price, lower cost, and favorable mix to all contribute to gross margin expansion in Q2. Operating expenses for fiscal Q2 are projected to be approximately $1.38 billion. As mentioned last quarter, Micron's fiscal Q4 2026 OpEx will also reflect the effect of an additional work week in this 53-week fiscal year. We expect a fiscal Q2 and fiscal year 2026 tax rate of around 15.5%. Micron is investing in a disciplined manner across our global manufacturing footprint to better meet demand.\n\n**Mark Murphy** (CFO)\nTo address tight supply-demand conditions extending beyond 2026, we now project our capital spending in fiscal 2026 to be approximately $20 billion, weighted to the second half of the fiscal year. We expect free cash flow to strengthen in fiscal Q2, and we expect to generate significantly higher free cash flow year over year in fiscal 2026. Any impacts that may occur due to potential new tariffs are not included in our guidance. With all these factors in mind, our non-GAAP guidance for fiscal Q2 is as follows. We expect revenue to be a record $18.7 billion, plus or minus $400 million. Gross margin to be in the range of 68%, plus or minus 100 basis points. Operating expenses to be approximately $1.38 billion, plus or minus $20 million.\n\n**Mark Murphy** (CFO)\nBased on a share count of approximately 1.15 billion shares, we expect EPS to be a record $8.42 per share, plus or minus $0.20. I'll now turn it over to Sanjay to close.\n\n**Sanjay Mehrotra** (CEO)\nThank you, Mark. AI-driven demand is here, and it is accelerating. Micron is capturing these opportunities with the best competitive position in its history. This success is built on the strength of our global team, and I want to thank our team members worldwide for their hard work and dedication. We are in the most exciting time in Micron's history, and the best is yet to come. We will now open for questions. Operator, can you queue up the questions?\n\n**Operator**\nYes, sir. I show our first question comes from the line of Timothy Arcuri from UBS. Timothy Arcuri from UBS, your line is open.\n\n**Timothy Arcuri** (Analyst)\nThanks a lot.\n\n**Timothy Arcuri** (Analyst)\nSanjay, I wanted to ask you about customer LTAs. I know we're hearing about D5 that's being bundled with HBM, and in some cases even NAND. So can you just talk about these LTAs? I know it sounds like these are stretching out through 2026 and in some cases even into 2027. I've even heard of some stuff into 2028. So can you talk about the nature of these LTAs? And then I had a follow-up as well. Thanks.\n\n**Sanjay Mehrotra** (CEO)\nThese are multi-year contracts that we are in discussions with several of our key customers. And these contracts, of course, involve DRAM as well as NAND. And with respect to terms, of course, these contracts that we are under discussions for are very different from prior LTAs. They have specific commitments in them and much stronger contract structure. And beyond that, I can't be giving you specifics at this point.\n\n**Sanjay Mehrotra** (CEO)\nOf course, in the future, if and when appropriate, we'll be sharing further details.\n\n**Timothy Arcuri** (Analyst)\nThanks. And then, Mark, I wanted to ask you about CapEx. So you took it up to $20 billion net, but it still seems, I mean, you're not guiding all fiscal 2026 revenue, so we don't really know what the capital intensity number is, but it seems like it's like 25%-30%, which is a little below your 35% metric that you usually think of. So is that because you're constrained because of FabSpace? And can you just talk about, does that sort of roll into fiscal 2027 where we would see CapEx up more near that 35% range? Thanks.\n\n**Mark Murphy** (CFO)\nThank you.\n\n**Timothy Arcuri** (Analyst)\nThank you.\n\n**Operator**\nAnd I show our next question in the queue comes from the line of CJ Muse from Cantor Fitzgerald. Please go ahead.\n\n**C.J. Muse** (Senior Managing Director and Analyst)\nBack to you. Back to you.\n\n**Operator**\nCJ Muse, your line is open.\n\n**C.J. Muse** (Senior Managing Director and Analyst)\nYeah, yeah. They didn't answer the priorquestion.\n\n**Sanjay Mehrotra** (CEO)\nOperator?\n\n**Operator**\nYes, sir.\n\n**Sanjay Mehrotra** (CEO)\nCan you turn it back to management so they can answer the prior question?\n\n**Operator**\nSure. Management's line is open. Please proceed. I believe the speaker's lines are muted at this time. Ladies and gentlemen, please continue to stand by. Your call will resume momentarily.\n\n**Mark Murphy** (CFO)\nOperator, can you hear us?\n\n**Operator**\nYes, we can now. You're unmuted, sir. Please proceed.\n\n**Mark Murphy** (CFO)\nOkay. I'm not sure what happened there. We were unmuted here. So I just want to make sure that you heard Sanjay's response, correct?\n\n**Timothy Arcuri** (Analyst)\nWe did not.\n\n**Mark Murphy** (CFO)\nYou did not hear Sanjay's response. Okay. Thanks, Tim. So Sanjay\n\n**Operator**\nWe heardno, I heard Sanjay's response to the first question, but I didn't hear your response, Mark, to my question on CapEx and on capital intensity.\n\n**Mark Murphy** (CFO)\nOkay, Tim. Okay, Tim. Thank you. So you're right, Tim.\n\n**Mark Murphy** (CFO)\nWe're not providing a full-year revenue guide. We did indicate that our CapEx was going up in calendar or in fiscal 2026. And a substantial part of that CapEx is to support DRAM and specifically HBM and the 1-gamma and 1-gamma ramp. I would say that from 2025 to 2026, the plan is roughly to double the brick-and-mortar construction CapEx. And at this time, we would expect 2027 CapEx to be up. But I want to emphasize that Micron is going to remain disciplined on CapEx growth to support bit demand and bit supply, and that supply will be in line with demand. As to your question of capital intensity, our capital intensity, of course, is dropping as the market conditions remain very constructive. And of course, we are working to be very efficient with our capital spend.\n\n**Timothy Arcuri** (Analyst)\nOkay, Mark. Thank you.\n\n**Mark Murphy** (CFO)\nThank you.\n\n**Operator**\nI show our next question comes from the line of CJ Muse from Cantor Fitzgerald. Please go ahead.\n\n**C.J. Muse** (Senior Managing Director and Analyst)\nYeah. Good afternoon. Thank you for taking the question. I guess, Mark, to follow up on the prior question around CapEx, the relative growth seems very conservative in the backdrop that we're in. And it feels like that you're just sitting here without cleanroom space. And it also doesn't sound like you're meaningfully pulling in cleanrooms. So can you talk about the philosophy there? And I guess what I'm taking away from your commentary is that you're being very conservative and judicious with adding capacity here.\n\n**Mark Murphy** (CFO)\nWell, I would say that we've been indicating issues with supply for several quarters, that we were working inventories down, that node transitions were going to be the principal source of supply growth in fiscal 2026. And that's exactly what's happening.\n\n**Mark Murphy** (CFO)\nWe know that cleanroom space takes time, and the HBM growth, which has only picked up with AI-driven demand, has further pressured supply. So there's no near-term solution. As we said in the prepared remarks, the entire industry, we expect to be short to demand. And we're no different in that case. But we are moving quickly to do our best to provide customer supply. And we have pulled in tools. We have accelerated construction in Idaho. We are doing everything we can within our existing footprint and near-term capacity expansions to deliver supply. And so we provided a bit growth number for 2026, and that is supply constrained.\n\n**Sanjay Mehrotra** (CEO)\nAnd I'll just add that, of course, we are continuing to make the investments in technology transitions in our existing footprint. And as we highlighted, that 1-gamma node will be a majority driver of our supply growth in 2026.\n\n**Sanjay Mehrotra** (CEO)\nOf course, you have seen us make investments not only in technology transitions, but also in greenfield capacity, but also enabling greater technology production capability in our existing cleanrooms in Japan. We are making the necessary investments there as well. Of course, we remain disciplined, but we are very much focused and trying to work hard toward increasing our supply there. We are pleased with our plans for Idaho 1, Idaho 2, and of course, New York as well. Of course, in the short term, we are very much focused on maximizing production efficiencies, maximizing our production output from the existing footprint as well. But yes, I mean, demand fundamentals are pretty strong, driven by AI from data center to edge with the build-out of our customers, and supply is significantly short.\n\n**Sanjay Mehrotra** (CEO)\nI would say that in the medium term, we are only able to meet about 50% to two-thirds of our demand from several key customers. We remain extremely focused on trying to increase the supply here and making the necessary investments.\n\n**C.J. Muse** (Senior Managing Director and Analyst)\nVery helpful. I guess as a follow-up for gross margins, obviously, the guide is quite stellar. But, curious, as you go through calendar 2026, how should we think about cost down across both DRAM and NAND? And as you transition from 3E to 4, is there anything that we should keep in mind or we should think about in contemplating our models where there might be higher costs temporarily giving yields or whatnot? Thanks so much.\n\n**Mark Murphy** (CFO)\nYeah. CJ, our cost execution has been very good across both DRAM and NAND. Of course, we're getting some volume leverage, but spend control has been very good.\n\n**Mark Murphy** (CFO)\nYields have been good. We do have some startup costs coming in for the new fabs, new construction across the network that starts to come in second half of 2026 and into 2027. But at these sizes of the business, at these levels, it's a relatively small impact on margin. We're not going to provide cost guidance for the rest of the year as it depends on many factors, including mix. But to our earlier question, I can say that we've talked about ramping one gamma DRAM and G9 NAND at length for supply in 2026. And those ramps are proceeding well and will be a tailwind or a cost as these nodes ramp. And regarding your question on HBM3E and HBM4, as we have said, we'll be beginning to ramp production of HBM4 in Q2 timeframe in line with our customer demands.\n\n**Mark Murphy** (CFO)\nAnd of course, our HBM 4 is progressing extremely well. Very pleased with our product, industry-leading product with the highest performance of over 11 gigabits per second. And so I mean, that's the highest performance. And very pleased with its overall yield ramp. And we expect our HBM 4 to be having a faster yield ramp than our HBM 3E. And of course, our mix of HBM 3E and HBM 4 during 2026 will be very much based on our overall customer demands. And we will have both of these products with strong profile in our 2026 revenue.\n\n**C.J. Muse** (Senior Managing Director and Analyst)\nThank you.\n\n**Operator**\nAnd I'll show our next question in the queue comes from the line of Harlan Sur from J.P. Morgan. Please go ahead. Good afternoon and great job on the quarterly execution.\n\n**Harlan Sur** (Analyst)\nJust over the past three to four months, as we track the different ASIC AI XPU programs, there's been a significant upper revision on ASIC XPU volume shipments next year. You have Google TPU, AWS Trainium, and so on, right? And all of these XPUs are still going to be using HBM3E. Have you, as the team, seen this near-term positive dynamic in your order book for 3E? And given that you're fully contracted for calendar 2026 and what appears to be growing upside to next year's view, how has the Micron team been trying to manage this upside dynamic in 3E alongside a strong HBM4 demand profile?\n\n**Sanjay Mehrotra** (CEO)\nSo as I mentioned to Harlan earlier that, of course, 2026 will have a mix of HBM3E and HBM4.\n\n**Sanjay Mehrotra** (CEO)\nAnd we have shared with you in the past that we are engaged with multiple customers, with the entire ecosystem here of HBM customers, and very much engaged with them. And they will all contribute to our strong year-over-year growth in revenue in 2026. And of course, that will be made up of both HBM3E and HBM4. So as I said, I mean, we will continue to manage the mix of the two based on customer requirements. I can tell you that in 2026, supply on HBM will be tight. Non-HBM DRAM will be tight as well. So we are continuing to see, as we have highlighted in our prepared remarks, tightening supply environment. And of course, we see strong year-over-year growth in 2026 for our HBM. We today upped our revenue forecast for HBM. We highlighted that by 2028, we expect it to be $100 billion TAM.\n\n**Sanjay Mehrotra** (CEO)\nThat's two years ahead of our prior outlook. Of course, HBM is on a good trajectory. What I can also tell you is that customers, as their architectures are evolving, as their platforms are evolving, and these are customers across the ecosystem, of course, they are requiring more and more HBM. I mean, the value of memory in terms of ability to deliver the AI capabilities and the functionality and the performance, memory is critical, and more HBM is required. That's across the various AI platforms in the industry. I appreciate that, Sanjay. After two to three quarters of enterprise SSD sort of muted trends, I believe the team saw a strong acceleration in the business, right? According to some of the third-party research estimates, I think your enterprise SSD business grew like 25% sequentially in the most recent quarter, right?\n\n**Sanjay Mehrotra** (CEO)\nSo you're the number three market share leader amongst eight or nine competitors, right? Very strong share position. Given, I would assume, increasing demand trends here, expanding lead times, is the Micron team also entering into long-term supply agreements with your ESSD customers? And then secondarily, I mean, SSD demand, is it more tied to expansion in inferencing workloads as customers aggressively move to monetization? In other words, is storage intensity higher on inferencing versus training workloads? So with respect to enterprise SSDs, really very proud of our engineering and business teams, and of course, our sales teams in terms of our customer engagement and the strong momentum and the share gains that we have with our enterprise SSD. Of course, our enterprise SSDs are a big part, an important part, let me say, of our data center strengthening mix.\n\n**Sanjay Mehrotra** (CEO)\nOf course, DRAM is continuing to increase in mix toward data center, but data center SSDs are an important part of our overall revenue mix. And we expect to continue to focus on share gains with our strong SSD roadmap, customer engagements, and great quality that we provide to the customers. And as I mentioned, that our multi-year contracts that we are in discussions with, with our several key customers, our SSDs, our data center SSDs are also part of that. And let me tell you that these multi-year contracts are not just about data center customers. They also are about multiple customers across our market segments here.\n\n**Sanjay Mehrotra** (CEO)\nAnd in terms of your questions on is the SSD requirement growing with inferencing versus training, what I can tell you is that in the data center AI applications, I mean, as the generative AI moves to more and more video, of course, that drives greater demand for more SSDs as well. So I mean, the rapid evolution of AI from training to inferencing and rapid evolution of AI models and applications, they're all driving greater growth of enterprise SSDs, yes, fueled by GenAI.\n\n**Sanjay Mehrotra** (CEO)\nThanks, Sanjay.\n\n**Operator**\nAnd now our next question comes from the line of Tom O'Malley from Barclays. Please go ahead.\n\n**Tom O'Malley** (Research Analyst)\nHey, guys. Thanks for taking my question. Sanjay, you've been helpful in the past about kind of talking about Micron's ramp in HBM and then also the ramp of the total market.\n\n**Tom O'Malley** (Research Analyst)\nYou gave some new color on HBM with the $35 billion moving at a 40% CAGR. But Micron specifically, I was curious if you could give us any color on percentage of the DRAM business today that's HBM from a dollar's perspective. And then on share as you move into next year, obviously, there's a large competitor that is looking to become more competitive at 3E. We haven't heard anything on 4 yet. How do you feel about your competitive positioning into next year? And do you think that you're going to make any strategic decisions differently based on the public certification of their memory in the next couple of months? Thank you very much.\n\n**Sanjay Mehrotra** (CEO)\nWe feel very good about our competitive position.\n\n**Sanjay Mehrotra** (CEO)\nWe feel very, very good about our product and our HBM4 product that we have highlighted as industry-leading performance over 11 gigabit per second, the best specifications in the industry with our performance. And of course, we feel very good about the power consumption in our products as well. In the past, we have shared with you about how our HBM3E is 30% lower power than any of the competitors in the industry. And we are maintaining that momentum of low power, which, in data center applications, is very important. So we are maintaining our performance and power and, of course, our strong capacity position with HBM4 roadmap as well. So we feel very good about our competitive position, about our roadmap, and our roadmap going beyond HBM4 for the future years, beyond 2026 as well.\n\n**Sanjay Mehrotra** (CEO)\nWe are very proud of our team's ability to execute successfully over the course of last several quarters in terms of ramping up production capabilities of HBM3E. We shared with you that in Q3, we reached our share of HBM3E to be in line with our I mean, our HBM share to be in line with our DRAM share. We have always highlighted that as we have reached that share, we will, particularly in this tight supply environment, we'll be managing the mix of our HBM as well as our non-HBM. All of it is in high demand. HBM as well as non-HBM has strong profitability. Looking at our strategic customer relationships as well as our overall profitability goals and growth objectives, we'll continue to manage that mix between HBM and non-HBM. Of course, HBM is growing.\n\n**Sanjay Mehrotra** (CEO)\nWe have highlighted how we expect the TAM to be $100 billion by 2028, a couple of years ahead of our prior projection. Of course, we will grow our HBM as well. 2026 will see a strong year-over-year growth in our HBM. In this tight supply environment, as I mentioned, the gap between the demand and supply for all of DRAM, including HBM, is really the highest that we have ever seen. I quantified it earlier as well. In this environment, of course, working closely with our customers, we are continuing to manage our mix of the product here.\n\n**Tom O'Malley** (Research Analyst)\nThank you, Sanjay.\n\n**Sanjay Mehrotra** (CEO)\nJust as we focus on also continuing to increase supply to better address our customers' demand requirements.\n\n**Tom O'Malley** (Research Analyst)\nPerfect. Then just as a follow-up, you've said historically kind of the $8 billion run rate.\n\n**Tom O'Malley** (Research Analyst)\nIf you look at November and February, you're taking up the total TAM. But any color specifically on HBM contribution in the November quarter and what you're expecting in the guide?\n\n**Sanjay Mehrotra** (CEO)\nWe are not really providing those specifics here in terms of the breakout. I mean, we highlighted that in FQ1, our HBM revenue was a record. We did highlight that, and beyond that, we are really not going to be providing the specifics in terms of revenue. And just would tell you again that year-over-year in 2026, we'll be seeing strong growth in our HBM revenue.\n\n**Tom O'Malley** (Research Analyst)\nThank you, Sanjay.\n\n**Sanjay Mehrotra** (CEO)\nAnd again, our product is very well positioned. So I mean, that's a very good place to be in in terms of managing overall mix of the business.\n\n**Tom O'Malley** (Research Analyst)\nThank you.\n\n**Operator**\nAnd our next question comes from the line of Krish Sankar from TD Cowen. Please go ahead. Yeah.\n\n**Krish Sankar** (Analyst)\nHi. Thanks for the good question, and congrats on the phenomenal results and guidance. My first question is for Mark. I know you spoke about the sustainability for next year. I'm kind of curious how to think about growth margins beyond the February quarter, like into May. Is it going to improve or sustain at these levels? How to think about the growth margins? And I'm going to follow up for Sanjay.\n\n**Mark Murphy** (CFO)\nThanks, Krish. We're not guiding margins beyond Q2. We did guide a record Q2, as you know, 68%, 11 points sequential improvement, 7 points better than the previous record. We did indicate that our business would strengthen through the year, and so we do believe margins can be up. We do believe that they will be up for DRAM and NAND.\n\n**Mark Murphy** (CFO)\nNow, keep in mind that at these high gross margin levels, mathematically, we get less in gross margin % for the same increase in price. So we would expect gross margins to expand beyond fiscal Q2, but we would expect that growth to be more gradual than what we've seen in the last couple of quarters, or the first quarter and the second quarter guide.\n\n**Krish Sankar** (Analyst)\nGot it. Thanks a lot, Mark. That's super helpful.\n\n**Mark Murphy** (CFO)\nAnd then finally, and Krish, just one last thing. We have indicated that strengthen through the year because we believe this constructive market environment will remain so through the year, these favorable market conditions. But we also were executing very well on cost. And as Sanjay mentioned earlier, we're deploying the bits to the valuable part of the market and where we can serve our customers best.\n\n**Krish Sankar** (Analyst)\nGot it. Super helpful, Mark. Thanks for that.\n\n**Krish Sankar** (Analyst)\nSanjay, just as a follow-up to the earlier question, I understand you don't want to put some boundary conditions, but a year ago, you totally nailed it when you said you're going to get HBM market share close to your DRAM market share, DRAM market share. So when you talk about 2028 CAGR of 40%, $100 billion TAM, how to think about Micron's HBM market share in that realm? Should you assume it's going to be in the low 20%, so that spectrum, or it's going to be lower? Thank you.\n\n**Sanjay Mehrotra** (CEO)\nKrish, again, we are not really going to be specifying the share. As we have said, we will be managing the mix of the business between HBM as well as our non-HBM.\n\n**Sanjay Mehrotra** (CEO)\nIt's like any other product in our portfolio that when you have a strong product roadmap across the portfolio, then of course, we manage the mix across our portfolio with all the strategic reasons and customer relationships in mind. So Krish, we are not really going to break that down. And all I would say is that in this current industry environment, which we see as durable industry fundamentals in the foreseeable future, we are in a very good position with all the tailwinds of our product portfolio. And of course, the increasing value of memory across the board, of course, HBM, but also non-HBM in data center and other markets, we will just remain very focused on managing the mix of our business and, of course, managing for the best in the midterm as well as keeping in mind the longer term.\n\n**Krish Sankar** (Analyst)\nThanks a lot, Sanjay. Appreciate it.\n\n**Operator**\nThank you. One moment for our next question. And our next question comes from the line of Chris Danely from Citi. Please go ahead.\n\n**Chris Danely** (Managing Direct and Semiconductor Analyst)\nHey, thanks, guys. So I just wanted to dig in on these long-term customer contracts you guys are negotiating. Can you give us any more sense of when you think you'll be able to sign these and then maybe just talk about what the holdup is? Is it just the unprecedented length or size? And given that the AI companies are asking for so much of your capacity, are you able to get them to more or less contribute to the building of a new fab? Thanks.\n\n**Sanjay Mehrotra** (CEO)\nSo we will not really get into the specifics around our contract discussions with our customers.\n\n**Sanjay Mehrotra** (CEO)\nBut again, I will highlight a couple of important factors that customers are concerned about long-term access to adequate memory in the environment that we are heading into. And that's leading to constructive dialogues with several key customers and across our multiple markets in terms of their supply as well as other important specific commitments related to these longer-term agreements. So not getting into the specifics, but as I highlighted, our contract structures that we are discussing are not like anything before. They are far stronger contract structures with specific commitments. And of course, different from prior contracts is that those used to be one-year contracts, and these are multi-year in nature as well. And as we look at addressing the customer discussions, of course, we have to look at our overall supply.\n\n**Sanjay Mehrotra** (CEO)\nAnd I have mentioned to you that in the midterm, medium term, we are only able to meet half to two-thirds of the demand from our several key customers. So all of that, as we are managing our customer relationships and keeping our strategic objectives in mind, all of that has to be taken into account as we manage our contract discussions. But really, not getting into the specifics here.\n\n**Chris Danely** (Managing Direct and Semiconductor Analyst)\nThat's still very helpful, Sanjay. Thanks. And for my follow-up, just a question on HBM and the pricing there. So given that the demand is so strong, I think you said you're sold out for 2026. Are you guys locked into a set price, or can you let that price more or less float a little bit given how strong demand is like DDR5 does, for example?\n\n**Sanjay Mehrotra** (CEO)\nWe are really pleased with our product position and our ability to work with our customers, as we highlighted in our prepared remarks, that our HBM for 2026 is sold out in terms of volume, and our negotiations with customers have been completed for calendar year 2026 for volume as well as pricing, and as we have always highlighted that our HBM has strong profitability and, of course, very much focused on ROI, and our non-HBM business also clearly has healthy profitability as reflected in the results that we produced as well as in the guidance that we have provided here.\n\n**Chris Danely** (Managing Direct and Semiconductor Analyst)\nGreat. Thanks, Sanjay, and congrats again on the results.\n\n**Sanjay Mehrotra** (CEO)\nThank you.\n\n**Chris Danely** (Managing Direct and Semiconductor Analyst)\nThank you.\n\n**Operator**\nOur next question comes from the line of Vivek Arya from Bank of America Securities. Please go ahead.\n\n**Vivek Arya** (Analyst)\nThanks for taking my questions.\n\n**Vivek Arya** (Analyst)\nSanjay, I'm curious, at what point does increasing memory price impact demand for electronics? If you set aside the data center and the AI market, do you see some elasticity? Do you see any impact on demand as you look into 2026 for more consumer and kind of traditional enterprise products? How does that shape where memory pricing can go next year?\n\n**Sanjay Mehrotra** (CEO)\nWe have highlighted in our prepared remarks that in some of the consumer markets, I mean, some of the unit demand may get impacted given semiconductor prices here, given memory prices here. And of course, some of the customers may have, for example, in smartphone and PCs, they may have some mixed adjustments in their portfolio as well to address available supply to them. But these are accounted for in our forecast that we have.\n\n**Sanjay Mehrotra** (CEO)\nAnd so, I mean, some of the possible impact on unit demand and some of the customer mix changes have been accounted for in our forecast. And we, of course, even then, we see a very, very tight supply environment here in the large gap between the demand and supply. However, I will highlight to you that AI experience across from data center to edge, including in these edge devices like smartphones and PCs and other devices, AI experience really more memory is essential. So without sufficient memory, that AI experience, the functionality, the capability does get impacted in these edge devices as well. So, I mean, the punchline here is that AI across the board from data center to edge is driving increase in content and increasing requirement for memory as the customers look ahead at their roadmaps.\n\n**Sanjay Mehrotra** (CEO)\nAnd that's why customers are, of course, working with us with respect to access to supply for their long-term multi-year plans here as well.\n\n**Vivek Arya** (Analyst)\nThank you.\n\n**Operator**\nThis concludes our Q&A session and today's conference call. At this time, I'd like to end today's conference call. Thank you all for participating. You may now all disconnect.",
      "fetched_at": "2026-02-04T15:48:32.923Z"
    },
    {
      "ticker": "MU",
      "title": "Micron Technology, Inc. (MU) Q4 FY2025 Post Call earnings call transcript",
      "published_date": "Sep 23, 2025, 6:00 PM EDT",
      "fiscal_year": "2025",
      "quarter": "Q4",
      "url": "https://finance.yahoo.com/quote/MU/earnings/MU-Q4-2025-earnings_call-359202.html",
      "content": "**Operator**\nThank you for standing by and welcome to Micron Technology's post-earnings analyst conference call. At this time, all participants are in a listen-only mode. After the speaker presentation, there will be a question-and-answer session. To ask a question during the session, you will need to press *11 on your telephone. To remove yourself from the queue, you may press *11 again. I would now like to hand the call over to Satya Kumar, Investor Relations. Please go ahead.\n\n**Satya Kumar** (Investor Relations)\nThank you, and welcome to Micron Technology's fiscal fourth quarter 2025 post-earnings analyst call. On the call with me today are Sumit Sadana, Micron's Chief Business Officer, Manish Bhatia, EVP of Global Operations, and Mark Murphy, our CFO. As a reminder, the matters we're discussing today include forward-looking statements regarding market demand and supply, market trends and drivers, and our expected results and guidance in other matters. These forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from statements made today. We refer you to documents that we have filed with the SEC, including our most recent Form 10-Q and upcoming 10-K for a discussion of risks that may affect our results. Although we believe that the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee future results, levels of activity, performance, and achievements.\n\n**Satya Kumar** (Investor Relations)\nWe are under no duty to update any of the forward-looking statements to confirm these statements to actual results. With that, we can now open up for Q&A.\n\n**Operator**\nThank you. As a reminder, to ask a question, you will need to press *11 on your telephone. Please limit yourself to one question and one follow-up to allow everyone the opportunity to participate. Please stand by while we compile the Q&A roster. Our first question comes from the line of Tom O'Malley of Barclays. Please go ahead, Tom.\n\n**Tom O'Malley** (Equity Research Director)\nHey, guys. Thanks for taking my question. My first one is just on the state of industry of NAND. Over the last couple of weeks, you've heard a lot of reports about hyperscalers stepping in. You've heard about tightness, pricing increases. If you look at your current quarter that you just reported, you had bits down in the quarter. I've tried a couple of different ways here to tell me if I'm crazy, but it seems like you need to have bits down again in your guide to kind of get there, largely driven by ASPs. Is that the right way to think about the world right now? Some of your peers are talking about some big growth going into the back half. Is that something that you're going to look to ease up with potentially some capacity additions?\n\n**Tom O'Malley** (Equity Research Director)\nAnything that you can comment on to the state of the world right now? Thanks.\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nYeah, hi. This is Sumit. I'll just take the question. In terms of the NAND industry, I wouldn't read too much into the bits for FQ4. It's really just noise based on a few things, different segments moving around in our mix. It's really just some mix-driven noise for the various segments. In terms of the demand profile and what is shaping up looking ahead, certainly, the large hyperscalers are looking like they will be needing significantly more storage capability for their AI server deployments because they have shortages on that side from the HDD segment of the market. The deployment of NAND SSDs in servers and data centers more broadly is going to increase in calendar 2026. We expect, driven by that tailwind, for the NAND industry conditions to start improving.\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nCertainly, our position in the data center SSD market, where we have been hitting record share after record share for several years now and have a really strong position in the market, allows us to benefit from that data center SSD competitive position that we have. We have announced a lot of new products. We have a very exciting portfolio. We expect to be able to leverage that going forward. I think the NAND industry will improve, with the improvement in the DRAM business definitely ahead from a time perspective. In terms of being tight, NAND is improving and getting tighter, but DRAM is tight already today and getting even tighter going forward.\n\n**Mark Murphy** (CFO)\nYeah, Tom, it's Mark. I would just add on the supply side, continue, you know, we structurally brought down wafer outs in NAND, continue to slow node transitions there and pace new node ramps. Still have low levels of CAPEX and still working down inventories there.\n\n**Manish Bhatia** (EVP of Global Operations)\nYeah, I was going to add, we're working down inventories, and now with our decision to exit managed NAND, you know, there'll be more supply availability for us to focus on the data center market as Sumit was mentioning.\n\n**Tom O'Malley** (Equity Research Director)\nHelpful. Just as a quick follow-up, if I look at the CAPEX guidance, you're saying kind of an annualized Q1, you get to $18 billion. I just want to make sure you're saying that's a net number. Obviously, something higher in aggregate. In your commentary in the slides, it seems like very little additional NAND spend and more on the DRAM side. Just on a very high level, I know you're not guiding specifically. Should we be taking away from this that you're moving from $13-something to close to $20-something and that incremental is largely a function of additional DRAM spend? Thank you.\n\n**Mark Murphy** (CFO)\nWe're just going to give in that number, Tom. We're saying that we're going to go from $13.8 billion net in 2025 to, you know, net approximately $18 billion in 2026. The vast majority of that is for DRAM construction and equipment.\n\n**Tom O'Malley** (Equity Research Director)\nThank you, Mark. Appreciate it, guys.\n\n**Operator**\nThank you. Our next question comes from the line of Joseph Moore of Morgan Stanley. Please go ahead, Joe.\n\n**Joe Moore** (Semiconductor Industry Analyst)\nGreat, thank you. Sanjay, early on in the call, talked about taking market share in HBM in calendar 2026, if I heard him right. I know that would sort of happen mechanically because you got to your target share towards the end of this year. You would gain share. Can you just talk about, you know, what are your share gain aspirations in HBM, if any? Are you content with holding your DRAM share? Does that need to go higher?\n\n**Sanjay Mehrotra** (Chairman, President, and CEO)\nYeah, in terms of our HBM share, you're right. We have ramped our share through calendar 2026, and we expect to be in the vicinity of our DRAM supply share in calendar Q3 in 2025. In 2026, for the full calendar year, we will expect to have higher share in HBM compared to calendar 2025. HBM has now become a very robust part of our portfolio, and we treat it like any other part of our portfolio where we focus on ROI of the portfolio, we focus on disciplined investments, we focus on getting to be the best from a product perspective and creating that value with our customers, and then ensuring that we are taking full advantage of the competitive landscape as it evolves over time. Those are some of the things we do.\n\n**Sanjay Mehrotra** (Chairman, President, and CEO)\nWe're not going to provide any more specifics beyond that, but that's how we are thinking about it.\n\n**Joe Moore** (Semiconductor Industry Analyst)\nOkay, that's helpful. Thank you. The gross margins in HBM, will that continue to be higher than, you know, sort of non-HBM DRAM? If given that you're locked in through most of 2025 and DDR5 is moving up, is it possible that that changes? Does that lock-in actually hurt you if DDR5 prices rise faster?\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nYeah, I mean, I don't think about the lock-in as \"hurting us\" because the two businesses, the HBM portion of it and the non-HBM DRAM, are just different types of businesses. The HBM business, we are working with customers with long lead times, long order visibility, lock-in of volumes, lock-in of pricing well ahead of time, a lot more stable ROI over the years. That kind of a profile is helpful because no matter what the rest of the business does, our expectation is that the HBM business will have higher through-cycle ROI. We manage that business in that different way. It creates a lot of value for our customers, and we have that expectation of a higher ROI for us in our portfolio.\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nNow, will there be times when the rest of the DRAM portfolio will become very profitable and can challenge or even exceed at times the profitability of the HBM business? Of course, that is possible. We don't think of that as a bad thing. We think of that as a positive thing that the whole business has become dramatically better. That's how we think of it as, you know, those outcomes are a good place to be because that means the whole industry is extraordinarily healthy from a supply-demand balance perspective, and that helps us drive really robust financial outcomes.\n\n**Joe Moore** (Semiconductor Industry Analyst)\nVery helpful. Thank you.\n\n**Operator**\nThank you. Our next question comes from the line of Jim Schneider of Goldman Sachs. Please go ahead, Jim.\n\n**Jim Schneider** (Senior Equity Analyst)\nGood evening. Thanks for taking my question. Two quick ones. One follow-up on Joe's question, which is, you know, just in general, given all the performance benefits you talked about relative to your position on an HBM4, would you expect your HBM4 share to be higher than it was for HBM3 in a sustainable way going forward?\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nI mean, we do feel we have very strong capabilities entering the HBM4 business. We certainly believe that we have the best HBM3E product in the world with highest performance and 30% lower power consumption than any other competitor. What we did not have at the start of the HBM3E business ramp, though, is that we didn't have that installed capacity and that base capability. We were ramping from very low levels. Now, with the very strong performance from our operations team, we have been able to get our capacity, our yields, our performance, our quality to extremely good levels. We have met our market share goal that we had articulated many quarters ago to you. We are starting off our HBM4 in a very different position in terms of being able to meet the expectations and requirements of our customers from a volume support perspective.\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nWe feel that from a competitive positioning, that aspect of the business is in much better shape. Now, with HBM4, there has been a lot of chatter in the market and the media about what is our HBM4 performance compared to those who are doing the baseline, the foundry, etc. We just wanted to mention and lay some of those doubts to rest that we today believe that our HBM4 has the highest performance amongst any competing product out there. We don't believe that others can match this performance with this level of capability, quality, power consumption, and so on. We believe that there'll be tremendous customer preference for our products. Of course, we have increases in our HBM supply that we have created through our investments. We have confidence that we will sell out that supply for calendar 2026.\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nThere may be some HBM share shifts happening on the competitive landscape, but it is our belief that most of that is most likely going to be between our two competitors rather than impacting our share in any material way.\n\n**Jim Schneider** (Senior Equity Analyst)\nThank you. As a follow-up on the CAPEX side, could you maybe give us some color on the split of WFE versus facility CAPEX you saw in fiscal 2025, and whether we should expect any significant change in that mix heading into next year? Thank you.\n\n**Mark Murphy** (CFO)\nJim, it's Mark. We're not going to provide that breakout, just that the vast majority of this spend is for DRAM construction and equipment.\n\n**Jim Schneider** (Senior Equity Analyst)\nthere any significant change in the facility piece of that for next year or two?\n\n**Mark Murphy** (CFO)\nWe're not going to comment on that. As you know, we're expanding in a number of sites, including, we talked about our first fab in Idaho, and we're also equipping those fabs as well.\n\n**Jim Schneider** (Senior Equity Analyst)\nOkay, thank you very much.\n\n**Operator**\nThank you.\n\n**Mark Murphy** (CFO)\nI should say equipping the fab and then also doing tech transitions.\n\n**Manish Bhatia** (EVP of Global Operations)\nYou mean, sorry, just to be clear, you're saying in Idaho, we're in construction. We expect production there.\n\n**Mark Murphy** (CFO)\nSecond half of 2027.\n\n**Manish Bhatia** (EVP of Global Operations)\nSecond half of 2027. We are investing in technology transitions and optimizing, you know, production across our footprint in Japan and Taiwan, where we have available clean-up space.\n\n**Operator**\nThank you. Our next question comes from the line of Chris Danely of Citi. Please go ahead, Chris.\n\n**Chris Danely** (Managing Director and Senior Semiconductor Equity Research Analyst)\nHey, thanks, guys. Can you hear me okay?\n\n**Mark Murphy** (CFO)\nYeah.\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nSo far.\n\n**Chris Danely** (Managing Director and Senior Semiconductor Equity Research Analyst)\nI've been having phone problems all day. Quick clarification. As far as the DRAM revs go, you guys gave us the HBM breakout. Can we assume, you know, roughly the same ratio for DDR4, roughly high single digits, and then the rest DDR5? Any commentary on the relative contributions to incremental gross margin between, say, you know, DDR5 and HBM?\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nYeah. We had said earlier to you that the DDR4 plus LP4, we had provided, you know, some guidance earlier. We are pretty close to those levels. I'm not going to say that it's going to sustain throughout the fiscal year because, you know, the mix changes over time. DDR4, just by itself, not counting LP4, has actually been a low single-digit % of the business. It's been relatively small. We have UL'd this. We have extended some of our UL timeline based on extreme shortages at customers. Of course, the margins have become dramatically better as this shortage has continued. I think that's that. I think in terms of the relative margin, if I understood your question correctly, relative margin between DDR and HBM, we are not going to comment on that because while the HBM, as I mentioned earlier, you know, they run like two different business models.\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nWhile the HBM pricing is set ahead of time for the upcoming calendar year, the pricing on the rest of the DRAM portfolio and, of course, NAND portfolio also is, you know, moving around based on quarterly trends. We have mentioned to you that the DRAM industry is tight. As we get into 2026, we expect it to further tighten due to all of the robust demand that we are seeing and the limits on the supply growth caused by a number of factors that were discussed. We believe that tightening is going to enable, you know, improving pricing and margins on the non-HBM portion of the portfolio. That will move around. It's not really practical or possible to give you sort of a relationship between the two.\n\n**Chris Danely** (Managing Director and Senior Semiconductor Equity Research Analyst)\nThat's great. That's still super helpful. For my follow-up question for Mark on gross margins. Mark, remember we had lunch earlier this year and I asked you about, you know, could you guys get back to 50% gross margin? You said it's possible. Who knows? Depends on a lot of things. It's going to be tough. Here we are, and now we're going past that. Can you just maybe talk about what changed or what was the key to that? What are the limiting factors on gross margin going forward? Is it just essentially a function of, you know, how many more quarters pricing keeps going up or is there something else going on as far as mix goes? Thanks.\n\n**Mark Murphy** (CFO)\nChris, since through the fourth quarter, the market conditions continue to improve. As you know, we updated in mid-August the 11th, and we reported a margin 120 basis points higher than that update. Prices continue to improve. The market conditions are very good, very tight on DRAM, and they've improved in NAND and continue to improve. The margin we reported is now above where it was in mid-fiscal 2022, and DRAM margins are higher than that mid-2022 period. The operating margin's the highest that it's been since November 2018. From here, the NAND business can continue to improve. There's been good supply response by us, and we've focused on higher-value SSD products in that business. While that business is below 2022 levels, it can continue to improve, and that will help overall margins. Furthermore, as we talked about, DRAM is very tight now, and incremental supply is meaningful.\n\n**Mark Murphy** (CFO)\nIncremental supply is difficult to bring on. You have a number of factors that are structural here. Our inventory levels are low below targets. We've got this extended life on DDR4 LP4, which is constraining the ability to do techno transitions. You have obviously the silicon intensity of HBM as that continues to grow quickly. Incremental capacity, as you know, to bring on a fab takes a long time. For example, our new fab, Idaho, will come on in wafer production starts in meaningful wafer production starts in second half 2027. That constrained supply focus on diverting bits to the best products and also our continued good cost improvements, those all offer the ability to expand margins. We've indicated that we expect second quarter gross margin to be up relative to first.\n\n**Chris Danely** (Managing Director and Senior Semiconductor Equity Research Analyst)\nGreat. Thanks for your explanation, Mark.\n\n**Operator**\nThank you. Thank you. Our next question comes from the line of Vijay Rakesh of Mizuho. Please go ahead, Vijay.\n\n**Vijay Rakesh** (Managing Director)\nYeah, hi, Mark, Sumit and Manish. Just a quick question on the DRAM side. I know you mentioned one-gamma is starting now. If you look at the year, one-beta, which looks like most of the HBM4 will be on one-beta as well, any thoughts on what the mix will be for you, one-gamma versus one-beta now versus exiting the year, fiscal 2026, let's say?\n\n**Manish Bhatia** (EVP of Global Operations)\nYeah, sure. Thanks, Vijay. Manish, we are very pleased with one-gamma ramp. We were able to achieve both mature yield this quarter as well as first revenue shipments into hyperscaler as well as other applications. We are really, really pleased with how that ramp is going. We expect to be able to have one-gamma be the primary area that's going to be providing us bit growth for fiscal 2026 in terms of supply. We are going to be qualifying across multiple different product areas as we go through the year. We are already at a point where the one-gamma production plus the one-beta production are the significant majority of our bit output, and that mix will continue to grow towards one-gamma as we go through fiscal year 2026.\n\n**Mark Murphy** (CFO)\nYeah, I would just maybe add one thing. We talked quite a bit about supply constraints on the last question. A very important part of our supply solution in 2026 is this ramping of one-gamma DRAM, which, as Manish said, is going very well. Chris, just one additional note on your margin question is, you know, is this just improved mix to, in our business, the data center and the higher performance requirements of that market and the favorable effect of that on the business?\n\n**Vijay Rakesh** (Managing Director)\nGot it. On the HBM4, given your higher speeds and lower power, I guess the die's bigger too, in your own logic die. Would you expect the margins on HBM4 to be better versus HBM3E, I guess, equal high?\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nYeah, I mean, we are very confident in the capabilities of our product. Certainly, the HBM4 cost is higher than the HBM3 cost, and the HBM4 price will be meaningfully higher than the HBM3E price. We don't really talk about margins by product line or, you know, within a product line, you know, which product has what kind of relative margin. Overall, for HBM, we certainly expect that we'll have really good ROI capability for many years for the company, not just driven by the huge complexity of HBM, but also driven by the dramatic value it creates for our customers and our intent to, you know, ensure that we are benefiting from providing that value.\n\n**Vijay Rakesh** (Managing Director)\nGot it. Thanks.\n\n**Operator**\nThank you. Our next question comes from the line of Aaron Rakers of Wells Fargo. Your line is open, Aaron.\n\n**Aaron Rakers** (Managing Director)\nYeah, thanks for taking the question. I'll ask two as well. I guess kind of building on some of the prior questions, I'm curious, I know, Mark, you had talked about your ability to execute, I think it was high single-digit cost down with HBM in DRAM in fiscal 2025, and then I think it was teens or something, low teens on NAND. I'm curious if, you know, as we make these process node transitions as well as G9 NAND, how do you think about the cost down curve as these process nodes materialize through this next fiscal year?\n\n**Mark Murphy** (CFO)\nJust to be clear, I think on cost downs, we gave for fiscal 2025 are slightly better than high single digits for DRAM front-end XHBM and mid-teens for NAND. I think as, and then for DRAM with HBM, down low single-digit % and NAND cost reductions, low teens. These are consistent with commentary we've given in the past that, you know, at that or better.\n\n**Aaron Rakers** (Managing Director)\nOkay. I'm curious, just structurally, the NAND market, you know, there's a lot of discussion around these high-cap enterprise SSDs pushing 250 terabytes and plus. As we look at that market, I'm curious how you guys see the average capacity trending on these AI servers for SSDs and whether we should really be expecting that to inflect materially higher as we move through fiscal 2026 and some of these high-cap drives really, you know, hit true volume.\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nYes, I think the average capacities are going to continue to escalate rapidly. We had 60-terabyte drives and then, you know, 102-terabyte drives. We have ourselves announced at our last SMS event 122-terabyte drives, 245-terabyte drives. We are very excited with the demand that we see for these drives. We do think there will be meaningful uptake of these high-capacity drives, and they will drive the average capacities higher. I also mentioned that, you know, there is expected to be a shortage of hard drive storage for these hyperscalers. More meaningful usage of NAND even beyond previous plans should drive a positive outcome here as well as an added tailwind.\n\n**Aaron Rakers** (Managing Director)\nWhere do you think the average capacity is today per server? Just curious.\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nIt's moving around quite a bit because in any given quarter, the mix of general-purpose servers and AI servers keeps changing. AI servers generally tend to use the highest capacity that is available in very meaningful quantities. AI servers are focused on just ensuring a huge amount of capacity. With different workloads of inference that are also increasing, more fragmentation is happening in the configurations that are getting shipped. Generally speaking, the highest capacity drives that the industry has been able to produce do get used by AI servers. They are going from 100, they're going from 60 terabytes to 120 and actively using a lot of 245 going forward.\n\n**Aaron Rakers** (Managing Director)\nThank you.\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nWelcome.\n\n**Operator**\nThank you. Our next question comes from the line of Brian Chin of Stifel. Please go ahead, Brian.\n\n**Brian Chin** (Director of Semiconductor Capital Equipment and Semiconductor-Memory)\nHi there. Thanks for letting us ask a few questions. Maybe I know there's a couple of questions on cost down or cost reduction, but I was just curious. You've obviously talked about in the past HBM3E, some efficiencies you've gained as you've kind of moved into relative maturity from where you started. I know you don't want to provide too much detail around pricing in 2026 for 3E. While your tone does suggest you should have sufficient leverage, I guess, in terms of those negotiations. I'm wondering, is there more efficiency in terms of an improvement in assembly and packaging yields for 3E that maybe could also help you out a little bit in terms of margin profile next year? Thanks, Brian. We are very happy with how the HBM3E 12-high ramp has gone.\n\n**Brian Chin** (Director of Semiconductor Capital Equipment and Semiconductor-Memory)\nWe talked about being able to get our yields to maturity on 12-high significantly faster than we did on 8-high, which was really our first major HBM volume node. We've now gotten production capacity up to meaningful volumes as we kind of gave you. There will be continued opportunity, but I would say that really the biggest part of that benefit in ramp has happened as we've gone through the 12-high over the last couple of quarters. Got it. I appreciate that. Maybe a quick follow-up. I know there's been some discussion here about your guys re-attaining this 50%+ blended gross margin, first time since the 2017, 2018 timeframe. I know you wouldn't recast or you can't recast cloud and core enterprise server revenue back that far. You did give us the sequential and the year-over-year compare today. Those segments are roughly mid-50% of sales now.\n\n**Brian Chin** (Director of Semiconductor Capital Equipment and Semiconductor-Memory)\nWhat roughly did they represent back then? Clearly, it must have been a much smaller proportion. That's obviously a structural shift in the business period to period.\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nYeah, I mean, without giving you specifics for any one particular timeline, I'll just mention to you that most segments that are part of the TAM over the different time horizons in the past prior to generative AI coming on the scene had peaked around a third of the overall market in terms of segment size, right? If you think about the data center segment or you think about the mobile segment, when they would go into this big spurt, it would peak around, roughly speaking, give or take, a third of the overall market. This time around, of course, that pseudo ceiling of a third is no longer in place because the data center has become more than half and continues to outgrow the rest of the market at very robust profitability levels. We do think that AI has radically changed the landscape.\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nNot only is the mix due to AI growth in the data center caused the data center to become a much larger part of the TAM, but it is also a higher value as well as a higher margin opportunity. We did mention that HBM and high-capacity DIMMs and the LP that goes into the data center, these three categories alone were $10 billion in fiscal 2025, so a very large part of our fiscal 2025 revenue. These are all high-value-add portions of the portfolio. This doesn't even account for regular DDR5 that is in 64GB and below type of DIMMs that are going into the data center. It doesn't account for data center SSDs that are part of the data center portfolio. There is a lot of that shift that is going on, but it's also a shift that has a lot of legs to continue.\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nThat's also the demand coming from the data center that's creating a lot of this tightness in the industry and causing pricing to and enabling us to be able to increase pricing across all of the segments of the market, not just the data center. It's helping the profitability of the entire portfolio of the company, even though it's driven largely from the data center.\n\n**Brian Chin** (Director of Semiconductor Capital Equipment and Semiconductor-Memory)\nGreat. Appreciate that.\n\n**Operator**\nThank you. Our next question comes from the line of Quinn Bolton of Needham & Company. Please go ahead, Quinn.\n\n**Quinn Bolton** (Managing Director and Equity Research)\nHey, Mark. Maybe I just missed your answer. I just want to clarify your answer to Aaron's question on the cost downs. You did low single digits in DRAM, inclusive of HBM, and low teens in NAND. Did you say that those are good ranges to think about in 2026, or did you not give a cost down target for fiscal 2026?\n\n**Mark Murphy** (CFO)\nWe just gave 25.\n\n**Quinn Bolton** (Managing Director and Equity Research)\nOkay. Thank you for that clarification. I guess maybe just kind of a bigger picture question. As you look at the inferencing market, NVIDIA recently introduced their CPX GPU that uses GDDR7 instead of HBM memory. To the extent that that architecture takes off, do you think that that lower HBM content on inferencing platforms would have any impact on your broader outlook for the HBM market over the next few years, or do you think that the CPX architecture represents sort of only a small portion of the inference market?\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nYeah, as the AI market continues to grow and evolve, it is for sure going to have a lot of different use cases come up, a lot of different types of workloads for which optimized architectures would have to be evolved. This is just another step in that direction. The AI market is going to become very, very big over time, and it is going to have needs that are not going to be one size fits all. That optimization will be necessary to scale out the capabilities in a cost-effective way. Certainly, this is just one example. There will be more in the future. One important thing to keep in mind as all of this happens is that a lot of the inference workloads tend to be memory-bound workloads.\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nConsequently, as inference becomes a larger and larger part of the AI market and over time will likely become, you know, 80% of the AI market over the years, a lot of that being memory-bound means customers will be looking for different architectures that increase memory capacity and memory bandwidth. Depending on the latency requirements and time-to-first token and those types of different KPIs that these architectures have to hit, different types of solutions will be appropriate for various workloads. We are having a strategy to ensure that we are very strong in HBM, as we have discussed at length. We have an industry-leading product with our GDDR7.\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nWe are the pioneers of LPDRAM in the data center, which is going to be used more and more over time, not just because of its energy efficiency, but because, you know, more industry players are going to, from an ecosystem perspective, from a CPU enablement perspective, going to start supporting LP over time. All of these capabilities that we have developed that are industry-leading will serve us really well. Our intent is to create those high-value solutions across the rich frontier of evolving architectures that our customers will be driving.\n\n**Quinn Bolton** (Managing Director and Equity Research)\nExcellent. Thank you.\n\n**Operator**\nThank you. Our next question comes from the line of John Vinh of KeyBank. Please go ahead, John.\n\n**John Vinh** (Managing Director and Senior Equity Analyst)\nGreat. Thanks for taking my question. I just had a couple of follow-ups. First on HBM, Sanjay on the call really went out of his way to kind of say, \"Hey, we can support 2.8 terabytes per second and 11 gigabits per second.\" It seems like these performance specs are greater than the original JEDEC standards that were set. It looks like customers are asking for more. I'm just curious, why are customers increasing kind of the original specifications for HBM4 and asking for higher performance? Just a quick housekeeping question from Mark. Just looking at your guidance, given the midpoint of all the ranges that you provided, it looks like to get to $3.75 in EPS, it implies that interest income is positive in the quarter. Is that the case of what's implied there?\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nI'll just answer the first part of your question and then hand it over to Mark. In terms of the HBM4 specs and its evolution, no doubt that the JEDEC specs were definitely exceeded by a significant margin by some of the numbers that we have quoted to you today, with greater than 11 gigabits per second pin speed and 2.8 terabytes per second of bandwidth. We have sampled these products. Customers, obviously, are looking for as much improvement as they can get in the ROI that they can offer to their end customers. That typically means that if there is a way to really drive higher bandwidth, you can increase the tokens, you can reduce the time-to-first token, you can get to a lower cost per token kind of a metric, and that becomes a more attractive solution for their end customers. That's really what is happening.\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nCertainly, the HBM4 specs that we have been able to produce will create a new bar for performance that would be needed to really enable these types of high-performing systems. That's really what has happened on that front. I'll pass it on to Mark to talk about the second part of your question.\n\n**Mark Murphy** (CFO)\nYeah, John, we do expect that interest to flip to income. We have greater capitalized interest, lower debt, and higher cash balances. All those will flip that line.\n\n**John Vinh** (Managing Director and Senior Equity Analyst)\nGreat. Thank you.\n\n**Operator**\nThank you. Our next question comes from the line of Kevin Cassidy of Rosenblatt Securities. Please go ahead, Kevin.\n\n**Kevin Cassidy** (Managing Director and Senior Research Analyst)\nYes, thanks for taking my question. You know, with the supply-demand going favoring the demand side, is there any discussions yet for, you know, long-term agreements with all of your clients or your customers?\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nYes, there is certainly interest in some of these agreements. We have certainly experimented with different types of long-term agreements in the past and innovated with some ideas on how to do some of these things. I do think that we are going to be very thoughtful about what we do here and what term and lifetime of these agreements we sign up for. We also have U.S. manufacturing that we are going to be bringing online. We also have changes that are likely to happen on the landscape due to tariffs, and we'll have to respond to that when they are announced, Section 232 Semiconductor Tariffs. There are all kinds of reasons to be thoughtful about what happens to pricing, what happens to how we create value for customers, whether it is through U.S. manufacturing or product capabilities.\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nThere is also, obviously, this very significant shift towards data center that I had been describing, and you have been watching that's been happening in the mix of the overall industry as well as for Micron Technology. We are being thoughtful about all of these different factors, and we will definitely be leveraging these in the discussions with customers. What that comes out on the other end of these, I would rather not speculate at this time.\n\n**Kevin Cassidy** (Managing Director and Senior Research Analyst)\nYes, understood. Maybe just a question on your decision to drop the managed NAND for the smartphone market. Is there a lower-cost supplier out there, a new supplier that is taking that type of business?\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nIt is not about a lower-cost supplier. It is just about, you know, for us, the ROI in the business. The NAND business ROI certainly has been for the past several years lower than that of DRAM. Our approach has been that as we have strengthened our portfolio in NAND, particularly with the growth of our data center SSD business, we wanted to leverage that to improve the overall portfolio mix. We determined that the pricing expectations and the level of competitiveness in the mobile NAND market did not lend itself for robust ROI over time. We determined that it was better to exit that and concentrate our resources in other places where we can drive better ROI. One of the things that you have seen us do over time is, you know, dramatically improve our product portfolio.\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nAs our portfolio has improved, it has given us the flexibility that we are now leveraging to mix into those parts of the portfolio which offer the highest profitability so we can have a bigger share of the industry's profit pool. That has been our strategy now. We can drive it more aggressively with the improved portfolio that we now have. We have been investing to get these capabilities for several years now, and we are in a good place to be able to leverage it now.\n\n**Mark Murphy** (CFO)\nTo add, to build on Sumit's comments, we don't report or operate the business by technology, but we do view that we've completed a second year of positive free cash flow in NAND.\n\n**Kevin Cassidy** (Managing Director and Senior Research Analyst)\nOkay, great. If I'm allowed to ask one more on that, just your smartphone customers didn't have a problem with that, but you know, doesn't affect your DRAM sales to them?\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nNo, I mean, customers are never happy when one important supplier is leaving a segment. I wouldn't say that they're happy to see us exit that, but we have a very strong relationship with all of these customers, and the DRAM business is super critical to them, and they have far fewer choices on the DRAM side compared to what they do on the NAND side. We have worked with them to transition their products to other suppliers. We have supported them through that transition on the NAND side, and we continue to remain very robust suppliers to them on the DRAM side.\n\n**Kevin Cassidy** (Managing Director and Senior Research Analyst)\nOkay, great. Thank you.\n\n**Sumit Sadana** (EVP and Chief Business Officer)\nWelcome.\n\n**Operator**\nThank you. That is all the time we have for our Q&A session. This concludes today's conference call. Thank you for participating. You may now disconnect.",
      "fetched_at": "2026-02-04T15:48:36.810Z"
    },
    {
      "ticker": "MU",
      "title": "Micron Technology, Inc. (MU) Q4 FY2025 earnings call transcript",
      "published_date": "Sep 23, 2025, 4:30 PM EDT",
      "fiscal_year": "2025",
      "quarter": "Q4",
      "url": "https://finance.yahoo.com/quote/MU/earnings/MU-Q4-2025-earnings_call-388210.html",
      "content": "**Operator**\nThank you for standing by and welcome to Micron Technology's Fiscal Fourth Quarter 2025 Financial Conference Call. At this time, all participants are in a listen-only mode. After the speaker presentation, there will be a question and answer session. To ask a question during the session, you will need to press star 11 on your telephone. To remove yourself from the queue, please press star 11 again. I would now like to hand the call over to Satya Kumar, Investor Relations. Please go ahead.\n\n**Satya Kumar** (Corporate VP - IR &amp; Treasury)\nThank you, and welcome to Micron Technology's Fiscal Fourth Quarter 2025 Financial Conference Call. On the call with me today are Sanjay Mehrotra, our Chairman, President, and CEO, and Mark Murphy, our CFO. Today's call is being webcast from our Investor Relations site at investors.micron.com, including audio and slides. In addition, the press release detailing our quarterly results has been posted on the website, along with prepared remarks for this call. Today's discussion contains forward-looking statements that are subject to risks and uncertainties. These forward-looking statements include statements regarding our future financial and operating performance, including our guidance, as well as trends and expectations in our business, market, industry, and regulatory and other matters. These statements are based on our current assumptions, and we assume no obligation to update these statements.\n\n**Satya Kumar** (Corporate VP - IR &amp; Treasury)\nPlease refer to our most recent financial report on Form 10-K and our other filings with the SEC for more information on the risks and uncertainties that could cause actual results to differ materially from expectations. Today's discussion of financial results is presented on a non-GAAP financial basis unless otherwise specified. A reconciliation of GAAP to non-GAAP financial measures can be found on our website. I'll now turn the call over to Sanjay.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nThank you, Satya. Good afternoon, everyone. Micron had an outstanding finish to fiscal 2025, delivering fiscal Q4 revenue, gross margin, and EPS all above the high end of our updated guidance ranges. We achieved record revenue in Q4, driven by pricing execution and strong performance across end markets. In our March 2024 earnings call, we said that we expect Micron to be one of the biggest beneficiaries of AI in the semiconductor industry and that we expect to deliver record revenue and significantly improved profitability in fiscal 2025. I'm pleased to report that in fiscal 2025, Micron's revenue grew nearly 50% to a record $37.4 billion, and gross margins expanded by 17 percentage points to 41%. This performance was supported by the ramp of our high-value data center products and our broad-based DRAM pricing strength across end markets.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nThe combined revenue from HBM, high-capacity DIMMs, and LP server DRAM reached $10 billion, more than a five-fold increase compared to the prior fiscal year. Our data center SSD business reached record revenue and market share in fiscal 2025. I want to thank our global Micron team for their focus and execution, which made these results possible. As we enter fiscal 2026, Micron is positioned better than ever. Our leadership in advanced technologies, including HBM, 1-gamma DRAM, and G9 NAND, enables a differentiated product portfolio that drives strong ROI. AI-driven demand is accelerating, and industry DRAM supply is tight. Our HBM performance has been strong, and robust demand, tight DRAM supply, and disciplined execution have significantly strengthened the profitability of the rest of our DRAM portfolio. In NAND, our higher mix to data center and improving industry conditions are contributing to profitability.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nOur fiscal Q1 guidance reflects new records for revenue and EPS. In addition to being a demand driver, AI is also a powerful productivity driver for Micron, contributing to our strong competitive position and financial performance. We are using AI throughout the company across product design, technology development, manufacturing, and other functional groups. We have seen strong adoption and, as much as a 30% to 40% productivity uplift in select Gen AI use cases, such as code generation. In design simulation, AI is accelerating our silicon-to-systems design cycle through advanced modeling and reduced iterations. In manufacturing, we have driven a 5x increase in wafer images analyzed in the past year and doubled the amount of useful data and telemetry collected and analyzed from our fab tools, all of which improve our yield performance. These AI capabilities enable us to achieve superior product specifications, quality, and time to market at scale.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nTurning to technology and operations, we are proud to announce that our 1-gamma DRAM node reached mature yields in record time, 50% faster than in the prior generation. We are the first in the industry to ship 1-gamma DRAM and will leverage 1-gamma across our entire DRAM portfolio to maximize the benefits of this leadership technology. We achieved first revenue from a major hyperscale customer on our 1-gamma products for server DRAM in the quarter. Our G9 NAND production ramp has been progressing well while scaling at a pace aligned with market demand. We have ramped our G9 NAND node for both TLC and QLC NAND and have qualified our G9 QLC NAND for enterprise storage.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nIn fiscal Q4, we received a CHIPS Act grant disbursement following the completion of a key construction milestone for our new high-volume manufacturing fab in Idaho, with the first wafer output expected to begin in the second half of calendar 2027. We began design work for our second Idaho manufacturing fab, which will provide additional capacity beyond 2028. In New York, we have completed initial phases of our environmental impact study and continue to work with state and federal authorities towards starting ground preparation. In fiscal Q4, we installed the first EUV tool for our Japan fab to enable 1-gamma capability, which will complement our existing 1-gamma supply from our fabs in Taiwan. The time from receiving this tool to completing installation was a record for all EUV tools globally, demonstrating Micron Technology's expertise with this equipment.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nWe plan to continue to invest in our Japan production capability to meet requirements of the advanced memory technologies of the future. Our continued HBM assembly and test investments position us well to meet growing HBM capacity requirements in calendar 2026. We are making good progress on our Singapore HBM assembly and test facility construction, which is on track to contribute to our HBM supply capability beginning in calendar 2027. Turning to our end markets. In data center, we now expect calendar 2025 total server units to grow approximately 10%, up from our prior expectations of mid-single-digit % growth. The calendar 2025 traditional server growth outlook has strengthened significantly from flat to growth in the mid-single-digit range. We believe this change in outlook is in part related to the growth of AI agents and the traditional server workloads agents initiate as they execute tasks on behalf of users.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nContinued growth in traditional server applications in enterprises is also contributing to additional demand growth. In addition to traditional servers, AI server growth continues to be very robust. This growth in both traditional and AI servers is driving strong demand for our DRAM products. Data centers require some of our industry's most complex and high-value products, and meeting this demand has presented several opportunities to enhance our product mix and profitability. In fiscal 2025, Micron Technology's data center business reached a record 56% of total company revenue, with gross margins of 52%. Our HBM business has posted many quarters of strong growth. In fiscal Q4, our HBM revenue grew to nearly $2 billion, implying an annualized run rate of nearly $8 billion, driven by the ramp of our industry-leading HBM3E products.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nWe are pleased to note that our HBM share is on track to grow again and be in line with our overall DRAM share in this calendar Q3, delivering on our target that we have discussed for several quarters now. Micron Technology's HBM4 12-high remains on track to support customer platform ramps, even as the performance requirements for HBM4 bandwidth and pin speeds have increased. We have recently shipped customer samples of our HBM4 with industry-leading bandwidth exceeding 2.8 TB/s and pin speeds over 11 Gbps. We believe Micron Technology's HBM4 outperforms all competing HBM4 products, delivering industry-leading performance as well as best-in-class power efficiency. Our proven 1-gamma DRAM, innovative and power-efficient HBM4 design, in-house advanced CMOS base die, and advanced packaging innovations are key differentiators enabling this best-in-class product. For HBM4E, Micron Technology will offer standard products as well as the option for customization of the base logic die.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nWe are partnering with TSMC for manufacturing the HBM4E base logic die for both standard and customized products. Customization requires close collaboration with customers, and we expect HBM4E with customized base logic dies to deliver higher gross margins than standard HBM4E. Our HBM customer base has expanded and now includes six customers. We have pricing agreements with almost all customers for a vast majority of our HBM3E supply in calendar 2026. We are in active discussions with customers on the specifications and volumes for HBM4, and we expect to conclude agreements to sell out the remainder of our total HBM calendar 2026 supply in the coming months. Micron's LP5 for servers had over 50% sequential growth in the quarter and reached record revenue.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nIn close collaboration with NVIDIA, Micron has pioneered the adoption of LPDRAM for servers, and since NVIDIA's launch of LPDRAM in their GB product family, Micron has been the sole supplier of LPDRAM in the data center. In addition to our leadership in HBM and LP5, Micron is also well-positioned with our GDDR7 products, which are designed to deliver ultra-fast performance with pin speeds exceeding 40 Gbps, along with best-in-class power efficiency to address needs of certain future AI systems. In data center NAND, AI-influenced use cases such as KV cache tiering and vector database search and indexing are driving demand for performance storage, while AI server growth is driving demand for high-capacity SSDs for capacity storage. Micron is gaining share in these markets with our customer focus, technology leadership, vertical integration, and execution.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nWe strengthened our portfolio with the industry's first G9 NAND data center products, including first-to-market PCIe Gen 6 SSDs. Near-term, we see continued growth in the data center storage market, with HDD supply shortages expected to improve NAND demand and drive a healthier supply-demand environment. Turning to PCs, end-of-life of Windows 10 and greater adoption of AI-enabled PCs are driving an improved PC demand outlook. We now expect PC unit shipments to grow at a mid-single-digit % level in calendar 2025 versus our low single-digit % growth expectations previously. During the quarter, we achieved our first OEM customer qualification of our 16GB 1-gamma-based D5 and commenced volume shipments. In NAND, we successfully qualified our first G9 NAND SSDs in both performance and mainstream categories with OEM customers. Our strong SSD portfolio enabled us to achieve record client SSD revenue in the quarter and in fiscal year 2025.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nSmartphone unit shipment expectations remain unchanged at low single-digit % range in calendar 2025. An increasing mix of AI-ready smartphones continues to be a key catalyst for DRAM content growth in mobile devices. Notably, one-third of the flagship smartphones shipped in calendar Q2 contained 12 GB or more, and given recent product launches from Apple, Samsung, and other smartphone OEMs, we expect this mix to increase over the coming quarters. In fiscal Q4, Micron ceased future mobile managed NAND product development in order to focus our resources and investments on higher ROI opportunities in our portfolio. We will continue to support existing mobile managed NAND products. Micron remains committed to serving the mobile DRAM market with our industry-leading portfolio. In fiscal Q4, we achieved OEM qualification of our first 10.7 Gbps 1B second-generation LP5X products at 16 GB and 24 GB capacities. Turning to auto, industrial, and embedded.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nIn automotive, trends such as ADAS and AI-enhanced in-cabin experiences require significantly higher memory and storage content, making it a higher-growth part of the industry. In embedded, we expect physical AI such as drones, advanced robots, and AR/VR to become a more important driver of demand over time. Automotive and industrial demand strengthened throughout the quarter, exceeding our initial forecast. We are seeing improved profitability in this business with stronger pricing and an increased mix of advanced technology nodes, with greater adoption of D5 and LP5 products. We continue to see supply constraints in D4 and LP4. In June, Micron announced investments in our Virginia facility in an effort to support our long life cycle customers' demand for D4 and LP4. Now turning to our market outlook. Customer inventory levels are healthy overall across end markets.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nWe expect calendar 2025 industry DRAM bit demand growth to be in the high teens % range, somewhat higher than our previous outlook. We expect calendar 2025 industry NAND bit demand growth to also be higher than our previous outlook, now in the low to mid-teens % range. We expect Micron's calendar 2025 bit supply growth to be below industry bit demand growth for non-HBM DRAM and for NAND. Robust data center demand, including the uptake in server unit growth, has contributed to a tight industry DRAM environment and strengthened NAND market conditions. Additionally, broadening of demand across end markets has also constrained DRAM supply. On the supply side, we expect low supply in inventories, constrained node migration as industry supports extended D4 and LP4 end-of-life, longer lead times, and higher costs globally for new wafer capacity, all to limit the pace of supply growth for DRAM in 2026.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nIn calendar 2026, we anticipate further DRAM supply tightness in the industry and continued strengthening in NAND market conditions. Over the medium term, we anticipate industry bit demand growth of mid-teens category for both DRAM and NAND. Micron invested $13.8 billion in CapEx in fiscal 2025. As we continue to make 1-gamma DRAM and HBM-related investments, we expect fiscal 2026 CapEx to be higher than fiscal 2025 levels. DRAM front-end equipment and fab construction will drive higher capital spending in fiscal 2026. Our continued technology node migration to 1-gamma will provide the majority of our supply growth for DRAM in calendar 2026. As we transition more products to 1-gamma, our 1-beta capacity will support HBM growth in 2026. I'll now hand over the call to Mark to provide more color on our fiscal fourth quarter and fiscal 2025 financials.\n\n**Mark Murphy** (EVP &amp; CFO)\nThank you, Sanjay, and good afternoon, everyone. Micron Technology delivered strong results to close out the fiscal year with Q4 revenue, gross margin, and EPS all exceeding our updated guidance. For the full year, we achieved record revenue of $37.4 billion, up 49% year-over-year. Gross margins expanded to 41%, a 17% improvement from fiscal 2024. EPS reached $8.29, reflecting a 538% increase compared to the prior year. Total fiscal Q4 revenue was $11.3 billion, up 22% sequentially and up 46% year-over-year, and a quarterly record for Micron Technology. Higher sequential revenue was driven by growth across our end markets, including record data center revenues and strong sequential growth in consumer-oriented markets. Fiscal Q4 DRAM revenue was a record $9 billion, up 69% year-over-year and represented 79% of total revenue. Sequentially, DRAM revenue increased 27%. Bit shipments increased in the low teens %, driven by strong demand across all end markets.\n\n**Mark Murphy** (EVP &amp; CFO)\nPrices increased in the low double-digit % range, driven by tight industry DRAM supply, pricing execution, and favorable mix. Fiscal 2025 DRAM revenues were a record $28.6 billion, up 62% year-over-year. Fiscal 2025 DRAM all-in costs, inclusive of HBM, were down by low single-digit % points. Fiscal Q4 NAND revenue was $2.3 billion, down 5% year-over-year and represented 20% of Micron Technology's total revenue. Sequentially, NAND revenue increased 5%. NAND bit shipments declined in the mid-single-digit % range, and prices increased in the high single-digit % range due to favorable mix. Fiscal 2025 NAND revenues were a record $8.5 billion, up 18% year-over-year. Fiscal 2025 NAND all-in cost reductions were around low teens %. Now turning to quarterly financial performance by business unit.\n\n**Mark Murphy** (EVP &amp; CFO)\nOur new segment disclosures for our business units, which you see starting in today's press release and will see in future filings, highlight the improvements in our profitability and changing business mix. The Cloud Memory Business Unit and Core Data Center Business Unit combined represent the totality of our data center business. Cloud Memory Business Unit revenue was $4.5 billion and represented 40% of total company revenue. CMB revenues were up 34% sequentially, driven by robust bit shipment growth. HBM revenues reached a new quarterly record. CMBU gross margins were 59%, higher by 120 basis points sequentially, supported by cost reductions. Core Data Center Business Unit revenue was $1.6 billion and represented 14% of total company revenue. CDBU revenues were up 3% sequentially. CDBU gross margins were 41%, up 400 basis points sequentially, driven by higher pricing and favorable mix.\n\n**Mark Murphy** (EVP &amp; CFO)\nMobile Client Business Unit revenue was $3.8 billion and represented 33% of total company revenue. MCBU revenues were up 16% sequentially, driven by higher DRAM shipments and improved pricing. MCBU gross margins were 36%, up 12 percentage points sequentially, driven by higher pricing and favorable mix. Automotive and Embedded Business Unit revenue was $1.4 billion and represented 13% of total company revenue. AEBU revenues were up 27% sequentially, driven by higher bit shipments. AEBU gross margins were 31%, up 540 basis points sequentially, driven by higher pricing. The consolidated gross margin for fiscal Q4 was 45.7%, up 670 basis points sequentially. Sequential gross margin improvement was driven by favorable product mix, better DRAM pricing, and strong execution on cost reductions. Operating expenses in fiscal Q4 were $1.2 billion, up $81 million quarter over quarter and in line with our guidance range. The sequential increase was driven primarily by higher R&D.\n\n**Mark Murphy** (EVP &amp; CFO)\nWe generated operating income of $4 billion in fiscal Q4, resulting in an operating margin of 35%, up 820 basis points sequentially and 12 percentage points year over year. Fiscal Q4 taxes were $471 million on an effective tax rate of 12%, lower than our guidance due to favorability in certain discrete items. Non-GAAP diluted earnings per share in fiscal Q4 was $3.03, with 59% sequential growth and 157% versus the year ago quarter. Turning to cash flows and capital expenditures. In fiscal Q4, our operating cash flows were $5.7 billion, and our capital expenditures were $4.9 billion, resulting in free cash flows of $803 million. The increase in capital expenditures was driven by planned investments for DRAM. For the full year of fiscal 2025, we generated $3.7 billion in free cash flow, representing 10% of revenue. Ending inventory for fiscal Q4 was $8.4 billion or 124 days.\n\n**Mark Murphy** (EVP &amp; CFO)\nInventory was down $372 million sequentially, and inventory days down 15 days, driven by strong sequential bit shipment growth and DRAM. DRAM inventory days are below target levels, and NAND inventory days improved sequentially. On the balance sheet, we held $11.9 billion of cash and investments at quarter end and maintained $15.4 billion of liquidity when including our untapped credit facility. During fiscal Q4, we reduced debt $900 million through paydown of $700 million term loans and repurchased approximately $200 million of our senior notes. We closed the quarter with $14.6 billion of debt, maintaining low net leverage and a weighted average debt maturity of 2033. Now turning to the outlook for the first fiscal quarter. We expect price, cost, and mix to all contribute to strengthening gross margins in Q1.\n\n**Mark Murphy** (EVP &amp; CFO)\nOperating expenses for fiscal Q1 are projected to be approximately $1.34 billion, with a sequential increase driven by R&D related to data center product innovation and development. Micron's fiscal 2026 will be a 53-week fiscal year compared to fiscal 2025, which was a 52-week fiscal year. As a result, fiscal Q4 2026 OPEX will reflect the effect of an additional work week in the quarter. We expect a fiscal Q1 and fiscal year 2026 tax rate of around 16.5%. We expect our fiscal Q1 capital spending to be approximately $4.5 billion. While quarterly spend may fluctuate, this level serves as a reasonable quarterly baseline for the planned capital spend in fiscal 2026. We will continue to exercise supply discipline as we pursue our growth opportunities. We expect free cash flow to strengthen in fiscal Q1, and we project significantly higher annual free cash flow year over year in fiscal 2026.\n\n**Mark Murphy** (EVP &amp; CFO)\nAny impacts that may occur due to potential new tariffs are not included in our guidance. With all these factors in mind, our non-GAAP guidance for fiscal Q1 is as follows. We expect revenue to be a record $12.5 billion, plus or minus $300 million, gross margin to be in the range of 51.5%, plus or minus 100 basis points, and operating expenses to be approximately $1.34 billion, plus or minus $20 million. Based on a share count of approximately 1.15 billion shares, we expect EPS to be a record $3.75 per share, plus or minus $0.15. I'll now turn it over to Sanjay to close.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nThank you, Mark. Fiscal 2025 was a year of many records for Micron, as we have highlighted today. We have strong momentum entering fiscal 2026 with a robust fiscal Q1 demand outlook led by data center and the most competitive position in our history. Over the coming years, we expect trillions of dollars to be invested in AI, and a significant portion will be spent on memory. As the only U.S.-based manufacturer of memory, Micron is uniquely positioned to benefit from the AI opportunity ahead. Thank you for joining us today. We will now open for questions.\n\n**Operator**\nThank you. As a reminder, to ask a question, you will need to press star 11 on your telephone. To remove yourself from the queue, you may press star 11 again. Please limit yourself to one question and one follow-up to allow everyone the opportunity to participate. Please stand by while we compile the Q&A roster. Our first question comes from the line of Timothy Arcuri of UBS. Please go ahead, Timothy.\n\n**Timothy Arcuri** (Managing Director)\nThanks a lot. Mark, I was wondering if you could help on the guidance a little bit. I know you don't want to get into too much detail, but of the $1.2 billion sequential revenue, can you help us how that splits out between DRAM and NAND? I guess any gross margin puts and takes you might have as well would be helpful.\n\n**Mark Murphy** (EVP &amp; CFO)\nYeah, Tim, you were breaking up a bit at the end, but I believe I've got it. In the first quarter, we'll be heavier, heavier DRAM mix than the NAND and that growth. As you mentioned, we're not going to break out, you know, bits in ASP, but we are, you know, guiding up, you know, 580 basis points, sequentially. It is split across, you know, mix, pricing, and strong execution on our cost reductions. We're in a very constructive pricing environment. Supply is tight for DRAM and improving substantially in NAND. We've got, you know, we've got essentially strong demand and supply factors at work, as you heard in the script today. On the demand side, data center spend remains robust, projected to grow. Traditional server spend is improving and expected to grow.\n\n**Mark Murphy** (EVP &amp; CFO)\nRefresh and inference workload, demand drivers, and then PC, smartphone, auto, all have increased content growth, and that's becoming clear. On the supply side, we'll get into that more in the Q&A here, but that is tight as well due to a number of factors that are structural. We're focused on our execution, and again, sequentially here, expect price, mix, and strong execution to drive that 580 basis point margin expansion. Thanks a lot, Mark.\n\n**Timothy Arcuri** (Managing Director)\nSanjay, I guess you had previously guided us to like a $100 billion HBM TAM by 2028, but since you gave us that number, there's been some massive rumors getting out, some, you know, TAM numbers by NVIDIA and some, you know, some of the investments that are, you know, going on at OpenAI and whatnot. It's obvious that the compute table is much bigger than what I think you probably would have assumed at that time. Do you have an update to that number? I would assume it's bigger than that number, and maybe you can comment on sort of what you see next year. I know this year you saw like mid-30s. I'm thinking you can give us any like mild hope starting next year, and, you know, update for that, you know, $100 billion in 2028.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nTim, your connection is poor and you were breaking up a lot, but I think I got the gist of your question. What we had said before regarding longer-term HBM TAM, we had said that by 2030, we expect HBM TAM to reach $100 billion, and we had also said that HBM bit CAGR will grow faster than the DRAM CAGR. We see that in 2026 as well, in terms of bits in HBM will outgrow the overall DRAM bit. Of course, as we look ahead, the value proposition of HBM continues to increase. As we talked about, HBM now in 2026 is transitioning to HBM4. Micron, of course, is well-positioned. The market is starting to require even higher performances, and we today pointed out that Micron with HBM4 will have the highest performance product with over 11 gigabits per second and, of course, highest power efficiency as well.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nThe specs of HBM are becoming increasingly more demanding, which is exciting for us because we are very well positioned with these products. This just means the value proposition of HBM continues to grow. We definitely continue to see strong long-term growth and are very excited about all these various announcements of massive data center infrastructure spend. We have talked about trillions of dollars of spend over the next several years, and memory is very much at the heart of this AI revolution. This means a tremendous opportunity for memory and certainly a tremendous opportunity for HBM. We feel very good about HBM longer-term opportunities, good about HBM opportunities in 2026, and very good about Micron's positioning with our very strong product portfolio and strong execution track record and the trust that we have built with our customers in our ability to supply quality and meet our customers' volume requirements.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nExciting times ahead, and we are, of course, continuing to work very closely with our customers.\n\n**Timothy Arcuri** (Managing Director)\nThanks a lot.\n\n**Operator**\nThank you. Our next question comes from the line of Vivek Arya at Bank of America. Please go ahead, Vivek.\n\n**Vivek Arya** (Managing Director)\nThank you for taking my question. I'm curious, how do you see the transition from HBM3E to HBM4? When do you expect the crossover next year? I think as part of that, you mentioned that the pricing for HBM3E is settled for 2026. I'm curious, what is the direction of that pricing versus what you're getting now? Is it higher or lower? Do you expect your HBM3E share to stay the same or change next year?\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nWith respect to HBM4, this is, of course, we will be at the forefront of this production ramp, very much aligned with customers' timing. As we have mentioned, we have the best product in the industry with highest performance over 11 gigabits per second, and we have sampled that product, as well as low power. Industry-leading product performance. We will be ramping it up in line with customer demands, of course, first production shipment in CQ2 of 2026 timeframe, and production will ramp during the course of 2026, second half of 2026, again in line with customer demand. Overall, in 2026 versus 2025, we see our share growing, product well-positioned. We are not commenting on the pricing of HBM3E. We have told you that HBM3E, we have pricing agreements completed with almost all customers for the vast majority of our HBM3E supply in 2026.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nWe are in discussions regarding HBM4 with our customers. What I will tell you is that supply is tight. We expect a healthy demand-supply environment in 2026 for overall DRAM, and that bodes well for profitability of DRAM, profitability of HBM, and, of course, profitability of non-HBM as well, which is experiencing tight supply.\n\n**Vivek Arya** (Managing Director)\nGot it. For my follow-up, maybe, Mark, on the gross margin side, what is this conceptually? How do you think about the puts and takes of gross margins as you go through the rest of the year, this 51.5%? Is this kind of the baseline? As long as sales grow, can you expand off of this level? Related to that, when I look at your cloud data center business, gross margins 59%, operating margins 48%, how much more room is there to expand from those very strong levels right now? Thank you.\n\n**Mark Murphy** (EVP &amp; CFO)\nYeah, Vivek, so we're not providing out-quarter guidance, but what we will say is that we believe or we expect gross margin to improve sequentially first to second quarter. It's on this tight DRAM supply, and the associated pricing, along with, you know, NAND business continuing to improve, and then just mix effects as we continue to steer bits towards high-value markets, and then our cost performance continues to be good. As I, as you know, mentioned in the prepared remarks, these supply-demand factors are, you know, we believe they're durable on the demand side. Data center spend continues to increase. I talked earlier about traditional server spend and then the edge and auto having increased content. On the supply side, you know, customer inventory levels are healthy. Our supply is lean. Our DRAM inventories are below target. NAND continues to improve.\n\n**Mark Murphy** (EVP &amp; CFO)\nYou know, we are, you know, we're working to be as efficient as we can in providing a supply response. You know, we're doing node transitions, but as the industry extends support for D4, that's constrained those node transitions. Finally, it just takes a long time and is expensive to add new clean room space. We all know the silicon intensity of HBM, creating the urgency for that capacity requirement. It's a good setup as we go into 2026. We, you know, delivered this strong guide on the first quarter gross margin, and we expect to see gross margins up in Q2. I also want to reiterate something Sanjay mentioned that we expect margins to be healthy in both HBM and non-HBM in 2026. I'll leave it at that on the out-quarter guidance.\n\n**Vivek Arya** (Managing Director)\nThank you.\n\n**Operator**\nThank you. Our next question comes from the line of CJ Muse of Cantor Fitzgerald. Your line is open, CJ.\n\n**CJ Muse** (Senior Managing Director)\nYeah, good afternoon. Thank you for taking the question. I guess first question, it certainly feels like in the last month or two there's been an inflection in DRAM demand led by inference hyperscalers. Curious if you could kind of speak to what you have seen, the breadth of demand, and particularly the sustainability of that. Would love your thoughts. You've talked about tightness expected into fiscal 2026. Your thoughts into this, what is typically seasonally slower February quarter? Should we see kind of normal seasonality, or are the supply trends so limited that things can hold up much better than kind of normal seasonality?\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nOf course, we are not providing you FQ2 guidance at this point, but you know, certainly, the AI trends are strong. As you noted, not just in training, but inference as well. As the AI applications broaden, innovations increase, greater, different architectures, all of this is only continuing to broaden the demand vector for AI in the data center as well as on edge devices such as smartphones. In the data center, AI servers have driven strong demand, as we have all known, particularly with the increasing demand and increasing demand for all DRAM, not just HBM, but LPDRAM, high-density DRAM modules. We are also seeing traditional server demand, as we noted in our remarks, increase as well. This is really driving a strong growth trend overall for the industry. The demand vectors are broadening, as I noted, smartphones in particular.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nYou have seen some recent launches of and shipments already starting of AI-enabled smartphones, which have higher content of DRAM in them versus the prior generation phones. PCs is another tailwind, AI PCs, and end-of-life for Windows 10. The AI PCs are a tailwind for DRAM content as well. Overall, AI trends are strong, and this is across data center, across AI-enabled smartphones and AI-enabled PCs. This is what leads to strong demand in 2026, across 2026. We have talked about tight supply as well. Mark just laid out the factors for tight supply, which we also discussed in our prepared remarks. Overall, we look forward to a healthy demand-supply environment in calendar year 2026 for us.\n\n**CJ Muse** (Senior Managing Director)\nVery helpful.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nCustomer inventories, customer as well as supplier inventories, are in good place. Supplier inventories are actually running lean. Micron DRAM supply is very tight.\n\n**CJ Muse** (Senior Managing Director)\nThank you for that. As a quick follow-up on CapEx, Mark, it appears net CapEx implied $18 billion versus $13.8 billion last year. I think you talked about front-end equipment versus clean room space and DRAM. Is there a way to kind of partition how much, you know, on equipment versus clean room? Can you share with us what the implied gross CapEx is for fiscal 2026? Thanks so much.\n\n**Mark Murphy** (EVP &amp; CFO)\nYeah, we've not laid out in detail. It's just that our spend in 2026 will be majority, vast majority will be for DRAM, and we've got construction and facilities related to that, some tools for node transitions and beginning to install for new greenfield. As it relates to, you're right that we guided, you know, a framework to be at around $18 billion, we will generally talk about CapEx in the context of net, which is gross CapEx offset by proceeds from government incentives. We're not going to talk about the gross and net for 2026, but you can see the components, you can back into the components here on what you've seen in the filings for the gross spend in 2025 and then the government incentives. We ended up at $13.8 billion net, and we were at $15.8 billion gross with $2 billion of government incentives in 2025.\n\n**Mark Murphy** (EVP &amp; CFO)\nYou'll see that going forward, and the government incentives in 2025 are largely the U.S., Singapore, and Japan. We can talk more about those in the future.\n\n**CJ Muse** (Senior Managing Director)\nThank you.\n\n**Operator**\nThank you. Our next question comes from the line of Harlan Sur of JPMorgan. Please go ahead, Harlan.\n\n**Harlan Sur** (Executive Director - Equity Research)\nYeah, good afternoon. Thanks for taking my question. Days of inventory are now at your target levels, as you had expected previously, and within that, DRAM is actually below your targets, right? Given the strong 3E, 12-high RAM, continued strong demand pull for non-AI DRAM, how are you guys thinking about your total and DRAM inventories exiting this quarter? Will days of inventory continue to come down? Just given the overall supply tightness, are your lead times extending and customers placing orders further in advance? Is this better visibility? What gives the team confidence on continued tightness into calendar 2026?\n\n**Mark Murphy** (EVP &amp; CFO)\nYeah, Harlan, I'll cover that. We do expect inventories to remain at or better on DIO than we've seen in the fourth quarter. DRAM will remain very tight, as we talked about through the year, so we would expect to be, you know, below target. NAND, you know, we're being very disciplined around NAND, and that market continues to improve, so we would expect NAND DIO to decrease as well.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nWe work closely with our customers, and customers are fully understanding that the demand environment is strong and the supply is very tight, and the DRAM and supply outlook is tight. We work closely with the customers. I just want to point out that as we look ahead at our supply, we are looking at 1-gamma ramp to support our demand in non-HBM products. HBM products, we will support them with our 1-beta. We continue maintaining focus on maximum production efficiencies and leveraging the clean room space that is available to implement the technology transitions as well as drive maximum production efficiency.\n\n**Harlan Sur** (Executive Director - Equity Research)\nNo, I appreciate that. Thank you for the insights, Sarah. Sanjay, as your customers continue to differentiate their GPU and XPU platforms, memory continues to be sort of that key focus area of differentiation. As you mentioned, some of your HBM4 customers are looking for as much as 25% more bandwidth versus the plain vanilla JEDEC standard. It looks like the Micron team delivered a solution that's 40% more performant than the JEDEC spec, right, and well exceeding your customers' requirements. Did the team have to redesign the base logic die to achieve these impressive results? I'm just wondering if the higher performance HBM4 SKU maybe pushed out customer calls or if the call schedules remained on track relative to your original plan. More importantly, even with the higher speeds, is your power consumption still superior to your competitive solutions?\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nVery good question, Harlan, and thank you for asking those questions. Very proud of our team's execution, proud of our team's design of our DRAM die and the advanced CMOS technology that is used in that DRAM die, as well as our base die, which has advanced CMOS as well. The combination of all of this, our innovative design, our memory architecture, our advanced CMOS in the DRAM, as well as advanced CMOS in the base die, and of course, that advanced CMOS base die is manufactured here by Micron, giving us a competitive advantage. All of this actually has enabled us to achieve customers' increasingly higher requirements, bandwidth at 2.8 gigabytes per second, and speeds at more than 11 gigabits per second as well. This has really positioned us well, getting ready for production ramp of our HBM4 product with these kinds of specs.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nAs I said, with these kinds of specs, we'll be at the forefront of HBM shipment ramp, keeping it in line with customer demand.\n\n**Harlan Sur** (Executive Director - Equity Research)\nThank you.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nI just want to be clear, I think I said for bandwidth 2.8 terabytes per second. I hope that came across clearly. 2.8 terabytes per second, speed 11 gigabits per second.\n\n**Operator**\nThank you. Our next question comes from the line of Krish Sankar of TD Cowen. Please go ahead, Krish.\n\n**Krish Sankar** (Managing Director)\nYeah, hi, thanks for taking my question. I had told them, Sanjay, you mentioned about getting sold out in HBM, hopefully in the next few months. Is there a way to quantify the supply opportunity in calendar 2026, assuming you're fully sold out? If the HBM demand is better than expected, can you increase supply in calendar 2026 if you're sold out in the next few months? I have a quick follow-up.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nYeah, we are not breaking down the supply volumes, et cetera. Yes, HBM3E, as we mentioned, pricing agreements are done with a vast majority of our HBM3E supply. Volume is also fixed for HBM3E with most customers. As our customers are finalizing their plans with HBM4, particularly plans with increased specifications and their own deployment of that in their next-generation platforms, we expect to be concluding our agreement on HBM4 supply, as well as all of 2026 HBM supply here in 2026, in the next few months. Really very pleased with our industry-leading HBM4 product specifications, absolutely outperforming the rest. We are well positioned with this. With respect to your question, we will, of course, manage the mix of our portfolio now that we have reached our HBM share in CQ3 to be in line with our industry DRAM share.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nWe will manage, and non-HBM being healthy margins as well, we will now manage the mix of our portfolio, keeping in mind, of course, ROI on our portfolio, as well as staying disciplined with our total investments. As you can well understand, we have, of course, flexibility to opportunistically manage share here for HBM because at the front end, it uses the same one-beta wafer as some of the rest of our products as well. That gives us fungibility at the front end in terms of supply management and assembly and test. With the investments that we have made over the course of the last several quarters, we are well positioned with capacity in assembly and test as well.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nOur investments and our team's strong execution in ramping up capacity and giving us the total confidence gives us now the flexibility to manage the mix of the full portfolio between HBM and non-HBM, keeping ROI in mind, and staying disciplined here with our investments as well.\n\n**Krish Sankar** (Managing Director)\nGot it. Thanks, Sanjay. Another quick question on HBM4. It was nice to see the 11 gigabits per second pin speed. You also said that you have the offering of both your in-house base die, also the customized TSMC logic die. Is there a way to figure out what do you expect that mix to be? Do you expect more customers to go with the in-house die or the TSMC die, and how easy is it for you from the Micron standpoint of switching between the two based on customer demand?\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nHBM4 is the product that is with our internal base die, and HBM4E is where we said in our remarks that, you know, we will be offering standard products as well as customized products. HBM4E is where we are partnering with TSMC. HBM4E is not in the industry. It's not a 2026 product. That will be, you know, 2027 kind of product. We'll share more details with you, and we will have both standard and customized products in HBM4E. HBM4 is using our own base die in the industry. HBM4 is what will be the product that will be ramping in production. As you mentioned, with the value proposition of HBM continuing to increase, and with HBM4E, that value proposition increases even further. We would certainly expect the customization to provide higher gross margins, as I indicated in my prepared remarks.\n\n**Sanjay Mehrotra** (Chairman, President &amp; CEO)\nOnce again, I would like to point out that our HBM uses our own logic die. That means Micron's own CMOS, and that gives us unique advantages and, of course, has been a key contributor along with our DRAM design and DRAM architecture, as well as the CMOS that is embedded inside the DRAM. All of that gives us a unique advantage in terms of industry-leading performance.\n\n**Operator**\nThank you. As that is all the time we have for Q&A today, that does conclude the Q&A portion of this call and today's conference call. Thank you for participating. You may now disconnect.",
      "fetched_at": "2026-02-04T15:48:41.060Z"
    },
    {
      "ticker": "MU",
      "title": "Micron Technology, Inc. (MU) Q3 FY2025 Post Call earnings call transcript",
      "published_date": "Jun 25, 2025, 6:00 PM EDT",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/MU/earnings/MU-Q3-2025-earnings_call-358650.html",
      "content": "**Operator**\nThank you for standing by, and welcome to Micron's post-earnings analyst call. I'd now like to introduce your host for today's program, Satya Kumar. Please go ahead, sir.\n\n**Satya Kumar** (Corporate VP of Investor Relations and Treasury)\nYeah, thank you, Jonathan, and welcome to Micron Technology's fiscal third quarter 2025 post-earnings analyst call. On the call today with me are Sumit Sadana, Micron's Chief Business Officer, Manish Bhatia, EVP of Global Operations, and Mark Murphy, our CFO. As a reminder, the matters we're discussing today include forward-looking statements regarding market demand and supply, market trends and drivers, and our expected results and guidance, and other matters. These forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from statements made today. We refer you to documents we have filed with the SEC, including our most recent Form 10Q and upcoming 10Q, for a discussion of risks that may affect our results. Although we believe that the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee future results, levels of activity, performance, and achievements.\n\n**Satya Kumar** (Corporate VP of Investor Relations and Treasury)\nWe are under no duty to update any of the forward-looking statements to conform these statements to actual results. We can now open the call up for Q&A.\n\n**Operator**\nCertainly, and our first question for today comes from the line of Carl Ackerman from BNP Paribas. Your question, please.\n\n**Karl Ackerman** (Managing Director of Semiconductors and IT Hardware)\nYes, thank you. I have two, please. This quarter, you raised your DRAM bit-to-man outlook for calendar 2025 to high teens from mid-teens. Is that only coming from your outlook on HBM, or do you believe excluding tariff pull-ins from certain customers that the man outlook for non-HBM DRAM has also improved? Another follow-up, please.\n\n**Sumit Sadana** (Chief Business Officer)\nYeah, hi Carl, this is Sumit here. This is a small change to our DRAM outlook for calendar 2025. We upgraded our view to the level you mentioned. Now, there is no impact of pull-ins in this assessment because whatever modest amount of pull-in there might have been, for example, in CQ2 from CQ3 or FQ3 from FQ4, etc., that kind of pull-in activity is net neutral for the full calendar year view. The improvement is not impacted by any kind of pull-in activity. The strength in our view of the AI business, i.e., the data center growth, continues to be pretty robust, and our view of the AI demand is certainly supportive of the forecast that we have provided you for bit growth in calendar 2025.\n\n**Sumit Sadana** (Chief Business Officer)\nThe other positive thing that has happened over the last three months is that we are seeing, after many, many quarters of very challenging environments in the broad distribution markets, industrial markets, and some parts of the automotive market, we are now starting to see really good improvements in demand in these broad distribution and industrial markets, and that is also providing a tailwind to the overall calendar 2025 bit growth estimates.\n\n**Karl Ackerman** (Managing Director of Semiconductors and IT Hardware)\nThanks for that, Sumit. Mark, given your expectations for another quarter of healthy free cash flow in the August quarter, I was hoping you could discuss how you might prioritize improving net leverage versus share buybacks, just given you look to not repurchase stock in the quarter. Thank you.\n\n**Mark Murphy** (CFO)\nYeah, Carl, as I mentioned in the earnings call, we're pleased with the deleveraging that's happened. We're down now to a net debt of $3 billion, substantially down from the prior quarter, and I said on the call that we expect to generate free cash flow in the fourth quarter. I would add that we stand at record levels of cash and record levels of liquidity for the company. We're at $15.7 billion in liquidity, including our untapped facility. We're in a great position to first continue to invest in the priorities of the business, maintaining our technology leadership, investing in needed capacity in DRAM to serve HBM and other high-value, high-return markets, and then do return capital shareholders through our routine dividend, which we hope to grow over time, and then opportunistic repurchase.\n\n**Mark Murphy** (CFO)\nI think the balance sheet is in a great spot now, and we have a lot of flexibility. On a covenant basis, I would add that we're actually basically at no leverage on a covenant basis.\n\n**Karl Ackerman** (Managing Director of Semiconductors and IT Hardware)\nThank you.\n\n**Operator**\nThank you, and our next question comes from the line of Aaron Rickers from Wells Fargo. Your question, please.\n\n**Aaron Rakers** (Managing Director and Technology Analyst)\nYeah, thanks for taking the question and doing the call. Two, if I can as well. I think, Mark, first of all, I appreciate the gross margin guidance. I think last quarter, we talked a little bit about startup costs and the potential for underutilization flowing through inventory in the NAND flash business. Obviously, demand dynamics have improved. I'm just curious, how should we think about those inputs of gross margin over the next couple of quarters? I will just ask my second question right out of the gate. The LPDDR business in the data center side, we've talked for several quarters about you being predominantly the sole provider of those solutions into some of the AI silicons. I guess, how do we think about that business as it progresses to a billion dollars plus of quarterly revenue?\n\n**Aaron Rakers** (Managing Director and Technology Analyst)\nI think you've alluded to in the past as far as diversity of customer base there. Has that expanded? Do you see a broadening market for that solution in data center? Thank you.\n\n**Mark Murphy** (CFO)\nYeah, I'll start, Aaron. As it relates to underload utilization-related period costs, we brought those up. I think it was on the December call. Over the past six months, we sort of worked last call, the March call, we talked about how the structural capacity had come down and that we were not incurring those period costs. They would end up being absorbed in inventories and passed through. That is what is happening. We have structurally lower capacity in NAND, and those costs all now just pass through on inventories. The NAND volumes were very strong, so we are benefiting from some more loading there. Still, we are very careful about capacity in that market because that part of the business is the market environment is challenging.\n\n**Mark Murphy** (CFO)\nAgain, we talk about low CapEx levels, careful about node transition, where our bits are going, and premium products in that market, and watching inventories carefully. Inventories improved in NAND, actually, in the quarter, but they remain less healthy than DRAM, which DRAM we actually expect to be below target by the end of the year. As it relates to, yeah, as it relates to the startup costs that I mentioned last quarter, we do see those beginning to increase and very modestly now, but through 2026, we'll see some increase related to, as you know, we're building Idaho One, and we'll begin to see those beginning to increase in 2026. We also see some FX-related costs. I mean, everybody knows that the dollar's been weakening, and so we're seeing a bit more of that.\n\n**Mark Murphy** (CFO)\nSince we made those comments, the revenue outlook that we have is much higher. Those effects are on a basis point less than what we talked about on the last call. I think that will have me reinforce what is important, which is, are we growing? We are positioning our bits in the right place, and we serve a market that is growing, and we are getting leverage on those costs. Our price performance is critical. We have done a great job of pricing in this market that is turning, becoming more constructive, which is why we have a strong guide in the fourth quarter, a 42, and we feel positive about the trajectory of the business beyond that.\n\n**Sumit Sadana** (Chief Business Officer)\nIn terms of your question about LPDDR in the data center, yeah, we continue to be very excited about our sole source position in that market. It has become quite a large market and, of course, pioneered by one large company in the data center. Of course, as you know, the power consumption in the data center continues to be an important driver of decisions and designs and architectural choices by our customers. Overall availability of power is an important driver of many decisions, including location of these data centers. Certainly, the interest in more broadly deploying LPDRAM in the data center amongst customers of scale continues to be high. We do expect, based on our interaction with customers as the pioneer of LPDRAM in the data center in the world, we have multiple interactions going on with customers of different types and scale.\n\n**Sumit Sadana** (Chief Business Officer)\nWe do expect that LP will grow in its penetration in the data center over time. We are very excited by our position, and we'll be able to leverage that position as that growth unfolds.\n\n**Aaron Rakers** (Managing Director and Technology Analyst)\nThank you.\n\n**Operator**\nThank you. Our next question comes from the line of Brian Chen from Stifel. Your question, please.\n\n**Brian Chin** (Director of Applied Technologies)\nHi, good afternoon. Thanks for letting us ask a few questions. I know you indicated on the call in the slides that DDR4 will be a low single-digit % revenue exposure in fiscal second half of 2025. Is there a way to quantify how much of the 300 basis point sequential higher gross margin guide for fiscal 4Q maybe is attributed to DDR4 pricing? I think that is a question that we're getting sort of post-call here.\n\n**Mark Murphy** (CFO)\nYeah, I'll take that. Yeah, the DDR4 pricing is a that market has gotten tight, as was talked about in our prepared remarks. Customers are beginning to see increasing shortages for DDR4. As you mentioned, it's a smaller part of our business and on a volume basis getting smaller. The DDR4 pricing is a positive Q3 results and Q4 guide, but it's one of the many factors contributing to the positive results. It's not a driver of that margin expansion. I would leave it at that.\n\n**Brian Chin** (Director of Applied Technologies)\nGot it. That's sort of, I know previously you'd said 10% revenue could be sort of DDR4, and now it's lower. Maybe part of that's because of strengthening in other DDR5 and other areas of mix. I guess, is this pretty consistent with where your production is and is going, as well as your finished good inventory in terms of DDR4 being at sort of like a sub-10% kind of exposure?\n\n**Sumit Sadana** (Chief Business Officer)\nYeah, just to clarify, right? I mean, our earlier comment about the 10% of revenue was a combination of DDR4 and LPDDR4. The comments that Mark made and what we provided in the prepared remarks as well relate to DDR4 only, which is a low single-digit % of our revenue. LPDDR4 and DDR4 together is around 10% of revenue. DDR4 alone is a low single-digit % of revenue. A lot of the things that you see on the spot market in terms of pricing relate to DDR4 only. That part is a very small part of our overall business.\n\n**Brian Chin** (Director of Applied Technologies)\nGot it. Maybe just one quick follow-up. It sounds like mixed, less consumer orientation in terms of the bit shipments in fiscal 4Q. Is there any reason not toI know you want to guide fiscal 1Q, November gross margins per se, but it would seem seasonal and kind of reasonableness that that mix should only continue to get less consumer oriented into fiscal 1Q. Is there any reason not to think that would not be a bit of a tailwind on top of sort of shipping more 12 high HBM3E into the fiscal first quarter in terms of gross margins?\n\n**Mark Murphy** (CFO)\nYeah, Brian, we did not guidewe are not going to guide first quarter. To your point, in the fourth quarter, we do see two forms of favorable mix. One at a high level. One is just more DRAM growth relative to NAND, and so mixing more DRAM, and then more data center relative to consumer. You have those positive mix effects. To your point on what is the trajectory into the November quarter, the market, we have talked about our inventories are very lean. We are bit constrained as we look out to that quarter. We are focused on the best pricing decisions. We are continuing to work for a favorable mix. That is why on this call earlier, we said that we can expand gross margins in November quarter, we believe.\n\n**Brian Chin** (Director of Applied Technologies)\nGreat. Thank you.\n\n**Operator**\nThank you. Our next question comes from the line of Chris Sencker from TD Cowen. Question, please.\n\n**Eddy Orabi** (Analyst)\nHey, guys. This is Eddie for Chris. Congrats on the strong results. If we go back to June of last year, you guys did give us some color about 2025 demand for HBM. I think you mentioned multiple billion-dollar opportunity, and you gave us some color about that pricing was being negotiated. This time, you guys chose not to. I wonder, are there any specific reasons? Are lead times different for HBM, or is customer behavior different, or the competitive environment? Any color would be great. On that note, I wonder when you guys are expecting to hear from your customer about 2026 demand? That's it for me. Thank you.\n\n**Sumit Sadana** (Chief Business Officer)\nYeah. In terms of 2026 HBM, we do expect that HBM bit growth in 2026 over 2025 calendar year will be significantly faster than the overall DRAM bit growth. HBM will continue to outrun the DRAM bit growth. Now, when it comes to the actual discussions with customers, compared to this time last year, of course, we provided you a lot of details about 2025 expectations and a lot of updates on color every quarter on what kind of milestones we were reaching on HBM and what kind of capacity ramp and yield improvements and percentage growth rates on quarters and billion-dollar quarter, 50% growth after that in FQ3, from that billion-dollar quarter in FQ2, etc., billion-plus quarter in FQ2.\n\n**Sumit Sadana** (Chief Business Officer)\nWe have provided you a lot of these data points over the last several quarters because we were still in the process of ramping our capacity and ramping our revenue and ramping our scale in HBM. Of course, HBM is now over a $6 billion run rate business for us based on the last quarter's reported numbers. We are now at a place where we can not only offer customers with our HBM products, world's best technology, most based on our very mature capability in one beta node, but also the best power consumption capabilities. We have not only that, which we also had last year, but we also now have the capacity in place and the scale in place to be able to meet their growing demand. We have earned the trust of our customers.\n\n**Sumit Sadana** (Chief Business Officer)\nWe have terrific engagements with all of the major HBM consumers in the world. We are deeply embedded in their roadmaps, not just for HBM4, which we have just sampled, but also for HBM4E, where we have multi-year R&D engagements to do co-design work that relate to the custom base die that HBM4E will have. We are very excited about the growth opportunity. We are very confident about our place in the competitive landscape. We are very happy and glad to see the contributions of our team on the execution front, from ramping the high-quality output to getting the financial benefits of growing this business in our portfolio. In terms of the discussions with the customers, our customers are going through a lot of rapid transitions. We're going from 8 high to 12 high. That is in progress right now on HBM3E.\n\n**Sumit Sadana** (Chief Business Officer)\nHBM4 has been sampled to them by us, and they are considering the timing of their platform transitions that will leverage HBM4. Most of our customers are still in the process of finalizing their plans for 2026 in terms of the transition timelines of their key platforms, which will then determine the mix of products they have to purchase. HBM products, as you know, come with very different types of lead times than the rest of the business. We like to ensure that when we start these wafers, we have very good visibility to the demand and good agreement and understanding with our customers on what volumes they will take and what time frame. Consequently, our customers have a higher bar in terms of providing those forecasts to us, a higher bar of fidelity, of quality of those forecasts.\n\n**Sumit Sadana** (Chief Business Officer)\nThey have to go through the assessment of what their platform transition timings will be, what their volumes by product will be. That business, as it has scaled, has become much more complex due to its scale. We are just going through those discussions with those customers. As and when we have the full visibility to all of these numbers and the agreements fall in place, we have confidence that we will end up with a terrific trajectory of our HBM business.\n\n**Eddy Orabi** (Analyst)\nThat's very helpful. Thank you, Samir.\n\n**Sumit Sadana** (Chief Business Officer)\nSure.\n\n**Operator**\nThank you. Our next question comes from the line of CJ Muse from Cantor Fitzgerald. Your question, please.\n\n**CJ Muse** (Senior Managing Director)\nYeah. Thank you for taking the question. I was hoping you could hit on, I guess, where you think you are seeing tariff-related pull-ins, and if you can kind of comment between both DRAM and NAND and kind of consumer, non-consumer. You did take up your DRAM bit outlook for the year. Can you also discuss what's driving the uptick there? Thanks so much.\n\n**Sumit Sadana** (Chief Business Officer)\nYeah. I think I had mentioned earlier in the callI will take your second part of the question first. I had mentioned in the earlier part of the call that the improvement in the DRAM outlook for the calendar year 2025 has nothing to do with any kind of tariff-related movement that may have occurred for some customers. It has a lot to do with the fact that we continue to see robust demand driven by AI in the data center. This is not just HBM demand, but all data center-related DRAM demand. We are seeing improvements from the CQ1 levels of data center SSD type of demand there as well. Really, the other area of improvement beyond the data center and DRAM has come from our improved view of what is happening in the industrial and broad distribution markets. These markets have not grown much for many quarters.\n\n**Sumit Sadana** (Chief Business Officer)\nYou have seen that view across the semiconductor industry. These markets seem to be improving their growth trajectory, forming up their growth forecast. That is helping the 2025 view of DRAM growth. As it relates to the tariffs and what some customers may have done, first, I just wanted to reiterate that whatever impact tariffs may have had on customer order patterns, we think that overall impact is fairly modest in our SQ3 numbers. We actually are not too concerned about what the tariff-related impact has been because our customers' aggregate demand signals for the remainder of calendar 2025 continue to be healthy. We feel like we are in a constructive demand environment for the remaining part of calendar 2025. Of course, there is uncertainty related to tariffs and whatever may hence happen to the macro environment.\n\n**Sumit Sadana** (Chief Business Officer)\nWe are mindful of that uncertainty, but we also know that we are one of the most agile businesses out there in responding to any changes that may occur. With that said, the tariff-related movement from certain customers may have mainly been to stage inventory of their own finished goods in different parts and different geographies. That may have created some need for memory products in terms of pull-in effect. Again, the overall impact is fairly modest.\n\n**CJ Muse** (Senior Managing Director)\nThank you.\n\n**Sumit Sadana** (Chief Business Officer)\nSure.\n\n**Operator**\nThank you. As a reminder, ladies and gentlemen, if you do have a question at this time, please press star 11 on your telephone. Our next question comes from the line of Vijay Rakesh from Mizuho. Your question, please.\n\n**Vijay Rakesh** (Manging Director)\nYeah. Hi, just a quick follow-up. When you look at your HBM4, I think you guys mentioned the CMOS logic die. Can you talk to how that compares toI think some of your peers have talked about FinFET as welland how that could drive higher ASPs on your HBM4, I guess, versus HBM3E? Thanks.\n\n**Sumit Sadana** (Chief Business Officer)\nYeah. The HBM4 cost and price is expected to be higher than HBM3. We do expect that the product itself has remarkably better specs, as you have seen from our press release as well on HBM4. In terms of value that it creates at the system level, it is also very robust value for our customers. We do expect that the pricing on HBM4 on a per-bit basis will be higher than that of HBM3E. We definitely will look forward to the tailwind from that growth as well.\n\n**Manish Bhatia** (EVP of Global Operations)\nVijay, I think Sanjay made this point. I think Sanjay made this point on the call. Maybe everyone knows this, but the JEDEC standard die size for HBM4 is larger than it is for HBM3E for all players. That is why the trade ratio, the cost with HBM4 will be higher. Just to reiterate, we're building our HBM4 on our now two-years-old one-beta technology, very, very proven, very strong-performing product. Similarly, our logic die is going to be built internally. The integration between the memory and the logic is also proven from our HBM3E processes. The advanced packaging process, we're leveraging all the learning. We feel very good about the roadmap decisions that we've made relative to HBM4 in order to intersect the market as soon as our customers are ready with a terrific-performing product as well.\n\n**Vijay Rakesh** (Manging Director)\nGot it. Just one quick last one on the pull-in. Sorry to be the dead horse. I know you said still seeing second-half strong data center, but is there any pull-in from Q1 into Q4? Should we be concerned about that? How can you frame that a little bit? Thanks.\n\n**Sumit Sadana** (Chief Business Officer)\nYeah. We think that any kind of pull-in activity in aggregate, whether it is Q3, FQ3, FQ4, is a modest amount of impact. We continue to feel that the overall demand environment beyond the FQ4 time horizon, which is the rest of the calendar year beyond FQ4, remains in a healthy place in terms of our customer signals. This is part of the reason why we also feel good about driving the pricing of our products. Our inventories are in a good place. We expect the pricing to improve in FQ4. We do not see that as just a very much tariff-related or pull-in-related effect. It is more of an overall market environment impact. That is why we have also provided you a view of DRAM bit growth in calendar 2025, which is now improved versus what we mentioned to you just a quarter ago.\n\n**Vijay Rakesh** (Manging Director)\nSounds good. Thank you.\n\n**Operator**\nThank you. Our next question comes from the line of Timothy Arcuri from UBS. Your question, please.\n\n**Timothy Arcuri** (Managing Director)\nThanks. I'm trying to figure out just the pricing modeling on HBM. So nearly half of the dollar revenue growth in DRAM came from HBM, where we know that the price is many multiples of non-HBM. I don't know. Most would say it's probably four and a half to five X. I get that the HBM ASPor sorry, that the non-HBM ASP would have come down because of the mixed-to-consumer. Why would the HBM ASP have come down? Because it had to come down a lot for overall DRAM pricing to be down if half of the dollar growth came from HBM. Pricing had to be down on HBM. Why would that have been the case? Is this product transition-related? I guess I'm just asking, is the pricing noisy on a sequential basis? Yeah. Thanks.\n\n**Sumit Sadana** (Chief Business Officer)\nYeah. I mean, the HBM pricing is not noisy, and it's not going up and down in the way you're describing. I think if you look at our results, and particularly, I'll point you to the growth in our mobile business, which has been very significant. The price points in mobile tend to be quite low compared to data center. Definitely, when you look at the overall mix, and the mobile business is a pretty sizable business. It's not a trivial business. It's a large part of the TAM as well. When you look at the overall effect, on a like-for-like basis, we have improved pricing, but we have growth in HBM happening, but we also have fairly significant increase in consumer-oriented mix in FQ3. We had highlighted when we provided guidance for FQ3 last quarter.\n\n**Sumit Sadana** (Chief Business Officer)\nWe highlighted to you that we would be having a significant increase in our consumer mix. That has been driven by the fact that it took several quarters for the inventories in client and smartphones to get to healthy levels after being heavy in inventory in the second half of calendar 2024. We were shipping into these markets on the consumer side at a very low rate compared to the ship-out rate on these markets because of that inventory level. When that inventory level became normalized, our growth rate in FQ3 has suddenly jumped in a lot of these consumer end markets, which carry lower price points. Even though we have had very steady pricing on the HBM front and like-for-like pricing increases, the mix change has been so sharp that it has caused the impacts on the high-level pricing that we're observing in the numbers.\n\n**Timothy Arcuri** (Managing Director)\nRight. So the message is that HBM price was still up. It's that the non-HBM price was down such that the blended ASP was down low single digits. That's the message, correct?\n\n**Sumit Sadana** (Chief Business Officer)\nYeah. I mean, the message is that the HBM pricing is steady, and the pricing we have on the DRAM side, like-for-like, has improved sequentially. It is really the mixed change on the consumer side that has done this. Now, we spoke about this on the DRAM side, but of course, on the NAND side, we have some different dynamics, including the fact that the market environment is not as healthy as it is on the DRAM side. It is a more challenging environment on the NAND side. The NAND dynamics are different. I just wanted to make sure that I clarify that the DRAM dynamics are very healthy.\n\n**Timothy Arcuri** (Managing Director)\nTotally. Totally great. Just one last quick one. Just on the cost. Cost had to be down a lot in both DRAM and NAND. It had to be down like mid-single digits in both. Definitely better than what I would have thought. Why was that? I know, Mark, you talked about these NAND headwinds, but it seems like they were not anywhere near as bad as what you thought they would be. How did the cost work so that they were down so much?\n\n**Manish Bhatia** (EVP of Global Operations)\nYeah. Mark and then I'll add some color.\n\n**Mark Murphy** (CFO)\nYeah. I would just say, Tim, that I mean, mix affects cost, as you know. And so there's some of those effects. I think just on cost overall, front-end bit cost reductions, HBM and DRAM and for NAND, they're generally on track with the front-end cost reduction ranges that we've talked about before. I think that's if you're looking to model things going forward, I think that's something to keep in mind. Our business is changing to this mix issue. Our business is changing with our focus on the higher performance part of the market. Sometimes that has some higher costs associated with it, but it's higher margin. We get higher value out of that. Again, the mix is really affecting the cost.\n\n**Mark Murphy** (CFO)\nYou'll see us move away from traditionally what we would do is drill into the cost detail every call because it's becoming a harder metric to follow with the improving mix that we are driving in the business.\n\n**Manish Bhatia** (EVP of Global Operations)\nYeah. Tim, I'll just add a littleI mean, you mentioned on the call that our HBM 12 high yields are doing better than our initial HBM 8 high ramp was a year ago at this time and better than our expectations. That is overall HBM gave me a little better than our expectations last quarter. There were certain other areas that Mark and Sanjay both commented on a little bit that our cost performance was operationally better. As Mark mentioned, a lot of it is due to mix as well.\n\n**Timothy Arcuri** (Managing Director)\nCool. Okay. Thank you so much.\n\n**Operator**\nThank you. For our final question today, it comes from the line of James from Citi. Your question, please.\n\n**Operator**\nHi there. Yeah. This is James filling in for Chris. Just had one question. Last, I think it was probably about a couple of months ago, but you said the August quarter gross margins could be flattest to slightly up compared to this quarter. Was there any major change in that other than some pricing? You talked about the data center mix, but just wanted to dig on that. Thanks.\n\n**Mark Murphy** (CFO)\nYeah. I think I covered this on the main call that when we provide that guidance, it was in a period of transition. We did know that inventory outlook was improving. We indicated on that call that we intended to work to inflect price. The conditions of the market are just better than we expected when we gave that guidance. Our performance, particularly on price relative to what we thought the market would bear, was better. That is carrying into the fourth quarter. Now, you reset the baseline. We did 39 versus our guide of 36.5. From that baseline of 39, we are seeing still a constructive market environment, particularly in DRAM, or especially in DRAM. We are still focused on price. The 39-42 guide is alsothe majority of that is driven by favorable mix effects.\n\n**Mark Murphy** (CFO)\nMore DRAM growth relative to NAND. And if we cut by markets, more data center than consumer-oriented mix.\n\n**Mark Murphy** (CFO)\nThank you.\n\n**Operator**\nThank you. This does conclude the question and answer session as well as today's program. Thank you, ladies and gentlemen, for your participation. You may now disconnect. Good day.",
      "fetched_at": "2026-02-04T15:48:45.416Z"
    }
  ]
}