{
  "ticker": "NXPI",
  "last_updated": "2026-02-04T15:45:48.605Z",
  "total_transcripts": 5,
  "transcripts": [
    {
      "ticker": "NXPI",
      "title": "NXP Semiconductors N.V. (NXPI) Q4 FY2025 earnings call transcript",
      "published_date": "Feb 3, 2026, 8:00 AM EST",
      "fiscal_year": "2025",
      "quarter": "Q4",
      "url": "https://finance.yahoo.com/quote/NXPI/earnings/NXPI-Q4-2025-earnings_call-397076.html",
      "content": "**Operator**\nLadies and gentlemen, thank you for standing by. Welcome to NXP fourth quarter 2025 earnings conference call. At this time, all participants are in a listen-only mode. After the speaker's presentation, there will be a question-and-answer session. To ask a question during the session, you would need to press star one one on your telephone. You will then hear an automated message advising your hand is raised. To withdraw your question, please press star one one again. Please be advised that today's conference is being recorded. I would now like to turn your conference over to Jeff Palmer, Senior Vice President, Investor Relations. Please go ahead.\n\n**Jeff Palmer** (VP of Investor Relations)\nThank you, Michelle, and good morning, everyone. Welcome to NXP Semiconductors earnings call today. With me on the call today is Rafael Sotomayor, NXP's President and CEO, and Bill Betz, our CFO. The call today is being recorded and will be available for replay from our corporate website. The call will include forward-looking statements that involve risks and uncertainties that could cause NXP's results to differ materially from management's current expectations. These risks and uncertainties include, but are not limited to, statements regarding the macroeconomic impact on the specific end markets in which we operate, the sale of new and existing products, and our expectations for the financial results for the first quarter of 2026. NXP undertakes no obligation to revise or update publicly any forward-looking statements. For a full disclosure of forward-looking statements, please refer to our press release.\n\n**Jeff Palmer** (VP of Investor Relations)\nAdditionally, we will refer to certain non-GAAP financial measures, which are driven primarily by discrete events that management does not consider to be directly related to NXP's underlying core operating performance. Pursuant to Regulation G, NXP has provided reconciliation to the non-GAAP financial measures to the most directly comparable GAAP measures in our fourth quarter 2025 earnings press release, which will be furnished to the SEC on a Form 8-K and available from NXP's website in the investor relations section. Now, I'd like to pass the call to Rafael.\n\n**Rafael Sotomayor** (President and CEO)\nThank you, Jeff, and good morning. We appreciate you joining our call today. Our overall performance during the fourth quarter was solid, with all end markets performing either in line or better than expected. All regions were up on a year-on-year basis. Turning to the specifics, NXP delivered fourth quarter revenue of $3.34 billion, an increase of 7% year-on-year and up 5% sequentially. This was $35 million better than the midpoint of our guidance. Non-GAAP operating margin in the fourth quarter was about 35%, 40 basis points above the same period a year ago and in line with the midpoint of our guidance. Taken together, we drove non-GAAP earnings per share of $3.35, $0.07 better than guidance. Distribution inventory was 10 weeks, consistent with our guidance.\n\n**Rafael Sotomayor** (President and CEO)\nWe remain disciplined on channel health, prioritizing sell-through of high-demand products rather than broad-based restocking. Now, I would like to reflect on our performance in 2025. The year was a tale of two halves, with the first half of the year exhibiting weaker demand trends, while in the second half of the year, demand began to accelerate in support of our long-term revenue growth model. Looking at the specifics, automotive revenue was $7.1 billion, flat year-on-year, due to slower inventory digestion at direct customers in the first half of 2025. With the inventory digestion behind us, the second half performance aligns with our eight to 12 long-term growth outlook, reflecting the underlying strength of our auto portfolio.\n\n**Rafael Sotomayor** (President and CEO)\nA few examples which underpin our optimism include our efforts in software-defined vehicles, where we have seen strong global adoption of NXP products. These include design win rates for our S32M family of 5-nanometer vehicle compute processors, the newly introduced S32K family of 16-nanometer zonal processors, and continued adoption of automotive Ethernet products. These efforts are now material and global in nature, with most auto OEMs undertaking SDV platform initiatives. Additionally, the early conversations with customers on the recently acquired technologies from TTTech Auto and Aviva Links are accelerating interest in NXP's SDV portfolio. The potential revenue contribution from this engagement should materialize beyond 2027. This multiyear SDV platforms deepen customer commitment and support mix improvement over time. Turning to the industrial and IoT end market, revenue was $2.3 billion, flat year-on-year.\n\n**Rafael Sotomayor** (President and CEO)\nThe second half growth was materially above our 8%-12% long-term growth outlook across both core industrial and consumer and IoT. Supporting our ambition to lead in intelligent systems at the edge, we continue to see strong customer engagement in the emerging markets and physical AI. By combining the industry-leading i.MX family of industrial application processors with the recently acquired Kinara NPU, we can deliver complete and scalable AI platforms that accelerate deployment at the edge. A few examples of applications include medical imaging systems, camera-based workplace safety system in the industrial market, logistic automation systems, and robotics. Customer interest has been exceptionally strong, and these engagements reinforce our vision of physical AI and the power of the NXP platform. These opportunities expand our addressable market, support sustainable growth, and validate the unique competitive nature of our complete system portfolio.\n\n**Rafael Sotomayor** (President and CEO)\nLooking at our mobile business, revenue in 2025 was solid at $1.6 billion, up 6% year-on-year. We saw stronger demand and content gains in the premium mobile market. Overall, NXP remains a specialty supplier in the mobile market, with a unique and defensible franchise center on secure mobile transactions. Finally, the revenue in the communications infrastructure market was $1.3 billion, down 24% year-on-year. As we have said in the past, we anticipate flat growth over the longer term as the Digital Networking and RF Power business decelerate, which will be offset by growth in our Secure Car business, which includes our UCODE RFID tagging solutions. Now, I will turn to our expectations for the first quarter. Our forecast for the first quarter is better than we anticipated 90 days ago.\n\n**Rafael Sotomayor** (President and CEO)\nWe expect all regions and all end markets to be up year-on-year. We're guiding first quarter revenue to $3.15 billion, up 11% versus the year-ago period, and seasonally down 6% sequentially. Compared to 90 days ago, the improvements reflect steady inventory normalization and auto tier ones, broadening order strength across both core industrial and consumer and IoT, and program ramps in the premium mobile market, consistent with seasonal patterns. Our guide does not assume broad-based restocking. At the midpoint, we expect the following trends in our business during Q1: Automotive is expected to be up in the mid-single digit versus Q1 2025, and down in the mid-single digit percent range versus Q4 2025. I would like to highlight that our first quarter revenue guidance only includes about $25 million or one month of revenue contribution from the MEMS sensor business.\n\n**Rafael Sotomayor** (President and CEO)\nIndustrial and IoT is expected to be up in the low-20% range year-on-year and down in the mid-single-digit range versus Q4 2025. Mobile is expected to be up in the mid-teen percent range year-on-year and down in the 20% range on a sequential basis. Finally, communication infrastructure and other is expected to be up in the mid-teen percent range versus Q1 2025, and up 10% versus Q4 2025. In summary, our first quarter outlook reflects early validation of the company's specific growth drivers we've been investing in, and we expect these trends to continue throughout 2026. We believe the NXP-specific secular drivers for our business are now outweighing the broader industry cyclical headwinds, which we have experienced over the last few years.\n\n**Rafael Sotomayor** (President and CEO)\nOverall, we expect product mix and disciplined cost execution to continue to support a gross and operating margin framework. We're focused on disciplined investment and portfolio enhancements to drive profitable growth while maintaining control over the factors we can influence. Our capital allocation framework is unchanged. Invest for growth, pursue targeted M&A to strengthen the portfolio, and return excess cash through dividends and buybacks within our long-term model. Now, I would like to pass the call to Bill for a review of the financial performance.\n\n**Bill Betz** (CFO)\nThank you, Rafael, and good morning to everyone on today's call. As Rafael has already covered the drivers of the revenue, I will move to the financial highlights. Overall, our results reflect the strength of our strategic priorities in our end markets, our disciplined investment in manufacturing and product leadership, and our consistent commitment to generating long-term shareholder value. Q4 was solid, with strong execution and results above the midpoint of guidance. Revenue, gross profit, and operating profit were all back into our long-term financial model. We delivered non-GAAP earnings per share of $3.35, or $0.07 better than the midpoint of guidance. Non-GAAP gross profit was $1.91 billion, with a 57.4% non-GAAP gross margin, a slight miss versus guidance, driven by stronger-than-expected mobile revenue.\n\n**Bill Betz** (CFO)\nNon-GAAP operating expenses were $756 million, or 22.7% of revenue. The primary increase sequentially is driven by our two new acquisitions, where we continue to make space for our strategic investments, offset by restructuring actions. Non-GAAP operating profit was $1.15 billion, and non-GAAP operating margin was 34.6%, up 80 basis points sequentially. Below the line, non-GAAP interest expense was $99 million, and taxes were $190 million. Non-controlling interest was a $13 million expense, and results from equity accounted investee, was a $1 million loss. Taken together, the below-the-line items were $4 million better than our guidance. While stock-based compensation, which is not in our non-GAAP earnings, was $100 million, $18 million lower than guidance, driven by the retirement of several executives.\n\n**Bill Betz** (CFO)\nTurning to changes in cash, debt, and capital returns, our balance sheet remains strong, giving us the flexibility to invest in our strategic priorities and hybrid manufacturing plans. We ended Q4 with $12.2 billion in total debt and $3.3 billion in cash, reflecting uses of cash for capital returns, acquisitions, joint venture investments, and CapEx, offset by cash generation during the quarter. Net debt was $8.96 billion, and net debt to Adjusted EBITDA was 1.9x, with Adjusted EBITDA interest coverage ratio of 14.7x. In Q4, we returned $338 million through buybacks and $254 million in dividends. Over the last ten years, we have returned over $23 billion to our shareholders, for 95% of free cash flow, and reduced our diluted share count by 27%.\n\n**Bill Betz** (CFO)\nAfter Q4, we repurchased another $36 million under our 10b5-1 program, and on January 5th, we redeemed the $500 million March 2026 notes with our cash on hand. Now, turning to working capital metrics. Days of inventory was 154 days, which included seven days of pre-build. Receivables were 29 days, payables were 60 days. Taken together, our cash conversion cycle was 123 days. As revenue growth accelerates, we expect working capital efficiency, particularly days of inventory, including pre-builds, to meaningfully improve throughout the year. From a cash usage perspective, we continue to advance our long-term manufacturing strategy, including contributions to both VSMC and ESMC. This will lead to a long-term supply resiliency and strong gross margin expansion.\n\n**Bill Betz** (CFO)\nCash flow from operations was $891 million, and net CapEx was $98 million, resulting in non-GAAP free cash flow of $793 million, or 24% of revenue. We invested $195 million in long-term capacity access fees, made a $282 million equity payment to VSMC, and a $44 million equity payment to ESMC. Taken together, we are about 50% through the investment cycle for both VSMC and ESMC, having invested about $1.7 billion of the $3.4 billion planned investments. We expect the majority of remaining investments will occur in 2026. Now, turning to our expectations for Q1.\n\n**Bill Betz** (CFO)\nWe expect revenue of $3.15 billion ±$100 million, up 11% year-on-year and down 6% sequentially, which is better than our view 90 days ago. We expect non-GAAP gross margin of 57% ±50 basis points. Operating expenses are expected to be $765 million ±$10 million, reflecting normal seasonal increases at the start of the year. We are committed to our long-term operating expense model of 23% of revenue, though there are seasonal variations, with the first half of the year normally higher than the second half, resulting in non-GAAP operating margin of 32.7% at the midpoint. Below the line, we expect non-GAAP financial expense to be about $92 million and our non-GAAP tax rate to be 18%.\n\n**Bill Betz** (CFO)\nNon-controlling interest expense will be $11 million, with our joint venture startup losses of about $3 million. Stock-based compensation should be about $108 million, which is not included in our non-GAAP guidance. This implies Q1 non-GAAP earnings per share of $2.97 at the midpoint. Turning to the uses of cash in Q1, we expect capital expenditures to be approximately 3% of revenue, our capacity access fee payment of $190 million, and an equity investment into VSMC of $210 million. Before turning to your questions, I have a few housekeeping items to highlight. After thoughtful consideration, we have decided that our RF Power business no longer aligns with our long-term strategic direction. Consequently, we will stop new product development and have taken an approximately $90 million restructuring charge, which is reflected in our fourth quarter GAAP results.\n\n**Bill Betz** (CFO)\nWe will redirect and focus our R&D resources to accelerate and enhance our strategic priorities towards software-defined vehicles and physical AI. Yesterday, after the market closed, STMicroelectronics announced the closure of NXP's MEMS sensor business acquisition. This is a positive transaction for both parties. NXP received $900 million in gross proceeds, with another $50 million to be received upon completion of certain closing conditions. We will recognize a one-time gain of approximately $630 million from the sale of the business, which is reflected in our first quarter's GAAP guidance. Next, we have made the decision to shift our geographic revenue reporting to headquarters-based region as opposed to a ship-to basis. We believe reporting headquarters-based region better reflects how we manage the business internally and where customer engagements and design win awards occur.\n\n**Bill Betz** (CFO)\nThe 2025 change can be found in the posted IR presentation. And finally, based on the positive trends, including current order rates and business signals we track, we are confident NXP will operate within its long-term financial model for the full year of 2026. In closing, we are well positioned to benefit from the powerful secular trends in our four focus end markets. We are confident about the strategic priorities and investments we are making across our entire portfolio and manufacturing footprint. With a strong balance sheet and a disciplined capital return philosophy, we are exceptionally well positioned to drive long-term value for our shareholders. Now, I would like to turn it back to the operator for your questions.\n\n**Operator**\nTo please press star one one on your telephone and wait for your name to be announced, and to withdraw your question, please press star one one again. We do ask that you please limit to one question and one follow-up. The first question will come from Tom O'Malley with Barclays. Your line is open.\n\n**Tom O'Malley** (Equity Research Director)\nHey, guys. Thanks for taking my question. I wanted to ask about the channel restock. So it looks like you guys went from nine to 10 weeks. In your guidance, you're saying no additional restock, kind of, baked in. Could you talk about where you are with the channel today, what you saw in the last quarter? And is it the decision to just not go to 11 weeks overall? Or is it just, we're gonna wait a little bit until we take it to the 11 weeks that we talked about previously? Thank you.\n\n**Rafael Sotomayor** (President and CEO)\nThank you, Tom. Let me take that one. It's Rafael. Yeah, clearly, I mean, I would say that our account strategy has shifted from, you know, what before we considered tight control to ensure that we staged the right product, the right product to satisfy demand. We are moving to our long-term target of 11 weeks, and the reason we're doing that is because it is a reflection of an improving demand environment for us. We finished Q4 with about 10 weeks. We will move into our long-term plan and long-term target of 11 weeks into 2026, and that's how we are going to manage our business in a steady state.\n\n**Tom O'Malley** (Equity Research Director)\nGotcha. Then as a follow-up, just on the comms business, so, you're deciding to move away from RF, but you had already kind of moved away from Digital Networking. You're guiding that business up 10%. Could you maybe walk through the moving pieces? Obviously, with Digital Networking coming down, you needed to see some really, you know, some strength from maybe the SIS business. Just walk through what's contributing to that Q1 strength. Thank you.\n\n**Rafael Sotomayor** (President and CEO)\nYeah, indeed, Tom. We did guide C&I about 10%, sequentially in Q1. And if you remember, C&I includes three distinct businesses: Secure Cars, Digital Networks, and RF Power. And they, they all of these three businesses can move differently quarter to quarter. And C&I, I think, right now is benefiting from the fact that, one, there's normalization in the Digital Networking business, but there's growth coming from the secure car, and, and that strength really will benefit C&I throughout 2026.\n\n**Tom O'Malley** (Equity Research Director)\nThank you.\n\n**Operator**\nThank you. And the next question will come from Matthew Prisco with Cantor. Your line's open.\n\n**Matthew Prisco** (Director)\nHey, guys. Thanks for taking the questions. I guess starting with the cyclical side, can you maybe offer some more color on customer ordering trends over the past few months, and maybe what type of linearity you saw through the quarter and into 1Q?\n\n**Jeff Palmer** (VP of Investor Relations)\nYeah, Matt, are you asking about the kind of trends that we track internally? Is that what you're asking? We couldn't quite hear your question. We apologize.\n\n**Matthew Prisco** (Director)\nOh, yes, that's exactly it. The trends that you track internally when you look at just customer ordering trends over those past few months, and then linearity through the quarter and into 1Q.\n\n**Jeff Palmer** (VP of Investor Relations)\nYeah, linearity, we don't, we don't disclose, but I think Bill will take some of the other metrics we track.\n\n**Bill Betz** (CFO)\nYeah, no, no. Obviously, over the quarter in the last 90 days ago, all our internal signals that we talked about in the past have improved. So think about our backlog, our distributions backlog, our customer escalations have increased. The short-term orders continue to increase as well, and we try to service as much as possible related to that. So across the board, we haven't seen anything like this in quite a while, and so we feel very confident about being in a long-term business model for 2026.\n\n**Jeff Palmer** (VP of Investor Relations)\nAnd maybe I'll just add one thing, Bill. If you kind of step back, Matt, and look at kind of the trends in the second half of 2025, they've truly started to accelerate, and we're in, you know, close to our growth rates that we presented at our Analyst Day. We believe that will continue as we progress through 2026. So we're feeling pretty optimistic that we are off the trough of the business.... Did you have a follow up?\n\n**Matthew Prisco** (Director)\nYes, please. I guess on the auto side, would love if you can offer some detail on the demand dynamics within your core auto business versus your accelerated growth drivers. And have you seen any impact to date from component price increases, potentially pressuring unit demand there? Thanks.\n\n**Rafael Sotomayor** (President and CEO)\nYeah, so we, I think there are a few questions there on auto. If you look at what happens, if you look at auto and the reason why we remain quite optimistic in auto, in Q4, our business returned to growth year-on-year. And the guide that we provided continues, you know, year-on-year, the Q1 guide gives you growth, as well, year-on-year. And so, and what we see is that business remains unchanged with respect to content gains. You asked me about pricing. Second question was on pricing. VPAs for the most part are done, right? With, in the pricing that is already reflected in our Q1 guide.\n\n**Rafael Sotomayor** (President and CEO)\nWe are modeling low single digit price declines, and that's what we see not only in auto but across the business.\n\n**Operator**\nThank you. And our next question will come from Ross Seymore with Deutsche Bank. Your line is open.\n\n**Ross Seymore** (Managing Director)\nHi, guys. Thanks for asking the question. Just sticking on the auto side of things, it's been, you know, pretty much flat for a couple, two, three years in a row. I know there's been a bunch of puts and takes on inventory and demand, et cetera, but I really wanted to dive into what you've seen over that period of time in your accelerated growth drivers. Is anything changing your thesis there? Are you more optimistic, less optimistic? Any sort of clarifications there, especially as we move forward. Hopefully, the headwinds are done, and so I just wanted to judge the growth rate from those drivers going forward. Thank you.\n\n**Rafael Sotomayor** (President and CEO)\nYeah, thanks, Ross. So I think what I said on the prepared remarks, right, auto in our business in general in 2025 was the story of two halves, and the first half was all about inventory digestion, and it really masked the true dynamics of our business. For the full year, the auto accelerated drivers were slightly below model. Remember model, we said that we were going to grow 8%-12%, but they were still growing in a year where auto was flat. And they were about 10%, and it was all led by our SDV efforts, our radar and our productivity. What you see right now in auto is our auto is shifting.\n\n**Rafael Sotomayor** (President and CEO)\nOur auto exposure is shifting to more and more structural and less cyclical, and it's driven by, you know, tying our roadmap to a secular trends are really transforming the architectures of auto. So we feel quite optimistic. The answer to the question on the core drivers, there's the, the whole story, the thesis is completely intact, and we feel stronger than ever that our, our roadmap is really addressing the needs of the market.\n\n**Ross Seymore** (Managing Director)\nGreat, thanks for that. And I guess, you had the MEMS divestiture and now the exit of the RF side of things. Can you aggregate, you know, how much of a headwind those exits are gonna be for this year? And I obviously know where the RF sits, but is the MEMS headwind in the auto side? Just wanna kinda make sure to level set on that.\n\n**Bill Betz** (CFO)\nSure. The way to think about... Oh, this is Bill, Ross. Good morning. The way to think about the sensors divestment, it runs around $300 million per year, and, Rafael shared, we recognized $25 million in the first quarter, and I think you guys can do the math of the impact that has from a year-over-year compare in our auto end market. Related to the RF business, the RF business is probably gonna track similar to what DN did. If you recall, our Digital Networking business, when we walked away from it, I don't know, eight years ago, it lives quite long. And so what we're actually doing is stop investing next generation products.\n\n**Bill Betz** (CFO)\nSo that will probably stay with us for at least the next two years, is what we're projecting at the current rate. And I think, Jeff, if we had to break out 2025 as a percentage of comms infra pieces, I don't have that on my fingertips, so we can usually share that, but maybe you can share how the three businesses fared in 2025 to get the size of it.\n\n**Rafael Sotomayor** (President and CEO)\nSure. Well, so the Secure Car business was just over 50%, and both the Digital Network and RF Power businesses were each about 25%.\n\n**Ross Seymore** (Managing Director)\nThank you.\n\n**Rafael Sotomayor** (President and CEO)\nThanks, Ross.\n\n**Operator**\nThank you. Our next question will come from Joe Moore with Morgan Stanley. Your line's open.\n\n**Joe Moore** (Managing Director and Semiconductor Industry Analyst)\nGreat. Thank you. In the auto business, there's been a number of sort of these supply disruptions. We had an Nexperia a few months ago causing issues. DDR4 now is causing some shortages. You know, is that impacting you guys in any way? Are you seeing either weaker demand because they're bottlenecked by those things, or is there any desire for tier ones to start building inventory to react to any of those things?\n\n**Rafael Sotomayor** (President and CEO)\nYeah, let me take that, Joe. So the Nexperia is not a conversation, it's not been a non-issue for NXP. The discussions on memory, there's always this chatter on memory is not just in autos, across our end markets. We have not seen memory impact the orders of our customers, but clearly it's a conversation that our customers discuss with us as an area of concerns for the second half of the year, but nothing has been reflected in our orders.\n\n**Joe Moore** (Managing Director and Semiconductor Industry Analyst)\nGreat. Thank you for that. And then in your auto business, any difference by region? I guess there's been some concern about China demand, just anything you're seeing regionally in your auto business.\n\n**Rafael Sotomayor** (President and CEO)\nNo, we don't see anything particular to comment on. I think the auto business, we believe it's gonna be within model for 2026 for us. It's strong, the accelerated growth drivers are executing, so we expect our thesis to continue towards 2026.\n\n**Joe Moore** (Managing Director and Semiconductor Industry Analyst)\nGreat. Thank you.\n\n**Operator**\nThank you. Our next question will come from Joshua Buchalter with TD Cowen. Your line's open.\n\n**Joshua Buchalter** (Managing Director)\nHey, guys. Thank you for taking my question. I apologize for a bit of a nitpicky semantic one, but it's one I've gotten a couple times. So, you know, in your prepared remarks, you said for 2026, you expect to operate within your target model, this year. You know, I think you're given the way we ended 2025, to hit your 6%-10% long-term CAGR, you know, 2026 and 2027 would have to be higher than that. You know, are you guys suggesting like this year is within the 6%-10%? Or are you saying that, you know, you should track towards the 6%-10% over a three-year period, in 2026 and 2027?\n\n**Jeff Palmer** (VP of Investor Relations)\nI think, Josh, what we're saying is the long-term model is intact. I think not to be nitpicky back, but I think you know how to do math, and you can probably do the, the chainsaw on that. But we, we feel very strongly that after the inventory digestion in the first half of 2025, things are starting to reaccelerate. So we'll, we'll leave there, leave it there. Did you have a follow-up?\n\n**Joshua Buchalter** (Managing Director)\nYeah. You know, can you maybe provide some more puts and takes on gross margin for the first quarter, in particular? How are you thinking about utilization rates as we sort of enter a better cyclical period? I know there were some die bank builds that boosted utilization rates at the end of the year. You know, and those done, how should we think about utilization rates from here? Thank you.\n\n**Bill Betz** (CFO)\nYeah, let me take that one. So I would say gross margins are performing to our expectations into Q1, and this is primarily driven by our annual low single-digit price concessions that Rafael shared, and that is offset only partially from our normal operational efficiencies that we regained back throughout the year. Again, I think for modeling purposes, the best way to think about our gross margins, use that rule of thumb I provided in the past for every $1 billion of revenue. We're entitled to approximately 100 basis points expansion gain to our gross margin on a full-year basis, and of course, that's the plus or minus normal mix changes that we share on a quarterly basis. Now, as shared in the past, we will continue to work on mixing up our portfolio through our new product introductions.\n\n**Bill Betz** (CFO)\nAlso, we're focused on our go-to-market for that long tail, which tends to be a richer mix. We also have the ability to improve our internal front-end utilizations. The front-end utilizations in Q4 were in the high 70s, and in Q1, they will remain in the high 70s. Obviously, if we get any inflationary costs that we can't offset internally, we will protect our gross margins and pass those on to our customers. And, and as you know, we always do the normal block and tackling on, improving our yields and test time reductions. Now, longer term, we're quite excited, on our hybrid manufacturing strategy, especially when VSMC is fully loaded in 2028, it is on track. And beyond, we expect our gross margins to be lifted by another 200 basis points at the company, level.\n\n**Bill Betz** (CFO)\nSo I would say in general, we, we are very committed to improving our gross margins over the long term. Related to inventory question, again, our prebuilds were seven days, sorry, at the end of 2025. As you all know, our consolidation efforts and our manufacturing footprint are underway. I would expect the prebuilds, by the end of 2026, be about 15-20 days, related to that. But including those prebuilds, we also expect to take our net inventory days down throughout the year, as we continue to focus in what's in our control and do the right thing operationally, to give you some more color on where we plan to take internal inventory.\n\n**Joshua Buchalter** (Managing Director)\nAppreciate all the detail there, Bill. Thank you.\n\n**Operator**\nThank you. Our next question will come from Vivek Arya with Bank of America Securities. Your line's open.\n\n**Vivek Arya** (Managing Director)\nThanks for taking my question. On the industrial and IoT segment, Rafael, I was hoping you could help segment how much of that is industrial, how much of that is IoT? And you know, off of easier compares, the growth rate is very high at the start of the year. But should we expect that this segment will also be in model for 2026? Just how, how are you looking at the, you know, potential growth scenarios for industrial and IoT this year?\n\n**Rafael Sotomayor** (President and CEO)\nYeah. Thank you, Vivek. So yeah, very strong growth we've seen right now in industrial, right? And the, and the growth, you saw the inventories begin recovering in Q3, and continue into Q4. I think Q4 was 20% year-on-year of growth. The growth is fairly broad-based, and it's not a single segment that is driving the growth. Just to give you an answer on the, on the question specific, you know, we have about 60, 60% of our business there is core industrial, 40% is in the consumer side. But the growth is broad-based. But we saw, I mean, if I would give you, we have some notable traction on fuse sockets in healthcare and smart glasses. We've seen strength in factory automation and energy storage.\n\n**Rafael Sotomayor** (President and CEO)\nAnd so very, very strong design wins with very differentiated product that we have in industrial and IoT. That strength of closing 2025 continues in 2026. I mean, you see the Q1 guide was also growing year-on-year 20%, and we feel very good about 2026 for industrial and IoT.\n\n**Vivek Arya** (Managing Director)\nAll right. And for my follow-up, I would be remiss not to ask the seasonality question as we look at Q2 and Q3. And I ask that just, just because of, you know, all the kind of the exits and things that, that you're considering this year. So based on, you know, historical patterns and normalizing for all your business divestitures, what would you consider normal seasonal trends in Q2, Q3? And, and are there any other things this year that we should take into account as we model your quarterly cadence this year? Thank you.\n\n**Rafael Sotomayor** (President and CEO)\nVivek, we're not gonna, we're not gonna give you guidance beyond Q1. But one of the things that you should take away, things have gotten better since 90 days ago. And they'll refer to the order patterns that we have, visibility into Q1 improved as well. We have the conversations with our customers that we're having. It gives us optimism for second half of the year. So we like the momentum. We like the strength that we go through 2025. I mean, Q4, the growth was broad-based, and we like that momentum we enter in 2026, because that momentum is also carrying, also broad-based. And so, and the way you should think about it, both in auto and industrial, the strength is increasingly structural rather than purely cyclical.\n\n**Rafael Sotomayor** (President and CEO)\nWe feel good about the trajectory we're carrying here towards the second half of the year.\n\n**Vivek Arya** (Managing Director)\nThank you.\n\n**Operator**\nThank you. Our next question is gonna come from Joe Quatrochi with Wells Fargo. Your line's open.\n\n**Joe Quatrochi** (Executive Director)\nYeah, thanks for taking the question. You talked about the acquisitions accelerating interest in your software-defined vehicle portfolio. I'm wondering if you could just kind of expand upon that or just, you know, what are the particulars that customers are excited about?\n\n**Rafael Sotomayor** (President and CEO)\nYes. So, the three acquisitions there, look, that we discussed, on the auto side, TTTech Auto has been really an injection of horsepower to accelerate our software-defined vehicle story. One of the deliverables that we have that are very important for us and for some of our customers is a deliverable of the software-defined architecture that will be delivering a system around zonal towards the end of the year. And so TTTech Auto and the injection of the TTTech Auto has really accelerate our path into delivering a zonal architecture and zonal systems by the end of the year. They also come in with a middleware, and now we have a different middleware called MotionWise. And that engagement right now is on track.\n\n**Rafael Sotomayor** (President and CEO)\nWe're taking, I think the interest of our customers is quite high now that they're moving to SDVs. On the industrial and IoT, in my prepared remarks, we talked about the interest level that our customers are now showing for physical AI and the capabilities that we have in our NXP platform. And I just want to double down on that. The interest in the combination of the Kinara NPU and the i.MX family of products that we have is really, really strong. And the level of the conversations right now that we're having with our customers has changed significantly. The traction that we get has changed significantly. So we're excited right now in that engagement, and I think that it's going to result in strong design wins in 2026.\n\n**Joe Quatrochi** (Executive Director)\nThanks for that. And then as a follow-up, on the automotive side, is there any color you can share just geographically on the demand you're seeing, you know, in the fourth quarter, and then kind of what's embedded in 1Q?\n\n**Rafael Sotomayor** (President and CEO)\nYeah, on the auto side, I mean, so I think this is an important question, just give you our perspective. And let's look at the data closely in auto, right? The inventory correction, one we said, is largely behind us. Q4, we returned year-on-year growth. Q4 auto finished within 1% of its prior peak in 2023, and we're guiding automotive to grow, in Q1 year-over-year. And, and our guide in Q1 only includes one month of the sensor business. And so the sequentially guide, I think it would have been very close to normal seasonality. So regionally, not a whole lot of differences. Usually, in Q1, you have a normal seasonality because of, because now the weight that China has in the market, but fundamentally, our thesis hasn't changed, right?\n\n**Rafael Sotomayor** (President and CEO)\nThe shift to SDVs, the advanced ADAS, these are multi-year platform transitions, and they're gonna drive content growth. And this is where we at NXP are very strong in portfolio.\n\n**Joe Quatrochi** (Executive Director)\nThank you.\n\n**Operator**\nThank you. Our next question will come from Chris Caso with Wolfe Research. Your line's open.\n\n**Chris Caso** (Managing Director)\nYes, thank you. Good morning. If I could follow up on auto again, and specifically the areas of accelerated growth drivers.\n\n**Chris Caso** (Managing Director)\nYou know, what you said last year is that those accelerated growth drivers were a bit below plan, and it sounds like the message is that is now likely to improve as you go into this year. What's the reason for that? You know, what was the reason you believe it was below plan last year? And I guess the question is because going forward, it doesn't sound like you're assuming that SAAR improves. So what's driving the change that get those accelerated growth drivers back in on track?\n\n**Rafael Sotomayor** (President and CEO)\nSo 2025, Chris, I mean, if you remember, first half of the year was a tough year with a lot of inventory digestion. That period put a pause in some of the accelerated growth drivers, because, for instance, some of the business, like radar, got caught up into inventory digestion. Electrification got caught up into inventory digestion. It slowed down the ramp of new models that basically address some of the slightly less growth, I would say, in the SDV piece. But we saw that second half accelerate. Once the inventory digestion, all the, our thesis became true, right? The accelerated growth drivers started to grow.\n\n**Rafael Sotomayor** (President and CEO)\nBy the way, the accelerated growth still grew in 2025, just didn't grow at target because of the challenges we had in the first half of the year. And now that thesis continues in 2026. We see our accelerated growth drivers now being within model and, or even better, and so we, we see that traction being in 2026, taking hold.\n\n**Chris Caso** (Managing Director)\nThank you. As a follow-up, if I could follow up on operating margin expectations and what you said for the year, returning to the long-term model, you know, I guess you've given some indication with regard to gross margins, but what does that mean for OpEx and operating leverage as you go forward through the year?\n\n**Bill Betz** (CFO)\nYeah, sure. As I mentioned in my prepared remarks related to OpEx, you know, typically, as expense as a percentage of revenue for the first half are typically higher than the second half, driven by our seasonal revenue profile. The timing effect of our US benefits at the start of the new year, that's why you see our guide up in Q1. Q2, remind you, we have our Q2 annual merits and promotions. And then we also have, at the moment, that one-time IP license impact in Q2 that we previously shared that occurs every year. So we're typically out of model in the first half, but then we expect to get below that 23% model in the second half, leading to a full year of about 23% or below.\n\n**Bill Betz** (CFO)\nObviously, we'll always have leverage on the SG&A side of the house, but the investments that are required for SDVs and physical AI and where we want to take the company, we wanna keep that at that 16% level, I would say, to make sure that we can capture that growth, that long-term growth that we're after. So for your modeling purposes, I gave you the gross margin, we gave you the revenue, here's the OpEx. I, I think you can get to the answer.\n\n**Chris Caso** (Managing Director)\nThank you. That's helpful.\n\n**Operator**\nThank you. Our next question will come from Gary Mobley with Loop Capital. Your line's open.\n\n**Gary Mobley** (Managing Director and Senior Equity Analyst)\nHey, guys. Thanks for taking my question. I know I'm gonna make Jeff cringe here, but I did wanna ask a follow-up question with respect to your statement on long-term operating model. When you laid out in November 2024, that long-term operating model, you know, the base off which you were guiding from was 2024, obviously. And so, you know, that would indicate, you know, $15.8 billion in revenue in fiscal year 2027, based on that 6%-10% revenue growth rate, minus the sale of the MEMS sensor business and whatever other adjustments since then. So for the fiscal year 2026 commentary about being on target, is that with respect to 6%-10% growth or that 2027 destination for revenue?\n\n**Jeff Palmer** (VP of Investor Relations)\nIt's the model as we laid out at the Analyst Day. I think, Gary, you, we both agree with you on the endpoint where we want to get to. We both know what we have to do to get there. We're gonna leave it to you and the analyst community to figure out how that march is. But we feel very good that after coming out of the first half of 2025 inventory digestion, we can accelerate through the next two years. I think that's the best we can do.\n\n**Gary Mobley** (Managing Director and Senior Equity Analyst)\nI appreciate what you gave there, Jeff. As my follow-up, I wanted to ask about the impact on the expense side from the sale of the MEMS sensor business. We know the revenue impact of $300 million, but what's the impact to gross margin in OpEx?\n\n**Bill Betz** (CFO)\nYeah, this is Bill. I mean, to think about with the sale is about 100 people. On gross margin, as we said, I think, or shared in the past, is it, it was, below our corporate margins. So I, I mean, not much, maybe 10, 20 basis points improvement related to that, one model. But, it's, it's, you know, those are, those are the colors I can give you on it.\n\n**Rafael Sotomayor** (President and CEO)\nAnd remember, Gary, that we did go through some corporate restructuring along with this to make room for the new headcount from the Aviva Links, TTTech, and Kinara. So I'd still like to say we made room for the additional headcounts.\n\n**Bill Betz** (CFO)\nYeah, and also remind you the other reason for divesting this business is we did see headwinds, as we know, the current acquirer, the buyer, actually manufactures the front end, and so we saw this as a great opportunity to prevent headwinds to our gross margin in the future as well.\n\n**Gary Mobley** (Managing Director and Senior Equity Analyst)\nAppreciate it, guys. Thank you.\n\n**Rafael Sotomayor** (President and CEO)\nMm-hmm.\n\n**Operator**\nThank you. Our next question will come from Jim Schneider with Goldman Sachs. Your line's open.\n\n**Jim Schneider** (Senior Equity Analyst)\nGood morning. Thanks for taking my question. You know, relative to everything you said about this year's cadence and being within model and obviously, kind of the inventory situation out there, is there any reason to believe that, you know, if you exclude the divestitures, that automotive and industrial IoT would not be operating sort of at the upper end of your long-term target model for the year?\n\n**Jeff Palmer** (VP of Investor Relations)\nHey, Jim, it's Jeff again. We're not going to guide 2026. Let me be very clear about that. We've given you guys as much as we're willing to do, but we're not guiding for 2026.\n\n**Jim Schneider** (Senior Equity Analyst)\nOkay, fair enough. And then maybe just on the capital allocation side of things, at this point, I mean, you've made, you know, a decent amount of investments in, you know, the fab relationships, et cetera. I mean, do you think that, you know, you're gonna get into a place where you could or you see your way clear to sort of increasing the buyback component of that at some point this year?\n\n**Bill Betz** (CFO)\nYeah, I mean, our capital allocation policy strategy has not changed one bit. We are very comfortable buying back the stock as long as we're below our net leverage ratio of 2x. And I think in Q4, we were at 1.9x. So, there's lots of opportunity with our investments in the long term of the business, along with buybacks, and I hope, into the future, as we expand, we also increase our dividend, as the company performs better. So again, we are doing multiple things, we're very flexible, and we demonstrate that, and we're committed to returning 100% of our excess free cash flow back to our owners.\n\n**Jim Schneider** (Senior Equity Analyst)\nThank you.\n\n**Operator**\nThank you. And our next question comes from Tore Svanberg with Stifel. Your line's open.\n\n**Tore Svanberg** (Managing Director and Senior Semiconductor Analyst)\nYes, thank you. Rafael, could you talk a little bit more about changing the way you report on geography, what some of the main reasons are behind that? I mean, I assume it's because, you know, things are changing so much as far as, you know, where your customers are taking design wins. But, yeah, if you could elaborate on that, that'd be really great.\n\n**Rafael Sotomayor** (President and CEO)\nYeah, let me start then with that one. And that question of why, why do it now? There's no way of reporting really reflects how we manage the company internally, how we direct our resources, how we direct our sales organization. I mean, think about the way we report today, a major handset maker will receive products in Asia, in Europe, in the U.S., but in reality, most of the decisions are made in one place, it will be here in the US. And so, and that gives you an example there that kind of gives you the ability to really think about how we internally we're organizing our sales force and our marketing is to go after design wins and address customers.\n\n**Rafael Sotomayor** (President and CEO)\nThis is how we manage internally, and I think it's better to reflect our business that way.\n\n**Tore Svanberg** (Managing Director and Senior Semiconductor Analyst)\nYeah, that's very helpful. And as a follow-up for you, Bill, Billy, I think you mentioned you'll get your $3.4 billion capacity expansion investment in 2026. Just curious, between VSMC and ESMC, what's the split gonna be when the year is complete?\n\n**Bill Betz** (CFO)\nOh, yeah, I would say majority of the investments, you know, VSMC is ahead of schedule, just purely timing, right? I think it's expected to start ramping in 2027 and then be in full load in 2028. And so majority of our investments will be out in 2026. Now, maybe a little bit into Q1 2027, I don't know, we'll see on the timing of that on the equity side, but I think majority will be out in 2026. ESMC, since that ramp occurs later, think about some payments going out this year, but then there's a still string of payments that go out from 2027 to 2029, which is much smaller in the aggregate. But majority of most of the payments, hopefully, we will be done at the end of 2026.\n\n**Tore Svanberg** (Managing Director and Senior Semiconductor Analyst)\nVery helpful. Thank you.\n\n**Operator**\nThank you. And our next question will come from Vijay Rakesh with Mizuho. Your line's open.\n\n**Vijay Rakesh** (Managing Director)\nYeah, hi, Rafael and Bill. Just a quick question on the auto side. Just wondering, as you look at the software-defined vehicles, and you mentioned a structural pickup there in autos, how are you looking at that auto segment revenue growth versus LVP? Like, should it grow like high single digit above LVP, or how should we look at it?\n\n**Jeff Palmer** (VP of Investor Relations)\nYeah. Hey, Vijay, it's Jeff. I think for next year, you know, the way our algorithm works is we assumed over a multi-year period that, SAAR would grow in the low single digits. You know, the long-term math for auto was, nine to twelve percent, eight to twelve percent, excuse me. And so if you were to say flattish SAAR, you kind of back that out of that total rate and, you know, take you down. But we still see content per vehicle as the real accelerator of automotive growth.\n\n**Vijay Rakesh** (Managing Director)\nGot it. And then, you know-\n\n**Jeff Palmer** (VP of Investor Relations)\nIf I look at LVP, and just maybe kind of give you the one piece that we have. You know, we use S&P as our kind of Bible for SAAR, and they're looking at 2026 at just a little, almost, you know, 93 million, 92.6 million cars in 2026, which is kind of flattish year-on-year from 2025. But when you kind of peel that back, you still see good acceleration of EVs, and good market share gains of the Chinese OEMs. So you kind of use that with the CPV content.\n\n**Vijay Rakesh** (Managing Director)\nGot it. And then as you look at 2025, I think you guys mentioned autos were $7 billion, $7.1 billion-ish. And I think you put out a long term, I think 2027, $9.5 billion. I know there's been a lot of puts and takes with acquisitions and divestitures, but just wondering how you are looking at that $9.5 billion by 2027 number?\n\n**Jeff Palmer** (VP of Investor Relations)\nSo the only change, yeah, the only change that we would make to the model is in 2024. To be honest, you probably have to back out the $300 million in sale of sensors off that baseline in 2024, and then apply the 8%-12% growth rate off of that.\n\n**Vijay Rakesh** (Managing Director)\nGot it. Thank you.\n\n**Jeff Palmer** (VP of Investor Relations)\nThanks, Vijay.\n\n**Operator**\nThank you. Our next question will come from William Stein with Truist Securities. Your line's open.\n\n**Operator**\nGreat, thanks for taking my questions. First, I'd like to ask another one on automotive. A couple of other suppliers have discussed this, EV incentive expiry in China as damaging their Q1 outlook somewhat. And I wonder if you're seeing that dynamic as well, and that's, and, and your guidance is certainly net of any of those effects, but can you discuss whether that's influencing your outlook either in Q1 or for the rest of the year? And then I have a follow-up. Thank you.\n\n**Rafael Sotomayor** (President and CEO)\nNo, we don't see. We don't have the same perspective. As a matter of fact, one of the changes, well, that we see in China, a couple of changes, you mentioned incentives, which tilts the incentive towards more of a high-end of the vehicles. The other change that China has made is that they increase certain regulations to improve the quality and resilience of the vehicles. And I think the both attempts is to reduce the pollution in the market. I think we see both of those initiatives to be good for us. The resilient or quality requirements they're putting in place right now, I think is really going to be a tailwind for us and the headwinds for 2026.\n\n**Rafael Sotomayor** (President and CEO)\nSo we see some of the changes actually are good for us, for NXP and the auto and our auto biz as well.\n\n**Rafael Sotomayor** (President and CEO)\nGreat. Thank you. And as a follow-up, you know, there's a rapid growth area in semis, we all know, not just endpoint, physical AI, but data center AI. And I think historically, you haven't talked about any exposure there, but my best guess is that you have something in that market. Can you discuss any ongoing development or any exposure to that market? Thank you.\n\n**Rafael Sotomayor** (President and CEO)\nYes, well, so today, our data center rev, revenue sits within the industrial segment, and our exposure is indeed, you mentioned, through processors, to support the data center infrastructure. I think, there will be things like power supplies, net cars, cooling systems, but we also have, our high-performance, products there for control functions and things that they need, probably security, like PQC. We don't break this revenue out separately, but it, it is growing nicely, and it will contribute to industrial momentum of 2026.\n\n**Rafael Sotomayor** (President and CEO)\nThank you.\n\n**Operator**\nThank you. I would now like to turn the call back over to Rafael for closing remarks.\n\n**Rafael Sotomayor** (President and CEO)\nThank you, everyone, for joining us today and your thoughtful questions. This quarter reaffirms the continuity of our strategy and the durability of our model, focused on profitable growth, disciplined execution, and predictable returns. With clear visibility into our company's specific growth drivers, we're confident in our ability to compound value through 2026 and beyond. Thank you.\n\n**Operator**\nThis concludes today's conference call. Thank you for participating, and you may now disconnect.",
      "fetched_at": "2026-02-04T15:45:28.906Z"
    },
    {
      "ticker": "NXPI",
      "title": "NXP Semiconductors N.V. (NXPI) Q4 FY2025 earnings call transcript",
      "published_date": "Feb 3, 2026, 8:00 AM EST",
      "fiscal_year": "2025",
      "quarter": "Q4",
      "url": "https://finance.yahoo.com/quote/NXPI/earnings/NXPI-Q4-2025-earnings_call-397076.html",
      "content": "**Operator**\nLadies and gentlemen, thank you for standing by. Welcome to NXP fourth quarter 2025 earnings conference call. At this time, all participants are in a listen-only mode. After the speaker's presentation, there will be a question-and-answer session. To ask a question during the session, you would need to press star one one on your telephone. You will then hear an automated message advising your hand is raised. To withdraw your question, please press star one one again. Please be advised that today's conference is being recorded. I would now like to turn your conference over to Jeff Palmer, Senior Vice President, Investor Relations. Please go ahead.\n\n**Jeff Palmer** (VP of Investor Relations)\nThank you, Michelle, and good morning, everyone. Welcome to NXP Semiconductors earnings call today. With me on the call today is Rafael Sotomayor, NXP's President and CEO, and Bill Betz, our CFO. The call today is being recorded and will be available for replay from our corporate website. The call will include forward-looking statements that involve risks and uncertainties that could cause NXP's results to differ materially from management's current expectations. These risks and uncertainties include, but are not limited to, statements regarding the macroeconomic impact on the specific end markets in which we operate, the sale of new and existing products, and our expectations for the financial results for the first quarter of 2026. NXP undertakes no obligation to revise or update publicly any forward-looking statements. For a full disclosure of forward-looking statements, please refer to our press release.\n\n**Jeff Palmer** (VP of Investor Relations)\nAdditionally, we will refer to certain non-GAAP financial measures, which are driven primarily by discrete events that management does not consider to be directly related to NXP's underlying core operating performance. Pursuant to Regulation G, NXP has provided reconciliation to the non-GAAP financial measures to the most directly comparable GAAP measures in our fourth quarter 2025 earnings press release, which will be furnished to the SEC on a Form 8-K and available from NXP's website in the investor relations section. Now, I'd like to pass the call to Rafael.\n\n**Rafael Sotomayor** (President and CEO)\nThank you, Jeff, and good morning. We appreciate you joining our call today. Our overall performance during the fourth quarter was solid, with all end markets performing either in line or better than expected. All regions were up on a year-on-year basis. Turning to the specifics, NXP delivered fourth quarter revenue of $3.34 billion, an increase of 7% year-on-year and up 5% sequentially. This was $35 million better than the midpoint of our guidance. Non-GAAP operating margin in the fourth quarter was about 35%, 40 basis points above the same period a year ago and in line with the midpoint of our guidance. Taken together, we drove non-GAAP earnings per share of $3.35, $0.07 better than guidance. Distribution inventory was 10 weeks, consistent with our guidance.\n\n**Rafael Sotomayor** (President and CEO)\nWe remain disciplined on channel health, prioritizing sell-through of high-demand products rather than broad-based restocking. Now, I would like to reflect on our performance in 2025. The year was a tale of two halves, with the first half of the year exhibiting weaker demand trends, while in the second half of the year, demand began to accelerate in support of our long-term revenue growth model. Looking at the specifics, automotive revenue was $7.1 billion, flat year-on-year, due to slower inventory digestion at direct customers in the first half of 2025. With the inventory digestion behind us, the second half performance aligns with our eight to 12 long-term growth outlook, reflecting the underlying strength of our auto portfolio.\n\n**Rafael Sotomayor** (President and CEO)\nA few examples which underpin our optimism include our efforts in software-defined vehicles, where we have seen strong global adoption of NXP products. These include design win rates for our S32M family of 5-nanometer vehicle compute processors, the newly introduced S32K family of 16-nanometer zonal processors, and continued adoption of automotive Ethernet products. These efforts are now material and global in nature, with most auto OEMs undertaking SDV platform initiatives. Additionally, the early conversations with customers on the recently acquired technologies from TTTech Auto and Aviva Links are accelerating interest in NXP's SDV portfolio. The potential revenue contribution from this engagement should materialize beyond 2027. This multiyear SDV platforms deepen customer commitment and support mix improvement over time. Turning to the industrial and IoT end market, revenue was $2.3 billion, flat year-on-year.\n\n**Rafael Sotomayor** (President and CEO)\nThe second half growth was materially above our 8%-12% long-term growth outlook across both core industrial and consumer and IoT. Supporting our ambition to lead in intelligent systems at the edge, we continue to see strong customer engagement in the emerging markets and physical AI. By combining the industry-leading i.MX family of industrial application processors with the recently acquired Kinara NPU, we can deliver complete and scalable AI platforms that accelerate deployment at the edge. A few examples of applications include medical imaging systems, camera-based workplace safety system in the industrial market, logistic automation systems, and robotics. Customer interest has been exceptionally strong, and these engagements reinforce our vision of physical AI and the power of the NXP platform. These opportunities expand our addressable market, support sustainable growth, and validate the unique competitive nature of our complete system portfolio.\n\n**Rafael Sotomayor** (President and CEO)\nLooking at our mobile business, revenue in 2025 was solid at $1.6 billion, up 6% year-on-year. We saw stronger demand and content gains in the premium mobile market. Overall, NXP remains a specialty supplier in the mobile market, with a unique and defensible franchise center on secure mobile transactions. Finally, the revenue in the communications infrastructure market was $1.3 billion, down 24% year-on-year. As we have said in the past, we anticipate flat growth over the longer term as the Digital Networking and RF Power business decelerate, which will be offset by growth in our Secure Car business, which includes our UCODE RFID tagging solutions. Now, I will turn to our expectations for the first quarter. Our forecast for the first quarter is better than we anticipated 90 days ago.\n\n**Rafael Sotomayor** (President and CEO)\nWe expect all regions and all end markets to be up year-on-year. We're guiding first quarter revenue to $3.15 billion, up 11% versus the year-ago period, and seasonally down 6% sequentially. Compared to 90 days ago, the improvements reflect steady inventory normalization and auto tier ones, broadening order strength across both core industrial and consumer and IoT, and program ramps in the premium mobile market, consistent with seasonal patterns. Our guide does not assume broad-based restocking. At the midpoint, we expect the following trends in our business during Q1: Automotive is expected to be up in the mid-single digit versus Q1 2025, and down in the mid-single digit percent range versus Q4 2025. I would like to highlight that our first quarter revenue guidance only includes about $25 million or one month of revenue contribution from the MEMS sensor business.\n\n**Rafael Sotomayor** (President and CEO)\nIndustrial and IoT is expected to be up in the low-20% range year-on-year and down in the mid-single-digit range versus Q4 2025. Mobile is expected to be up in the mid-teen percent range year-on-year and down in the 20% range on a sequential basis. Finally, communication infrastructure and other is expected to be up in the mid-teen percent range versus Q1 2025, and up 10% versus Q4 2025. In summary, our first quarter outlook reflects early validation of the company's specific growth drivers we've been investing in, and we expect these trends to continue throughout 2026. We believe the NXP-specific secular drivers for our business are now outweighing the broader industry cyclical headwinds, which we have experienced over the last few years.\n\n**Rafael Sotomayor** (President and CEO)\nOverall, we expect product mix and disciplined cost execution to continue to support a gross and operating margin framework. We're focused on disciplined investment and portfolio enhancements to drive profitable growth while maintaining control over the factors we can influence. Our capital allocation framework is unchanged. Invest for growth, pursue targeted M&A to strengthen the portfolio, and return excess cash through dividends and buybacks within our long-term model. Now, I would like to pass the call to Bill for a review of the financial performance.\n\n**Bill Betz** (CFO)\nThank you, Rafael, and good morning to everyone on today's call. As Rafael has already covered the drivers of the revenue, I will move to the financial highlights. Overall, our results reflect the strength of our strategic priorities in our end markets, our disciplined investment in manufacturing and product leadership, and our consistent commitment to generating long-term shareholder value. Q4 was solid, with strong execution and results above the midpoint of guidance. Revenue, gross profit, and operating profit were all back into our long-term financial model. We delivered non-GAAP earnings per share of $3.35, or $0.07 better than the midpoint of guidance. Non-GAAP gross profit was $1.91 billion, with a 57.4% non-GAAP gross margin, a slight miss versus guidance, driven by stronger-than-expected mobile revenue.\n\n**Bill Betz** (CFO)\nNon-GAAP operating expenses were $756 million, or 22.7% of revenue. The primary increase sequentially is driven by our two new acquisitions, where we continue to make space for our strategic investments, offset by restructuring actions. Non-GAAP operating profit was $1.15 billion, and non-GAAP operating margin was 34.6%, up 80 basis points sequentially. Below the line, non-GAAP interest expense was $99 million, and taxes were $190 million. Non-controlling interest was a $13 million expense, and results from equity accounted investee, was a $1 million loss. Taken together, the below-the-line items were $4 million better than our guidance. While stock-based compensation, which is not in our non-GAAP earnings, was $100 million, $18 million lower than guidance, driven by the retirement of several executives.\n\n**Bill Betz** (CFO)\nTurning to changes in cash, debt, and capital returns, our balance sheet remains strong, giving us the flexibility to invest in our strategic priorities and hybrid manufacturing plans. We ended Q4 with $12.2 billion in total debt and $3.3 billion in cash, reflecting uses of cash for capital returns, acquisitions, joint venture investments, and CapEx, offset by cash generation during the quarter. Net debt was $8.96 billion, and net debt to Adjusted EBITDA was 1.9x, with Adjusted EBITDA interest coverage ratio of 14.7x. In Q4, we returned $338 million through buybacks and $254 million in dividends. Over the last ten years, we have returned over $23 billion to our shareholders, for 95% of free cash flow, and reduced our diluted share count by 27%.\n\n**Bill Betz** (CFO)\nAfter Q4, we repurchased another $36 million under our 10b5-1 program, and on January 5th, we redeemed the $500 million March 2026 notes with our cash on hand. Now, turning to working capital metrics. Days of inventory was 154 days, which included seven days of pre-build. Receivables were 29 days, payables were 60 days. Taken together, our cash conversion cycle was 123 days. As revenue growth accelerates, we expect working capital efficiency, particularly days of inventory, including pre-builds, to meaningfully improve throughout the year. From a cash usage perspective, we continue to advance our long-term manufacturing strategy, including contributions to both VSMC and ESMC. This will lead to a long-term supply resiliency and strong gross margin expansion.\n\n**Bill Betz** (CFO)\nCash flow from operations was $891 million, and net CapEx was $98 million, resulting in non-GAAP free cash flow of $793 million, or 24% of revenue. We invested $195 million in long-term capacity access fees, made a $282 million equity payment to VSMC, and a $44 million equity payment to ESMC. Taken together, we are about 50% through the investment cycle for both VSMC and ESMC, having invested about $1.7 billion of the $3.4 billion planned investments. We expect the majority of remaining investments will occur in 2026. Now, turning to our expectations for Q1.\n\n**Bill Betz** (CFO)\nWe expect revenue of $3.15 billion ±$100 million, up 11% year-on-year and down 6% sequentially, which is better than our view 90 days ago. We expect non-GAAP gross margin of 57% ±50 basis points. Operating expenses are expected to be $765 million ±$10 million, reflecting normal seasonal increases at the start of the year. We are committed to our long-term operating expense model of 23% of revenue, though there are seasonal variations, with the first half of the year normally higher than the second half, resulting in non-GAAP operating margin of 32.7% at the midpoint. Below the line, we expect non-GAAP financial expense to be about $92 million and our non-GAAP tax rate to be 18%.\n\n**Bill Betz** (CFO)\nNon-controlling interest expense will be $11 million, with our joint venture startup losses of about $3 million. Stock-based compensation should be about $108 million, which is not included in our non-GAAP guidance. This implies Q1 non-GAAP earnings per share of $2.97 at the midpoint. Turning to the uses of cash in Q1, we expect capital expenditures to be approximately 3% of revenue, our capacity access fee payment of $190 million, and an equity investment into VSMC of $210 million. Before turning to your questions, I have a few housekeeping items to highlight. After thoughtful consideration, we have decided that our RF Power business no longer aligns with our long-term strategic direction. Consequently, we will stop new product development and have taken an approximately $90 million restructuring charge, which is reflected in our fourth quarter GAAP results.\n\n**Bill Betz** (CFO)\nWe will redirect and focus our R&D resources to accelerate and enhance our strategic priorities towards software-defined vehicles and physical AI. Yesterday, after the market closed, STMicroelectronics announced the closure of NXP's MEMS sensor business acquisition. This is a positive transaction for both parties. NXP received $900 million in gross proceeds, with another $50 million to be received upon completion of certain closing conditions. We will recognize a one-time gain of approximately $630 million from the sale of the business, which is reflected in our first quarter's GAAP guidance. Next, we have made the decision to shift our geographic revenue reporting to headquarters-based region as opposed to a ship-to basis. We believe reporting headquarters-based region better reflects how we manage the business internally and where customer engagements and design win awards occur.\n\n**Bill Betz** (CFO)\nThe 2025 change can be found in the posted IR presentation. And finally, based on the positive trends, including current order rates and business signals we track, we are confident NXP will operate within its long-term financial model for the full year of 2026. In closing, we are well positioned to benefit from the powerful secular trends in our four focus end markets. We are confident about the strategic priorities and investments we are making across our entire portfolio and manufacturing footprint. With a strong balance sheet and a disciplined capital return philosophy, we are exceptionally well positioned to drive long-term value for our shareholders. Now, I would like to turn it back to the operator for your questions.\n\n**Operator**\nTo please press star one one on your telephone and wait for your name to be announced, and to withdraw your question, please press star one one again. We do ask that you please limit to one question and one follow-up. The first question will come from Tom O'Malley with Barclays. Your line is open.\n\n**Tom O'Malley** (Equity Research Director)\nHey, guys. Thanks for taking my question. I wanted to ask about the channel restock. So it looks like you guys went from nine to 10 weeks. In your guidance, you're saying no additional restock, kind of, baked in. Could you talk about where you are with the channel today, what you saw in the last quarter? And is it the decision to just not go to 11 weeks overall? Or is it just, we're gonna wait a little bit until we take it to the 11 weeks that we talked about previously? Thank you.\n\n**Rafael Sotomayor** (President and CEO)\nThank you, Tom. Let me take that one. It's Rafael. Yeah, clearly, I mean, I would say that our account strategy has shifted from, you know, what before we considered tight control to ensure that we staged the right product, the right product to satisfy demand. We are moving to our long-term target of 11 weeks, and the reason we're doing that is because it is a reflection of an improving demand environment for us. We finished Q4 with about 10 weeks. We will move into our long-term plan and long-term target of 11 weeks into 2026, and that's how we are going to manage our business in a steady state.\n\n**Tom O'Malley** (Equity Research Director)\nGotcha. Then as a follow-up, just on the comms business, so, you're deciding to move away from RF, but you had already kind of moved away from Digital Networking. You're guiding that business up 10%. Could you maybe walk through the moving pieces? Obviously, with Digital Networking coming down, you needed to see some really, you know, some strength from maybe the SIS business. Just walk through what's contributing to that Q1 strength. Thank you.\n\n**Rafael Sotomayor** (President and CEO)\nYeah, indeed, Tom. We did guide C&I about 10%, sequentially in Q1. And if you remember, C&I includes three distinct businesses: Secure Cars, Digital Networks, and RF Power. And they, they all of these three businesses can move differently quarter to quarter. And C&I, I think, right now is benefiting from the fact that, one, there's normalization in the Digital Networking business, but there's growth coming from the secure car, and, and that strength really will benefit C&I throughout 2026.\n\n**Tom O'Malley** (Equity Research Director)\nThank you.\n\n**Operator**\nThank you. And the next question will come from Matthew Prisco with Cantor. Your line's open.\n\n**Matthew Prisco** (Director)\nHey, guys. Thanks for taking the questions. I guess starting with the cyclical side, can you maybe offer some more color on customer ordering trends over the past few months, and maybe what type of linearity you saw through the quarter and into 1Q?\n\n**Jeff Palmer** (VP of Investor Relations)\nYeah, Matt, are you asking about the kind of trends that we track internally? Is that what you're asking? We couldn't quite hear your question. We apologize.\n\n**Matthew Prisco** (Director)\nOh, yes, that's exactly it. The trends that you track internally when you look at just customer ordering trends over those past few months, and then linearity through the quarter and into 1Q.\n\n**Jeff Palmer** (VP of Investor Relations)\nYeah, linearity, we don't, we don't disclose, but I think Bill will take some of the other metrics we track.\n\n**Bill Betz** (CFO)\nYeah, no, no. Obviously, over the quarter in the last 90 days ago, all our internal signals that we talked about in the past have improved. So think about our backlog, our distributions backlog, our customer escalations have increased. The short-term orders continue to increase as well, and we try to service as much as possible related to that. So across the board, we haven't seen anything like this in quite a while, and so we feel very confident about being in a long-term business model for 2026.\n\n**Jeff Palmer** (VP of Investor Relations)\nAnd maybe I'll just add one thing, Bill. If you kind of step back, Matt, and look at kind of the trends in the second half of 2025, they've truly started to accelerate, and we're in, you know, close to our growth rates that we presented at our Analyst Day. We believe that will continue as we progress through 2026. So we're feeling pretty optimistic that we are off the trough of the business.... Did you have a follow up?\n\n**Matthew Prisco** (Director)\nYes, please. I guess on the auto side, would love if you can offer some detail on the demand dynamics within your core auto business versus your accelerated growth drivers. And have you seen any impact to date from component price increases, potentially pressuring unit demand there? Thanks.\n\n**Rafael Sotomayor** (President and CEO)\nYeah, so we, I think there are a few questions there on auto. If you look at what happens, if you look at auto and the reason why we remain quite optimistic in auto, in Q4, our business returned to growth year-on-year. And the guide that we provided continues, you know, year-on-year, the Q1 guide gives you growth, as well, year-on-year. And so, and what we see is that business remains unchanged with respect to content gains. You asked me about pricing. Second question was on pricing. VPAs for the most part are done, right? With, in the pricing that is already reflected in our Q1 guide.\n\n**Rafael Sotomayor** (President and CEO)\nWe are modeling low single digit price declines, and that's what we see not only in auto but across the business.\n\n**Operator**\nThank you. And our next question will come from Ross Seymore with Deutsche Bank. Your line is open.\n\n**Ross Seymore** (Managing Director)\nHi, guys. Thanks for asking the question. Just sticking on the auto side of things, it's been, you know, pretty much flat for a couple, two, three years in a row. I know there's been a bunch of puts and takes on inventory and demand, et cetera, but I really wanted to dive into what you've seen over that period of time in your accelerated growth drivers. Is anything changing your thesis there? Are you more optimistic, less optimistic? Any sort of clarifications there, especially as we move forward. Hopefully, the headwinds are done, and so I just wanted to judge the growth rate from those drivers going forward. Thank you.\n\n**Rafael Sotomayor** (President and CEO)\nYeah, thanks, Ross. So I think what I said on the prepared remarks, right, auto in our business in general in 2025 was the story of two halves, and the first half was all about inventory digestion, and it really masked the true dynamics of our business. For the full year, the auto accelerated drivers were slightly below model. Remember model, we said that we were going to grow 8%-12%, but they were still growing in a year where auto was flat. And they were about 10%, and it was all led by our SDV efforts, our radar and our productivity. What you see right now in auto is our auto is shifting.\n\n**Rafael Sotomayor** (President and CEO)\nOur auto exposure is shifting to more and more structural and less cyclical, and it's driven by, you know, tying our roadmap to a secular trends are really transforming the architectures of auto. So we feel quite optimistic. The answer to the question on the core drivers, there's the, the whole story, the thesis is completely intact, and we feel stronger than ever that our, our roadmap is really addressing the needs of the market.\n\n**Ross Seymore** (Managing Director)\nGreat, thanks for that. And I guess, you had the MEMS divestiture and now the exit of the RF side of things. Can you aggregate, you know, how much of a headwind those exits are gonna be for this year? And I obviously know where the RF sits, but is the MEMS headwind in the auto side? Just wanna kinda make sure to level set on that.\n\n**Bill Betz** (CFO)\nSure. The way to think about... Oh, this is Bill, Ross. Good morning. The way to think about the sensors divestment, it runs around $300 million per year, and, Rafael shared, we recognized $25 million in the first quarter, and I think you guys can do the math of the impact that has from a year-over-year compare in our auto end market. Related to the RF business, the RF business is probably gonna track similar to what DN did. If you recall, our Digital Networking business, when we walked away from it, I don't know, eight years ago, it lives quite long. And so what we're actually doing is stop investing next generation products.\n\n**Bill Betz** (CFO)\nSo that will probably stay with us for at least the next two years, is what we're projecting at the current rate. And I think, Jeff, if we had to break out 2025 as a percentage of comms infra pieces, I don't have that on my fingertips, so we can usually share that, but maybe you can share how the three businesses fared in 2025 to get the size of it.\n\n**Rafael Sotomayor** (President and CEO)\nSure. Well, so the Secure Car business was just over 50%, and both the Digital Network and RF Power businesses were each about 25%.\n\n**Ross Seymore** (Managing Director)\nThank you.\n\n**Rafael Sotomayor** (President and CEO)\nThanks, Ross.\n\n**Operator**\nThank you. Our next question will come from Joe Moore with Morgan Stanley. Your line's open.\n\n**Joe Moore** (Managing Director and Semiconductor Industry Analyst)\nGreat. Thank you. In the auto business, there's been a number of sort of these supply disruptions. We had an Nexperia a few months ago causing issues. DDR4 now is causing some shortages. You know, is that impacting you guys in any way? Are you seeing either weaker demand because they're bottlenecked by those things, or is there any desire for tier ones to start building inventory to react to any of those things?\n\n**Rafael Sotomayor** (President and CEO)\nYeah, let me take that, Joe. So the Nexperia is not a conversation, it's not been a non-issue for NXP. The discussions on memory, there's always this chatter on memory is not just in autos, across our end markets. We have not seen memory impact the orders of our customers, but clearly it's a conversation that our customers discuss with us as an area of concerns for the second half of the year, but nothing has been reflected in our orders.\n\n**Joe Moore** (Managing Director and Semiconductor Industry Analyst)\nGreat. Thank you for that. And then in your auto business, any difference by region? I guess there's been some concern about China demand, just anything you're seeing regionally in your auto business.\n\n**Rafael Sotomayor** (President and CEO)\nNo, we don't see anything particular to comment on. I think the auto business, we believe it's gonna be within model for 2026 for us. It's strong, the accelerated growth drivers are executing, so we expect our thesis to continue towards 2026.\n\n**Joe Moore** (Managing Director and Semiconductor Industry Analyst)\nGreat. Thank you.\n\n**Operator**\nThank you. Our next question will come from Joshua Buchalter with TD Cowen. Your line's open.\n\n**Joshua Buchalter** (Managing Director)\nHey, guys. Thank you for taking my question. I apologize for a bit of a nitpicky semantic one, but it's one I've gotten a couple times. So, you know, in your prepared remarks, you said for 2026, you expect to operate within your target model, this year. You know, I think you're given the way we ended 2025, to hit your 6%-10% long-term CAGR, you know, 2026 and 2027 would have to be higher than that. You know, are you guys suggesting like this year is within the 6%-10%? Or are you saying that, you know, you should track towards the 6%-10% over a three-year period, in 2026 and 2027?\n\n**Jeff Palmer** (VP of Investor Relations)\nI think, Josh, what we're saying is the long-term model is intact. I think not to be nitpicky back, but I think you know how to do math, and you can probably do the, the chainsaw on that. But we, we feel very strongly that after the inventory digestion in the first half of 2025, things are starting to reaccelerate. So we'll, we'll leave there, leave it there. Did you have a follow-up?\n\n**Joshua Buchalter** (Managing Director)\nYeah. You know, can you maybe provide some more puts and takes on gross margin for the first quarter, in particular? How are you thinking about utilization rates as we sort of enter a better cyclical period? I know there were some die bank builds that boosted utilization rates at the end of the year. You know, and those done, how should we think about utilization rates from here? Thank you.\n\n**Bill Betz** (CFO)\nYeah, let me take that one. So I would say gross margins are performing to our expectations into Q1, and this is primarily driven by our annual low single-digit price concessions that Rafael shared, and that is offset only partially from our normal operational efficiencies that we regained back throughout the year. Again, I think for modeling purposes, the best way to think about our gross margins, use that rule of thumb I provided in the past for every $1 billion of revenue. We're entitled to approximately 100 basis points expansion gain to our gross margin on a full-year basis, and of course, that's the plus or minus normal mix changes that we share on a quarterly basis. Now, as shared in the past, we will continue to work on mixing up our portfolio through our new product introductions.\n\n**Bill Betz** (CFO)\nAlso, we're focused on our go-to-market for that long tail, which tends to be a richer mix. We also have the ability to improve our internal front-end utilizations. The front-end utilizations in Q4 were in the high 70s, and in Q1, they will remain in the high 70s. Obviously, if we get any inflationary costs that we can't offset internally, we will protect our gross margins and pass those on to our customers. And, and as you know, we always do the normal block and tackling on, improving our yields and test time reductions. Now, longer term, we're quite excited, on our hybrid manufacturing strategy, especially when VSMC is fully loaded in 2028, it is on track. And beyond, we expect our gross margins to be lifted by another 200 basis points at the company, level.\n\n**Bill Betz** (CFO)\nSo I would say in general, we, we are very committed to improving our gross margins over the long term. Related to inventory question, again, our prebuilds were seven days, sorry, at the end of 2025. As you all know, our consolidation efforts and our manufacturing footprint are underway. I would expect the prebuilds, by the end of 2026, be about 15-20 days, related to that. But including those prebuilds, we also expect to take our net inventory days down throughout the year, as we continue to focus in what's in our control and do the right thing operationally, to give you some more color on where we plan to take internal inventory.\n\n**Joshua Buchalter** (Managing Director)\nAppreciate all the detail there, Bill. Thank you.\n\n**Operator**\nThank you. Our next question will come from Vivek Arya with Bank of America Securities. Your line's open.\n\n**Vivek Arya** (Managing Director)\nThanks for taking my question. On the industrial and IoT segment, Rafael, I was hoping you could help segment how much of that is industrial, how much of that is IoT? And you know, off of easier compares, the growth rate is very high at the start of the year. But should we expect that this segment will also be in model for 2026? Just how, how are you looking at the, you know, potential growth scenarios for industrial and IoT this year?\n\n**Rafael Sotomayor** (President and CEO)\nYeah. Thank you, Vivek. So yeah, very strong growth we've seen right now in industrial, right? And the, and the growth, you saw the inventories begin recovering in Q3, and continue into Q4. I think Q4 was 20% year-on-year of growth. The growth is fairly broad-based, and it's not a single segment that is driving the growth. Just to give you an answer on the, on the question specific, you know, we have about 60, 60% of our business there is core industrial, 40% is in the consumer side. But the growth is broad-based. But we saw, I mean, if I would give you, we have some notable traction on fuse sockets in healthcare and smart glasses. We've seen strength in factory automation and energy storage.\n\n**Rafael Sotomayor** (President and CEO)\nAnd so very, very strong design wins with very differentiated product that we have in industrial and IoT. That strength of closing 2025 continues in 2026. I mean, you see the Q1 guide was also growing year-on-year 20%, and we feel very good about 2026 for industrial and IoT.\n\n**Vivek Arya** (Managing Director)\nAll right. And for my follow-up, I would be remiss not to ask the seasonality question as we look at Q2 and Q3. And I ask that just, just because of, you know, all the kind of the exits and things that, that you're considering this year. So based on, you know, historical patterns and normalizing for all your business divestitures, what would you consider normal seasonal trends in Q2, Q3? And, and are there any other things this year that we should take into account as we model your quarterly cadence this year? Thank you.\n\n**Rafael Sotomayor** (President and CEO)\nVivek, we're not gonna, we're not gonna give you guidance beyond Q1. But one of the things that you should take away, things have gotten better since 90 days ago. And they'll refer to the order patterns that we have, visibility into Q1 improved as well. We have the conversations with our customers that we're having. It gives us optimism for second half of the year. So we like the momentum. We like the strength that we go through 2025. I mean, Q4, the growth was broad-based, and we like that momentum we enter in 2026, because that momentum is also carrying, also broad-based. And so, and the way you should think about it, both in auto and industrial, the strength is increasingly structural rather than purely cyclical.\n\n**Rafael Sotomayor** (President and CEO)\nWe feel good about the trajectory we're carrying here towards the second half of the year.\n\n**Vivek Arya** (Managing Director)\nThank you.\n\n**Operator**\nThank you. Our next question is gonna come from Joe Quatrochi with Wells Fargo. Your line's open.\n\n**Joe Quatrochi** (Executive Director)\nYeah, thanks for taking the question. You talked about the acquisitions accelerating interest in your software-defined vehicle portfolio. I'm wondering if you could just kind of expand upon that or just, you know, what are the particulars that customers are excited about?\n\n**Rafael Sotomayor** (President and CEO)\nYes. So, the three acquisitions there, look, that we discussed, on the auto side, TTTech Auto has been really an injection of horsepower to accelerate our software-defined vehicle story. One of the deliverables that we have that are very important for us and for some of our customers is a deliverable of the software-defined architecture that will be delivering a system around zonal towards the end of the year. And so TTTech Auto and the injection of the TTTech Auto has really accelerate our path into delivering a zonal architecture and zonal systems by the end of the year. They also come in with a middleware, and now we have a different middleware called MotionWise. And that engagement right now is on track.\n\n**Rafael Sotomayor** (President and CEO)\nWe're taking, I think the interest of our customers is quite high now that they're moving to SDVs. On the industrial and IoT, in my prepared remarks, we talked about the interest level that our customers are now showing for physical AI and the capabilities that we have in our NXP platform. And I just want to double down on that. The interest in the combination of the Kinara NPU and the i.MX family of products that we have is really, really strong. And the level of the conversations right now that we're having with our customers has changed significantly. The traction that we get has changed significantly. So we're excited right now in that engagement, and I think that it's going to result in strong design wins in 2026.\n\n**Joe Quatrochi** (Executive Director)\nThanks for that. And then as a follow-up, on the automotive side, is there any color you can share just geographically on the demand you're seeing, you know, in the fourth quarter, and then kind of what's embedded in 1Q?\n\n**Rafael Sotomayor** (President and CEO)\nYeah, on the auto side, I mean, so I think this is an important question, just give you our perspective. And let's look at the data closely in auto, right? The inventory correction, one we said, is largely behind us. Q4, we returned year-on-year growth. Q4 auto finished within 1% of its prior peak in 2023, and we're guiding automotive to grow, in Q1 year-over-year. And, and our guide in Q1 only includes one month of the sensor business. And so the sequentially guide, I think it would have been very close to normal seasonality. So regionally, not a whole lot of differences. Usually, in Q1, you have a normal seasonality because of, because now the weight that China has in the market, but fundamentally, our thesis hasn't changed, right?\n\n**Rafael Sotomayor** (President and CEO)\nThe shift to SDVs, the advanced ADAS, these are multi-year platform transitions, and they're gonna drive content growth. And this is where we at NXP are very strong in portfolio.\n\n**Joe Quatrochi** (Executive Director)\nThank you.\n\n**Operator**\nThank you. Our next question will come from Chris Caso with Wolfe Research. Your line's open.\n\n**Chris Caso** (Managing Director)\nYes, thank you. Good morning. If I could follow up on auto again, and specifically the areas of accelerated growth drivers.\n\n**Chris Caso** (Managing Director)\nYou know, what you said last year is that those accelerated growth drivers were a bit below plan, and it sounds like the message is that is now likely to improve as you go into this year. What's the reason for that? You know, what was the reason you believe it was below plan last year? And I guess the question is because going forward, it doesn't sound like you're assuming that SAAR improves. So what's driving the change that get those accelerated growth drivers back in on track?\n\n**Rafael Sotomayor** (President and CEO)\nSo 2025, Chris, I mean, if you remember, first half of the year was a tough year with a lot of inventory digestion. That period put a pause in some of the accelerated growth drivers, because, for instance, some of the business, like radar, got caught up into inventory digestion. Electrification got caught up into inventory digestion. It slowed down the ramp of new models that basically address some of the slightly less growth, I would say, in the SDV piece. But we saw that second half accelerate. Once the inventory digestion, all the, our thesis became true, right? The accelerated growth drivers started to grow.\n\n**Rafael Sotomayor** (President and CEO)\nBy the way, the accelerated growth still grew in 2025, just didn't grow at target because of the challenges we had in the first half of the year. And now that thesis continues in 2026. We see our accelerated growth drivers now being within model and, or even better, and so we, we see that traction being in 2026, taking hold.\n\n**Chris Caso** (Managing Director)\nThank you. As a follow-up, if I could follow up on operating margin expectations and what you said for the year, returning to the long-term model, you know, I guess you've given some indication with regard to gross margins, but what does that mean for OpEx and operating leverage as you go forward through the year?\n\n**Bill Betz** (CFO)\nYeah, sure. As I mentioned in my prepared remarks related to OpEx, you know, typically, as expense as a percentage of revenue for the first half are typically higher than the second half, driven by our seasonal revenue profile. The timing effect of our US benefits at the start of the new year, that's why you see our guide up in Q1. Q2, remind you, we have our Q2 annual merits and promotions. And then we also have, at the moment, that one-time IP license impact in Q2 that we previously shared that occurs every year. So we're typically out of model in the first half, but then we expect to get below that 23% model in the second half, leading to a full year of about 23% or below.\n\n**Bill Betz** (CFO)\nObviously, we'll always have leverage on the SG&A side of the house, but the investments that are required for SDVs and physical AI and where we want to take the company, we wanna keep that at that 16% level, I would say, to make sure that we can capture that growth, that long-term growth that we're after. So for your modeling purposes, I gave you the gross margin, we gave you the revenue, here's the OpEx. I, I think you can get to the answer.\n\n**Chris Caso** (Managing Director)\nThank you. That's helpful.\n\n**Operator**\nThank you. Our next question will come from Gary Mobley with Loop Capital. Your line's open.\n\n**Gary Mobley** (Managing Director and Senior Equity Analyst)\nHey, guys. Thanks for taking my question. I know I'm gonna make Jeff cringe here, but I did wanna ask a follow-up question with respect to your statement on long-term operating model. When you laid out in November 2024, that long-term operating model, you know, the base off which you were guiding from was 2024, obviously. And so, you know, that would indicate, you know, $15.8 billion in revenue in fiscal year 2027, based on that 6%-10% revenue growth rate, minus the sale of the MEMS sensor business and whatever other adjustments since then. So for the fiscal year 2026 commentary about being on target, is that with respect to 6%-10% growth or that 2027 destination for revenue?\n\n**Jeff Palmer** (VP of Investor Relations)\nIt's the model as we laid out at the Analyst Day. I think, Gary, you, we both agree with you on the endpoint where we want to get to. We both know what we have to do to get there. We're gonna leave it to you and the analyst community to figure out how that march is. But we feel very good that after coming out of the first half of 2025 inventory digestion, we can accelerate through the next two years. I think that's the best we can do.\n\n**Gary Mobley** (Managing Director and Senior Equity Analyst)\nI appreciate what you gave there, Jeff. As my follow-up, I wanted to ask about the impact on the expense side from the sale of the MEMS sensor business. We know the revenue impact of $300 million, but what's the impact to gross margin in OpEx?\n\n**Bill Betz** (CFO)\nYeah, this is Bill. I mean, to think about with the sale is about 100 people. On gross margin, as we said, I think, or shared in the past, is it, it was, below our corporate margins. So I, I mean, not much, maybe 10, 20 basis points improvement related to that, one model. But, it's, it's, you know, those are, those are the colors I can give you on it.\n\n**Rafael Sotomayor** (President and CEO)\nAnd remember, Gary, that we did go through some corporate restructuring along with this to make room for the new headcount from the Aviva Links, TTTech, and Kinara. So I'd still like to say we made room for the additional headcounts.\n\n**Bill Betz** (CFO)\nYeah, and also remind you the other reason for divesting this business is we did see headwinds, as we know, the current acquirer, the buyer, actually manufactures the front end, and so we saw this as a great opportunity to prevent headwinds to our gross margin in the future as well.\n\n**Gary Mobley** (Managing Director and Senior Equity Analyst)\nAppreciate it, guys. Thank you.\n\n**Rafael Sotomayor** (President and CEO)\nMm-hmm.\n\n**Operator**\nThank you. Our next question will come from Jim Schneider with Goldman Sachs. Your line's open.\n\n**Jim Schneider** (Senior Equity Analyst)\nGood morning. Thanks for taking my question. You know, relative to everything you said about this year's cadence and being within model and obviously, kind of the inventory situation out there, is there any reason to believe that, you know, if you exclude the divestitures, that automotive and industrial IoT would not be operating sort of at the upper end of your long-term target model for the year?\n\n**Jeff Palmer** (VP of Investor Relations)\nHey, Jim, it's Jeff again. We're not going to guide 2026. Let me be very clear about that. We've given you guys as much as we're willing to do, but we're not guiding for 2026.\n\n**Jim Schneider** (Senior Equity Analyst)\nOkay, fair enough. And then maybe just on the capital allocation side of things, at this point, I mean, you've made, you know, a decent amount of investments in, you know, the fab relationships, et cetera. I mean, do you think that, you know, you're gonna get into a place where you could or you see your way clear to sort of increasing the buyback component of that at some point this year?\n\n**Bill Betz** (CFO)\nYeah, I mean, our capital allocation policy strategy has not changed one bit. We are very comfortable buying back the stock as long as we're below our net leverage ratio of 2x. And I think in Q4, we were at 1.9x. So, there's lots of opportunity with our investments in the long term of the business, along with buybacks, and I hope, into the future, as we expand, we also increase our dividend, as the company performs better. So again, we are doing multiple things, we're very flexible, and we demonstrate that, and we're committed to returning 100% of our excess free cash flow back to our owners.\n\n**Jim Schneider** (Senior Equity Analyst)\nThank you.\n\n**Operator**\nThank you. And our next question comes from Tore Svanberg with Stifel. Your line's open.\n\n**Tore Svanberg** (Managing Director and Senior Semiconductor Analyst)\nYes, thank you. Rafael, could you talk a little bit more about changing the way you report on geography, what some of the main reasons are behind that? I mean, I assume it's because, you know, things are changing so much as far as, you know, where your customers are taking design wins. But, yeah, if you could elaborate on that, that'd be really great.\n\n**Rafael Sotomayor** (President and CEO)\nYeah, let me start then with that one. And that question of why, why do it now? There's no way of reporting really reflects how we manage the company internally, how we direct our resources, how we direct our sales organization. I mean, think about the way we report today, a major handset maker will receive products in Asia, in Europe, in the U.S., but in reality, most of the decisions are made in one place, it will be here in the US. And so, and that gives you an example there that kind of gives you the ability to really think about how we internally we're organizing our sales force and our marketing is to go after design wins and address customers.\n\n**Rafael Sotomayor** (President and CEO)\nThis is how we manage internally, and I think it's better to reflect our business that way.\n\n**Tore Svanberg** (Managing Director and Senior Semiconductor Analyst)\nYeah, that's very helpful. And as a follow-up for you, Bill, Billy, I think you mentioned you'll get your $3.4 billion capacity expansion investment in 2026. Just curious, between VSMC and ESMC, what's the split gonna be when the year is complete?\n\n**Bill Betz** (CFO)\nOh, yeah, I would say majority of the investments, you know, VSMC is ahead of schedule, just purely timing, right? I think it's expected to start ramping in 2027 and then be in full load in 2028. And so majority of our investments will be out in 2026. Now, maybe a little bit into Q1 2027, I don't know, we'll see on the timing of that on the equity side, but I think majority will be out in 2026. ESMC, since that ramp occurs later, think about some payments going out this year, but then there's a still string of payments that go out from 2027 to 2029, which is much smaller in the aggregate. But majority of most of the payments, hopefully, we will be done at the end of 2026.\n\n**Tore Svanberg** (Managing Director and Senior Semiconductor Analyst)\nVery helpful. Thank you.\n\n**Operator**\nThank you. And our next question will come from Vijay Rakesh with Mizuho. Your line's open.\n\n**Vijay Rakesh** (Managing Director)\nYeah, hi, Rafael and Bill. Just a quick question on the auto side. Just wondering, as you look at the software-defined vehicles, and you mentioned a structural pickup there in autos, how are you looking at that auto segment revenue growth versus LVP? Like, should it grow like high single digit above LVP, or how should we look at it?\n\n**Jeff Palmer** (VP of Investor Relations)\nYeah. Hey, Vijay, it's Jeff. I think for next year, you know, the way our algorithm works is we assumed over a multi-year period that, SAAR would grow in the low single digits. You know, the long-term math for auto was, nine to twelve percent, eight to twelve percent, excuse me. And so if you were to say flattish SAAR, you kind of back that out of that total rate and, you know, take you down. But we still see content per vehicle as the real accelerator of automotive growth.\n\n**Vijay Rakesh** (Managing Director)\nGot it. And then, you know-\n\n**Jeff Palmer** (VP of Investor Relations)\nIf I look at LVP, and just maybe kind of give you the one piece that we have. You know, we use S&P as our kind of Bible for SAAR, and they're looking at 2026 at just a little, almost, you know, 93 million, 92.6 million cars in 2026, which is kind of flattish year-on-year from 2025. But when you kind of peel that back, you still see good acceleration of EVs, and good market share gains of the Chinese OEMs. So you kind of use that with the CPV content.\n\n**Vijay Rakesh** (Managing Director)\nGot it. And then as you look at 2025, I think you guys mentioned autos were $7 billion, $7.1 billion-ish. And I think you put out a long term, I think 2027, $9.5 billion. I know there's been a lot of puts and takes with acquisitions and divestitures, but just wondering how you are looking at that $9.5 billion by 2027 number?\n\n**Jeff Palmer** (VP of Investor Relations)\nSo the only change, yeah, the only change that we would make to the model is in 2024. To be honest, you probably have to back out the $300 million in sale of sensors off that baseline in 2024, and then apply the 8%-12% growth rate off of that.\n\n**Vijay Rakesh** (Managing Director)\nGot it. Thank you.\n\n**Jeff Palmer** (VP of Investor Relations)\nThanks, Vijay.\n\n**Operator**\nThank you. Our next question will come from William Stein with Truist Securities. Your line's open.\n\n**Operator**\nGreat, thanks for taking my questions. First, I'd like to ask another one on automotive. A couple of other suppliers have discussed this, EV incentive expiry in China as damaging their Q1 outlook somewhat. And I wonder if you're seeing that dynamic as well, and that's, and, and your guidance is certainly net of any of those effects, but can you discuss whether that's influencing your outlook either in Q1 or for the rest of the year? And then I have a follow-up. Thank you.\n\n**Rafael Sotomayor** (President and CEO)\nNo, we don't see. We don't have the same perspective. As a matter of fact, one of the changes, well, that we see in China, a couple of changes, you mentioned incentives, which tilts the incentive towards more of a high-end of the vehicles. The other change that China has made is that they increase certain regulations to improve the quality and resilience of the vehicles. And I think the both attempts is to reduce the pollution in the market. I think we see both of those initiatives to be good for us. The resilient or quality requirements they're putting in place right now, I think is really going to be a tailwind for us and the headwinds for 2026.\n\n**Rafael Sotomayor** (President and CEO)\nSo we see some of the changes actually are good for us, for NXP and the auto and our auto biz as well.\n\n**Rafael Sotomayor** (President and CEO)\nGreat. Thank you. And as a follow-up, you know, there's a rapid growth area in semis, we all know, not just endpoint, physical AI, but data center AI. And I think historically, you haven't talked about any exposure there, but my best guess is that you have something in that market. Can you discuss any ongoing development or any exposure to that market? Thank you.\n\n**Rafael Sotomayor** (President and CEO)\nYes, well, so today, our data center rev, revenue sits within the industrial segment, and our exposure is indeed, you mentioned, through processors, to support the data center infrastructure. I think, there will be things like power supplies, net cars, cooling systems, but we also have, our high-performance, products there for control functions and things that they need, probably security, like PQC. We don't break this revenue out separately, but it, it is growing nicely, and it will contribute to industrial momentum of 2026.\n\n**Rafael Sotomayor** (President and CEO)\nThank you.\n\n**Operator**\nThank you. I would now like to turn the call back over to Rafael for closing remarks.\n\n**Rafael Sotomayor** (President and CEO)\nThank you, everyone, for joining us today and your thoughtful questions. This quarter reaffirms the continuity of our strategy and the durability of our model, focused on profitable growth, disciplined execution, and predictable returns. With clear visibility into our company's specific growth drivers, we're confident in our ability to compound value through 2026 and beyond. Thank you.\n\n**Operator**\nThis concludes today's conference call. Thank you for participating, and you may now disconnect.",
      "fetched_at": "2026-02-04T15:45:33.034Z"
    },
    {
      "ticker": "NXPI",
      "title": "NXP Semiconductors N.V. (NXPI) Q3 FY2025 earnings call transcript",
      "published_date": "Oct 28, 2025, 8:00 AM EDT",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/NXPI/earnings/NXPI-Q3-2025-earnings_call-340589.html",
      "content": "**Operator**\nHello and thank you for standing by. Welcome to NXP third quarter's 2025 earnings conference call. At this time, all participants are on a listen only mode. After the speaker's presentation, there will be a question and answer session. To ask the question during the session, you will need to press star 11 on your telephone. You will then hear an automated message advising your hand is raised. To withdraw your question, please press star 11 again. I would now like to hand the conference over to Jeff Palmer, Senior Vice President, Investor Relations. Please go ahead, sir.\n\n**Jeff Palmer** (SVP of Investor Relations)\nThank you, Tawanda, and good morning, everyone. Welcome to our third quarter earnings call today. With me on the call today is Rafael Sotomayor, NXP's President and CEO, and Bill Betz, our CFO. Also on the call with us is Kurt Sievers, who will act as a Special Advisor to Rafael through the end of 2025. The call today is being recorded and will be available for replay from our corporate website. Today's call will include forward-looking statements that involve risks and uncertainties that could cause NXP's results to differ materially from management's current expectations. These risks and uncertainties include, but are not limited to, statements regarding the macroeconomic impact on the specific end markets in which we operate, the sale of new and existing products, and our expectations for financial results for the fourth quarter of 2025. NXP undertakes no obligation to revise or update publicly any forward-looking statements.\n\n**Jeff Palmer** (SVP of Investor Relations)\nFor a full disclosure of forward-looking statements, please refer to our press release. Additionally, we will refer to certain non-GAAP financial measures which are driven primarily by discrete events that management does not consider to be directly related to NXP's underlying core operating performance. Pursuant to Regulation G, NXP has provided reconciliations of the non-GAAP financial measures to the most directly comparable GAAP measures in our third quarter 2025 earnings press release, which will be furnished to the SEC on Form 8-K and is available on NXP's website in the Investor Relations section. Now I'd like to turn the call over to Rafael.\n\n**Rafael Sotomayor** (President and CEO)\nThank you, Jeff, and good morning. We appreciate you joining our call today. Our overall performance during the third quarter was solid. Our revenue exceeded guidance by $23 million. We experienced sequential growth driven by broad-based improvements across all regions and end markets. We maintained good profitability and controlled operating expenses, resulting in healthy fall through. Turning to the specifics, NXP Semiconductors delivered third quarter revenue of $3.17 billion, a decline of 2% year on year and up 8% sequentially. Non-GAAP operating margin in the third quarter was above 34%, 170 basis points below the same period a year ago and 10 basis points above the midpoint of our guidance. The lower operating margin versus the same period last year was due to lower revenue and gross profit, partially helped by flat operating expenses. Taken together, we drove non-GAAP earnings per share of $3.11, a penny better than guidance.\n\n**Rafael Sotomayor** (President and CEO)\nDistribution inventory was flat at nine weeks, consistent with our guidance while still below our long-term target of 11 weeks. From a direct sales perspective, we believe our shipments into the Tier 1 automotive supply chain best approach end demand. We estimate that aggregate inventory levels of NXP Semiconductors-specific products at our major Tier 1 partners are below NXP Semiconductors' manufacturing cycle time. We believe this reflects a continued cautious approach in the automotive supply chain due to the uncertain macro environment. Overall, during the quarter, we did not experience any material customer order pull-ins or push-outs. Now I will turn to our expectations for the fourth quarter. Our outlook reflects the continued strength of our company-specific growth drivers and signs of a steady cyclical recovery in our automotive and industrial markets.\n\n**Rafael Sotomayor** (President and CEO)\nWe do not yet anticipate direct customer inventory restocking as one might expect off the bottom of a cyclical trough. From a channel perspective, our guidance assumes distribution inventory may fluctuate between nine and 10 weeks as we are selectively staging additional products in the channel to be competitive. We are guiding fourth quarter revenue to $3.3 billion, up 6% versus the fourth quarter of 2024 and up 4% sequentially. At the midpoint, we expect the following trends in our business during Q4: Automotive is expected to be up mid-single digits versus Q4 2024 and up in the low single-digit % range versus Q3 2025. Industrial and IoT is expected to be up in the mid 20% range year on year and up 10% versus Q3 2025.\n\n**Rafael Sotomayor** (President and CEO)\nMobile is expected to be up in the mid teens % range year on year and up in the mid single digit range on a sequential basis. Finally, Communication infrastructure and other is expected to be down in the 20% range versus Q4 2024 and flat versus Q3 2025. In summary, NXP Semiconductors third quarter results and guidance for the fourth quarter reflect a growing confidence in the company's specific growth drivers and that a new upcycle is beginning to materialize. This is based on the several signals we track regularly. These include continually growing customer backlog placed with our distribution partners, improved order signals from our direct customers, increased short cycle orders, and a growing number of product shortages leading to customer escalations. At the same time, we do not yet see material customer restocking due to the uncertain macro environment.\n\n**Rafael Sotomayor** (President and CEO)\nNow an update on our pending acquisitions of Kinara and Aviva Links. We have received all regulatory approvals. We have closed both Aviva Links and Kinara. We are extremely excited about the long term benefits these acquisitions will bring to our customer engagements and market position. As we have previously shared, in the short term, these acquisitions will have an immaterial impact on the revenue and financial model of NXP Semiconductors. We do believe the revenue impact will be material in 2028 and beyond. The three recent acquisitions, TTTech Auto, Kinara, and Aviva Links, will enable NXP Semiconductors' vision to be the leader in intelligent edge systems in the automotive, industrial & IoT markets. As this is my first earnings call, I would like to assure you that the strategy we laid out during our November 2024 Investor Day stays firmly in place.\n\n**Rafael Sotomayor** (President and CEO)\nThis includes our product innovation focus in our financial and capital return model. For the last six months I've traveled globally engaging with our customers, suppliers, and development teams. My key takeaway is that NXP Semiconductors strategy is compelling. We are focused on the most important customers and thought leaders. Our highly differentiated product roadmaps position us well to achieve our long term goals. I will continue to work closely with the cross functional leaders throughout NXP Semiconductors to accelerate our innovation in time to market efforts. Overall, we remain focused on disciplined investment and portfolio enhancements to drive profitable growth while maintaining control over the factors we can influence. I would like to pass the call to Bill for a review of our financial performance.\n\n**Bill Betz** (CFO)\nThank you, Rafael, and good morning to everyone on today's call. As Rafael has already covered the drivers of the revenue during Q3 and provided the revenue outlook for Q4, I would like to move to the financial highlights. Overall, Q3 financial performance was solid with revenue, gross profit, and operating profit all above the midpoint of our guidance range, while operating expenses were a touch above the midpoint of our guidance due to slightly higher variable compensation. Taken together, we delivered non-GAAP earnings per share of $3.11, or a penny better than the midpoint of our guidance. Now moving to the details of Q3, total revenue was $3.17 billion, down 2% year on year and $23 million above the midpoint of our guidance range.\n\n**Bill Betz** (CFO)\nWe generated $1.81 billion in non-GAAP gross profit and reported a non-GAAP gross margin of 57%, down 120 basis points year on year and in line with the midpoint of our guidance range. Total non-GAAP operating expenses were $738 million, or 23.3% of revenue, flat year on year. From a total operating profit perspective, non-GAAP operating profit was $1.07 billion and non-GAAP operating margin was 33.8%, down 170 basis points year on year and 10 basis points above the midpoint of our guidance range. Non-GAAP interest expense was $91 million, while taxes for ongoing operations were $173 million, or a 17.7% non-GAAP effective tax rate. Non-controlling interest was $15 million, and results from equity accounted investees related to our joint venture manufacturing partnerships was a $2 million loss.\n\n**Bill Betz** (CFO)\nTaken together, the below the line items were $6 million unfavorable versus our guidance, primarily due to a slightly higher tax rate driven by improved profitability. Stock-based compensation, which is not included in our non-GAAP earnings, was $118 million. Now I'd like to turn to the changes in our cash and debt. Our total debt at the end of Q3 was $12.24 billion, up $757 million sequentially. We issued three new tranches of debt totaling $1.5 billion with a combined weighted cost of debt of 4.853%. During the quarter, we reduced our net commercial paper outstanding by $735 million. Additionally, we plan to retire two tranches of debt due in March and June of 2026 totaling $1.25 billion with a weighted cost of debt of 4.465%.\n\n**Bill Betz** (CFO)\nOur ending cash balance was $3.95 billion, up $784 million sequentially due to the cumulative effect of commercial paper reduction, capital returns, equity and CapEx investments offset against the new debt and cash generated during the quarter. The resulting net debt was $8.28 billion with a trailing twelve month adjusted EBITDA of $4.65 billion. Our ratio of net debt to trailing twelve month adjusted EBITDA at the end of Q3 was 1.8 times, and our twelve month adjusted EBITDA interest coverage ratio was 15.9 times. During Q3, we paid $256 million in cash dividends and repurchased $54 million of our shares, representing a twelve month total shareholder return of $2.05 billion or 106% of non-GAAP free cash flow. After the end of the quarter and through October 24th, we bought an additional $100 million of our shares under a 10B5-1 program.\n\n**Bill Betz** (CFO)\nNow turning to working capital metrics, days of inventory was 161 days, an increase of 3 days versus the prior quarter, with inventory dollars up modestly due to pre-builds and wafer receipts from our foundry partners. Days receivables were 31 days, down 2 days sequentially, and days payable were 58 days, down 2 days sequentially as well. Taken together, our cash conversion cycle was 134 days. Cash flow from operations was $585 million and net CapEx was $76 million or about 2% of revenue, resulting in non-GAAP free cash flow of $509 million or 16% of revenue. During Q3, we paid $225 million towards the capacity access fees related to VSMC, which is included in our cash flow from operations.\n\n**Bill Betz** (CFO)\nAdditionally, we paid $139 million into VSMC and $15 million into ESMC, our two equity-accounted foundry joint ventures under construction, with the payments reflected in our cash flow from investing activities. Now turning to our expectations for the fourth quarter, as Rafael Sotomayor mentioned, we anticipate Q4 revenue to be $3.3 billion plus or minus $100 million at the midpoint. This is up about 6% year on year and up 4% sequentially, better than our view 90 days ago. We expect non-GAAP gross margin to be 57.5% plus or minus 50 basis points. Operating expenses are expected to be about $757 million plus or minus $10 million or about 23% of revenue, consistent with our long term financial model. Taken together, we see non-GAAP operating margin to be 34.6% at the midpoint, bringing NXP Semiconductors back into our long term financial model.\n\n**Bill Betz** (CFO)\nIn addition, our guidance includes about two months of operating expenses for the closed Aviva Links and Kinara acquisitions. Now turning to the below line items, we estimate non-GAAP financial expense to be about $103 million. We expect the non-GAAP tax rate to be 18% of profit before tax, non-controlling interest expense will be about $14 million, and startup expenses related to our equity account investees will be about a $3 million loss. For Q4, we suggest for modeling purposes you use an average share count of 254.3 million shares. We expect stock-based compensation, which is not included in our non-GAAP guidance, to be $118 million. Taken together, at the midpoint, this implies a non-GAAP earnings per share of $3.28. Turning to the uses of cash, we expect capital expenditures to be around 3% of revenue, below our 5% target, as we execute our hybrid manufacturing strategy.\n\n**Bill Betz** (CFO)\nThis includes consolidating our 200 millimeter front-end manufacturing factories and investing in our 300 millimeter joint ventures with VSMC and ESMC. These investments will result in margin expansion, supply resilience, and access to a competitive manufacturing cost structure. As shared at our Investor Day, we will continue to substantially invest in VSMC in Singapore during Q4, including a $250 million capacity access fee payment and a $350 million equity investment. When VSMC is fully loaded in 2028, it will drive a 200 basis points improvement in NXP Semiconductors' total gross margin. Additionally, we will make a $45 million equity investment into ESMC in Germany, enabling additional 300 millimeter supply resilience. Lastly, we will pay approximately $500 million for the closed acquisitions of both Aviva Links and Kinara.\n\n**Bill Betz** (CFO)\nFurthermore, we have restarted our buybacks at the beginning of September, and we will continue to buy back stock consistent with our capital allocation strategy. Finally, I would like to extend my personal thanks to Kurt as he transitions to a new and exciting chapter of his life. He's been an inspiration to all NXP Semiconductors team members and a personal mentor and valued partner to me as a CFO. We will miss his infectious humor, timely counsel, and thoughtful insights. With that, I would like to now turn it back to the operator for questions.\n\n**Operator**\nThank you, ladies and gentlemen. As a reminder, to ask the question, please first start 1:1 on your telephone, then wait for your name to be announced. To withdraw your question, please press star one one. Again, we ask that you limit yourself to one question and one follow up. Please stand by while we compile the Q and A roster. Our first question comes from the line of Ross Seymore with Deutsche Bank. Your line is open.\n\n**Ross Seymore** (Stock Analyst)\nHi, guys. Thanks for letting me asking the question and congrats to both Kurt and Rafael. I guess my first question, a big picture one, Bill, you just mentioned that the guidance for the fourth quarter was better than you expected 90 days ago. The details Rafael gave, while positive didn't seem like much had really changed. What specifically got better over the last 90 days either by end market, inventory, region, etc.\n\n**Rafael Sotomayor** (President and CEO)\nLet me take that one, Ross. The way we think about Q4 is we're guiding Q4 sequentially, 4% up. What we said last time, we did provide a soft guide of Q4 that we said we're going to be flat, slightly up. I think what I would say is that things that we expected to go, maybe potentially the risk that we have, they didn't materialize and the signals with respect to a soft recovery continue to be there. Our order book continues to be strong. The end consumer backlog, our distribution partners continues to be healthy. If you look at the quarter to quarter guide, what is driving a slight improvement, I would say over seasonality, pre-Covid seasonality is industrial and IoT where I think we see signs now of slight demand improvement.\n\n**Ross Seymore** (Stock Analyst)\nGood. I guess on that front, you mentioned about the inventory staying in the nine to ten week level, not quite getting to the eleven. That's your target. If you go from nine to eleven, any sort of rough dollar amount that that contributes that we should think about? Is there any specific trigger that you're looking at to let that inventory get back to its normal level, whether it be in the fourth quarter, which it doesn't sound like, or say the first half of next year.\n\n**Rafael Sotomayor** (President and CEO)\nYeah, Ross. I understand in the past, I mean, we apply a math that it was that we said it's about one week of inventory equals to $100 million. I understand the math. What I would like you kind of for now think of, I think it's more useful to look at how we're managing the channel strategically and so kind of shift a little bit of how you look at channel inventory. If you look at today, given the current environment that we have where visibility is limited, orders come late. The one thing I want to leave you with, it's important to have the right product mix in the channel to be competitive, especially when you think about our competition that has significantly higher inventory in the channel than us.\n\n**Rafael Sotomayor** (President and CEO)\nAs you know, we're not a catalog company, so getting the right product mix is really important for us now. Today, right now, we're being selective. We're staging additional product that we have high conviction of sell through. That one, that's the reason I state that the inventory may fluctuate between 9 and 10 is because what I want to leave you with is in today's environment, weeks of inventory is not static. Right? Orders are coming late. I would say that your question with respect to when 11 weeks. I would say that as our visibility and confidence continues to improve, I will confirm your point, we still see the optimal level moving towards 11 weeks. That may or may not happen in Q1 as we see improvements in the business conditions.\n\n**Ross Seymore** (Stock Analyst)\nThank you.\n\n**Kurt Sievers** (Executive Director and Advisor)\nThanks, Ross.\n\n**Operator**\nThank you. Please stand by for our next question. Our next question comes from the line of François Bouvignies with UBS. Your line is open.\n\n**François Bouvignies** (Equity Analyst)\nThank you very much. My first question is on maybe, you know, your comment, Rafael, you said that you think inventories are, I mean, low in automotive, for example, and things are getting better broad based. You do not expect to increase inventories in the channel, I mean, or even, sorry, not in channel, but in the direct channel. I was wondering if we look at Q1, you know, in terms of seasonality, I think you are down high single digit % quarter on quarter for Q1. Should I read this comment as, you know, today with your visibility, you are comfortable with seasonality, assuming there is no stockpiling and demand is stabilizing. Is that the right way to look at it?\n\n**Rafael Sotomayor** (President and CEO)\nYou're asking about Q1.\n\n**François Bouvignies** (Equity Analyst)\nYeah, Q1. You know, in a way directionally based on what you just said, you know, are you comfortable with a seasonal trend?\n\n**Rafael Sotomayor** (President and CEO)\nLet me just kind of, before I get into it, give you a slight answer on that one. I would say that if you look into what we feel good about, it is the setup into 2026. If you look at how we finished Q4, I think that we are now entering a phase of inventory normalization in auto, and we've seen signals of, I would say, demand improvement in industrial and IoT. I think we like the setup. I'm not going to guide Q1 for you, François, but I think if you're going to model, I think modeling seasonality, and I would say using pre-Covid seasonality, which is high single digits decline, would be reasonable.\n\n**François Bouvignies** (Equity Analyst)\nThank you, Rafael. I appreciate the color. Maybe the second question is for Bill. I mean, gross margin is going up in the next quarter. I assume it could be because of mix, but I would be happy to have your view here. More generally, your inventory is still fairly high, you know, days a bit higher, dollars a bit higher. You assume your loading is still, you know, you keep loading quite high. How should we think about the gross margin direction after this Q4? Are you going to, you know, crystal loading at the expense of gross margin, or do you think you can manage this level of gross margin or even increase from here? Just the moving parts would be very helpful, thank you.\n\n**Bill Betz** (CFO)\nSure, François. As you can see, as you mentioned, we are guiding gross margins up approximately 50 basis points into Q4. This is driven by the higher revenues, François, improved operational costs, and also, yes, higher utilizations which is actually offset with unfavorable product mix. Of course, we have the normal plus or minus 50 basis points on what that mix tends to ultimately be in the quarter for Q1, 2026 and the full year of 2026. We are not guiding. However, please consider our normal seasonality that Rafael just talked about in revenues for Q1 along with our annual low single digit price negotiations that typically impact us in the first quarter. We always work to offset those throughout the year through cost reductions and operational efficiencies.\n\n**Bill Betz** (CFO)\nFor full year 2026, I would say we expect to be in our long term model of 57% to 63% driven by a function of revenue levels, improved utilizations, cost reductions, offsetting the price gives, and the normal product mix fluctuations in any given quarter. I would say as stated before, please continue to use that rule of thumb. For every $1 billion of revenue on a full year basis drives approximately 100 basis points improvement to gross margin. For example, I shared in the past at $15 billion, we should be at 60%. Remember, as I mentioned in my prepared remarks, beyond 2027 we also see another lift to our gross margins by approximately 200 basis points driven by our hybrid manufacturing strategy. Again, overall, I think we're very pleased with the trajectory of our gross margins and how we manage this.\n\n**Bill Betz** (CFO)\nRelated to your inventory question, you know, you're right. In Q3 we finished inventory at 161 days. That was up three days. We're staging inventory to support our growth into Q4 proactively. We are holding more inventory to support the continued increase of late orders that Rafael talked about which are coming in below lead times. Of course, the customer escalations have grown quarter over quarter as Rafael shared in his prepared remarks.\n\n**Bill Betz** (CFO)\nAs I mentioned, last quarter we started our pre-builds for the 200 millimeter consolidation plans, which by the end of the year will be worth about six to seven days of our total NXP days of inventory. Also, remember we're holding approximately 14 days of inventory on our balance sheet versus our distribution partners. That assumes nine weeks. With the positive signals we are seeing, and from lessons learned from the past, I'm quite comfortable and pleased with the internal inventory positioning. As we mentioned many times, we have long-lived inventory in die form, preventing obsolescence risk. If you had me call inventory into Q4, I would say similar levels from a days perspective, plus or minus five days is the best view I can give you at the moment into Q4.\n\n**François Bouvignies** (Equity Analyst)\nVery clear. Thank you, gentlemen.\n\n**Bill Betz** (CFO)\nThanks François.\n\n**Operator**\nPlease stand by for our next question. Our next question comes from the line of Joe Moore with Morgan Stanley. Your line is open.\n\n**Joe Moore** (Analyst)\nGreat, thank you. I also wanted to touch on automotive customers' kind of view on inventories, and I guess can you just talk to us a little bit about what those conversations are like. Understanding there's not much overlap between you and NXP at this point, I would think stuff like that is a reason to want to hold more inventory and kind of buffer yourself from these geopolitics issues. Are you seeing any indications that that is happening or will happen?\n\n**Rafael Sotomayor** (President and CEO)\nYeah, Joe, that's a great question. I think the issue with NXP Semiconductors really shows that the current level of inventory at the end customer is not sufficient to have any ripple of business continuity. We don't see it restocking with our direct customers. I would say the good thing, right, if you look at the business dynamics of auto highly related to inventory, the normalization and also a very nice, already we consider, very nice tailwind, and you would expect the next phase to actually be restocking of inventory. We have not seen it happen. The conversations are pretty much about how they are being very conservative with respect to how they manage their working capital. No restocking so far.\n\n**Bill Betz** (CFO)\nYeah, maybe I'll add exterior itself just to add to it because I think your question does it impact NXP in any way from a direct standpoint, the answer is no. As Rafael said, we're still in the early phase and seeing customer escalations. The signals improve. The restocking has not happened nor has price increases that happen, which you typically see during a supply crisis. Those are other signals that we wait to see.\n\n**Joe Moore** (Analyst)\nOkay, is there any impact potentially on automotive production from all of that on the negative side that you could see if they have shortages of other components, that it slows productions?\n\n**Rafael Sotomayor** (President and CEO)\nJoe, we don't anticipate that. I think that the products that are associated right now with Nyxperia, these are products that could be second source. I think the qualification process could be relatively benign for OEMs. So far our orders will not indicate any impacts into the production of auto.\n\n**Joe Moore** (Analyst)\nThank you so much.\n\n**Operator**\nThank you. Our next question comes from the line of Stacy Rasgon with Bernstein Research. Your line is open.\n\n**Stacy Rasgon** (Senior Analyst)\nHi guys. Thanks for taking my questions. My first one, I wanted to drill into gross margins a little more. You are guiding it up sequentially, but it's flat year over year, even on a pretty decent revenue increase. I guess that's mix, but I'm struggling to see where the mix issue is. It looks like your industrial mix is higher. Auto looks about the same. What is going on with gross margin? It sounds like utilizations. I'm not even sure. They don't sound like they're lower year-over-year. Why are we getting more gross margin leverage on a year-over-year basis?\n\n**Bill Betz** (CFO)\nYes, Stacy, I think the factor that we see going into Q4 again, what we talked about is from an end segment, our gross margins tend to be much closer to each other to the corporate average. You can see the industrial, not the industrial, the common infra is down quite a bit year over year. The other one is you can see we're having record quarters in our mobile space, which again, you know, is slightly below our margin corporate mix. Those two end markets are kind of impacting our mix from a utilization standpoint. We are in the high 70% or plan to be in the high 70% into Q4 related to it. We do have kind of inventory at the high end internally.\n\n**Bill Betz** (CFO)\nOf course, that also has an impact on how we run total our material throughout the line, not just in the front end but also in the back end and so forth. Those are really helping offset that unfavorable mix that we see at the moment.\n\n**Stacy Rasgon** (Senior Analyst)\nI guess the inventory fill also helps. The distribution stuff is higher margin as well.\n\n**Bill Betz** (CFO)\nYeah, there's two sets of it. Remember the distribution and what you'll see is actually our distribution sales will be up quarter over quarter. Let me remind you that a portion of that or a large portion of it is driven by our mobile business where we drive and use the distribution partners in that mobile end market. That's what's driving the increase from a quarter over quarter perspective.\n\n**Stacy Rasgon** (Senior Analyst)\nThanks. My follow up, I just wanted to level set. It sounds like there is some channel fill into Q4. If I say half a week, I guess is that, do I just roughly think of that as $50 million of income on the impact into the Q4 guidance? I know you said Q1 you were comfortable with seasonal, but does that incremental channel fill in Q4 influence how we might think about Q1 seasonality? Are you sort of implicitly assuming that you are going to be putting more into the channel in Q1 before seasonal guide?\n\n**Rafael Sotomayor** (President and CEO)\nOkay, there were several questions on that one. Stacy, let me grab that one. You made a comment again on trying to kind of equate where we're going to end up in the channel and you equate, I mean you mentioned $50 million. I wouldn't see it that way. We gave a guidance of $3.3 billion. The demand, again, the visibility that we have right now is low. Orders are coming late. Where the weeks of inventory end up in the channel, like I said, it may fluctuate between 9-10. It's not going to be more than 10, it may be nine.\n\n**Rafael Sotomayor** (President and CEO)\nTo put a formulaic kind of way of looking at how much revenue is going to come from weeks of inventory staying in the channel, I don't know if I could really kind of go there, given how fluid the demand is. We're putting products that we have high conviction of sell through. I don't see it. We usually have a scenario that's baked into guidance.\n\n**Stacy Rasgon** (Senior Analyst)\nYou must have a scenario that's baked into guidance for Q4, right?\n\n**Rafael Sotomayor** (President and CEO)\nYeah. The scenario says that depends. The inventory may fluctuate between 9 and 10 weeks. The scenario is what material we put in the channel.\n\n**Stacy Rasgon** (Senior Analyst)\nOkay. All right, guys, thank you.\n\n**Operator**\nThank you. Our next question comes from the line of Tom O'Malley with Barclays. Your line is open.\n\n**Tom O'Malley** (Equity Research Analyst)\nHey guys, thanks for taking my questions. The industrial and IoT business seems very strong to close the year, kind of particularly versus where expectations were. You guys have been helpful in the past about kind of laying out where you're seeing that strength, whether it's the core industrial side or more on that IoT side. Could you give us a little bit of a feel of what's moving into your Q4?\n\n**Rafael Sotomayor** (President and CEO)\nYes, Tom, let me just step back. If you look at our industrial & IoT business at a high level, 60% is core industrial, 40% is consumer. Even within that, 80% of the revenue flows to distribution. It just kind of gives you kind of step by step. Now what we see in IoT, the end customer backlog through the channel continues to improve. We see really strong signs of demand improvement. On the consumer side, this is where we continue to benefit from company specific drivers. For instance, I'll give you an example that there's a new category of wearables. These are smart glasses that have high demand, they require high performance, low power processing. This is an area where our portfolio is strong. We're seeing some tailwinds on that side. In the core industrial, we're seeing broad based improvements across regions and products.\n\n**Rafael Sotomayor** (President and CEO)\nFor us, if you were to drill into a little bit of the application specific, it will be driven by, for us, is driven by energy storage systems and building automation. Let me put a caveat here. I don't think we, and we'll be the first one to tell you, we don't see ourselves as bad weathers for industrial & IoT. What we see, it may be that this is very company specific.\n\n**Tom O'Malley** (Equity Research Analyst)\nHelpful. A similar question just on the automotive side because it's useful to kind of see what's moving here is just on the S32 automotive processing platform portfolio. You've seen some really strong growth trends. Part of the reason many think that you guys have handled this a lot better is just the growing portion of your business that is levered to processors. Maybe again what happened in the quarter, maybe the processor business versus the rest of auto, and then into the fourth quarter, any kind of color on if there's a divergence there, how we should be thinking about just the entire auto business with those two pieces. Thank you.\n\n**Rafael Sotomayor** (President and CEO)\nNo, I think Tom, I mean we were encouraged about the direction that auto is taking, right? I mean if you were to take just Q3, in Q3, we were only 3% below our prior peak, and I think that's encouraging. Now, with respect to what is driving the performance in the business, it continues to be what we term core accelerate growth drivers. These are in the software defined vehicle, which is the S32 automotive processing platform that you mentioned, is radar, is connectivity. If you were to ask me what is driving that, it is exactly what is driving, it is the secular shift to software defined vehicles that is driving the performance of auto.\n\n**Kurt Sievers** (Executive Director and Advisor)\nTom, if I could add, we'll provide a full year kind of update on where we're at with our accelerated growth drivers on our Q4 call. Directionally, I'd say we feel very good about how the accelerated growth drivers are playing out inter quarter. Thank you guys.\n\n**Operator**\nOur next question comes from the line of Vivek Arya with Bank of America Securities. Your line is open.\n\n**Vivek Arya** (Senior Equity Research Analyst)\nThanks for taking the question and best wishes to both Rafael and Kurt. Rafael, let's say 2026 plays out the way 2025 did with China OEMs and EVs growing, but the rest of the world, you know, not growing or flattish. What does it mean for NXP? In an overall flattish auto production environment, what kind of lift can content provide net of any pricing movement? Like can your autos be conceptually within your long term model for next year?\n\n**Rafael Sotomayor** (President and CEO)\nVivek, I think the one thing I want to maybe reframe is the way we see the drivers of our business, right? Car production is not the driver of our business. We're not SAR related. If you were to look at the production, it has been stable for years. It varies 1% here and there, but it stays pretty flat. And $90-ish million a year, content growth dwarfs SAR growth. What you have in auto is the production is quite stable, but you have a very complex supply chain.\n\n**Rafael Sotomayor** (President and CEO)\nThat complex supply chain is the one that creates either bubbles in inventory glut or vacuums that create shortages. The supply chain is the one that creates the cyclical aspect of our business. The way I see it is we see normalization in inventory. If you already get behind the content growth of auto, normalization of inventory is something that we see as very, very positive for the direction of auto. I just want to basically reframe the way I think you posed the question a little bit. The way we see it, content growth and normalization of inventory provides for us an optimistic view of our business in auto in 2026.\n\n**Vivek Arya** (Senior Equity Research Analyst)\nFor my follow up, Bill, on gross margins, is it just volume that takes you from the lower end of the 57%-63% range right towards the middle of the range? Or are there any new products, any new kind of mixing up of your portfolio that can provide benefits on top of any volume benefit?\n\n**Bill Betz** (CFO)\nOh, absolutely. As we said in the past, our new product ramps are accretive to the company and they go through their normal growing pains, of course, as they ramp and other parts of our products roll off. I mean mix is really the one that, you know, what orders we get, what orders we serve. We serve over 10,000 SKUs or products every quarter, and we have to adjust and either accommodate for it and offset those or vice versa, let them fall through. That is why gross margin improves as another factor related to it. Really also our hybrid manufacturing strategy, as we mentioned, moves more to 300 millimeter.\n\n**Bill Betz** (CFO)\nAs we're making all these investments that will start to yield benefits beyond 2027 as I talked about, short term levers, again, I think we're doing a really good job offsetting any price gives that we give through our cost efficiencies and productivity internally on test time reductions and so forth. Those, you know, that's really what we're supposed to go do day in and day out. I think the team's doing a good job. You can see this by just our variability in our gross margin margins through this last cycle. I think as we become less fixed costs, that will just improve with that variability going forward. As I mentioned today, we're 30% fixed and my guess is in about a couple years from now, once we finish our consolidation efforts. Think five years and we'll probably be below 20%, which will reduce that variability.\n\n**Vivek Arya** (Senior Equity Research Analyst)\nOkay.\n\n**Operator**\nThank you. Our next question comes from the line of Chris Caso with Wolfe Research. Your line is open.\n\n**Chris Caso** (Senior Equity Analyst)\nYeah, thanks. Good morning. I wanted to go back to some of what you said with inventory levels, particularly at your direct automotive customers, where those inventory levels stand now and you quantified a bit on what the impact would be as the distribution channel increased inventory. Is there any, I mean, help us with the magnitude of what would happen if those direct auto customers finally decided that they did indeed need to restock?\n\n**Rafael Sotomayor** (President and CEO)\nChris, what we see right now is that we're starting to shift to end demand. I think that normalization, and we can see it in orders, and we did say indeed that we don't see the restocking. Now, a specific question is of what the levels are. I think we don't have visibility at a granular per customer, per Tier 1. That will be complex. It is very clear to us that it is way below our manufacturing cycle. That's what I mean. I think that is just eventually not a healthy level to be able to manage sustainable business. I can't comment whether this will happen or not in the next few quarters or in even 2026. That is a potential scenario of restocking, which is indeed a tailwind for our business. That is something that will provide benefit for us.\n\n**Kurt Sievers** (Executive Director and Advisor)\nMaybe I could add a little bit, Rafael. Chris, as you know, for about the last eight quarters we've been under shipping into the Tier 1 supply chain and actual end production. It's actually been a headwind to us, I'd say over the last two quarters, and in our guidance into Q4, we started to see that headwind subside. We think the inventory levels at the Tier 1 are where the Tier 1 players believe are normalized for the current environment. They are still very cautious on the macroeconomic outlook. As Rafael said, we've not seen that next lever of restocking occurring. When you go from a headwind of under shipping to at least shipping to end demand, that's the new growth in the short term. Did you have a follow up, Chris?\n\n**Chris Caso** (Senior Equity Analyst)\nI do. Thanks. I wanted to come to your comment on buybacks that you mentioned in your prepared remarks, could you give us a little more detail on what the intention is going forward and what we should expect now that you're resuming the buybacks?\n\n**Bill Betz** (CFO)\nYeah, no change to our capital allocation strategy. Chris, as shared in our prepared remarks, we restarted our buybacks. As I mentioned, we have a lot of cash going out, and we just wanted to make sure we had all the cash to continue to return and make all the investments we want to make inside NXP, but also balance that with healthy returns to our owners. If you look at the last 12 months, we returned 106% back to our owners, and we're going to continue to go do that. Thank you.\n\n**Operator**\nThank you. Our next question comes from the line of Blayne Curtis with Jefferies. Your line is open.\n\n**Blayne Curtis** (Senior Equity Analyst)\nHey guys, thanks for taking my question. I just want to ask on the kind of cyclical tailwinds versus seasonality. I guess if you look at December, it's really just industrial that maybe you could argue is above typical seasonality. I think you said just soft guidance for March normal. I think a lot of people have talked about just the slowing down of cyclical recovery. I mean your comments were pretty positive, Rafael. I'm just kind of curious if you can assess if you're just looking at seasonality. Is the seasonal cyclical tailwind slowing, and maybe you can look at the different markets and if you feel differently about them.\n\n**Rafael Sotomayor** (President and CEO)\nYeah, I think if you look at the Q4 numbers, you clearly stated industrial. It was above. I would even say that automotive was slightly better than seasonality, right? Pre-Covid levels.\n\n**Rafael Sotomayor** (President and CEO)\nThe drivers have one common driver that is, I think, inventory digestion is almost done. I think that normalization is a big deal. We started to shift to true end demand in automotive, and we're starting to see some company-specific drivers in industrial IoT that are helping us with respect to whether seasonality is going to change. We call it an upcycle. I think we're careful with that because, one, we do have the inventory digestion done as a factor for an upcycle. We do see some specific areas of growth in industrial, and we see an encouraging sign. True demand in industrial IoT. We do see the elements of a soft upcycle, and that's the reason why I would say that.\n\n**Rafael Sotomayor** (President and CEO)\nBlayne Daddy, if you were to ask me today are you more optimistic than you were last quarter, I would say that we are slightly more optimistic than last quarter.\n\n**Blayne Curtis** (Senior Equity Analyst)\nThanks. I wanted to ask you on mobile, I mean, if I have the numbers right, it might be a record. I'm just kind of curious the drivers behind that.\n\n**Rafael Sotomayor** (President and CEO)\nBlayne, you know, in automotive, mobile, we're a specialty player there, mostly driven by the wallet and a little bit of custom analog that we do for a Tier 1 customer there. I see that the moves of Q2 to Q3 and Q4, and I think you got to take Q3 and Q4 together, is purely, in my opinion, it's just a seasonable move and some strength in some of our customers.\n\n**Blayne Curtis** (Senior Equity Analyst)\nOkay, thank you.\n\n**Operator**\nThank you. Our next question comes from the line of Joshua Buchalter with TD Cohen. Your line is open.\n\n**Joshua Buchalter** (Senior Equity Research Analyst)\nHey guys, thank you for taking my question and congrats to both Rafael and Kurt and good luck. I know it's still early in earnings season, but your comments and outlook on the industrial and IoT segment were certainly better than your peers who have mainly talked about decelerating trends. We've kind of touched on it a little bit and I realize you're not going to comment on peers, but would you say the difference in what you're seeing versus peers is because of inventory management or more product cycle driven, and what gives you confidence in the sustainability of sort of the upcycle that you're starting to see signs of with orders still coming in late and with the lead time. Thank you.\n\n**Rafael Sotomayor** (President and CEO)\nYeah, Josh. I can speak of NXP Semiconductors' situation with respect to industrial and IoT because for us, industrial and IoT has indeed been one of the more challenging end markets since 2022, and as of Q3, our business is still 20% below our peak, right?\n\n**Rafael Sotomayor** (President and CEO)\nI do remind you that we're not the bellwether for industrial IoT, so the comparisons to other, you could say, peers may not be, I guess, relevant. I would have to say that we did manage inventory in a different way. We were very disciplined in the way we manage our business in the down cycle. I think I would say that we will be similarly disciplined managing what we see. I would say it's a sub upcycle. We are having some company specific drivers there that are driving demand, that is true new demand. We have exposure to a few company specific design wins in the core industrial that are driving some of the improvement. I don't know how you will take that as a bellwether for the industry.\n\n**Joshua Buchalter** (Senior Equity Research Analyst)\nUnderstood. Helpful color. Thank you. I was maybe also hoping that you could provide some color on the China auto market, what you saw there inter quarter and your expectations into 4Q. I believe a good amount of that is actually served by the distribution. Are inventory levels there are lean as well? Thank you.\n\n**Rafael Sotomayor** (President and CEO)\nYes. China, I mean, listen, I was in China a few months ago with Kurt and we did a customer visit to both China, Taiwan, and actually Japan. China specifically continues to be strong, continues to be a very dynamic market themselves. The auto industry there is very competitive and they continue to actually push for innovation, push for product. I would say our inventory situation there is also lean. It's also a business that is driven, that is driving, is strong. We have good customer traction. We feel very optimistic about our position in China.\n\n**Kurt Sievers** (Executive Director and Advisor)\nJosh, if I could add as a reminder, in the Asia market, specifically in China auto, we service the majority of that through our distribution channel, and it is in the western markets in North America and Europe where we do it on a direct basis. Our approach to channel management, which I'd say is probably best in class, is that we take a heavy hand there even in Asia with the channel.\n\n**Joshua Buchalter** (Senior Equity Research Analyst)\nThank you both.\n\n**Operator**\nThank you. Our next question comes from the line of William Stein with Truist Securities. Your line is open.\n\n**William Stein** (Senior Equity Research Analyst)\nThanks for taking my questions. First, I'm hoping you can remind us about the strategic purpose of the recent acquisitions. I think TTTech Auto closed recently, but then you have the two new ones as well. Can you just frame that as it relates to the rest of the autos business? I have a follow up. Thank you.\n\n**Rafael Sotomayor** (President and CEO)\nYeah, William, these acquisitions are actually directly aligned with the strategic direction of bringing intelligent systems at the edge of industrial and automotive.\n\n**Rafael Sotomayor** (President and CEO)\nIf you look at TTTech Auto, it is a software company that is going to help us accelerate our move of the system defined vehicle and around S32s and around a system approach, so quite excited to have them. It's a capability that would have been very difficult to obtain organically. It's a company that brings IP specific also in functional safety at a system level. Aviva Links is a company that has a really, really, I would say, innovative technology on a SERDES technology that is a standard. It's a standard SERDES, and that is critical to standardize sensors. Think of our radar, think of cameras, think of lidar around a core processor, which in this case will be our S32. We're quite, quite bullish on Aviva Links. Kinara brings AI capabilities, especially GenAI capabilities. High performance, low power.\n\n**Rafael Sotomayor** (President and CEO)\nThat is going to also accelerate our portfolio of intelligence into the edge.\n\n**William Stein** (Senior Equity Research Analyst)\nThere has been some discussion about elevated competitive dynamics in the infotainment part of your autos business. Can you remind us how big that is in your autos business and maybe update us on that competitive situation? Thank you.\n\n**Kurt Sievers** (Executive Director and Advisor)\nHey, Will, I'll take that one. Think about IVI and vehicle infotainment. There's kind of two parts. There's the visualization, what you see on the dashboards, and there's what you hear, the audio portion. I'd say on IVI Auto, we continue to be a dominant player there. On the visualization, our performance is maybe a little below some of our peers, but I think that's very well known at this time. I think with that, Tawanda, I think we're going to need to move back to Rafael for closing remarks, if we can.\n\n**Rafael Sotomayor** (President and CEO)\nThank you everyone for joining us today and your thoughtful questions. This quarter marks both a leadership transition and a reaffirmation of NXP Semiconductors' consistent strategy, focus on profitable growth, disciplined execution, and predictable returns. We are encouraged by the gradually increasing signs of a cyclical recovery across our automotive and industrial and IoT end markets and by the continued strength of our company-specific growth drivers. Our priorities remain clear: deliver on our commitments, manage what is in our control, and position NXP Semiconductors to continue to grow profitably. I want to express my gratitude to Kurt for his outstanding leadership and for the partnership we have built over many years. In his 30-year career at NXP Semiconductors, he has left a lasting legacy, navigating us through various challenges and positioning NXP Semiconductors as a leader in the markets we serve. I am truly humbled to follow his footsteps.\n\n**Rafael Sotomayor** (President and CEO)\nIt is a privilege to lead this company and this team. I am excited about what we will achieve together.\n\n**Operator**\nThank you, ladies and gentlemen, that concludes today's conference call. Thank you for your participation. You may now disconnect.",
      "fetched_at": "2026-02-04T15:45:37.311Z"
    },
    {
      "ticker": "NXPI",
      "title": "NXP Semiconductors N.V. (NXPI) Q2 FY2025 earnings call transcript",
      "published_date": "Jul 22, 2025, 8:00 AM EDT",
      "fiscal_year": "2025",
      "quarter": "Q2",
      "url": "https://finance.yahoo.com/quote/NXPI/earnings/NXPI-Q2-2025-earnings_call-308847.html",
      "content": "**Operator**\nLadies and gentlemen, thank you for standing by and welcome to NXP's Second Quarter twenty twenty five Earnings Conference Call. At this time, all participants are in a listen only mode. After the speakers' presentation, there will be a question and answer session. Please be advised that today's conference is being recorded. I would like now to turn the conference over to your first speaker, Jeff Palmer, Senior Vice President of Investor Relations. Please go ahead.\n\n**Jeff Palmer** (SVP - IR)\nThank you, Michelle, and good morning, everyone. Thank you for joining our call today. With me on the call is Curt Sievers, NXP's CEO Rafael Sotomayor, NXP's President and Bill Betz, our CFO. Call today is being recorded and will be available for replay from our corporate website. Today's call will include forward looking statements that involve risks and uncertainties that could cause NXP's results to differ materially from management's current expectations.\n\n**Jeff Palmer** (SVP - IR)\nThese risks and uncertainties include, but are not limited to, statements regarding the macroeconomic impact on the specific end markets in which we operate, the sale of new and existing products, and our expectations for the financial results for the third quarter of twenty twenty five. NXP undertakes no obligation to revise or update publicly any forward looking statements. For a full disclosure on forward looking statements, please refer to our press release. Additionally, we will refer to certain non GAAP financial measures, which are driven primarily by discrete events that management does not consider to be directly related to NXP's underlying core operating performance. Pursuant to Regulation G, NXP has provided reconciliations of the non GAAP financial measures to the most directly comparable GAAP measures in our second quarter twenty twenty five earnings press release, which will be furnished to the SEC on Form eight ks and is available on XP's website in the Investor Relations section.\n\n**Jeff Palmer** (SVP - IR)\nNow I'd like to turn the call over to Kirk.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nThank you, Jeff, and good morning, everyone. We appreciate you joining our call today. I will review our quarter two performance, and then I will discuss our guidance for the third quarter. Beginning with Q2, our revenue was $26,000,000 better than the midpoint of our guidance. The revenue trends in all our focus end markets were above expectations, reflective of increasingly positive cyclical trends.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nTaken together, NXP delivered quarter two revenue of $2,930,000,000 a decrease of 6% year on year. Non GAAP operating margin in quarter two was 32%, two thirty basis points below the year ago period and 20 basis points above the midpoint of our guidance. Year on year performance was a result of the lower revenue and the related gross profit fall through, partially offset by 40,000,000 lower operating expenses. From a channel perspective, distribution inventory was consistent with our guidance of nine weeks, while still below our long term target of eleven weeks. And during the quarter, we did not experience any material customer order pull ins or push outs, which could be associated with tariffs.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nFrom a direct sales perspective, we continue to support Western Tier one automotive customers with their desire to digest on hand inventory. However, we do believe that for the most part, the Tier one are either approaching or already at normalized inventory levels. Now let me turn to our expectations for the third quarter. Our guidance for the third quarter reflects the combination of an emerging cyclical improvement in NXP's core end markets and the performance of our company specific growth drivers. We are guiding quarter three revenue to 3,150,000,000 down 3% versus the 2024 and up 8% sequentially, a return to better than historic seasonal trends.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nAt the midpoint, we expect the following trends in our business during quarter three. Automotive is expected to be flat versus quarter three twenty twenty four and up in the mid single digit percent range versus quarter two twenty twenty five. Industrial and IoT is expected to be up in the mid single digit range year on year and up in the high single digit range versus quarter two twenty five. Mobile is expected to be up in the low single digit percent range year on year and up in the mid 20% range on a sequential basis. And finally, communication infrastructure and other is expected to be down in the upper 20% range versus quarter three twenty twenty four and flat versus quarter two twenty twenty five.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nOur guidance assumes channel inventory will remain at nine weeks. However, if the cyclical recovery continues, we may stage additional products at our distribution partners to be competitive. And hence, we may selectively increase the inventory in the channel. With respect to direct sales, our automotive outlook assumes that we will come closer to shipping to natural end demand. In industrial and IoT, which is primarily served through distribution, we see globally a broad based recovery across both core industrial and consumer IoT.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nSo in summary, NXT's second quarter results and guidance for the third quarter reflect an increasingly positive view that a new up cycle is beginning to materialize. This is based on several signals we track regularly. These include continually growing customer backlog levels placed with our distribution partners, Improved order signals from our direct customers, increased short cycle orders, and increasing product shortages leading to customer escalations. At the same time, the tariff environment continues to create a level of uncertainty in the long term planning of our customers. And yet, as of today, the direct impact of the current tariffs is immaterial to NXP's financials.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nSo looking ahead, we will continue to manage what is in our direct control to drive solid profitability and earnings. This includes strengthening our competitive portfolio by leveraging the recently closed acquisition of TTTEP Auto, as well as the addition of Kinara and AvivaLinks, which are still pending regulatory approval. Lastly, we are on track to align our evasive fabrication footprint consistent with our hybrid manufacturing strategy. And now I would like to pass the call over to you, Bill, for a review of our financial performance.\n\n**Bill Betz** (EVP &amp; CFO)\nThank you Kurt and good morning to everyone on today's call.\n\n**Bill Betz** (EVP &amp; CFO)\nAs Kurt has already covered the drivers of the revenue during Q2 and provided our revenue outlook for Q3, I will move to the financial highlights.\n\n**Bill Betz** (EVP &amp; CFO)\nOverall, our Q2 financial performance was good, with revenue and gross profit above the midpoint of our guidance range. While operating expenses were at the high end of our guidance due to the timing of tape outs and project spend. Taken together, we delivered non GAAP earnings per share of $2.72 or $06 better than the midpoint of guidance. Consistent with our guidance, the distribution channel inventory was nine weeks. Now, moving to the details of Q2, total revenue was $2,930,000,000 down 6% year on year and $26,000,000 above the midpoint of our guidance range.\n\n**Bill Betz** (EVP &amp; CFO)\nWe generated $1,650,000,000 in non GAAP gross profit and reported a non GAAP gross margin of 56.5%, down two ten basis points year on year and 20 basis points above the midpoint of our guidance range due to higher revenue and slightly favorable manufacturing costs. Total non GAAP operating expenses were $720,000,000 or 24.6% of revenue, down $40,000,000 year on year and $10,000,000 above the midpoint of our guidance range. From a total operating profit perspective, non GAAP operating profit was $935,000,000 and non GAAP operating margin was 32%, down two thirty basis points year on year and 20 basis points above the midpoint of the guidance range. Non GAAP interest expense was $85,000,000 while taxes for ongoing operations were $148,000,000 or a 17.4% non GAAP effective tax rate. Non controlling interest was $12,000,000 and results from equity account investees associated with our joint venture manufacturing partnerships was zero.\n\n**Bill Betz** (EVP &amp; CFO)\nTaken together, the below the line items were $1,000,000 unfavorable to our guidance. Stock based compensation, which is not included in our non GAAP earnings was $117,000,000 Now I would like to turn to the changes in retention debt. Our total debt at the end of Q2 was 11,480,000,000.00 down $247,000,000 sequentially as we repaid the $500,000,000 tranche of debt due in May 2025 during the quarter. Our ending cash balance was 3,170,000,000.00 down $818,000,000 sequentially due to the cumulative effect of acquisition costs, debt reduction, capital returns, equity and CapEx investments offset against the cash and additional liquidity generated during the quarter. The resulting net debt was 8,310,000,000.00 and we exited the quarter with a trailing twelve month adjusted EBITDA of $4,750,000,000 Our ratio of net debt to trailing twelve month adjusted EBITDA at the end of Q2 was 1.8 times, and our twelve month adjusted EBITDA interest coverage ratio was 17.4 times. During Q2, we paid $257,000,000 in cash dividends and repurchased $2.00 $4,000,000 of our shares. Due to the capital requirements related to the TTTEF auto acquisition, the potential closure of Canara and AvivaLinks and our long term net debt leverage ratio targets, we paused the buyback during the quarter. We expect to resume the buyback in Q3 consistent with our long term capital allocation policy.\n\n**Bill Betz** (EVP &amp; CFO)\nTurning to working capital metrics. Days of inventory was one hundred and fifty eight days, a decrease of eleven days versus the prior year, with inventory dollars slightly up sequentially. Days receivables were thirty three days, down one day sequentially, and days payable were sixty days, down two days sequentially. Taking together, our cash conversion cycle improved to one hundred and thirty one days. Cash flow from operations was $779,000,000 and net CapEx was $83,000,000 or 3% of revenue, resulting in non GAAP free cash flow of $696,000,000 or 24% of revenue.\n\n**Bill Betz** (EVP &amp; CFO)\nDuring Q2, we paid $35,000,000 towards the capacity access fees related to VSMC, which is included in our cash flow from operations. Additionally, we paid $50,000,000 into VSMC and $16,000,000 into ESMC, our two equity accounting foundry joint ventures under construction with the payments reflected in our cash flow from investing activities. Now turning to our expectations for the third quarter. As Kurt mentioned, we anticipate Q3 revenue to be $3,150,000,000 plus or minus about $100,000,000 At the midpoint, this is down about 3% year on year and up 8% sequentially. We expect non GAAP gross margin to be 57% plus or minus 50 basis points.\n\n**Bill Betz** (EVP &amp; CFO)\nOperating expenses are expected to be about $735,000,000 plus or minus about $10,000,000 or about 23% of revenue, consistent with our long term financial model. The sequential increase is primarily driven by the acquisition of TD Tech Auto and variable compensation. Taken together, we see non GAAP operating margin to be 33.7% at the midpoint. Please note, our third quarter guidance does not incorporate the remaining two acquisitions, which continue to be under regulatory review. We estimate non GAAP financial expense to be about $91,000,000 We expect non GAAP tax rate to be 17.4% of profit before tax.\n\n**Bill Betz** (EVP &amp; CFO)\nNon controlling interest will be about $14,000,000 and results from equity account investees about $1,000,000 For Q3, we suggest for modeling purposes, you use an average share count of 253,800,000.0 shares. We expect stock based compensation, which is not included in our non GAAP guidance to be 116,000,000 Taken together at the midpoint, this implies non GAAP earnings per share of $3.1 Turning to uses of cash. We expect capital expenditures to be around 3% of revenue. We will make a $225,000,000 capacity access fee and a $145,000,000 equity investment into VSMC, as well as a $15,000,000 equity investment into ESMC, which are two equity accounted foundry joint ventures under construction. Pending the regulatory approval for Aviva and Chimera acquisitions, we will result in a cash payment of $550,000,000 Now, in closing, I would like to highlight a few focus areas for NXP.\n\n**Bill Betz** (EVP &amp; CFO)\nFirst, as Kurt mentioned, based on the signals we track, it appears to us we are in the early stages of a cyclical recovery. Second, we have started the consolidation of our legacy front end 200 millimeter factories as part of our hybrid manufacturing strategy. This includes pre building a bridge site for future customer requirements, which will result in higher inventory. We expect by year end, this will be approximately six to seven days of inventory, which we will hold in die form. As a result, our front end utilizations have moved to the mid 70% range during Q2 from the low 70% range before.\n\n**Bill Betz** (EVP &amp; CFO)\nLastly, we will continue to focus on what is in our control, driving solid profitability and earnings consistent with our long term financial model. I would like to now turn it back to the operator for your questions.\n\n**Operator**\nThank And the first question comes from Ross Seymore with Deutsche Bank. Your line is now open.\n\n**Ross Seymore** (Analyst)\nHey guys, thanks for letting me ask a question. Kurt, you went through some of the same signals this quarter as you did last quarter about the cyclical business turning and then of course, some of the idiosyncratic NXP specific drivers. I just wondered how you'd compare those signals quarter to quarter. Is your cyclical confidence rising quarter over quarter? Is it staying about the same?\n\n**Ross Seymore** (Analyst)\nIn general, just how are you feeling this quarter versus last?\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nYeah, thanks and good morning. Good morning, Ross. Clearly better. So it is indeed the same signals. That's actually the reason why we do this.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nWe track these signals all the time, and there is clearly an improvement on all four of them over the past ninety days. That is exactly why I tried to highlight them, because that drives our growing confidence that we are in the beginning of new upside. So ninety days ago, I guess I really talked about a balance of uncertainty from tariffs and some early, early signals which would signify the early innings of new cycle. This time I would say nothing really new on the tariffs, but clearly those signals about the new up cycle have strengthened since ninety days ago. So a market difference, Ross, versus one quarter ago.\n\n**Ross Seymore** (Analyst)\nGreat. Thanks for that color. And then for Bill, just I guess two parts quickly on margins. One, how much does your gross margin get benefited from running the fabs a little hot in the consolidation? And then two, with those two pending deals on the OpEx side of things, how do you expect to manage that?\n\n**Ross Seymore** (Analyst)\nIf they close, does OpEx pop up in the fourth quarter? Or can you kind of offset that in other ways to keep that 23% intensity?\n\n**Bill Betz** (EVP &amp; CFO)\nSure. Good morning, Ross. Related to Q2 results delivering the 56.5%, it had very little impact. Related to the 57%, not much, I would say, because again, you start the material and we're only building a couple of days and at the end of the year, it will be about six to seven days. As you can see, we've been also focused on draining some of our internal inventory as well.\n\n**Bill Betz** (EVP &amp; CFO)\nSo you have that net effect occurring there. Related to the acquisitions that are still pending, again, we have mechanisms in a way to try to absorb this as much as If we do close in this quarter, which we do expect, we may be a bit higher. But remember, these two acquisitions are the smaller of the three. Just to remind you from a headcount size, I believe Canara is around 60, and AvivaLinks is around 100.\n\n**Ross Seymore** (Analyst)\nThank you.\n\n**Operator**\nAnd our next question will come from Vivek Arya with Bank of America Securities. Your line is open.\n\n**Vivek Arya** (Analyst)\nThank you for taking my question. Kurt, I heard on the call the suggestion that you're in early stages of cyclical recovery. So if we apply that to the automotive segment, you know, Q2 sales flattish year on year, I think Q3 are also indicating to be flattish year on year, and that seems to be a somewhat more conservative tone that we hear from some of your analog peers who are more optimistic, right, they're seeing the year on year sales increase, especially in China. So how would you contrast the pace of recovery you are seeing in automotive versus your peers, and when do you expect your automotive sales to start growing year on year? Can that happen in Q4?\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nHey. Good morning, Gimmick. Yeah. Well, I can't really contrast to our peers because I think we are the first one to have earnings. So I wouldn't really know what they have to say this quarter.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nWe will probably all of us learn a little later. Now I still fully understand your question and I would reformat this a little. Our automotive business is accelerating massively from the second into the third quarter when you think about the sequential growth. So we just gave you actuals of the second quarter, which were 3% up quarter on quarter, and for the first time in a long time by the way flat year on year as you rightfully said, And we said now mid single digit up into the third quarter. So that is doubling in terms of sequential growth rate.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nSo therefore, I'd say there is a clear difference. Furthermore, the underlying inventory burn, which has held us back for quite a while, that is actually what is moderating or eventually going away through the quarter. So that was the tier one inventories in the Western world, which we've talked about many quarters where we had to follow their desire to bring down their internal inventory quite materially. It appears that this is coming to an end through this upcoming quarter. So that is actually the real factor.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nChina, since you also asked about China, China has been strong all along. And mind you that we are serving the automotive market in China predominantly through distribution, where we have been and continue to be below our inventory targets there with nine weeks, significantly less than eleven weeks. So what really matters is this change in the Western Tier 1s. So what I try to say is, Vivek, I don't think we should sugarcoat that the automotive macro is certainly mixed. S and P just came out with their latest SAAR forecast for this year, which they upped actually from ninety days ago to flat year on year, 90,000,000 cars.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nWhen we talked ninety days ago, they were actually at 88,000,000 cars. So the forecast has slightly gone up. I wouldn't celebrate this as a big thing. It's still flat. So our main improvement is that we come closer to shipping to natural end demand effects.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nThat's the key points, because the inventory burn at the Tier 1s is going away. So that's how I would frame the automotive environment at this stage.\n\n**Vivek Arya** (Analyst)\nOkay. And for my follow-up, just one or two related ones for Bill. So Bill, if you could give us just the contribution from the acquisitions. I think one has closed, two have not closed. Just how to kind of think about when they do close, what the contribution ranges might be.\n\n**Vivek Arya** (Analyst)\nAnd then if I were to make a guess for Q4 and say, if NXP sales were to grow low to mid single digits sequentially in Q4, what would that do to gross margins? And is there anything in the mix that we should be thinking about as we kind of conceptually think about Q4 gross margins?\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nOkay. There was a number of questions, Vivek, which you did slow into your second question. Well done. Let me try to pass them. The first one was about the contribution of the acquisitions.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nWe actually closed one acquisition in the second quarter, which is T2Tech Automotive. And as we said before, their contribution from a revenue gross margin perspective is completely immaterial to our financial model all the way through '27. We did acquire them for the IP and know how they have in software for safe processing in the software defined vehicle, where it is a major, major contributor to our system solutions there. On the OpEx side, we do have to digest OpEx from them. And I think Bill talked about this in the prior quarters, both quarters before, that we do create space with our existing OpEx by actually deprioritizing less strategic parts in our portfolio in order to have enough room to swallow TT Tech Auto's OpEx.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nAnd I think we also told you they come with 1,100 software engineers. Those are now indeed part of NXP. So the OpEx guide, which you get for quarter three, Vivek, includes fully TT Tech Automotive. It's fully in there, but we did create space for this by deprioritizing other elements. And all in all, and here I speak for what Bill said earlier, we are on track in the second half of the calendar year 'twenty five to be in our OpEx model or say twenty three percent OpEx of revenue.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nThat's what we're going to hit in the second half of calendar year '25. Now you talked also about Q4, and I think this gets pretty lengthy here. We don't really guide here from Q4, but you put something into my mouth. So from experience, know I have to say something, otherwise you say I said it differently. We don't guide Q4, but I know you want to model something Vivek.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nSo I guess for Q4 revenue to start with, it is fair to orientate yourself on long term historical seasonality, which we have had from Q3 to Q4, or to be more specific, a flat to slightly up revenue development from Q3 into Q4. Now I want to remind you when saying this that this is all sitting on nine weeks of inventory. And in order to stay competitive in the channel, we may want to stage our what we call hero products, which are the products which have the best sell through higher in the channel from an inventory perspective in order to be competitive against the competitive pressure in an up cycle situation. So I made that comment for quarter three, and I want to be sure that you all understood what I said. The quarter three guide which we gave you, the $3,150,000,000 sits at nine weeks, but we may take it higher by putting more inventory in, and the same holds for Q4.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nAnd that would be of course over and above this historic seasonality of flat to slightly up, which I talked about earlier. And now the last part of your question was about the impact on gross margin, and that I give to you.\n\n**Bill Betz** (EVP &amp; CFO)\nSure. Q3 related to gross margin, the way to think about this, the 57% guide assumes that we stay in the mid-70s from a utilization standpoint, because at the same time, we're lowering inventory, but we started to bridge and build up a couple of days of our inventory as well. Now, for Q4, we are not guiding it. However, I continue at this time to model a front end utilization in the mid-70s based on what Kurt just said the normal revenue seasonality of flattish to slightly up. Unless we see stronger business signals and conditions, which we may want to increase this then up to the upper 70s.\n\n**Bill Betz** (EVP &amp; CFO)\nWe haven't made that decision yet. It's something that we will monitor very carefully and explore from now until next earnings period. And then again, beyond 2025, I know you didn't ask, but I'm sure somebody will ask without providing direct guidance. I'll just refer to what I said last quarter and what we shared during Analyst Day as a good rule of thumb for every 1,000,000,000 in incremental revenue, we should see about 100 basis points of incremental margin on a full year basis. So, $12,000,000,000 revenue should be around 57%, 13% at 58%, 14%, 59% and so on.\n\n**Bill Betz** (EVP &amp; CFO)\nNow, of course, there's timing elements and other levers that we may get us above or below these levels, given any quarter hence why we give plus or minus 50 basis points on a quarterly basis. Now, remember, these other levers include front end utilization back to the 85% level or even above mix refilling our channel target of eleven weeks ramp of those new products, improve costs, normal annual low single digit ASPs, and eventually think about post-twenty twenty seven reducing our fixed costs with our consolidation efforts, part of our hybrid manufacturing strategy. So a lot going on, but we have the levers in place to and we feel very confident in delivering our long term model range of '57 to '63.\n\n**Operator**\nAnd our next question will come from Francois Bourbonis with UBS. Your line is open.\n\n**François-Xavier Bouvignies** (Head of Europe Tech Hardware/Semiconductor)\nThank you very much. I just have a follow-up on your channel inventory. So you said that you expect to sit at nine weeks. Your guidance is based on nine weeks. And you may increase it, either in Q3 and Q4, if I recall correctly.\n\n**François-Xavier Bouvignies** (Head of Europe Tech Hardware/Semiconductor)\nWhat are you waiting for exactly to increase? I mean, what are the signs that you would make you, you know, make the decisions and why, know, you don't do it right now? So what are the moving parts that would make it increase to higher levels? That would be my first question.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nYeah. Thanks, Francois. Good afternoon. I actually did not say or Q3 or Q4. What I want to say is it could be Q3 and Q4.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nThat really depends on circumstances. What we are waiting for is a further solidification through this quarter, but it could be in this quarter of those at least those four trends, which I talked about earlier, which is the number of short cycle orders, which is the growing backlog of the orders at our distribution partners, which is the growth of our direct customer order book, and actually escalations, supplier escalations, which by the way have almost doubled over the last ninety days. So if this continues to go, and that's why I put it into my prepared remarks, Francois, it could be as early as in this running quarter that we start to touch this. Again, the importance here is it is not about those $200,000,000 revenue, which is probably the difference currently between nine and eleven weeks. It is much more about the competitiveness of the right products of distributor's ships.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nThat is what we are watching. Likely it will lead to an increase then at some points of the inventory, but we don't look at it as making revenue, because we know we just ship revenue from here to there. It is about being competitive and drive ourselves as the distributors with the right products. So that's how you have to think about it. But again, there is a chance it happens in Q3 and the same again in Q4, and that could be end eventually.\n\n**François-Xavier Bouvignies** (Head of Europe Tech Hardware/Semiconductor)\nMakes sense. Thank you very much, Kurt. And maybe one for Bill. Mean, on the inventory days, eleven days below is actually a big decrease in days. I mean, when you look in the history, so that's welcome.\n\n**François-Xavier Bouvignies** (Head of Europe Tech Hardware/Semiconductor)\nStill on the absolute number, it's still relatively high. But how should we think about your own inventories in Q3 and Q4? Do you want to work it down more aggressively perhaps given the relative high level? It would be great to have your color here.\n\n**Bill Betz** (EVP &amp; CFO)\nAbsolutely, Francois. For Q2, we made some progress on reducing our internal DIO from one hundred and sixty nine days last quarter to one hundred and fifty eight days. Now approximately five days are linked to a future asset for sale and the remaining is linked to reducing our inventory levels from a day's perspective. For Q3, based on the combination of the linked to the higher revenues and take an account the start of our pre bills of a couple days, we expect to be at a similar level ending in Q3. Now, please note, are still holding about fourteen days worth of channel inventory on our balance sheet And by year end hold about six to seven days of pre built stock related to our manufacturing consolidation efforts. So overall, we're trying and continue to balance and hold a bit more internal inventory versus our long term target of one hundred and ten days to ensure we improve supply in this new emerging up cycle from the lessons learned from the code supply crisis in the past. So, we're trying to balance this as best as we can.\n\n**François-Xavier Bouvignies** (Head of Europe Tech Hardware/Semiconductor)\nThanks a lot.\n\n**Operator**\nAnd the next question will come from C. J. Muse with Canner. Your line is open.\n\n**CJ Muse** (Senior Managing Director)\nYes, good morning. Thank you for taking the question. I guess digging a little bit deeper into auto, you talked about shipments tracking to natural end demand. I was hoping perhaps you could be a little more specific within your key growth drivers and the trends you're seeing there both from China and kind of non China perspective to get a sense of the rate of recovery geographically?\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nYeah. Thanks, CJ. So, a couple of statements here. One is, as we annually update them, sneak preview, it appears that all the growth drivers which we laid out, and that means of course also including the automotive ones, are on track the targets which we had given you in November in our Investor Day. Secondly, I think it's really important in automotive to take a step back and look at our overall automotive situation relative probably relative to peers.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nAnd I want to remind you that the revenue which we just guided for quarter three is only 4% below the peak which we had in automotive in the fourth quarter of calendar year 'twenty three. So we are just a little bit away from the peak. So we've done extremely well through this, what you would call a down cycle. Again, you know where the industry has gone in and what high percentages from peak to truck. We are now only 4% away from the former peak.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nNow, of course, we want to grow above that peak because of the growth drivers. But I just wanted to put this a bit into perspective also relative to the question earlier from Vivek. Now, on a geographic basis, Ziche, the way I would phrase it is China has been and continues to grow both from a quarter on quarter perspective as well as from a year on year perspective. There was one dip in the Q on Q growth in auto in China, which was Q1. And we talked about this earlier.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nThis is a seasonal drop, which we every year have in China. It did grow very nicely into the second quarter, and so it will into the third quarter. The same is true for Japan and Asia Pacific. What for us is the change which is significant and which really makes a difference to us and that also drives the higher sequential growth for the total auto segment is that the inventory burn with the Tier 1s and that is especially in Europe and to a lesser extent in The US is starting to go away, which means through this quarter we think we will start versus the second half of the quarter, maybe versus the end of the quarter, we will start to ship to end demand. And that makes a real difference, because we get them growth without the macro would need to improve.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nSo we don't need improvement from the macro for us to grow our and we also don't need restocking at customers. That growth comes alone from the moderation of the inventory burn at these Tier one customers, and that's the biggest dynamic which we currently have, CJ.\n\n**CJ Muse** (Senior Managing Director)\nVery helpful. And I guess a follow-up question for you, Bill. You spoke earlier to Vivek around the key drivers to gross margins. I was hoping perhaps you could speak to maybe the near term, the next six to nine months within the kind of structure of 57% to 63% target model. Would you highlight any particular drivers outside of utilization and mix that could impact trends there or no?\n\n**Bill Betz** (EVP &amp; CFO)\nYes, I think Kurt alluded to it. We still are holding at nine weeks. And obviously, that's an opportunity once we feel and target in specific areas to bring that back up to eleven, and that will also help our inventory. I think ongoing improved costs, we continue if you recall, in the beginning of the year, we always have our low single digit price adjustments, and then it takes time to get through and improve for the full year effect. So that becomes a tell.\n\n**Bill Betz** (EVP &amp; CFO)\nAnd then we continue focus on that. Then more medium term, it's really going to be a function of why I laid out that rule of thumb. So that's where we are besides the utilization that I mentioned earlier.\n\n**CJ Muse** (Senior Managing Director)\nThanks so much.\n\n**Operator**\nAnd our next question will come from Chris Dannelly with Citi. Your line is open.\n\n**Christopher Danely** (Analyst)\nHey, thanks guys. Hey Kurt, can you just give us a little more color on the visibility trends maybe through the end of the year even into next year? You mentioned some shortages and escalations, just any sort of quantitative metrics you can give us, say now versus three months ago on how the rest of this year next year is looking?\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nWell, hi, Chris. I'm smiling now because I went ahead of my skis already. Yeah, the Q3 guidance you just got. The difference to ninety days ago is that ninety days ago, we didn't even provide any, not even the remote soft guide for the next quarter. I did offer that color for the calendar quarter four of this year a few minutes ago with a flat to slightly up typically historic seasonality based on the nine week distribution inventory, and we may or may not be higher than that.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nMy sense is, Chris, that that dynamic is continuing, because inventory has burned away our company specific growth drivers. And here I would actually call out auto because it's almost 60% of the company are just firing on all cylinders. I mean, is a whole race now on these software defined vehicles, which is driving very hard our revenue in the S32 processor families going very, very well. So we this number one position which we have there globally, we really see it expanding. Radar is doing very well because ADAS levels are driven up, and I personally even believe that you think a bit more midterm that robotaxis will become more pervasive.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nWhen an electrification, even so people in the Western world might have been a little bit more muted on it, electrification just keeps penetrating. So S and P latest forecast for this year is 15% more units, car units, which are XEVs over last year, and ending this year of 43% global penetration. Now what makes me really excited, Chris, in all of this is China. So Rafael and I, were just a week before last week, were together in China. And maybe Rafael, you share a little how excited we were by how innovative and how fast customers are turning design ins into revenue.\n\n**Rafael Sotomayor** (President &amp; Ad interim GM - Secure Connected Edge)\nYeah, indeed. And thanks for the question on that one. China, if you think of China, China is an OEM driven market where they're driving innovation through software defined vehicles and is extremely fast moving. So, clearly China is extremely competitive and the competitive pressure, I mean, I can get issues on this, is not only in pricing, it's also on product differentiation and innovation. Quite exciting, had a week of very good meetings with both OEMs and the tier ones, where kind of part of the transition plan, but the relationship to me, but not only that, it was started initiatives associated with software defined architectures, BMS and radar.\n\n**Rafael Sotomayor** (President &amp; Ad interim GM - Secure Connected Edge)\nAnd so quite exciting the opportunities that we see in China. The strength in China comes also with peer There's a story there in China that's probably not told enough. The tier ones in China are relevant not only for China, but they're relevant for foreign OEMs, for China markets and non China. And so, quite important meetings there with the Tier one Chinese customers who are driving innovation and competitiveness in non China OEMs.\n\n**Christopher Danely** (Analyst)\nThanks for the color, guys. So just as a follow-up, I guess, on that same topic. I mean, it sounds like auto, you're most optimistic on that. If we look at the next, I don't know, year, year and a half Kurt, would you expect higher relative growth from your automotive segment or your industrial segment?\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nLike Chris two points. The one is we are as optimistic on industrial. It was an auto question, so we answered on auto. That doesn't mean we are not optimistic on industrial. And the best way to answer your midterm question is we see absolutely no reason to not meet our 11/20/1943 Wall Street guide of 8% to 12%, both in industrial and IoT as well as in auto.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nSince we will be certainly below this year, we clearly see the opportunity to catch up next year and the year after, which is greatly helped by the cycle and by the company specific drivers. It's also industrial. Maybe Rafael, you speak a bit about early views on edge AI capability of NXP in industrial.\n\n**Rafael Sotomayor** (President &amp; Ad interim GM - Secure Connected Edge)\nYeah, so see, well, we already started to see the signals already in industrial for the next quarter to actually normalize. This is the first time, the last time we discussed how Q2 less of an LTE was being driven by consumer space. The changes that we see now in Q3 is that this is broad based. This is the growth that you see in quarter over quarter is driven geographically in all areas, all geographies are showing growth. And the other thing we're seeing is we also see now a big part growth comes also from industrial, from core industrial, not just consumer.\n\n**Rafael Sotomayor** (President &amp; Ad interim GM - Secure Connected Edge)\nSo, the trends of the stable decision in industrial for NXP on the MCU and microprocessor place is starting to kind of take shape. And now we're starting to get engagements for next year on high performance, higher AI capabilities with our tier one. So the thesis of our industrial growth of 8% to 12% that continues to eight to 12% are still very much in play and continues.\n\n**Christopher Danely** (Analyst)\nThanks a lot guys. That's very helpful.\n\n**Operator**\nAnd our next question will come from Thomas O'Malley with Barclays. Your line is open.\n\n**Thomas O'Malley** (Director - Equity Research)\nHi guys. Thanks for taking the question. If I look at last quarter and this quarter, obviously one of the major changes is your confidence that you could actually up some of the weeks of just the inventory and you're still kind of waiting mid quarter here and you kind of addressed that already, but you made the remark nine weeks to eleven weeks. Is eleven weeks the maximum that you guys would channel refill in this period of time? Or is there any circumstance in which you would go a little bit higher than that?\n\n**Thomas O'Malley** (Director - Equity Research)\nJust walk me through why would be eleven weeks? Is that just kind of the stated goal long term or what would change to make you maybe go a little bit higher than that given that you guys are clearly seeing a recovery?\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nYeah, it's stated long term goal, which we actually about the same size we had before the whole COVID and supply crisis. We completely relooked at it, reassessed it by the mix of the pieces which are in there and not by a top down decision but by bottom up assessment, we arrived again at eleven weeks being a reasonable target across different segments. Know, Tom, the reality is once we are there, I think we also want to stop speaking about this for time because we got almost paranoid about this, which we did because we were probably the only ones to hold our channel inventory very much under control through this cycle, which has served us extremely well. But yeah, we want to go back to normal. The definition of normal for us is eleven weeks, and then we just continue on much more regular basis.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nBut yeah, maybe it jumps today to twelve and jumps down to ten again, but the the stated long term target is indeed eleven weeks. I would almost go that far, and I think we had it even on the slide there. In our Wall Street model, which we provided last November, the eleven weeks was actually an element of the forecast. So we said this forecast is valid with the eleven weeks inventory on the long run.\n\n**Thomas O'Malley** (Director - Equity Research)\nHelpful, Kurt. And then obviously, you gave us a little sneak peek into Q4, so I can't help but pick a little bit there too. But you're saying flat to slightly up. If you look at normal seasonality for your segments kind of into the December, at least over the past seven, eight years, it looks like auto is up low single digits. Industrials actually up a bit more robustly in the fourth quarter.\n\n**Thomas O'Malley** (Director - Equity Research)\nIf you're to plug that in, you kind of get greater than 20% growth in the industrial business. You're clearly pointing to some strength there, but any differences that we should be thinking about in the recovery between auto industrial as the year closes? Or would you say the contributing factors to that flat to slightly up are relatively in line with what you've seen historically?\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nTom, that's a stretch too far. Clearly, no segment guidance in Q4. What I did say, the flat to slightly up is indeed just mathematically our, I don't know, nine year or so average historical seasonality across the entire company. And that's what we give for Q4, and it stays there. So I'm sorry, but we really can't go to second level at this stage.\n\n**Operator**\nAnd the next question comes from Joshua Buchalter with TD Cowen. Your line is open.\n\n**Joshua Buchalter** (Director - Equity Research)\nHey guys, thank you for taking my question. In your prepared remarks, I think you talked about not seeing any material impact from the tariff environment or pull ins. Can you maybe elaborate on what signals you're looking for and what makes you so sure that there's not really a meaningful impact yet? You know, I think a few of your peers have commented, you know, your customers don't check a pull in box when they place an order. So I'd be curious to hear if there's any changes in your customers' behavior and what you're seeing on the tariff front. Thank you.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nWe have a pretty good view on this, Joshua, because we are very alert to it. And that has to do that we have been highly disciplined over a number of years now on inventory levels. So we didn't want to get into the trap of being a victim of pull ins here at the very end of the down cycle or better at the beginning of the up cycle. The way we can do this is we have a lot of AI running on our auto patterns, which tells you immediately if there is anything which falls out of the normal patterns. And when we see that, we go back to the customer and ask, what is it?\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nAnd if there is a clear plea for this is a wish for a pull in relative to tariffs, we typically don't support it because that is exactly what we want to avoid. We had a very few of those situations, so I'm not talking fiction. Not much though, and therefore we can really make a statement. We also looked at it relative to Liberation Day, if there was any correlation of any of these signals. And given our very application specific business structure, we have pretty smooth overtracks.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nI mean, is not like everything is jumping around all the time. It is relatively smooth. So we would see those deviations. That's the basis I made this comment from. My comments, to be very clear here, was a firm comment for the past second quarter.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nSo the numbers which we gave you had no pull ins or push outs. And the comment also holds for what we can see from today's perspective for the third calendar quarter. Now I don't know yet what the rest of the quarter is going to be in the end, but it doesn't appear at this stage that any of this would happen.\n\n**Joshua Buchalter** (Director - Equity Research)\nGot it. Thank you, Kurt. You touched on this before, but I was wondering if you could maybe comment on behaviors from your auto customers specifically related to their investment in software defined vehicle. I mean, it's a very challenging time to still to be an auto OEM. Like, are you seeing them sustain, accelerate, pull back on their investment in newer technologies and features like SDV and ones that that enables? Thank you.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nYeah, that's actually what I find exciting because, yes, that is accelerating. Clearly OEMs around the world are finding out more and more that the SDV concept delivers them a number of very, very significant competitive advantages. One is really consumer value, because the car just doesn't age in the hands of the consumer, which is a significant advantage. But it also makes their designs more versatile and cheaper. So I'm going that far to claim that a lot of the cost advantages which the Western car industry is suffering from against or disadvantages against the Chinese players is because China has embarked earlier, faster and more successfully on STV concepts.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nSo it's a must do, Chao Chao, for the rest of the world to catch up, to remain competitive with China Inc. So clearly an acceleration. And I know that that sounds orthogonal to the tariff pressures and other turmoil this industry is in, but they all know this is the way to move forward. It's almost like electrification of drivetrains and people know how to do it. It's now like how to reach the consumer with it.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nThe next big thing is STDs, and the next big thing in that is NXP. I mean, we are with our S32 family and our Ethernet connectivity with it, and now Teachable Auto software, that's just I mean, are just far away from everybody.\n\n**Joshua Buchalter** (Director - Equity Research)\nGot it. Thank you. And Kurt, if this is indeed your last earnings call, thank you for all the help over the years.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nThanks, Chandra. Thank you.\n\n**Operator**\nAnd our next question will come from Stacy Rasgon with Bernstein Research. Your line is open.\n\n**Stacy Rasgon** (Analyst)\nHi, guys. Thanks for taking my question. Kurt, I wanted to revisit the TTT Tech in the guide. I know you said it was insignificant, but but I mean, you have 1,100 employees, and you paid $625,000,000 for it. Is the revenue really zero? Like, how how big is the insignificant amount of revenue that's actually in Q3?\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nIt is insignificant, Stacie, because we don't want them to do what they used to do to an extent. We need that competence they have and that know how in the sector which they know, but really going more from maybe a service model to becoming an integral element of what we do for the SDV. So that's why this is also changing to what it might have been in the past, Stacey.\n\n**Stacy Rasgon** (Analyst)\nOkay, so what, it's single digit millions? Or is it double digit? Like just help me size it. How big is it?\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nWe don't give a number for it, Stacy, but it is really completely insignificant and immaterial to NXP's financials. On the revenuegross margin as a consequence side, it is not insignificant at all from the OpEx side, which I pulled out because those 1,100 engineers, we of course want to have them, we pay them. So they are on the payroll. So that's really where impact is.\n\n**Stacy Rasgon** (Analyst)\nGot it. Okay. So there's a business model change is what you're saying. Okay.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nAbsolutely. Thank\n\n**Stacy Rasgon** (Analyst)\nyou. For my follow-up, I wanted to take a little bit on Q4. So it does sound like I get it the guidance doesn't include filling the channel, but it's certainly on the table. And you sort of gave a number for kind of typical seasonality for Q4. Are there plausible scenarios where you could be above seasonal in Q4 without filling up the channel further than it is right now?\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nSandy, don't guide Q4 at all. I try to guide it.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nYou asked me if I could give you direction today, if we can be above seasonality. I mean, that's your question. And if we just What take a call\n\n**Stacy Rasgon** (Analyst)\nI'm asking is, do you need to fill the channel to be above seasonal is what I'm asking.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nNo. That is fine with nightly. However, the sell through trends, Stacy, are very dynamic to the positive side. And that's why I made that comment even for quarter three, Stacy. I mean, you asked for quarter four.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nHonestly, I think the more burning question is for quarter three, because already there the dynamic is such that we might selectively put it a little higher. Now, if that all continues the way it actually in all the past cycles has continued, of course, the dynamic pulls or accelerates even into Q4.\n\n**Stacy Rasgon** (Analyst)\nI mean, even though I wonder a little bit we've had negative preannouncements from auto OEMs and like the end demand environment for auto doesn't seem fantastic. It's just a normalization of inventory or like what?\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nAbsolutely know what to speak about. There were a few less overwhelming announcements very recently. But I think we have to look at the total market, Stacy. And I told you that S and P just upped their car forecast for this year from 88,000,000 to 90,000,000. It's only 2,000,000 cars.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nAnd I would also clearly not say it's not the SAAR which is driving us, but it's not going backwards. It's actually improving a little. And our growth comes from content increase, thanks to our like radar electrification S32. And it comes and it's really important it comes from a moderation or even cease of the inventory burn at the tier ones in the Western world, which has been a big headwind over I'd say eight quarters now. And if that goes away, we just start to shift to natural end demand, which is growth Stacy.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nI mean, there's not much we have to do. It's just the inventory burn goes away at the tier ones and we already grow.\n\n**Stacy Rasgon** (Analyst)\nGot it. No, that's helpful. Hey, I apologize if I sound like a harpy. Thank you very much.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nNo, that's all right, Stacie. And I think we are out of time. So I want to thank you all for the attention. And I trust you got a feel that we have quite a change from ninety days ago relative to the sentiment on the upcycle, which starts to be clearly broad based in industrial and IoT across geographies, across consumer IoT and for industrial and across direct and distribution channels. So it can't be broader than this.\n\n**Kurt Sievers** (CEO &amp; Executive Director)\nAlso auto, which was actually the best segment, if you will, in the second quarter, because it was already flat year on year, is accelerating from a sequential perspective. But what excites us in auto is the design win traction on the one hand and the fact that this damp inventory burn at the Tier 1s starts to go away. Having said that, thank you very much all and speak to you in the individual calls. Thank you. Bye bye. Thank you.\n\n**Operator**\nThis concludes today's conference call. Thank you for your participation. You may now disconnect.",
      "fetched_at": "2026-02-04T15:45:41.128Z"
    },
    {
      "ticker": "NXPI",
      "title": "NXP Semiconductors N.V. (NXPI) Q1 FY2025 earnings call transcript",
      "published_date": "Apr 29, 2025, 8:00 AM EDT",
      "fiscal_year": "2025",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/NXPI/earnings/NXPI-Q1-2025-earnings_call-251238.html",
      "content": "**Operator**\nDay and thank you for standing by. Welcome to the NXP First Quarter 2025 earnings conference call. At this time, all participants are in a listen-only mode. After the speaker's presentation, there will be a question-and-answer session. To ask a question during the session, you will need to press star 11 on your telephone. You will then hear an automated message advising that your hand is raised. To withdraw your question, please press star 11 again. Please be advised that today's conference call is being recorded. I would now like to hand the conference over to your first speaker today, Jeff Palmer, Senior Vice President of Investor Relations. Please go ahead.\n\n**Jeff Palmer** (VP of Investor Relations)\nThank you, Tonya. Good morning, everyone. Welcome to NXP Semiconductors First Quarter earnings call. With me on the call today is Kurt Sievers, NXP's President and CEO, and Bill Betz, our CFO. The call today is being recorded and will be available for replay from our corporate website. Today's call will include forward-looking statements that involve risks and uncertainties that could cause NXP's results to differ materially from management's current expectations. These risks and uncertainties include, but are not limited to, statements regarding the macroeconomic impact on the specific end markets in which we operate, the sale of new and existing products, and our expectations for the financial results for the second quarter of 2025. NXP undertakes no obligation to revise or update publicly any forward-looking statements. For full disclosure on forward-looking statements, please refer to our press release.\n\n**Jeff Palmer** (VP of Investor Relations)\nAdditionally, we will refer to certain non-GAAP financial measures, which are driven primarily by discrete events that management does not consider to be directly related to NXP's underlying core operating performance. Pursuant to Regulation G, NXP has provided reconciliations of the non-GAAP financial measures to the most directly comparable GAAP measures in our First Quarter 2025 earnings press release, which will be furnished to the SEC on Form 8K and available on NXP's website in the Investor Relations section. Now, I'd like to pass the call to Kurt.\n\n**Kurt Sievers** (President and CEO)\nThank you, Jeff, and good morning, everyone. We appreciate you joining our call today. I will read you our Quarter One performance and then discuss our guidance for Quarter Two. Beginning with Quarter One, our revenue was $10 million better than the midpoint of our guidance. The revenue trends in the mobile and communication infrastructure markets were slightly above expectations, while performance in the automotive and industrial and IoT markets was slightly below our expectations. Taken together, NXP delivered Q1 revenue of $2.84 billion, a decrease of 9% year-on-year. Non-GAAP operating margin in Quarter One was 31.9%, 260 basis points below the year-ago period and about 40 basis points above the midpoint of our guidance. Year-on-year performance was a result of the lower revenue and related gross profit fall-through, partially offset by lower operating expenses.\n\n**Kurt Sievers** (President and CEO)\nFrom a channel perspective, distribution inventory was in line with our guidance at nine weeks, below our long-term target of 11 weeks. From a direct sales perspective, we continue to support Western Tier One auto customers with their ongoing digestion of on-hand inventory against the backdrop of a cloudy automotive demand environment. Now, let me turn to our expectations for the second quarter. We are operating in a very uncertain environment influenced by tariffs, with volatile direct and indirect effects. As of today, the direct impact of the current tariffs is immaterial to our financials. However, the indirect impact of current tariffs related to future end demand and supply chain remains unknown. As of now, we are not seeing any abnormal customer order pullings or push-outs, which could be associated with the tariffs. Other than the potential indirect impacts of tariffs, we are seeing some positive trends.\n\n**Kurt Sievers** (President and CEO)\nThese trends include improving distribution customer backlog levels, as well as stabilized order signals from our direct customers. Additionally, we are experiencing an increase in short-cycle orders, as well as some spot product shortages leading to customer escalations. Taken together, these trends have historically been indicative of the early innings of improving cycle dynamics. Therefore, our guidance reflects these improving cycle trends and the immaterial direct tariff impact, but we have not incorporated any judgment of indirect impact from tariffs. Given the uncertain macro environment, we are only providing guidance for the second quarter. We are guiding Q2 revenue to $2.9 billion, down 7% versus the second quarter of 2024, and up 2% sequentially. At the midpoint, we expect the following trends in our business during Quarter Two. Automotive is expected to be flat versus Quarter Two 2024 and up in the low single-digit % range versus Quarter One 2025.\n\n**Kurt Sievers** (President and CEO)\nIndustrial and IoT is expected to be down in the mid-teens % range year-on-year and up in the mid-single-digit % range versus Quarter One 2025. Mobile is expected to be down in the mid-single-digit % range on both a year-on-year and a sequential basis. Finally, communication infrastructure and other is expected to be down in the high 20% range versus Quarter Two 2024, flat versus Quarter One 2025. Our outlook assumes that we will continue to undership end demand in automotive, and we expect channel inventory to be flat at nine weeks against our long-term target of 11 weeks. Before turning to your questions, I would like to review a strategic acquisition which we announced in the first quarter. On February 10, we announced the intention to acquire Kinara for $307 million, an industry leader in high-performance, energy-efficient, and programmable neural processors.\n\n**Kurt Sievers** (President and CEO)\nThis acquisition provides a scalable platform for AI-powered edge-based systems, combining NXP's broad portfolio of processing, connectivity, security, and advanced analog solutions with Kinara's AI NPU hardware and software. We believe there is an inflection point in the industrial and IoT markets, which is creating demand for intelligent edge AI compute solutions. Customers need high-performance, secure low-power processing, which takes place locally at the edge. This eliminates the requirement to connect to the cloud for the execution of AI models in order to meet the critical latency, security, and real-time edge requirements. Kinara already has meaningful customer engagements within the factory automation, building, and energy management, healthcare, and smart home end markets. We expect the regulatory approval should be complete by the end of the second quarter. The transaction will not have a material impact on the financial model shared at our investor day in November.\n\n**Kurt Sievers** (President and CEO)\nWe expect Kinara to be accretive to our current financial model by 2028, and it will accelerate our overall position in the industrial and IoT markets. In summary, NXP's first quarter results and guidance for the second quarter underpin a cautious optimism that NXP continues to effectively navigate through a challenging set of market conditions. We are operating in a very uncertain environment influenced by tariffs, with volatile direct and indirect effects. Considering these external factors, we are redoubling our efforts to manage what is in our direct control, enabling NXP to drive solid profitability and earnings. Now, finally, on a more personal note, after deep reflection, I have decided to retire from NXP at the end of 2025. My past 30 proud years with NXP, including seven years as President and five years as CEO, have been hugely fulfilling.\n\n**Kurt Sievers** (President and CEO)\nI am incredibly thankful for the invaluable privilege to work with so many amazing people and having the opportunity to co-create NXP's future and drive technological leadership for a better world. For three decades, I've passionately prioritized and dedicated my energy to NXP and all of our stakeholders. Now the time has come to start planning for a shift and focus on my personal journey. I am looking forward to entering the next chapter of my life in good health, taking more time for family, friends, and personal passions. I would like to congratulate Rafael on his promotion to President of NXP. I look much forward to the next six months of transition period before Rafael assumes the Chief Executive Officer role for NXP in October. Rafael will work very closely together with all of you in the upcoming period.\n\n**Kurt Sievers** (President and CEO)\nBuilding on more than 10 years of experience in NXP, Rafael will be an excellent leader to execute on NXP's strategy to bring intelligent systems to the edge in the automotive and industrial and IoT end markets. With that, I would like to pass the call over to you, Bill, for a review of our financial performance.\n\n**Bill Betz** (CFO)\nThank you, Kurt, and good morning to everyone on today's call. As Kurt has already covered the drivers of the revenue during Q1 and provided our revenue outlook for Q2, I will move to the financial highlights. Overall, our Q1 financial performance was good. Revenue was slightly above the midpoint of our guidance range, while gross profit was in line, and operating expenses were below the midpoint of our guidance. Taken together, we delivered non-GAAP earnings per share of $2.64, or 5 cents better than the midpoint of our guidance. We continue to manage sales into the distribution channel consistent with our guidance of nine weeks. Now, moving to the details of Q1. Total revenue was $2.84 billion, down 9% year-on-year, slightly above the midpoint of our guidance range.\n\n**Bill Betz** (CFO)\nWe generated $1.59 billion in non-GAAP gross profit and reported a non-GAAP gross margin of 56.1%, down 210 basis points year-on-year and 20 basis points below the midpoint of our guidance range due to product and channel mix. Total non-GAAP operating expenses was $686 million, or 24.2% of revenue, down $50 million year-on-year and $14 million below the midpoint of our guidance range. From a total operating profit perspective, non-GAAP operating profit was $904 million, and non-GAAP operating margin was 31.9%, down 260 basis points year-on-year and 40 basis points above the midpoint of our guidance range. Non-GAAP interest expense was $80 million, while taxes for ongoing operations were $143 million, or a 17.4% non-GAAP effective tax rate. Non-controlling interest was $7 million, and results from equity account invest fees associated with our joint venture manufacturing partnerships was $1 million.\n\n**Bill Betz** (CFO)\nTaken together, below-the-line items were $3 million unfavorable versus our guidance. Stock-based compensation, which is not included in our non-GAAP earnings, was $127 million. Now, I would like to turn to the changes in our cash and debt. Our total debt at the end of Q1 was $11.73 billion, up $871 million sequentially due to a combination of a second tranche of the European Investment Bank loan and the initial results of our new commercial paper program. Our ending cash balance was $3.99 billion, up $696 million sequentially due to the cumulative effect of additional liquidity, capital returns, CapEx investments, and cash generation during the quarter. The resulting net debt was $7.74 billion, and we exited the quarter with a trailing 12-month adjusted EBITDA of $4.89 billion.\n\n**Bill Betz** (CFO)\nOur ratio of net debt to trailing 12-month adjusted EBITDA at the end of Q1 was 1.6 times, and our 12-month adjusted EBITDA interest coverage ratio was 19.2 times. During Q1, we repurchased $303 million of our shares and paid $258 million in cash dividends. After the end of the quarter and through April 25, we bought an additional $90 million of our shares under an established 10B5-1 program. Turning to working capital metrics, days of inventory was 169 days, an increase of 18 days sequentially and flattish on a dollar basis. Days receivable were 34 days, up 4 days sequentially, and days payable were 62 days, down 3 days sequentially. Taken together, our cash conversion cycle was 141 days. Cash flow from operations was $565 million, and net CapEx was $138 million, or 5% of revenue, resulting in non-GAAP free cash flow of $427 million, or 15% of revenue.\n\n**Bill Betz** (CFO)\nDuring Q1, we paid a $125 million capacity access fee related to VSMC, which is included in our cash flow from operations. Additionally, we paid $16 million into ESMC, our equity-accounted foundry joint venture under construction in Germany, and $20 million into VSMC, our equity-accounted foundry joint venture under construction in Singapore, both of which are included in our cash flow from investing. Now, turning to our expectations for the second quarter. As Kurt mentioned, we anticipate Q2 revenue to be $2.9 billion, plus or minus about $100 million. At the midpoint, this is down about 7% year-on-year and up about 2% sequentially. We expect non-GAAP gross margin to be 56.3%, plus or minus 50 basis points. Operating expenses are expected to be about $710 million, plus or minus about $10 million.\n\n**Bill Betz** (CFO)\nThe sequential increase is driven by our normal annual merit increases and the previously disclosed annual license payment, modestly offset by our ongoing restructuring to make room for the three pending acquisitions. Taken together, we see non-GAAP operating margin to be 31.8% at the midpoint. Please note our second quarter guidance does not incorporate the three pending acquisitions. We estimate non-GAAP financial expense to be about $88 million. We expect the non-GAAP tax rate to be 17.4% of profit before tax. Non-controlling interest will be about $9 million, and results from equity account invest fees about $2 million. For Q2, we suggest for modeling purposes, you use an average share count of 255 million shares. We expect stock-based compensation, which is not included in our non-GAAP guidance, to be $115 million. Taken together, at the midpoint, this implies a non-GAAP earnings per share of $2.66.\n\n**Bill Betz** (CFO)\nFurthermore, we continue to operate our internal fabs in the low 70% range, and we expect our days of inventory to be flattish into Q2. Turning to uses of cash, we expect capital expenditures to be around 4% of revenue. We will pay a $35 million capacity access fee to VSMC. Additionally, we will make a $16 million equity investment into ESMC and a $50 million equity investment into VSMC, our two equity-accounted foundry joint ventures under construction. Pending the regulatory approval of the three acquisitions, it will result in a cash payment of $1.1 billion, and we will redeem the $500 million tranche of debt due in May from our current cash balance of $4 billion. After closing these acquisitions, our ongoing restructuring actions are intended to enable NXP to get into its stated long-term operating expense model of 23% in the second half of 2025.\n\n**Bill Betz** (CFO)\nIn closing, I would like to highlight a few focus areas for NXP. First, as Kurt mentioned in his prepared remarks, our outlook does not consider unknown indirect and market demand impacts because of global tariffs, while the direct impact of the current tariffs is immaterial to our financial guidance. Second, with the upcoming CEO transition, there is no change to our long-term financial model and capital allocation strategy. Lastly, we are operating in a very uncertain environment influenced by global tariffs. Considering these external factors on the end markets we operate, we are redoubling our efforts to manage what is in our direct control, enabling NXP to drive solid profitability and earnings while executing our growth strategy. With that, I would like to now turn it back to the operator for your questions.\n\n**Operator**\nCertainly. As a reminder, to ask a question, please press star 11 on your telephone and wait for your name to be announced. To withdraw your question, please press star 11 again. Please limit yourself to one question and one follow-up. Please stand by while we compile our Q&A roster. Our first question will be coming from Christopher Muse of Canter Fitzgerald. Your line is open, Christopher.\n\n**Christopher Muse** (Senior Managing Director)\nYeah, good morning, good afternoon. Thank you for taking the question. Kurt, you will clearly be very missed. Thank you for everything that you've done over the last five years, and obviously before that as President. I guess maybe first question, you highlighted in your prepared remarks the Kinara acquisition, but you've also made acquisitions with Aviva and TTTech. I guess my question is this: as you think about competition from China in the MCU world, how much of these acquisitions are defensive in terms of a world where MCU discrete purchases probably decrease and focus on software is more important, or, conversely, more offensive in terms of true differentiation, both in the auto and in the industrial side of things, where you look to really separate yourselves?\n\n**Kurt Sievers** (President and CEO)\nMany thanks and good morning, CJ. Yeah, indeed, we have had three acquisitions now: Kinara, Aviva Links, and TTTech Auto. Kinara is the AI edge compute, which I just discussed briefly on the call. Aviva Links is about asynchronous connectivity in the car between displays and cameras and for very high data rates in one direction versus not in the other, so clearly beating what Ethernet can do. TTTech Auto is indeed a very strong software complement to our CoreRite platform. To answer your question in brief, this is clearly an offensive addition, complement to our product strategy as we have it today to make us more differentiated with our compute portfolio. I was a little bit hesitating, CJ, because it is not just the compute portfolio, because especially Aviva Links and TTTech Auto is the whole offering with our CoreRite platform for the software-defined vehicle.\n\n**Kurt Sievers** (President and CEO)\nClearly, this will come to good play in China, but I have to emphasize, CJ, not only in China. I mean, this is a global offering, but it will certainly also further help our China for China strategy.\n\n**Chris Caso** (Managing Director and Senior Equity Analyst)\nVery helpful. Then, as a quick follow-up, could you give us a kind of level set where we are in the auto correction? You talked about undershipping and demand. I guess, when do you now expect excess inventory to be digested? How are you thinking from a geographic perspective? I think three months ago, you talked about China strong, America's kind of slowly recovering, and Europe weak. Is that kind of consistent with where we are again today? Thanks so much.\n\n**Kurt Sievers** (President and CEO)\nYeah, actually, quarter two guidance is a bit of a turning point above and beyond the comments I made in my prepared remarks about better backlog with distribution customers, about stabilization of the order patterns from direct customers, some early innings of escalations because of supply shortages with very short-term orders. The turning point of auto in the second quarter is actually, in my view, that second quarter, we are flat year on year. That is the first time after five quarters. We look now back to five quarters of year-on-year declines in automotive. This second quarter of calendar 2025 is the first time that we are flat. It is indeed, CJ, a combination of a stabilizing order pattern from the direct customers with somewhat slower digestion of above inventory in the Western tier ones.\n\n**Kurt Sievers** (President and CEO)\nI say somewhat slower because some of them are done, and we still have a few left which are still absorbing over inventory. This is still undershipping to their end demands. At the same time, we see a pretty nice pickup in order pace, especially from Asia for the second quarter automotive. Asia here is a combination of China and Japan. Admittedly, that also has seasonal components. China automotive is always seasonally weak in Q1 and then picks up the pace in Q2, and that's exactly what we see. In Japan, there is another element which makes Q2 always stronger than Q1, which has to do with the price adjustment. I talked about global pricing in the last earnings call, and I hope I made a clear comment that most of the Western customers resettle pricing for the full year by January 1.\n\n**Kurt Sievers** (President and CEO)\nFor Japan, that is by April 1. Natural customer behavior is that they hesitate to buy before they have the new price. Japan was waiting, and that is why we see now an uptick in Japan into the second quarter. Since it will be one of the next questions, for sure, I say it upfront. With having all the price negotiations with the large customers now settled for the year, I can reconfirm and with confidence what I said last earnings, which is we will have for this year a low single-digit price erosion for the whole company for the year. No change to what we said last year. It is just that now the confidence is fully in place since we also closed and operate and execute in Japan.\n\n**Christopher Muse** (Senior Managing Director)\nThanks so much.\n\n**Operator**\nThank you. One moment for our next question. Our next question will be coming from Ross Seymore of Deutsche Bank. Ross, your line is open.\n\n**Ross Seymore** (Managing Director)\nHi guys. Thanks for letting me ask a couple of questions. Kurt, I want to echo what CJ said. Thank you so much for all your help over the years, and congrats, and best of luck in retirement. I guess my first question is, I know you talked about the direct and indirect not really having an impact on the tariff front, but can you just talk a little bit about how NXP is viewed by the customers and by the various governments? I know where you're technically headquartered, but are you a US company to China? Are you a China for China play? Does the US consider you a European company? Just trying to talk through the manufacturing footprints you have and the flexibility that might provide.\n\n**Kurt Sievers** (President and CEO)\nYeah, thanks, Ross, and good morning. Let me first reiterate indeed what I said about direct and indirect impact. The direct impact of the current tariffs we consider immaterial to our financial guidance. There is a tiny little bit, but it is immaterial. Therefore, consider zero. What I did say about the indirect impact is that it is completely confusing because things are changing by the day. I think today is another reiteration planned for the 25% auto. That keeps changing, and we do not see a consistent pattern. I would also clearly say we have been very busy talking to all of our customers across the world, asking them what they plan to do, what they have possibly done. There is neither pull-in nor push-out effects at this point in time.\n\n**Kurt Sievers** (President and CEO)\nalso do not—we did not really foresee anything for the second quarter from an indirect perspective. That is why the comment in my prepared remarks. The second part of your question is indeed yielding something we essentially see as an opportunity, especially in China, Ross. We are seen, and of course, we position ourselves that way as a European company, very clearly as a European company with a lot of our manufacturing operations given our hybrid manufacturing strategy outside of the U.S. That makes us, I would say, a pretty much appreciated partner for the industry and our customers in China.\n\n**Kurt Sievers** (President and CEO)\nNow, tariffs have been exempted and coming and going over the last couple of weeks, but clearly we've seen an opportunity with our China for China strategy from these tariffs because our manufacturing structure and our hybrid manufacturing network, which I think I've discussed over the past couple of quarters already, which is very much emphasizing and strongly building a local manufacturing network, is a positive in this. It is not just how we are seen, Ross, but it is also factually such that I think more than a third of our China for China business today is already manufactured in China. We already have made a lot of progress in leveraging this advantage. You also asked how are we seen in the U.S.\n\n**Kurt Sievers** (President and CEO)\nOf course, in the U.S., we are seen as a U.S. company, which means we are complying with anything that is being asked from us. I think that the part which gives us potentially a boost and we try to leverage is that the Chinese are seeing us as European, and we have already spent, I'd say, two years of changing our supply network to be a better partner from a China for China manufacturing perspective.\n\n**Ross Seymore** (Managing Director)\nThanks for that. I guess for my follow-up, I just want to pivot over to the industrial side of things. You gave a lot of color about the order patterns, etc., and automotive channel versus direct, etc. We've heard from other companies that they're seeing some of the green shoots. I know those are dangerous words these days, but nonetheless, in the industrial business, I just wondered what you're seeing on that side of things, both kind of direct or geographically, and then, of course, via the channel.\n\n**Kurt Sievers** (President and CEO)\nYeah, as a precursor to this, I'm a little bit humble when it comes to looking at NXP as a bellwether for the industrial sector. I mean, we are comparably small, so I'm a little bit careful in taking my commentary now as a strong direction for the whole industry. What we are seeing is that actually in Q1, from a performance perspective, actual performance, but also for the guidance to the second quarter, which is up mid-single digit, it is more left by the consumer IoT part than the core industrial part. The ratio is still about the same as we discussed earlier, Ross, which is that 60/40 between core industrial and consumer IoT. Directionally, both in Q1, but also now into Q2, it is the consumer IoT part which is stronger on a relative basis.\n\n**Kurt Sievers** (President and CEO)\nHowever, I do believe, Ross, that also has to do with company-specific design wins. We just have a number of really strong design wins. Again, they are specifically in China, which are now playing out nicely in the first half of this year. I do not know. We can take this as a proxy for the industry. It is probably pretty specific to NXP.\n\n**Ross Seymore** (Managing Director)\nThank you.\n\n**Operator**\nOur next question. Our next question will be coming from Chris Caso of Wolfe Research. Your line is open, Chris.\n\n**Chris Caso** (Managing Director and Senior Equity Analyst)\nYes, thank you. Good morning. I wonder if you could expand a little bit on some of the comments you made on your China-for-China strategy. I guess how far that progresses. I guess ultimately, within China, how much of your China revenue do you expect to be able to supply domestically and under which time? Maybe you could speak a little bit to the U.S., obviously, because that's something we're awaiting the regulations and how much of the U.S. you'd be able to satisfy from a U.S. FAP.\n\n**Kurt Sievers** (President and CEO)\nYeah, so good morning, Chris. First of all, the China-for-China strategy has two legs. One is the manufacturing leg, which I will expand on in a second. The other one, I think structurally or strategically even more important, is the roadmapping and product generation dedicated for Chinese customers with the consideration of them as lead customers, given that they are really setting the pace now in the automotive and industrial sector when it comes to innovation. I might have talked last fall about the fact that I even changed the management team of NXP to the extent that I have a leader now directly reporting to me who runs the China business to make sure we have full visibility on the highest level in the company on the specific product needs. The product roadmapping is a very important strategic element.\n\n**Kurt Sievers** (President and CEO)\nNow, back to your question on the manufacturing side. We have currently about—by the way, everything I say now is wafer manufacturing. There are different considerations when you think about back-end test and assembly versus front-end wafer manufacturing. I speak now about wafer manufacturing, where we have about 30% capability at the moment to supply not only capability. It's actually what we do to supply for our China for China business. So from the revenues which we currently ship, China for China, 30% are actually sourced in China. Of course, we work hard to expand this. Now, don't assume that the rest is in the U.S. You know that we have 60% of our overall wafers coming from foundries, which are typically not in the U.S. We have a much higher number, which is non-U.S. sourced, which is then from Europe and other places in Asia serving China.\n\n**Kurt Sievers** (President and CEO)\nIt's a much higher number than the 30%, which is already in China. Again, we want to work this as high as possible, as soon as possible, to have maximum independence here relative to possible tariffs. To that end, I would actually say, Chris, the tariffs, of course, are now adding uncertainty and complexity, but the China for China strategy, which I can speak about here, is not something we now suddenly did because of the tariffs. We've had that actually in place for probably more than two years, given the revenue opportunity which we see for our core markets, automotive and industrial in China, where we just see that the industry in China is leading the pack now from a global perspective, which is why we've been leaning into this already for a longer time.\n\n**Chris Caso** (Managing Director and Senior Equity Analyst)\nThank you. As a follow-up, a question for Bill. I think you made a comment that you would get to your 23% expenses percentage of revenue target in the second half of the year after accounting for the acquisitions. Could you go into a little more detail on that and what assumptions you're making to get to those numbers?\n\n**Bill Betz** (CFO)\nYeah, sure. On operating expenses, right, we're not guiding the second half. You could see in Q1 we were favorable against our guidance. That means we're ahead of the plan of the restructuring activities. We're going to continue that into Q2 and Q3 because it's time phased. Think about at the end of June 30, we will have probably 1,250 extra employees joining us for a full quarter effect starting Q3 and Q4. You're right in my prepared remarks. Basically, what we're doing is continue making space for those acquisitions so that we can absorb and hit our model at 23%. Obviously, we're not guiding the second half, but we have scenarios on what revenue we think we want to go do and different levers to go pull against that.\n\n**Bill Betz** (CFO)\nWe feel pretty confident we'll land sometime in the second half of 2025 at the model.\n\n**Chris Caso** (Managing Director and Senior Equity Analyst)\nGot it. Thank you.\n\n**Kurt Sievers** (President and CEO)\nTony, we'll take the next caller.\n\n**Operator**\nThank you. Our next question will be coming from Francois Bouvignies of UBS. Your line is open, Francois.\n\n**François Bouvignies** (Equity Research Executive Director)\nThank you very much. Kurt, thank you very much for your help. You will be missed. Sad to see you leaving, but well-deserved, I have to say as well. The two questions I had is firstly, you said, Kurt, that you do not see much pull-in so far and not much impact there in terms of order behavior. Obviously, you managed very well during COVID the inventories in the channel. My question is, if you were seeing some pull-in at some point, would you allow your customer to increase their inventories, or would you control it the way you did during COVID? I mean, how do you want to play this dynamic here given, I mean, your customers maybe they would like to increase the buffer and inventories maybe above some level that you would like to see?\n\n**Kurt Sievers** (President and CEO)\nYeah, thanks. Good afternoon, Francois. By the way, I'm still around for a full half year. This is not a good time for. That's it. On the pull-ins, yes, I first of all reconfirmed through Q1 and through quarter-to-date Q2, we have not seen pull-ins. I say that very explicitly. We checked it very carefully, customer by customer, because we wanted to be sure that this is clean of that. If it was to happen, I think the underlying policy of Francois continues to be we do not want this. We do not like that. Now, there could be specific reasons in specific cases with specific customers where they can explain to us why it makes sense, and we might want to do it.\n\n**Kurt Sievers** (President and CEO)\nI would say, especially on the distribution side, which is more than 50% of NXP, I think I said in my prepared remarks, we want to stay flat to the nine-weeks inventory into the second quarter, where again, we would not want to allow it.\n\n**Kurt Sievers** (President and CEO)\nI also said, and I don't know if CJ or Ross asked earlier, we are still busy with some Tier 1 automotive customers to digest inventory. For that same reason, we don't have a hell of a lot of appetite to consider pull-ins. I'd say with possible exceptions always in the range of the normal, we don't want that. We would not want to support it.\n\n**François Bouvignies** (Equity Research Executive Director)\nAll right. Thank you, Kurt. Maybe my follow-up would be for Bill on the gross margin side. I mean, your inventory days are relatively high when you look at history. You said you think you will be flat. I mean, when I look at the gross margin, you are around 56, low 56 in H1. I look at the consensus. It has more than 57% gross margin in the second half of the year. How should we think about the gross margin here? Because it seems tricky to get a big improvement of gross margin with inventories having to come down on your balance sheet, maybe not in Q2, but in Q3, Q4.\n\n**François Bouvignies** (Equity Research Executive Director)\nCan you help us or reassure us on the gross margin side trajectory in the second half of the year? Can it go up despite inventories coming down on your balance sheet? Maybe you can remind us the mix effect.\n\n**Bill Betz** (CFO)\nSure. Absolutely. Very fair question. Let me just repeat. In Q1, we had a slight mix driven by our product and channel mix. If we hold everything equally and go into Q2, we're just saying, \"Okay, right now our order book's pretty full. We actually see the mix, and it says similar mix as Q1, and we'll get in the fall through on the higher revenues over fixed costs.\" That is why we guided the 56.3. Now, without providing guidance for the second half of 2025, the best way to think about our gross margin is a function of revenue levels before any of our company-specific drivers to influence it. For example, at a $13 billion revenue annual number level, we will feel very confident at 58%, plus or minus. $12 billion, 57%, $11 billion, 56%. Again, that's that plus or minus 50 basis points.\n\n**Bill Betz** (CFO)\nWe have demonstrated those levels in the past. Now, from an upside perspective, we obviously have these additional levers to drive gross margin much higher. They include increasing our internal utilization, again, that is at 70%. It is staying at 70% because our inventory, as you said, is at the higher bounds. The consolidation of our 200-millimeter factories, we will be talking more about that in the second half. We are increasing our industrial and IoT go-to-market through our channel. We want to focus on addressing that mass market. We also have, and by the way, our company-specific accelerate growth drivers are tracking to our growth plans versus investor day. I know we are only one quarter in, but everything is good there. We have the normal operational efficiency of our projects to offset just these annual pricing, low single digit that we occur. Those two offset each other.\n\n**Bill Betz** (CFO)\nA bit longer term, which we've shared all of last year, we will leverage our VSMC 300-millimeter joint venture with Vanguard, which is tracking slightly ahead of schedule. We feel pretty good about that. Overall, stepping back with the revenue numbers I just gave you, we feel very confident to deliver our long-term gross margin range of 57-63%. It really is where revenue comes from is the influence as a starting point. Then you have these levers on top of it. On inventory, again, you're right. 169 days is probably the upper bound in my liking for sure related to it. You have to think we managed Q4 going into Q1. We had to manage the absolute dollars because it was the variable orders with our suppliers, and we kept utilizations internally.\n\n**Bill Betz** (CFO)\nGoing into Q2 and also Q3, again, 169 because we have a backlog that we see actually is okay so far for Q3. We have to make sure we take that into account to make sure we build the proper product. As you all know, with the uncertainty around the macro effects related to global tariffs and, more importantly, the number of potential disruptions from a supply chain perspective that could occur and we are starting to read about, we believe holding a bit more inventory is important from the lessons learned from the past. Again, I agree with you, the 169 is the upper balance, and we are going to probably adjust this once we learn a little bit more about second half and the confidence of second half revenue.\n\n**François Bouvignies** (Equity Research Executive Director)\nVery clear. Thank you for your answers.\n\n**Operator**\nThank you. One moment for our next question, which is coming from Stacy Rasgon of Bernstein Research. Your line is open, Stacy.\n\n**Stacy Rasgon** (Senior Analyst)\nHi guys. Thanks for taking my question. Bill, first, a question for you. I know you said you were not guiding the second half. That being said, the OPEX targets, I mean, you are running $710 million a quarter in OPEX. 23% of that would be like $3.1 billion at some point in the second half. You got close to $50 million a quarter in OPEX coming in Q3. I mean, $750 million a quarter would be like $3.3 billion at some point in the second half. I mean, are these the kinds of revenue targets into the second half that you have in mind when you give those OPEX targets? How do we think about that in the context of everything else that is going on?\n\n**Bill Betz** (CFO)\nLet me remind you about the Q2 OPEX number. There is a one-time payment from a recurring license that occurs each year. That's about $16 million to one of our peers, and I had that in my prepared remarks. I also mentioned that we continue to restructure the company to make space for these new acquisitions, which I have not disclosed the size from an operating expense standpoint related to it. We feel pretty confident under the different types of revenue scenarios that we can model because we have other levers to make sure. Remember what I said and what our whole message is, we are redoubling our efforts on the areas that we can control.\n\n**Bill Betz** (CFO)\nAs you know, Stacy, the two things that we like to control is our spend because that we can do, as well as to some extent the inventory time based on what we're building and not building and taking and placing bets with those orders with the unknown macro environment. Hopefully, that helps provide additional color back.\n\n**Stacy Rasgon** (Analyst)\nGot it. That is helpful. I guess for my follow-up, I am going to try it. I know, again, you said you did not want to give color on the backup. I mean, any just even soft commentary on how you guys are seeing Q3 right now? I mean, what is typical seasonality in Q3? Is there any reason to expect you could be above or below that typical seasonality? I am sympathetic to the idea that nobody knows what the hell is going on at all right now. Any color you can give us at all, even a little bit farther out, would be helpful if you are so inclined.\n\n**Kurt Sievers** (President and CEO)\nYeah. Good morning, Stacy. This is Kurt. Look, last year, we did this. And you know that we were wrong. We called a cycle, which did not happen. One of the learnings from that was that we would not want to repeat this. Now, this year, the situation is even more complex because, as I said in my prepared remarks, on the one hand, we do see now what has been always good early innings of the cycle recovery. I mean, that is very positive, what we see there. At the same time, we have this pretty material uncertainty of the indirect impacts from the tariff, which we just cannot figure out what they would possibly mean for the second half.\n\n**Kurt Sievers** (President and CEO)\nTherefore, we wanted to draw here a clear line, not even for a soft cut for the second half. We just cannot. It would be really irresponsible to do it. We stick to quarter two.\n\n**Stacy Rasgon** (Senior Analyst)\nI mean, how do you even tell the difference between a cycle recovery or green shoots and pull forwards and short-term orders and things like that? Wouldn't they look the same?\n\n**Kurt Sievers** (President and CEO)\nOh, we can clearly see that because I gave you a couple of elements. One of them was that the backlog of our distribution and customers, which we see by product, is starting to grow after a long, long period of absolutely no growth or even decline. That is different customers, new customers, new products. That is totally different to a pull-in. It's absolutely not pull-in. I also talked about a nicely stabilized order pattern from our direct customers, which has been in decline for a long, long, long period and has now stabilized across the board, which is not a pull-in because it's far too even to be a pull-in. We think we can clearly differentiate between those because, as I said earlier too, I think Francois, we want to avoid entertaining pull-ins and increasing inventories again. Stacy, that's for us a pretty focal point.\n\n**Kurt Sievers** (President and CEO)\nTherefore, no, let's stick to the second quarter and see how that plays out with the uncertainty which is provided to us from the tariff landscape to our customers. Stacy, what we do is we speak to our customers, and that's where that uncertainty comes from. I mean, it's not us inventing it, but we have no better source than speaking to our customers, big and small across the different segments, and they have no idea what the second half should look like. So how should we make it up?\n\n**Stacy Rasgon** (Senior Analyst)\nYeah. No, I get it. That's helpful. Thank you so much. Appreciate it.\n\n**Operator**\nOne moment for our next question. Our next question will be coming from Vivek Arya of Bank of America Securities. Your line is open.\n\n**Vivek Arya** (Managing Director)\nThanks for taking my question. Kurt, I just wanted to go back to the green shoots that were discussed because when I look at your Q1 results, auto and industrial sales, industrial IoT sales were actually modestly below expectations. I think the upside came from mobile and the comm segment. Q2, you're largely guiding to kind of seasonal trends. If there are green shoots, is it fair to say they have not yet shown up in the first half, and they could show up in the second half? I'm just trying to get a sense for where are these green shoots showing up, if any?\n\n**Kurt Sievers** (President and CEO)\nVivek, you do not know what we thought it was earlier because you pressed us already if you want to do a soft cut for Q2, where I do not know. I think I said it is maybe flat or very, very slightly up. No, I think there was something very relevant in your question, which is in Q1, indeed, auto and industrial and IoT were a touch light against guidance, while the other two segments were a touch richer. That has a reason, and it is actually Japan and China. It is the seasonal weakness of China automotive, which was a little bit stronger than what we had anticipated. Again, we know that that was to happen, so it was forecasted, but not to the full extent it came.\n\n**Kurt Sievers** (President and CEO)\nIn Japan, I think I talked about this earlier, it is the price change, which is leading customers to finally, and mind you, that for several years, we have either increased prices or kept them flat. Now, it was the first time that we offered a low single-digit price decline for customers also in Japan. They were eagerly waiting and held actually back to purchase until they could enjoy the quarter two prices. It is a bit of a, it is kind of specific. For quarter two, we see things coming up. What you do not see, Vivek, is, of course, what underneath is still at work from an inventory digestion perspective with the tier one automotive customers, which is kind of fogging some of the nice uptake which we are seeing. Again, you did not hear me calling the cycle, Vivek.\n\n**Kurt Sievers** (President and CEO)\nI said we see now trends which are or have been in the past, and I would say also now indicative of early innings of a cycle recovery. It is certainly not at the stage that we would say with bells and whistles, everything is jumping up. That alone would not be given, simply given the uncertainty which our customers face from tariffs.\n\n**Vivek Arya** (Managing Director)\nGot it. For my follow-up, the last, I think, forecast that we saw from IHS or S&P was for light vehicle production to be down, I think, kind of low single digit. Let's assume that that is the case, right, including all the effects of tariffs and whatnot. If that is the industry backdrop, what does that tell us about what NXP's automotive business could do this year, given all your company-specific growth drivers? Thank you.\n\n**Kurt Sievers** (President and CEO)\nLet me confirm, Vivek, that indeed S&P just published their latest forecast for the year, which says the SAR is going to be down by almost 2% this year, which compares to a flat line last quarter. It has degraded, which maybe or maybe not is a consequence of the tariff fears. It could be. The matter of the fact is indeed it is now a 2% decline in the forecast versus a flat line before. As we said earlier, we are not guiding the year, and we are also not guiding the year for automotive, Vivek. However, the much bigger role it continues to play, the content increases. All of the growth drivers which we had laid out at the last Investor Day in November, think about SDVs, think about radar, think about electrification, are nicely at work. We are on track on those.\n\n**Kurt Sievers** (President and CEO)\nI think it is those content increases which should continue to make us very optimistic about automotive, not that much the SAR.\n\n**Vivek Arya** (Managing Director)\nDoes that suggest they can offset the SAR decline, or are we not willing to say that yet?\n\n**Kurt Sievers** (President and CEO)\nHey, Vivek, I'll take that. I really think we're going to hold off giving any real color on where the second half could be revenue-wise. You also have to remember, our revenue does not synchronize to global production quarter per quarter. There's always a six-month or so lag between when we recognize revenue and when a car comes out of the factory somewhere in the world and is counted in SAR. We really do want to respectfully not address revenue targets or potentials in the second half.\n\n**Vivek Arya** (Managing Director)\nUnderstood. Thank you. Good luck.\n\n**Kurt Sievers** (President and CEO)\nHere. Tony, this will probably be our last panelist question, if you would.\n\n**Operator**\nCertainly. Our last question will come from Mark Lipacis of Evercore ISI. Mark, your line is open.\n\n**Mark Lipacis** (Senior Managing Director)\nGreat. Thanks for taking my question. Kurt, congrats on your retirement. Really appreciate all your great insights and help over the years, and wish you luck. The question, Kurt, is for you. Every two to three years, there's a new theory on inventory stocking that gets proposed. Before COVID, it was just in time, and during COVID, it became just in case, and now it's just in time. I think our own checks are consistent with your own, that some of the tier ones are well below normal for their inventory stocking on semis, at least. My question is about what would you expect on a restocking cycle?\n\n**Mark Lipacis** (Senior Managing Director)\nAre you of the view that something has foundationally changed, like you and your semiconductor peers keep inventories well above normal and your lead times lower than they had been historically, and then downstream, your supply chain feels comfortable with the idea of just keeping things very low, and then you do not really benefit from a restocking cycle? Or are you of the view that really nothing has changed and it is all driven by lead times, and when lead times stretch, everybody is just going to restock again?\n\n**Kurt Sievers** (President and CEO)\nI fear, Mark, I have a bit of a frustrating answer. It's more the latter than the first. I'd say more than because there are notable exceptions to this. I don't think that semiconductor companies in general will hold more inventory because it would be just the wrong inventory. That always creates a mixed issue. What has got better in several cases is the communication and the alignment between customers and us on understanding the future, on understanding where could be bottlenecks. Of course, given the whole geopolitical turmoil, there is also a more sophisticated, diversified supply chain in place now across the world, which eventually helps going forward. Fundamentally, Mark, I fear as an industry in total, intellectually, we've all learned a lot. Practically, not much of that is actually happening as we speak.\n\n**Kurt Sievers** (President and CEO)\nThe working capital pressure across the supply chain is just too high to allow that to happen.\n\n**Bill Betz** (CFO)\nWith that, I guess, Jeff, that was the last question. Let me. Mark, have a follow-up?\n\n**Kurt Sievers** (President and CEO)\nYeah. Oh, yeah. Sure.\n\n**Mark Lipacis** (Senior Managing Director)\nNo, that's all I had. It was simple as that. Thanks so much, Kurt. Appreciate it. Thanks, Jeff.\n\n**Kurt Sievers** (President and CEO)\nThank you. Thanks very much, Martin. Let me go to make just a couple of closing comments. We have now a very interesting crosshair situation between what I would call a significant macro uncertainty offered by the tariffs with the current tariffs, more the indirect impact of them rather than the direct, which is immaterial for us, standing against the clear early innings of a cycle recovery. Mind you that, for example, automotive turns to a flat year on year already now in the second quarter. Those two are competing forces which are not easy to forecast into the rest of the year. With that, we continue to, I hope, show pretty strong resilience through the trust cycle and at the same time offer excellent exposure to the secular growth drivers, especially in the automotive and industrial sectors.\n\n**Kurt Sievers** (President and CEO)\nWhen we zoom out from this, we see us nicely on track to doubling our EPS by 2030 plus as we had laid out in our Investor Day last year in November. Of course, a lot of turmoil short term, but seeing the cycle coming back now, of course, overshadowed by that uncertainty in the macro from tariffs, but fundamentally seeing the cycle coming back, we consider as a pretty nice positive. Thanks for your attention today and see you soon. Thank you.\n\n**Operator**\nLadies and gentlemen, this concludes today's conference call. Thank you for participating. You may now disconnect.",
      "fetched_at": "2026-02-04T15:45:45.589Z"
    }
  ]
}