{
  "ticker": "ON",
  "last_updated": "2026-02-04T15:46:43.192Z",
  "total_transcripts": 3,
  "transcripts": [
    {
      "ticker": "ON",
      "title": "ON Semiconductor Corporation (ON) Q3 FY2025 earnings call transcript",
      "published_date": "Nov 3, 2025, 9:00 AM EST",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/ON/earnings/ON-Q3-2025-earnings_call-370101.html",
      "content": "**Operator**\nLadies and gentlemen, thank you for standing by. Welcome to ON Semiconductor Quarter 2025 earnings conference call. At this time, all participants are in a listen-only mode. After the speaker's presentation, there will be a question-and-answer session. To ask a question during the session, you would need to press Star 11 on your telephone. You will then hear an automated message advising your hand is raised. To withdraw your question, please press Star 11 again. Please be advised that today's conference is being recorded. I would like now to turn the conference over to Parag Agarwal, Vice President of Investor Relations and Corporate Development. Please go ahead.\n\n**Parag Agarwal** (Head of Investor Relations and Corporate Development)\nThank you, Michelle. Good morning, and thank you for joining ON Semiconductor Quarter 2025 Results Conference Call. I'm joined today by Hassane El-Khoury, our President and CEO, and Thad Trent, our CFO. This call is being webcast on the Investor Relations section of our website at www.onsemi.com. A replay of this webcast, along with our Quarter 2 earnings release, will be available on our website approximately one hour following this conference call, and the recorded webcast will be available for approximately 30 days following this conference call. Additional information is posted on the Investor Relations section of our website. Our earnings release and this presentation include certain non-GAAP financial measures.\n\n**Parag Agarwal** (Head of Investor Relations and Corporate Development)\nReconciliation of these non-GAAP financial measures to the most directly comparable GAAP financial measures and a discussion of certain limitations when using non-GAAP financial measures are included in our earnings release, which is posted separately on our website in the Investor Relations section. During the course of this conference call, we'll make projections or other forward-looking statements regarding future events or the future financial performance of the company. We wish to caution that such statements are subject to risk and uncertainties that could cause actual events or results to differ materially from projections. Important factors that can affect our business, including factors that can cause actual results to differ materially from our forward-looking statements, are described in our most recent Form 10-K, Form 10-Q, and other filings with the Securities and Exchange Commission and in our earnings release for the Quarter 2.\n\n**Parag Agarwal** (Head of Investor Relations and Corporate Development)\nOur estimates or other forward-looking statements might change, and the company assumes no obligation to update forward-looking statements to reflect actual results, changed assumptions, or other events that may occur except as required by law. Now, let me turn it over to Hassane. Hassane.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nThank you, Parag. Good morning, and thank you all for joining us. We are pleased with our Quarter 2 results, which reflect the strength of our strategy and the resilience of our business model. Our Quarter 2 results exceeded the midpoint of our guidance with revenue of $1.55 billion, non-GAAP gross margin of 38%, and earnings per share towards the high end of our range at $0.63. We have been positioning the company for a market recovery, and we believe we are well aligned to benefit as demand normalizes. We're already seeing stabilization in automotive and industrial while continuing to grow in AI. Our Trail platform continues to scale across our core markets, and our recent acquisitions are expanding our portfolio and accelerating our roadmap. We are delivering solutions that help customers scale performance while improving energy efficiency and system cost.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nThe growing demand for high-efficiency power delivery across our end markets of automotive, industrial, and AI positions us for long-term growth. We remain committed to our gross margin expansion strategy through innovation, with both organic and inorganic investments and differentiation, and have achieved four significant milestones that I'd like to highlight. First is our Trail platform. Our new products continue to scale, and our design funnel now exceeds $1 billion, driven by strong customer engagement across automotive, industrial, and AI infrastructure. We remain on track to double the number of products sampling this year. Teledyne Technologies selected our Trail platform to develop next-generation products for infrared imaging systems. Trail's process technology combines precision analog, advanced digital, and low-voltage power features to meet the demands of infrared focal plane array systems used in aerospace, defense, and security applications. Second is our vertical GaN, or VGAN.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nLast quarter, I highlighted our strategic investment in our generation wide band gap semiconductors. Last week, we announced our VGAN platform developed on proprietary GaN-on-GaN architecture in our Syracuse fab in New York. VGAN conducts current vertically through the chip, enabling higher operating voltages versus lateral GaN and faster switching and record power density. It reduces energy loss by up to 50%, making it ideal for AI data centers, EVs, renewable energy, and aerospace, defense, and security. Sampling is already underway with lead customers in automotive and AI. This launch expands our leadership beyond silicon and silicon carbide, giving customers a future-ready toolkit to meet rising performance and efficiency demands. Third, our SIG JFET continues to proliferate, and we have been ramping revenue in AI data centers for high-current workloads.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nWe're also seeing traction in aerospace, defense, and security, where our SIG JFETs are now deployed in low-orbit satellite platforms, delivering industry-leading radiation ruggedness and power density. And fourth is our VCORE acquisition. In Q3, we expanded our analog and mixed-signal portfolio with the acquisition of VCORE power technology and IP assets from Auro Semiconductor. This transaction accelerates our roadmap for advanced multiphase controllers and monolithic smart power stages, enabling us to close key gaps in our offering and deliver comprehensive solutions for the next generation AI data centers and compute platforms. These new products will be integrated into our Trail platform, enhancing performance, reliability, and energy efficiency at the point of load and support X86 and ARM-based architectures. Sampling begins this quarter with production release expected in early 2026.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nShifting to the demand environment, we are seeing stabilization in the near term with automotive, which grew 7%, and industrial, which grew 5% sequentially, and our design wins in both markets continue to reflect a broad global engagement. For example, our industrial image sensor funnel is up 55% year over year, with traction in factory automation and inspection. We continue to ramp our AI revenue, which again approximately doubled year over year in Q3 and is now becoming material, with almost $250 million expected in 2025. Regionally, our revenue in the Americas grew 22% sequentially from momentum in automotive and aerospace, defense, and security. Japan was up 38% quarter over quarter, driven by traction in automotive and image sensing. Europe was down 4% as macro softness persisted, while China was down 7% sequentially.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nIn China, we secured strategic wins in high-voltage traction inverters with a leading tier one for multiple local OEMs. We also expanded our position at NIO with SICK for their traction inverter across their newest brand and with our 8-megapixel image sensor for their ADAS applications. AI is reshaping the power landscape both inside and outside the data center. Their National Energy Agency projects that electricity demand from AI-optimized data centers will quadruple by 2030, making power efficiency and density critical differentiators, an area where ON Sem leads. ON Sem's intelligent power technologies span the full power tree from solar and storage systems to UPS and rack-level PSUs, optimizing every watt before it reaches the processor. In Q3, we secured strategic wins in solar and energy storage platforms that are foundational to hyperscale AI deployments.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nOur latest generation of IGBTs and SiC in the most advanced hybrid modules were selected for high-efficiency solar inverters and energy storage systems, or ESS, including wins with two of the leading utility solar inverter suppliers in China. We also secured the next generation large-scale stationary storage with a large OEM in the United States as microgrid deployments are rapidly emerging as a key growth vector across our end markets. This business is reported under our industrial segment, and we expect our latest generation FieldStop 7 IGBT revenue to increase in 2025 over 2024, with continued double-digit growth expected in 2026. Turning to the AI data center itself, at the UPS level, a leading industrial OEM has integrated ON Sem's SiC MOSFET into their latest three-phase UPS platform, where superior efficiency and power density were key differentiators.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nAt the rack level, we secured multiple design wins across high-efficiency PSUs with our SIG FETs, T10 Trench MOSFET, and SiC JFET into 5.5 kilowatt AI server PSUs with top global PSU providers, delivering best-in-class thermal performance, supply assurance, and switching efficiency for hyperscale deployment. At the compute board level, we have introduced high-efficiency smart power stages and secured design wins on multiple platforms with leading XPU providers. The acquisition of IP from Auro Semiconductor further strengthened our SPS and controller offerings for power-to-the-core applications. Our collaboration with NVIDIA is also accelerating the industry's transition to 800-volt DC power architecture critical for next-generation AI data centers. These technology achievements and customer engagements reflect the strength of our differentiated power and sensing portfolios and our ability to deliver system-level value in the high-growth segments of our core markets.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nLet me now turn it over to Thad to give you more detail on our results and guidance for the fourth quarter.\n\n**Thad Trent** (CFO)\nThanks, Hassane. Our third-quarter results were driven by disciplined execution and prudent management of the business. We have made structural changes across our portfolio and our manufacturing footprint that will enable margin expansion at scale and position us for a market recovery. These initiatives will continue in future quarters, and we are committed to extracting value through our fab-like activities. Our investments in next-generation technologies, including Trail, VCORE, silicon carbide JFET, and vertical GaN, are reshaping our mix and strengthening our competitive advantage to further our leadership position. In addition, we continue to return capital to our shareholders. Year to date, we have repurchased $925 million of shares, returning approximately 100% of our free cash flow to shareholders.\n\n**Thad Trent** (CFO)\nTurning to the third-quarter results, we exceeded the midpoint of our guidance with revenue of $1.55 billion, increasing 6% over Q2. Automotive revenue was $787 million, which increased 7% sequentially, driven by increases in Americas, China, and Japan. Revenue for industrial was $426 million, up 5% sequentially, primarily driven by aerospace, defense, and security. Outside of auto and industrial, our other business increased 2% quarter over quarter with continued momentum in AI data center. Looking at the third-quarter results between the business units, we saw sequential revenue growth in all three business units. Revenue for the Power Solutions Group, or PSG, was $738 million, an increase of 6% quarter over quarter and a decrease of 11% year over year. Revenue for the Analog and Mixed Signal Group, or AMG, was $583 million, an increase of 5% quarter over quarter and a decrease of 11% year over year.\n\n**Thad Trent** (CFO)\nRevenue for the Intelligent Sensing Group, or ISG, was $230 million, a 7% increase quarter over quarter and a decline of 18% over the same quarter last year as we strategically refocused this business. Turning to gross margin in the third quarter, GAAP gross margin was 37.9%, and non-GAAP gross margin was 38%, above the midpoint of our guidance due to favorable mix within the quarter. Manufacturing utilization was up compared to Q2 at 74% as we started to build DiBank inventory to support the mass market. We expect utilization to be flat to down slightly in the fourth quarter as we complete these builds. GAAP operating expenses were $323 million, and non-GAAP operating expenses were $291 million. GAAP operating margin for the quarter was 17%, and non-GAAP operating margin was 19.2%. Our GAAP tax rate was 6.5%, and non-GAAP tax rate was approximately 16%.\n\n**Thad Trent** (CFO)\nDiluted GAAP earnings per share was $0.63, and non-GAAP earnings per share was also $0.63. GAAP and non-GAAP diluted share count was 408 million shares, and we repurchased $325 million of shares in the third quarter. Since launching our share repurchase program in February 2023, we have repurchased $2.1 billion and had approximately $861 million remaining on our authorization at the end of the quarter. Turning to the balance sheet, cash and short-term investments was approximately $2.9 billion, with total liquidity of $4 billion, including $1.1 billion undrawn on a revolver. Cash from operations was $419 million, and free cash flow was $372 million. Our year-to-date free cash flow is 21% of revenue, and we remain on track to deliver strong free cash flow margin for the full year. Capital expenditures were $46 million, or 3% of revenue.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nInventory decreased by $39 million to 194 days from 208 days in Q2. This includes 82 days of bridge inventory to support fab transitions and silicon carbide, down from 87 days in Q2. Excluding the strategic builds, our base inventory is healthy at 112 days. Distribution inventory declined to 10.5 weeks from 10.8 weeks in Q2 and within our target range of 9 to 11 weeks. Looking forward, let me provide you the key elements of our non-GAAP guidance for the fourth quarter. As a reminder, today's press release contains a table detailing our GAAP and non-GAAP guidance. Our guidance is inclusive of our current expectation that there is no material direct impact of tariffs announced as of today. We anticipate Q4 revenue will be in the range of $1.48 billion-$1.58 billion. Our non-GAAP gross margin is expected to be between 37%-39%, which includes share-based compensation of $8 million.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nNon-GAAP operating expenses are expected to be between $282 million-$297 million, which includes share-based compensation of $32 million. We anticipate our non-GAAP other income to be a net benefit of $7 million, with our interest income exceeding interest expense. We expect our non-GAAP tax rate to be approximately 16%, and our non-GAAP diluted share count is expected to be approximately 405 million shares. This results in non-GAAP earnings per share in the range of $0.57-$0.67. We expect capital expenditures in the range of $20 million-$40 million. To close, we remain focused on discipline execution and financial leverage. The structural changes we have made across our portfolio, operations, and manufacturing footprint are driving margin expansion and positioning ON Semiconductor for long-term earnings power. With over 100% of our year-to-date free cash flow returned to shareholders, we continue to prioritize capital efficiency and shareholder value while investing in innovation and differentiation.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nAs the market stabilizes, we are well aligned to scale with demand and deliver sustainable growth. With that, I'd like to turn the call back over to Michelle to open it up for Q&A.\n\n**Operator**\nThank you. As a reminder to ask a question, please press star 11 on your telephone and wait for your name to be announced. To withdraw your question, please press star 11 again. Our first question comes from Ross Seymore with Deutsche Bank. Your line is open.\n\n**Ross Seymore** (Analyst)\nThanks for the question, guys. First one, I want to ask about the automotive side of things. Upside in the quarter nicely versus the low single-digit guide that you had. So, Hassane, I just wanted to get an update on what you're seeing in that end market, what caused the upside, and perhaps what's the sustainability of that sort of growth as you look into the fourth quarter and then 2026 as well.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nYeah. Nothing really out of the ordinary. You can think about the Q3 and Q4 as I do, which is what I've been talking about. I look at the second half versus the first half of the year. The quarter-on-quarter lumpiness as customers try as new designs ramp, I wouldn't read much into it. What we're seeing in automotive is really stabilization, which is a positive from where we were. The quarter-on-quarter, I don't think I read anything into it. It's purely between seasonality and ramps. As far as 2026, we'll let you know as we get closer.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nA lot of things going on out in the world, so we're not guiding specifically by market into 2026. What I can tell you is demand is stabilizing. We're starting to see a seasonal trend. One thing I would highlight is we haven't seen a restocking cycle yet. That's still out there.\n\n**Ross Seymore** (Analyst)\nThanks for that color. I guess this is my second question, perhaps a little bit of a longer-term one. You, for the first time, I believe, sized the AI business at about $250 million, I think, for this year as a whole, so what are the roughly 4% of sales. Can you just talk about how ON differentiates in that? You mentioned the collaboration list on the 800-volt with NVIDIA, and that's great to be on that list, but there's 13 other folks on the list as well. As you look at that market, how do you believe that $250 million will grow, and what's the differentiation ON delivers to drive that growth?\n\n**Hassane El-Khoury** (President, CEO, and Director)\nYeah. That's a very good question. Overall, we expect the AI data center for us to continue to grow. We look at ourselves as really the share gainer from some of the companies that have been in that market longer than we have. Being able to post $250 million or about $250 million revenues is pretty stellar. You can see our investments accelerating in that across the whole power tree. From a customer perspective, to answer your question more directly, if you take that \"crowded space\" of 13 or however many companies and you look at who can go from wall to core, there are only two. We are the shared gainer. We are one of the two.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nThe way we differentiate is we are one of the only companies that are able to support the power delivery from the high voltage all the way to the core, all with the product portfolio that we have that we have grown organically or even inorganically with the VCOR acquisition. That is how we differentiate. We have proven that differentiation through our JFET, Silicon Carbide, through our AMG with the products that they have been delivering, and the revenue growth that has doubled year on year, every quarter in the first three quarters to deliver that number I gave in 2025 is really the proof of that.\n\n**Operator**\nThank you. Our next question will come from Vivek Arya with Bank of America. Your line is open. Thanks for taking my question.\n\n**Vivek Arya** (Senior Analyst)\nHassane, I know it is a little early and I am not asking for quantitative guidance, but I am curious how you are thinking about seasonality in Q1 and just growth in 2026 overall versus how you thought about it three months ago. No change from where we were three months ago. Still with the same outlook, same expectation. Okay. For my follow-up, maybe on utilization and gross margins, I think you said something about utilization perhaps flat to slightly down, anything more to read into it? If you could just remind us, what is your seasonal pattern in Q1? If there is some utilization headwind from Q4, how does that kind of reflect in gross margins in Q1 just based on historical seasonal trends? Thank you.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nYeah. Our utilization increased to 74% in Q3, as I said in the prepared remarks. We have been building die bank inventory for the mass market. This is a market that we have talked about for probably well over a year about needing to seed that market. We have been doing it through the distribution channel. Now we have to hold inventory in die bank for kind of quick turn on that mass market that we need to invest in. I expect it to be down, the utilization to be down in Q4 because we expect those builds to be completed. Going back to kind of a normal, normalized utilization rate from that point forward, excuse me. You can think about utilization, the impact on utilization as having a couple-quarter impact on the P&L. There is always a delay on that, right?\n\n**Hassane El-Khoury** (President, CEO, and Director)\nIf you think about going into next year, and obviously we're not providing any guidance at this point, but we think between Q4 and kind of the next couple quarters, we're looking at seasonal patterns. If you take the midpoint of our guidance for Q4, it's directly in line with normal seasonality, which is typically flat to down 2%. I think the midpoint of our guidance is down about 1.3%. To answer your question about kind of what's the normal seasonality in Q1, it's typically down 2-3%.\n\n**Vivek Arya** (Senior Analyst)\nDoes that mean slightly lower gross margin in Q1 time, or just how should we be prepared based on if that kind of seasonality is what actually emerges?\n\n**Hassane El-Khoury** (President, CEO, and Director)\nLook, we're not guiding that far out, Vivek, but there's tailwinds as the utilization improves over time.\n\n**Vivek Arya** (Senior Analyst)\nGot it. Thank you.\n\n**Operator**\nOur next question is going to come from Chris Danely with Citi. Your line is open.\n\n**Chris Danely** (Managing Director and Senior Semiconductor Equity Research Analyst)\nHey, thanks, Gang. I'm sure you've seen this ongoing soap opera, Nexperia. Have you seen any impact to your business, either directly or indirectly, or do you anticipate any impact longer term from all this stuff going on over there?\n\n**Hassane El-Khoury** (President, CEO, and Director)\nLook, as you said, there's a big impact. It's too soon to call anything. We're focusing really on the business that I've really outlined. What I can say about that, obviously, is we have a lot of the same customers, and we are supporting our customers to the extent we can, and we'll continue to do that with the complete portfolio, not just the parts that may be impacted. What I can say is I'm not redirecting any changes from where we are, but we are supporting customers as they request it.\n\n**Chris Danely** (Managing Director and Senior Semiconductor Equity Research Analyst)\nOkay. Thanks, Hassane. For my follow-up, it seems like the auto market is starting to do a little better than the industrial end market. We've seen this trend at several of your peers. Going forward, would you expect auto to keep outgrowing industrial for the next few/several quarters?\n\n**Hassane El-Khoury** (President, CEO, and Director)\nI wouldn't put the two kind of—I guess I wouldn't compare the two and read anything into a difference in growth quarter on quarter. Both of them have growth factors that we are participating in, but the lumpiness that you see between the two is purely a market timing or a build-out timing. Some of the industrial was from some of the slowdown in the solar deployment in China. That's temporary. As you go from a tariff to a market pricing, there's a shift in there. We see that as temporary and will continue to grow.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nWe talked about some of the industrial growing because of the AI data center power requirements that I highlighted, like energy storage system driven by AI, but we call those out in our industrial market. That's some of the growth vectors in industrial and automotive. Obviously, it's our major market. You know about the growth factors that we have there. So both are growing, but the delta is purely market-driven and macro-driven. I would not read anything into kind of the deltas in the few quarters here short term.\n\n**Chris Danely** (Managing Director and Senior Semiconductor Equity Research Analyst)\nAll right. Thanks, Hassane.\n\n**Operator**\nThe next question will come from Blayne Curtis with Jefferies. Your line is open.\n\n**Blayne Curtis** (Managing Director and Equity Research Analyst)\nHey, morning, guys. Thanks for the question. I just want to ask about normal seasonal for December. Obviously, your company's gone through a lot of changes, but I think in the past, particularly auto has been up in December.I am just kind of curious how you are thinking about this guide, which is down 1%. Do you feel like that is a more normal range for you, or do you think you are undershifting the market?\n\n**Thad Trent** (CFO)\nYeah. As I mentioned, our normal seasonal pattern for Q4 is flat to down 2%. I think it is very positive that we have gone from this stabilization to now seeing seasonal patterns. I think that is the first step to recovery. As we think about the guidance there in Q4, both auto and industrial, we think, will be down low single digits. The other bucket will be up kind of mid to high single digits. Hassane mentioned it, right? I do not think you should kind of read into the lumpiness of the autos just because of the ramping of programs and timing, but that is how we kind of think about Q4 is laying out right now.\n\n**Blayne Curtis** (Managing Director and Equity Research Analyst)\nPerfect. I wanted to ask you about that AI, I am assuming, straddles industrial and this other bucket you have. I am just kind of curious, is there a way to think about, as we try to layer on that growth, how it impacts those two buckets?\n\n**Thad Trent** (CFO)\nYeah. The AI data center is reported in the other bucket. Everything prior to the data center wall is in industrial. Think about all the energy storage, energy infrastructure. That is sitting in industrial. AI data center specifically inside the four walls of the data center is in the other bucket.\n\n**Blayne Curtis** (Managing Director and Equity Research Analyst)\nGotcha. Thanks, for that.\n\n**Operator**\nOur next question comes from Gary Mobley with Loop Capital. Your line is open.\n\n**Gary Mobley** (Managing Director and Senior Analyst)\nMorning, guys. Thanks for taking my question. I think last quarter it was communicated, the specifics to the revenue headwind as you exit nine core businesses. If I recall correctly, it was assumed to be a $200 million revenue headwind for this fiscal year, $300 million for next year. Is there any change from that outlook?\n\n**Hassane El-Khoury** (President, CEO, and Director)\nNo change. For Q3, we exited about $45 million of nine core exits. That leaves about $55 million here for Q4. That is right in line with our expectations. You nailed it going into 2026. There is about 5% of the 2025 revenue that does not repeat. No change from what we were talking about last quarter.\n\n**Gary Mobley** (Managing Director and Senior Analyst)\nGreat. Thank you. I guess there has been some news, maybe it is a few months old now, about. The big analog player raising prices. How do you think that impacts sort of a pricing reset as we transition to the next calendar year?\n\n**Thad Trent** (CFO)\nI think we're expecting normal pricing behavior. I don't know if the other company you're talking about is something specific to them or not, but obviously, things can change. We're monitoring the situation always. As you can imagine, it's very dynamic out there. Right now, we're not expecting any of that in 2026. You can think about it as if anything does happen, it will be upside.\n\n**Gary Mobley** (Managing Director and Senior Analyst)\nGot it. Thank you, guys.\n\n**Operator**\nThe next question will come from Quinn Bolton with Needham & Company. Your line is open.\n\n**Quinn Bolton** (Analyst)\nHey, Hassane, I was wondering if you could give us a little bit more detail on the VCORE power or exactly what comes into the business with that acquisition. I think in the script you mentioned VCORE for X86 and ARM processors. Obviously, there's a huge number of voltage regulators on the XPU side. Does VCORE help you on that, or does that come from the existing ARM product portfolio? I got a follow-up.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nYou can think about it as a combination of both. The way we look at the acquisition is it complements the product offering that we're already offering with Trail. It provides products also in the short term. I talked about revenue generation coming here in 2026. That gives you time to market while we integrate those architectural and product functions into our base Trail platform. It's a very synergistic approach that gives us the acquisition itself, time to market, and in long term, it gives us an architectural advantage from a performance perspective once we leverage the performance of Trail from a technology base. Reading between the lines, are you taking those VCORE products as they are today into the market for 2026, but longer term, you'll redesign them using the Trail platform to get better performance?\n\n**Quinn Bolton** (Analyst)\nYes. Yeah. Got it. You guys mentioned the entry into the vertical GaN market. GaN to date hasn't been used that much in the high-power segments of the market, I think, because of reliability issues. Can you just address how do you feel the vertical GaN technology compares with lateral GaN on reliability? Can you give us any sense on when you think that might start to go into production?\n\n**Hassane El-Khoury** (President, CEO, and Director)\nYeah. I'll tell you, vertical GaN is better on the reliability side. It has all the inherent features from the lateral GaN, but better on reliability from a die size perspective. One thing you need to understand, the barrier for lateral GaN to be used in high-voltage applications has really been the fact that lateral GaN, to get it to high voltage, you have to go laterally, which makes the die size not competitive versus other similar functions. When. You look at the vertical GaN, the current goes vertically, which means that we can go higher and higher voltage without increasing the die size. Not just from a performance perspective, but also from a commercial competitiveness perspective, not just the reliability. We believe we've solved those. We're sampling. We have lead customers in both AI and automotive. We're excited about that, that we cracked that code. It is a breakthrough technology. I don't believe anybody's able to sample such technology outside. It gives our customers the optionality to have really a broad portfolio of high-voltage, high-efficiency products.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nAnytime you need high voltage and high switching frequency, vertical GaN is the solution and the answer.\n\n**Quinn Bolton** (Analyst)\nThank you.\n\n**Operator**\nOur next question will come from Joe Quartrocchi with Wells Fargo. Your line is open.\n\n**Joe Quattrocchi** (Analyst)\nYeah. Thanks for taking the questions. I was wondering, a quarter to go, any sort of color you could provide on your expectations for silicon carbide revenue growth this year?\n\n**Hassane El-Khoury** (President, CEO, and Director)\nWe didn't provide any guidance on silicon carbide, but I'll tell you, silicon carbide is coming in exactly where we expected. We continue to gain share in our end customers, and our position in China remains unchanged as new products are ramping. I mentioned one of a couple of examples here. One is the NIO launching a new brand where we were designed into that new brand with silicon carbide.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nA broader deployment now in China EVs through a leading tier one in China gives us really exposure to beyond just the top 10 OEMs that we've been engaged to. That gives you a little bit of an outlook or a feel into our penetration with silicon carbide will continue to increase, and we will continue to gain share.\n\n**Joe Quattrocchi** (Analyst)\nThanks. As a follow-up, I was wondering if you could talk about the rate of short lead time orders that you're seeing and how that compares in the third quarter relative to the prior quarter and if you're seeing any increased visibility.\n\n**Thad Trent** (CFO)\nOur lead times actually pushed out slightly. We're kind of in the mid-teen weeks. We're up around 20 weeks or so now. I don't think there's been a significant change to the short lead time orders at this point. Customers are layering in backlog as they have visibility. We probably have seen order patterns that continue to improve, which gives us that confidence in the stabilization right now.\n\n**Operator**\nThank you.\n\n**Joe Quattrocchi** (Analyst)\nOur next question will come from Joshua Buchalter with TD Cowen. Your line is open.\n\n**Joshua Buchalter** (Analyst)\nHey, guys. Thank you for taking my question. I was hoping you could provide a little bit more color on the revenue by geography. It seemed like there was a lot of volatility this quarter with Americas up so strongly. In particular, China down. Could you maybe elaborate on some of the drivers there? Was the Americas strength led by your lead customer and, yeah, what's going on in China? Thank you.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nYeah. In our prepared remarks, we laid out the quarter-over-quarter changes on each of the markets. There is some kind of movement of orders between some geographies as well. A large customer is now placing orders out of Japan versus Europe. If you normalize for that, Japan comes down slightly, Europe goes up a little bit. The rest of it is just what we're seeing as a normal pattern at this point. Not a lot to read into those bigger swings.\n\n**Joshua Buchalter** (Analyst)\nOkay. Thank you. I was also hoping you could elaborate on what you're seeing now and why it's the right time to start building up die bank inventory and taking utilization rates up, especially ahead of a couple down seasonal quarters. Maybe how we should be thinking big picture about your capacity planning with those utilization rates. Thank you.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nYeah. Look, I think we've been very disciplined on utilization versus inventory versus outlook and demand. I think we've proven that the formula works. We're not sitting here on a ton of inventory. Our base inventory is actually closer to the low end of our target, which is 110-120 days. I think we're sitting at like 112. 112, yep. 112. I think Thad mentioned it, the die bank inventory we're building is really for the mass market. For the last two to three quarters, we have been consistently talking about how we are going to be growing. Our customer count increased almost 20% year on year just in the mass market. Therefore, the demand is there for that, and we will make sure that we have it in die bank internally so we can respond to changes in demand that usually come from the mass market. We do see the business justification for it. That doesn't mean that we're going to be building blindly. We will maintain our targets. We will maintain inventory and all of our metrics within the range that we've previously outlined. I see this as business as usual, really.\n\n**Thad Trent** (CFO)\nYeah. Just to point out also that even with that die bank increase, our inventory actually declined quarter on quarter $39 million. It's a mixed shift within our base inventory to get a better profile of inventory for that mass market.\n\n**Joshua Buchalter** (Analyst)\nThank you both.\n\n**Operator**\nThe next question will come from Tore Svanberg with Stifel. Your line is open.\n\n**Tore Svanberg** (Managing Director and Senior Semiconductor Analyst)\nYes. Thank you. Hassane, with the recent acquisitions. I know you have a slide that talks about power delivery from grid to processors and the content per rack going from maybe a few thousand dollars today to maybe as much as $50,000 by 2027 or so. I mean, do you have all the IP and all the building blocks right now to get there, or is this sort of more of an opportunity and you still need to build out a few more things before you get to those types of numbers?\n\n**Hassane El-Khoury** (President, CEO, and Director)\nI think with whatever we need, call it in the next couple of years, we either have it or are working on it both organically and inorganically. Obviously, the ecosystem is evolving. Things that are needed three, four years from now are slightly different. We believe we have a very full portfolio of the IP that we need, and we will be creating products very quickly based on that IP. You can think about it as we have built a toolbox with all the IP and technology, and we are quickly deploying products. I mean, you've seen us double the number of products and Trail overall year on year, which we remain on track to do. You're going to see kind of that same mindset on AI data center along with automotive and so on. We do have the toolbox. We do have the IP.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nWe developed it internally and/or acquired it, and we will be deploying it to win in these markets to capture a lot of that share from the dollars you mentioned on the rack.\n\n**Tore Svanberg** (Managing Director and Senior Semiconductor Analyst)\nGreat. Great. Thank you for that. That's my follow-up, and I want to just take a step back on VGAN. Could you just give us a little bit of history here? I mean, I know it's obviously in your own Syracuse fab, but how many years has this been in development? Maybe back to Quinn's question, when do you start to expect some revenues here? Because obviously, this is a very unique approach to GaN. Any sort of historical context and future revenue contribution milestones would be great to know.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nSure. We started working on it through acquisition of IP and assets back in 2024. Since then, we've turned on the fab, launched the first products. First products from a, call it electrically speaking, are yielding, are functioning. Therefore, we were very aggressive in our deployment with samples to customers. We have lead customers in our major markets of automotive and AI data centers that are currently evaluating the first-generation samples, and we're already working on the second generation. We expect revenue, you can think about it in the 2027 timeframe.\n\n**Tore Svanberg** (Managing Director and Senior Semiconductor Analyst)\nGreat. Thank you so much.\n\n**Operator**\nThe next question will come from Christopher Rolland with Susquehanna. Your line is open.\n\n**Christopher Rolland** (Senior Equity Research Analyst)\nThanks so much for the question. My questions are really around AI as well and what seems like a bigger push over the last few quarters. Just some of these applications that you mentioned. I wanted to know if you could address, could you do things like solid-state transformers? It sounds like you're in the PSU, 48-volt bus converters. I guess the last one would be hot swaps as well. Do you address these or do you plan on addressing these over the next few years?\n\n**Hassane El-Khoury** (President, CEO, and Director)\nWe address every single one of them already. When I refer to, and we have it online too, when we refer to our ability to address the power tree, that was my answer before as far as how do we differentiate. Our ability to address already today the whole power tree, including all of the IP and functionality required that you have mentioned, some of them, is the differentiation we bring. The answer is yes to all. We do that today, and we will continue to expand that portfolio as we gain share.\n\n**Christopher Rolland** (Senior Equity Research Analyst)\nExcellent. And Hassane. Secondly, on silicon carbide, as we kind of digest that growth outlook, perhaps you can talk about some of the moving parts like geographically or even across industries. Lastly, do you have the ability to convert to 300-millimeter wafers? We're hearing about the potential for new applications on 300.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nYeah. First off, there's a lot of changes in the silicon carbide as new opportunities open up. For example, a few years ago, silicon carbide in AI data centers was not even a conversation point. Today, it is, and we are gaining share and really designed into the PSUs with our JFET and even our silicon carbide MOSFET. Those are new applications that our legacy with silicon carbide in automotive allowed us to really tackle very quickly and gain share with products we already have. In automotive specifically, the silicon carbide approach was for battery electric vehicles or BEVs.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nAs now you see a resurgence of a mix into plug-in hybrids or range extender EVs, silicon carbide is now getting designed in even in plug-in hybrids, which historically has been assumed to remain on IGBT. That's not the case, and we are gaining share in the plug-in hybrid market with our silicon carbide. Within the market itself, there are new opportunities and really breadth of opportunities that just a few years ago when we started on this journey was not part of even our addressable market because it wasn't there. As far as geographical, I would say I don't expect a change in the geographical outlook for silicon carbide specifically because to a first order, it's going to match where the electrification, whether it's full electric vehicles or plug-in hybrids, is going to come from and where the AI data center deployments are going to come from. That puts it strong in China and the U.S., and following behind that is Europe then Japan.\n\n**Christopher Rolland** (Senior Equity Research Analyst)\nExcellent. And 300 millimeter?\n\n**Hassane El-Khoury** (President, CEO, and Director)\n300 millimeter. We've seen it, but my point is it's too far from now. I don't think 300 millimeter opens up new applications. It's a different throughput, just like 6 to 8. I've always said 6 to 8 inch provides us an additional capacity from the number of die per wafer. We see the 300 millimeter the same, but it's very, very early in development today. I wouldn't put that in any short-term models or anything. But today, we have been just, I'll use the opportunity to give you an update on our 8 inch. Our 8 inch is in production. We're running 8 inch in our fab at 350 micron thickness, so best in class. And we will be shipping production on track in 2026.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nThe 8 inch is full-on, and then we're always looking at what's next to come both from a device like the JFET or MOSFET, but also from a technology.\n\n**Christopher Rolland** (Senior Equity Research Analyst)\nThanks, Hassane.\n\n**Operator**\nThe next question will come from Harlan Sur with JPMorgan. Your line is open.\n\n**Harlan Sur** (Equity Research Analyst)\nYeah. Good morning. Thanks for taking my question. Back to the mass market strategy or long tail of small to medium-sized customers. This has been a bright spot for the team, right? Solid customer account improvements. It serves through distribution, which gross margins. How big is this segment as a % of your total distribution revenues, and how did this subsegment do in the September quarter relative to your overall DISCI business?\n\n**Hassane El-Khoury** (President, CEO, and Director)\nLet me give you a breakdown of the distribution revenue that may help you get there. Roughly about 58% of our business goes through distribution. About half of that is fulfillment half is demand creation, right? If you think about that half, not all of that's mass market. When we think about mass market, we're thinking small customers, right? We at ON Semiconductor maybe don't know their names, right? They're emerging customers that the distributors do a good job of identifying at the opportunity. You can think about it as being a subset of that half. Maybe it's 25% of the total distribution revenue, somewhere in that kind of camp if you think about it. If they're a medium or large customer at that distributor, we still have, we still track that. I wouldn't put that in the mass market. Got it. Okay. It was good to see the technology and portfolio expansion on the wide band gap with your vertical VGAN technology.\n\n**Harlan Sur** (Equity Research Analyst)\nAs you mentioned, I think, Hassane, it looks like this was the technology that you acquired through the acquisition of NextGen late last year. Did the acquisition also include the Hewitt Syracuse Fab Facility, or was that already a part of ON? It looks like they were able to develop this very differentiated technology but not able to commercialize it. What has the ON Semiconductor team done to take the technology beyond proof of concept to commercialization?\n\n**Hassane El-Khoury** (President, CEO, and Director)\nGreat question. Yes. The fab was not part of our base fab. You can think about it as a fab that came with the technology given the differentiation of the technology. You're absolutely right on. It's such a breakthrough and differentiated technology, very difficult to make what the ON Semiconductor team has brought is our ability to manufacture wide band gap and the team's capability to be able to scale new technologies very quickly and reach maturity very quickly than, call it a startup. By the way, I will mirror this to what we've done with GTET and silicon carbide, if you recall. Same questioning, same conversations. Can you guys pull it off? Why would you pull it off if the others did not? And look where we are today. You can think about it. Our capability has already been proven with the GTET acquisition and building a franchise in a couple of years. That gives us leadership. You can imagine that same muscle, that same knowledge, and that same team is going to do exactly that with VGAN.\n\n**Harlan Sur** (Equity Research Analyst)\nYeah. Totally agree. Thank you, Hassane.\n\n**Operator**\nThe next question will come from Jim Schneider with Goldman Sachs. Your line is open.\n\n**Jim Schneider** (Senior Equity Analyst)\nGood morning. Thanks for taking my question. Hassane, you talked about the fact that customers are not willing to restock at this point, or you are not seeing that effect. Can you maybe talk a little bit about when you speak to OEMs, what they would need to see to get more confidence to restock? Is that broadly applicable to the distributor side as well?\n\n**Hassane El-Khoury** (President, CEO, and Director)\nYes. First, I will answer the distributor. I think distributors are from a mass market, as Thad said it, we are increasing our die bank internally because we want to be able to make sure we see the, call it the shelves as customers pull on the mass market. The OEM is slightly different. The OEMs, what they need to see, one is a credible demand signal.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nThink about it, consumer-level confidence, consumer-level demand signal that people are going to buy cars or people are going to buy power tools or whatever the market is. That has to be seen. The biggest thing that they want to see, which we do also, is stabilization in the geopolitical aspect of it. As they are working on shuffling and changing logistical models and manufacturing sites and so on, they are not going to be replenishing given the changes that they are going through. What I would say is consumer confidence and geopolitical stabilization will start adding more and more confidence for OEMs to restock.\n\n**Jim Schneider** (Senior Equity Analyst)\nThank you. Maybe as a follow-up, give us a little more visibility on what is happening with your other segment for a minute. It sounds like data center is doing very, very well for you. Maybe talk about what some of the offsets are that might be headwinds you saw in this quarter and then maybe what you are seeing going forward. Thank you.\n\n**Thad Trent** (CFO)\nFor Q4, I mentioned that we think that other segment is going to be up mid to high single digits. There is some normal seasonality in our non-core markets there that helps. You have AI data center that is growing as well in that market. I think those are the big drivers if you sum it up.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nAnd then, of course, we have the exits that a lot of it lands into the others bucket as offsetting the growth. So net growing actually means the strategic market like AI, data center, and so on within that is growing very, very nicely.\n\n**Jim Schneider** (Senior Equity Analyst)\nThank you.\n\n**Operator**\nAnd the next question will come from Joe Moore with Morgan Stanley. Your line is open.\n\n**Joe Moore** (Managing Director and Semiconductor Research Analyst)\nGreat. Thank you. I wonder if you could give us some sense of the automotive market by region, any sort of different behaviors that you're seeing, and I guess particularly. On China EV, there's been sort of a lot of noise in both directions. Can you just talk to the health of that market?\n\n**Hassane El-Khoury** (President, CEO, and Director)\nYeah. Look, I think from a market, of course, we've always expected adjustments in that market. I've always said there's over 100 brands. So between consolidation, between. Success and not success, the only strategy we have, which we've been executing to, and it's worked very well for us, is customer diversification. So you've heard us always adding new and new customers. Leading customers in the top 10, which drive a lot of volume. And then secondary is trying to reach into that tail of OEMs. So we're not sitting here picking winners or not winners in China.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nWe want to have the majority market share across the market. And as shares shift between them, our customer diversification strategy will work to our advantage. We've proven that very well over the last few years. We're gaining share consistently across a broad range of OEMs and brands. Have worked for us to really de-risk the lumpiness that you're referring. But I don't see that as any change from the headlines. So our strategy is working, and we'll continue to execute to that while we kind of fine-tune it as things change because things do change rapidly.\n\n**Joe Moore** (Managing Director and Semiconductor Research Analyst)\nGreat. That's helpful. And then you addressed an experience situation, but I guess I'm just trying to figure out why that isn't a bigger deal. We've listened to some of the tier one auto suppliers, and they seem quite anxious about the situation. Shouldn't that be the catalyst for them to start building up inventory to sort of deal with the geopolitics of the situation? Or just. Why isn't that something that's a bigger deal for you guys in the next quarter or two?\n\n**Hassane El-Khoury** (President, CEO, and Director)\nWe're here to support, but I will make a comment on the tier ones panicking. I've been saying that inventory is low for the last two years, and we're draining inventory below critical levels. Whether Nexperia or not, any trip into supply chain is going to cause a chain reaction, and this is the proof. The only way out of this is place the backlog with visibility, and we will start planning and shipping. So we are seeing it. We are responding to it. And we will keep supporting it. Regardless of how the next few quarters go, we need the replenishment cycle. We need to make sure that the tier ones and OEMs have safety stock in order to buffer any disruption. That is the only solution. We have learned a hard lesson in COVID, and here we are again.\n\n**Joe Moore** (Managing Director and Semiconductor Research Analyst)\nYeah. Very helpful. Thank you so much.\n\n**Operator**\nThe next question will come from Harsh Kumar with Piper Sandler. Your line is open.\n\n**Harsh Kumar** (Managing Director and Senior Research Analyst)\nOkay, guys. Thanks for squeezing me in. Hassane, if I can dare say that you seem somewhat, somewhat cautiously excited about your end markets for the first time in a long time. If I can ask you a question in auto, a two-parter, could you give us a hint of maybe what backlog or bookings were? I am trying to gauge that relative to your stabilization comment. If you are talking about stabilization in auto, then I am looking at your 6% odd growth that you put up in the September quarter. Is that seasonal growth, or is that better than seasonal growth? If it is better, then, of course, what drove that?\n\n**Hassane El-Khoury** (President, CEO, and Director)\nYeah. Look, I think I will go back to the prior answer that I gave earlier. I do not look at the quarter-on-quarter. I would recommend you should not either. I have to look at first half, second half. We have always said the second half of the year is going to outgrow the first half of the year in our end markets. Remember, auto, we said the bottom was going to be in Q2. That has been the case, and we were going to grow from there. Grow meaning closer to demand, but no restocking yet.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nThat is coming in exactly as we expected. That quarter-on-quarter, I would not talk about seasonality within markets and so on. I would talk about the lumpiness and project ramps. Some projects ramped in Q3 versus ramping in Q4. Those, I do not think, are a read on how the market is doing. Visibility, however, with stabilization, we get better visibility. Not where we would like to see it, but it improved. We are getting better visibility. Again, there is more work to do to get the visibility. That is what I can tell you about where we are in automotive. I am cautious, but I am also looking at the data in order to sound like I do. Our work is not done. It is not all behind us.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nI think what you have seen from us is we will manage to what we see, and we will deliver the results that we promise. That is the consistency. Of course, we all wish it were different. We all wish it was way better than sometimes it is. Some of my peers did. We have been very consistent, and we are going to continue to manage the company with discipline, whether in inventory, cash flow, or really R&D investments in differentiated technologies.\n\n**Harsh Kumar** (Managing Director and Senior Research Analyst)\nFair enough. Maybe one for you, Thad. As sort of you look at stabilization. I understand you'll need to ramp up your factories and fabs to be able to get to that 40% level. But is there a revenue number that I can think of where you start to get close to that 40% number, or is it just purely a function of utilization and it ebbs and flows depending on how much dive bank inventory you're building?\n\n**Thad Trent** (CFO)\nYeah. It's utilization-driven, right? So we talked about. Every point of utilization is 25 to 30 basis points of gross margin improvement. That math still holds. As we look into the 2026, utilization is going to drive the margin.\n\n**Harsh Kumar** (Managing Director and Senior Research Analyst)\nFair enough. Thanks, guys.\n\n**Operator**\nThank you. This will conclude today's question and answer session. I would now like to turn the call back over to Hassane for closing remarks.\n\n**Hassane El-Khoury** (President, CEO, and Director)\nThank you all again for joining us today. Before we conclude the call, I want to recognize the outstanding efforts of our global teams. Their focus and execution continue to drive our results and help us deliver for our customers and shareholders.We're encouraged by the signs of stabilization across our core markets and remain focused on delivering differentiated solutions and operational excellence for our customers. We are committed to being a reliable and trusted partner and continue to raise the bar on how we support their success through technology, leadership, responsiveness, and a deep understanding of their evolving needs. We appreciate your continued support and look forward to updating you next quarter. Thank you. This concludes today's conference call. Thank you for participating. You may now disconnect.",
      "fetched_at": "2026-02-04T15:46:21.258Z"
    },
    {
      "ticker": "ON",
      "title": "ON Semiconductor Corporation (ON) Q2 FY2025 earnings call transcript",
      "published_date": "Aug 4, 2025, 9:00 AM EDT",
      "fiscal_year": "2025",
      "quarter": "Q2",
      "url": "https://finance.yahoo.com/quote/ON/earnings/ON-Q2-2025-earnings_call-342132.html",
      "content": "**Operator**\nGood day and thank you for standing by. Welcome to the ON Semiconductor second quarter 2025 earnings conference call. At this time, all participants are in a listen-only mode. Later, we will conduct a question and answer session. To ask a question at that time, you need to press *one one on your telephone. If your question has been answered and you wish to remove yourself from the queue, please press *one one again. Please be advised today's conference is being recorded. I would now like to hand the conference over to your speaker today, Parag Agarwal. Please go ahead.\n\n**Parag Agarwal** (Head of Investor Relations)\nThank you, Kevin. Good morning and thank you for joining ON Semiconductor 2025 results conference call. I'm joined today by Hassane El-Khoury, our President and CEO, and Thad Trent, our CFO. This call is being webcast on the investor relations section of our website at www.onsemi.com. A replay of this webcast, along with our second quarter earnings release, will be available on our website approximately one hour following this conference call, and the recorded webcast will be available for approximately 30 days following this conference call. Additional information is posted on the investor relations section of our website. Our earnings release and this presentation include certain non-GAAP financial measures.\n\n**Parag Agarwal** (Head of Investor Relations)\nReconciliation of these non-GAAP financial measures to the most directly comparable GAAP financial measures and a discussion of certain limitations when using non-GAAP financial measures are included in our earnings release, which is posted separately on our website in the investor relations section. During the course of this conference call, we will make projections or other forward-looking statements regarding the future events or future financial performance of the company. We wish to caution that such statements are subject to risk and uncertainties that could cause actual events or results to differ materially from projections. Important factors that can affect our business, including factors that could cause actual results to differ materially from our forward-looking statements, are described in the most recent Form 10-K, Form 10-Qs, and other filings with the Securities and Exchange Commission and in our earnings release for the second quarter.\n\n**Parag Agarwal** (Head of Investor Relations)\nOur estimates or other forward-looking statements might change, and the company assumes no obligation to update forward-looking statements to reflect actual results, change assumptions, or other events that may occur except as required by law. Now, let me hand it over to Hassane. Hassane.\n\n**Hassane El-Khoury** (President and CEO)\nThank you, Parag. Good morning and thank you all for joining us. In the second quarter, we made meaningful progress across our strategic priorities and advanced critical initiatives in the automotive, industrial, and AI data center. In automotive, we're helping customers like Xiaomi improve range and enhance the driving experience, and we're expanding our engagement with more global OEMs and tier ones, including our collaboration with Schaeffler. In AI data centers, we are enabling next-generation power architectures that drive efficiency and performance at scale through collaboration with market leaders like NVIDIA to accelerate the shift to 800 VDC power architecture. We remain focused on making strategic investments to extend our competitive edge and deepen customer relationships to build long-term value. At the same time, we are making structural improvements across the business to enhance efficiency.\n\n**Hassane El-Khoury** (President and CEO)\nThis, combined with disciplined cost management, creates significant leverage in our model as we prepare to capitalize on a market recovery. On the financial side, we delivered Q2 revenue of $1.47 billion, exceeding the midpoint of our guidance, and non-GAAP gross margin and EPS of 37.6% and $0.53, respectively. Turning to the demand environment, we are seeing signs of stabilization across our end markets. We have not seen any pull-ins to date due to tariffs, and our diversified manufacturing footprint remains a competitive advantage, providing sourcing options to our customers as they work on optimizing their supply chains. By market, automotive revenue in Q2 was down 4%, performing better than anticipated, and is expected to grow in the third quarter with continued EV ramps. In China, select Xiaomi YU7 electric SUV models integrate our 1200-volt EliteSiC M3E, enabling better performance and the longest range in its class.\n\n**Hassane El-Khoury** (President and CEO)\nChina remains a growth driver for ON Semiconductor with strong traction in both BEV and PHEV platforms. China revenue in Q2 grew 23% sequentially, driven by silicon carbide with the new EV ramps I mentioned last quarter. We also expanded our collaboration with Schaeffler to deliver our next-generation traction inverter for a global OEM's PHEV platform, using our latest 1200-volt EliteSiC M4T trench technology to unlock higher energy efficiency and reliability. We expect adoption to continue to expand and our customer engagement to continue to diversify as OEMs redesign hybrid architectures to meet emissions targets and extend range. Industrial revenue increased 2% quarter-over-quarter. Revenue for AI data center, which we report as part of our other bucket, nearly doubled again in Q2 over the same quarter last year. As outlined in the President's AI Action Plan, AI infrastructure has become a focus of national priority in the United States.\n\n**Hassane El-Khoury** (President and CEO)\nAI growth will be limited by power delivery rather than compute alone, and ON Semiconductor is the only broad-based U.S. power semiconductor supplier addressing this challenge with our intelligent power semiconductors, dramatically increasing power density and reducing energy loss. We are actively working with leading XPU providers on smart power stages that address the power requirements of current and next-generation platforms. We are in production on single SPS products in an industry standard 5x5 package and began sampling a dual SPS in the same footprint. As part of our ongoing transformation, we will continue investing in next-generation technologies where we have clear competitive advantages while reducing our exposure to areas with limited differentiation. This includes end-of-life of legacy products, exiting non-core businesses, and repositioning our image sensing portfolio toward higher value segments such as ADAS and machine vision.\n\n**Hassane El-Khoury** (President and CEO)\nThese actions are reshaping ON Semiconductor into a company with a distinct value proposition powered by leadership in intelligent power sensing and analog mixed signal technologies. A strong example of the strategy in action is Trayo. Momentum continues to build around our Trayo platform with a design funnel that has more than doubled quarter-over-quarter as we progress towards our billion-dollar revenue target. We are on track to double the number of products sampling from last year. Trayo's differentiated technology, modular SoC-like design, and ability to integrate high and low voltage domains are driving strong customer engagement across all our end markets. An example in automotive is 10BASE-T1S, where we sampled over 10 customers as they work on their zonal architecture. After delivering our first Trayo revenue in Q1, we've also reached an important milestone.\n\n**Hassane El-Khoury** (President and CEO)\nWe've now shipped over 5 million units from our East Fishkill facility this year. These milestones reflect the strength of our innovation engine and the strategic investments we've made to support long-term growth. By reducing complexity, sharpening our operational focus, and allocating capital more efficiently, we are building a more resilient and higher-quality business for the long term. As the global economy accelerates toward electrification and intelligent automation, next-generation vehicles, sustainable energy systems, and AI data centers are converging around a shared need for a new era of power solutions. Beyond silicon carbide, our strategic investments in next-generation wide-bandgap semiconductors have delivered transformative gains in power density, thermal performance, and energy efficiency. We started sampling customers on these new breakthrough technologies, and I will talk more about it soon.\n\n**Hassane El-Khoury** (President and CEO)\nLet me now turn it over to Thad to give you more detail on our results and guidance for the third quarter.\n\n**Thad Trent** (CFO)\nThanks, Hassane. Through our ongoing transformation, we remain dedicated to building sustainable long-term value for our shareholders. We have progressively rationalized our portfolio and manufacturing footprint to expand gross and operating margins at scale. These efforts will continue in future quarters, and we are committed to extracting value through our FabRight initiative. Investments in next-generation technologies across the portfolio will continue to expand our position as a leader in power and sensing and drive the shift in our portfolio mix to move ON Semiconductor up the value chain with our customers. As a reminder, in Q1, we took aggressive action to reduce our manufacturing capacity and restructure our workforce to continue driving long-term operational efficiencies. In the second quarter, we began to see the benefits of those structural changes with a substantial reduction in operating expenses.\n\n**Thad Trent** (CFO)\nIn parallel, we increased our 2025 targeted share repurchase to 100% of free cash flow. We are executing to that target, and after repurchasing an additional $300 million of shares in the second quarter, we have returned 107% of our free cash flow to shareholders on a year-to-date basis. Turning to the second quarter financial results, we exceeded the midpoint of our guidance with revenue of $1.47 billion, increasing 1.6% over Q1. Automotive revenue was $733 million, which decreased 4% sequentially, driven by weakness in America and Europe and offset by continued strength in China. Revenue for industrial was $406 million, up 2% sequentially. While our medical and aerospace and defense businesses continue to grow, traditional industrial declined slightly in Q2 versus Q1. Outside of auto and industrial, our other businesses increased 16% quarter-over-quarter, with AI data center being one of the significant contributors.\n\n**Thad Trent** (CFO)\nLooking at the quarter between the split between the business units, revenue for the Power Solutions Group, or PSG, was $698 million, an increase of 8% quarter-over-quarter, and a decrease of 16% year-over-year. Revenue for the Analog and Mixed Signal Group, or AMG, was $556 million, a decrease of 2% quarter-over-quarter and 14% year-over-year. Revenue for the Intelligent Sensing Group, or ISG, was $215 million, an 8% decrease quarter-over-quarter and 15% over the same quarter last year. Turning to gross margin in the second quarter, GAAP and non-GAAP gross margin was 37.6%, above the midpoint of our non-GAAP guidance. Manufacturing utilization was flat compared to Q1. Accounting for the capacity impairment completed in Q1, utilization is now 68% based on our reduced manufacturing capacity.\n\n**Thad Trent** (CFO)\nWe expect to see approximately a $5 million reduction in depreciation on the income statement starting in Q4. Now, let me give you some additional numbers for your models. GAAP operating expenses for the second quarter were $359 million as compared to $396 million in the second quarter of 2024. GAAP operating expenses decreased sequentially in Q1 as Q1 included restructuring charges of $539 million. Non-GAAP operating expenses were $298 million compared to $308 million in the quarter a year ago. Non-GAAP operating expenses decreased $17 million sequentially and were above the midpoint of our guidance. This was due to delays in realizing the full benefit of our restructuring activities in the quarter, which we expect to recognize fully in the third quarter. GAAP operating margin for the quarter was 13.2%, and non-GAAP operating margin was 17.3%. Our GAAP tax rate was 12.6%, and non-GAAP tax rate was 16%.\n\n**Thad Trent** (CFO)\nLooking forward, we expect no material change in 2025 due to the One Big Beautiful Bill, while we see a positive impact in 2026 and beyond, reducing our non-GAAP tax rate to approximately 15% from our previous expectation of 19%. Diluted GAAP earnings per share for the second quarter was $0.41 as compared to $0.78 in the quarter a year ago. Non-GAAP earnings per share was $0.53 as compared to $0.96 in Q2 of 2024. GAAP and non-GAAP diluted share count was 415 million shares. Turning to the balance sheet, cash and short-term investments were $2.8 billion, with total liquidity of $4 billion, including $1.1 billion undrawn on a revolver. Cash from operations was $184 million, and free cash flow was $106 million. The sequential decline in free cash flow was driven by timing of working capital, which created lumpiness between quarters.\n\n**Thad Trent** (CFO)\nOur year-to-date free cash flow is 19% of revenue, and we remain on track to deliver 25% free cash flow margin for the full year. Capital expenditures during Q2 were $78 million, or 5% of revenue. Inventory was up quarter-over-quarter on a dollar basis by $9 million and decreased by 11 days to 208 days. This includes 87 days of bridge inventory to support fab transitions in silicon carbide, down from 100 days in Q1. Excluding the strategic builds, our base inventory is healthy at 121 days. Distribution inventory was 10.8 versus 10.1 weeks in Q1, and within our target range of 9 to 11 weeks. Looking forward, let me provide you the key elements of our non-GAAP guidance for the third quarter. As a reminder, today's press release contains a table detailing our GAAP and non-GAAP guidance.\n\n**Thad Trent** (CFO)\nFirst, our guidance is inclusive of our current expectations that there is no material direct impact of tariffs announced as of today. Given our current visibility, we anticipate Q3 revenue will be in the range of $1.465 billion-$1.565 billion. Our non-GAAP gross margin is expected to be between 36.5% and 38.5%, which includes share-based compensation of $6 million. Our third quarter guidance includes 900 basis points of non-cash under-absorption charges, and we expect utilization to be flat to up slightly in Q3. Moving on to non-GAAP operating expenses, we expect OpEx to be in the range of $280 million-$295 million, including share-based compensation of $32 million. We anticipate our non-GAAP other income to be a net benefit of $8 million, with our interest income exceeding interest expense.\n\n**Thad Trent** (CFO)\nWe expect our non-GAAP tax rate to be approximately 16%, and our non-GAAP diluted share count is expected to be approximately 410 million shares. This results in non-GAAP earnings per share to be in the range of $0.54 -$0.64. We expect capital expenditures in the range of $35 million-$50 million. As we look forward, we continue to rationalize our product portfolio to force the shift towards higher value and higher margin products. In 2026, we expect that approximately 5% of our 2025 revenue will not repeat. This includes the end-of-life of certain legacy products, ongoing non-core exits, and the repositioning of Intelligent Sensing Group that Hassane talked about. We've also been executing our FabRight strategy to align capacity with this shift as we drive to a higher quality of revenue and long-term earnings power.\n\n**Thad Trent** (CFO)\nTo wrap up, we continue to operate with financial discipline and a clear focus on shareholder value. By taking decisive action to streamline our portfolio and align operations, we are well positioned for a recovery. We continue to invest in next-generation technologies and capabilities that will strengthen our competitive advantage and support our transformation. With our focus on intelligent power and sensing, we are reshaping ON Semiconductor into a more focused and differentiated company. With that, I'd like to turn the call back over to Kevin to open up the line for Q&A.\n\n**Operator**\nThank you. Ladies and gentlemen, if you have a question or a comment at this time, please press *one one on your telephone. If your question has been answered and you're removing yourself from the queue, please press *one one again. We'll pause for a moment while we compile our Q&A roster.\n\n**Operator**\nOur first question comes from Ross Seymour Seymore with Deutsche Bank. Your line is open.\n\n**Ross Seymour** (Managing Director)\nHi guys, thanks for letting me ask a question. Hassane, the first one's for you, and I guess there's kind of two parts to it. You sound better cyclically than you have in a while. The first part is, what are you seeing cyclically, and where are there still headwinds? Where are you seeing mainly the tailwinds? Perhaps more importantly, when we move to the secular side, you talked about the AI data center side, the Trayo side of things, but we still have the offsets of businesses you're exiting, like Thad just mentioned, probably a 5% headwind. Can you talk a little bit about the traction in those secular drivers and when the good ones are going to offset the exits?\n\n**Hassane El-Khoury** (President and CEO)\nYeah, Ross, thanks. That's a great segue into what really the call is about. As far as what we're seeing, we're seeing stabilization relative to where we have been over, call it, the last three, four, five quarters. That is a positive development. We talked about automotive hitting the low end in the second quarter. Thad talked about also expecting, we expect automotive to be up in the third quarter. You're starting to see that stabilization. I'm not there calling a recovery. There's still a lot of uncertainty and customers are being cautious. Relatively speaking, I do have a more, I guess, positively optimistic looking forward. I remain cautious in the way we run the company until we see that stabilization turn into a better foundation for a recovery. We're controlling everything we can from what Thad mentioned, from an OpEx perspective.\n\n**Hassane El-Khoury** (President and CEO)\nWe're being very disciplined in investments that will turn the company into the high-value products and revenue that we want. Those are the second part of your question. When we talk about AI data center, we've said we've started introducing products. Those products are gaining traction, not just from our Analog and Mixed Signal Group, but also we talked about the silicon carbide JFET. A lot of foundational technologies that we have in the company, we have been moving that into the AI data center, and that business has doubled year on year from the quarter a year ago. That's the second quarter, we doubled from last year as well. That's getting the traction that we are expecting. Trayo as a broad-based product, it is differentiated. We hit a very important milestone last quarter.\n\n**Hassane El-Khoury** (President and CEO)\nI talked about we already recognized revenue a few quarters ahead of what we described prior to that. We expected the revenue in the second half of this year, but we posted the first revenue in Q1 of 2025. The second milestone is really the volume, and that tells you a little bit on the breadth and the traction that we're seeing with customers. All of these investments that we've been making over the last few years are what's driving our longer-term view and why it's important for us to start focusing on really reshaping the company into the high-value product company that we want and really a much better revenue quality from a margin perspective and from a capital allocation perspective.\n\n**Hassane El-Khoury** (President and CEO)\nAll of these pieces of the puzzle that we've been investing in and putting in place, now they're starting to come together with traction in the market that we are able to use as a foundation for where we go next.\n\n**Ross Seymour** (Managing Director)\nThanks for that, Hassane. I guess this is my follow-up one for Thad on the gross margin side. Again, a little bit of a near-term, long-term balance. In the near term, why is it flat to slightly down if your revenues are up? Then longer term, especially given the changes in mix that you're talking about, what are the key levers you think you can pull to get to the 53% long-term target, if indeed that is still the target?\n\n**Thad Trent** (CFO)\nYeah, Ross, I mean, the key to margin expansion for us is all about utilization, right? We've been saying that for a few quarters here. As we see a recovery, utilization will improve, and that'll fall through on a gross margin line a couple quarters later as you think about burning through that inventory. In the short term, look, we're being cautious right now, right? We've got inventory in the balance sheet we're going to burn through. We're lean there. We're lean in the distribution channel. We're in a good spot that when the market does turn, we take utilization up. We're being cautious here. We think it's flat to slightly up here in Q3. As we get better visibility into Q4 and into early next year, we'll think about taking utilization up. That will give us a nice tailwind as you go into 2026.\n\n**Thad Trent** (CFO)\nIn terms of the march to the target of 53%, you've got about 900 basis points of underutilization charges in our Q3 guide. That's consistent with Q2. That obviously, every point of utilization is 25-30 basis points of gross margin improvement. That math still holds. As you see the utilization coming up, you'll see us get that 900 basis points back. We also have the monetization of the divested fabs as we move that production back in-house. We're continuing to do more work on our FabRight initiative, which will get us another 200 basis points kind of in that neighborhood. Then, as Hassane talked about, as we ramp these new products, there are favorable margins. I think when you start to add that up, you can start to get within kind of a pretty tight range of getting to that 53% long-term target.\n\n**Thad Trent** (CFO)\nLike I said, in the short term, it's all about utilization. That's the number one driver.\n\n**Ross Seymour** (Managing Director)\nThank you.\n\n**Operator**\nOne moment for our next question. Our next question comes from Vivek Arya with Bank of America. Your line is open.\n\n**Vivek Arya** (Managing Director and Senior Equity Research Analyst)\nThank you for taking the question. For the first one, I just wanted to go back to Q2 results. Industrial was a bit softer than I think you had thought before. What drove that? The other was, you know, much stronger. Is it really the data center part of that other? If that is the case, how large is the data center part of your other business right now?\n\n**Thad Trent** (CFO)\nYeah, on the industrial, you know, it wasn't up as much as we were expecting. That's primarily because of what we call the traditional industrial. It was down just slightly. When we look at our traditional industrial, I would say it's kind of bouncing across the bottom. We think we've stabilized, but you know, there's going to be some ups and downs here. It was down slightly and down more than we thought it was going to be. That's the primary driver on the industrial. On the other market, yeah, it's the AI data center and the opportunity that we have there. We talked about year-over-year that that business has doubled. Still a small piece of the overall company, but growing nicely.\n\n**Vivek Arya** (Managing Director and Senior Equity Research Analyst)\nOkay. For my follow-up, Hassane, where are we in the automotive recovery cycle for ON Semiconductor? I think you mentioned China appears to be strong for you. Is it really the weakness outside of China, especially at the North American EV OEM? I'm trying to contrast what you are seeing versus what several of your analog peers are seeing. Some of them are within 4% or 5% of their prior automotive peaks, whereas ON Semiconductor's auto business is still, I think, 30% off your prior peak. Why is the automotive recovery so slow for ON Semiconductor? When do you think that your auto business could start to regrow year on year? Thank you.\n\n**Hassane El-Khoury** (President and CEO)\nYeah, I think the automotive, specifically, the regions other than China, both Europe and North America are weak. I think there's a lot of uncertainty in the automotive market. I don't think we're any different other than the portfolio rationalization that we've been doing. Those obviously will not repeat moving forward. Where we are in the EV, EV ramps continue to happen. Of course, not at the same rate that we all expected. I think the unit volume is not where it needs to be. The rest is just purely on mix and exposure versus our peers. I can't really comment what our peers are seeing in automotive. From our side, we hit the bottom in the second quarter. We're starting to post growth.\n\n**Hassane El-Khoury** (President and CEO)\nOur expectation in Q3 will be growth, and then we'll see based on the visibility we get over the next few quarters where that's going to lead.\n\n**Vivek Arya** (Managing Director and Senior Equity Research Analyst)\nThank you.\n\n**Operator**\nOne moment for our next question. Our next question comes from Blayne Curtis with Jefferies. Your line is open.\n\n**Blayne Curtis** (Managing Director and Senior Equity Analyst)\nHey, good morning. Thanks for taking my question. I actually wanted to ask you about the ISG repositioning. I thought you said the 5% was the end-of-life products, and that's what you've been saying for a while. Maybe you could just walk me through what are you repositioning, why, and is there a revenue number tied to that repositioning in ISG?\n\n**Hassane El-Khoury** (President and CEO)\nYeah, from a repositioning, the strategic repositioning, I've talked about it at a high level in prior quarters, is really our focus on the machine vision part of it. As we see some of the competition coming in, we've always said we're going to focus on value, and we're going to focus on high-quality revenue based on the technology and the differentiation we bring. That differentiation locks with the vision product or machine vision product rather than the human vision product. To give you an example that I've always given in the past, reverse parking, it doesn't matter how good your camera is, there's always dirt on the lens because it's outside. The quality doesn't matter. That's where we're not going to be engaging on these designs.\n\n**Hassane El-Khoury** (President and CEO)\nWhen it comes to proper ADAS, where the CPU or the SoC, the central SoC, needs clarity and the best image quality for safety, that's where we bring, that's where we add value with our vision products. That's the difference between where the company used to tackle, which is a lot of the volume, aiming for number one market share across all markets, to a very focused value-driven approach, which we've been on for a few years. That's really the difference that I talked about here. It's no different than the strategy we've been implementing. Right now, we're very confident in the approach that we want and the strategy we're going to move forward with and followed with the investments that we are making in order to maintain that differentiation in the markets we want.\n\n**Thad Trent** (CFO)\nTo answer the second part of your question in terms of the revenue impact, we think for 2026, it's about $50 million to $100 million that doesn't repeat from the 2025 baseline.\n\n**Blayne Curtis** (Managing Director and Senior Equity Analyst)\nIs that incremental to the 5% from the end-of-life stuff?\n\n**Thad Trent** (CFO)\nNo, that's inclusive of the 5%.\n\n**Blayne Curtis** (Managing Director and Senior Equity Analyst)\nGotcha. Maybe Thad, just on the DISTI inventories, I guess it kind of came in the high end of the range in June. What's your expectation for DISTI in the September guide?\n\n**Thad Trent** (CFO)\nI think it's going to be right in this range. Let's call it 10 weeks plus or minus, right? We came in at 10.8. It's in our sweet spot of 9 to 11, so I don't expect any material change one way or another.\n\n**Blayne Curtis** (Managing Director and Senior Equity Analyst)\nGot it.\n\n**Hassane El-Khoury** (President and CEO)\nObviously, we talk, so Blayne, just from a quarter on quarter, we don't really look at a quarter on quarter at that level of detail as long as it remains within the range. As you understand, there's ramps that we have in the third quarter. Those ramps kind of we get through in the second quarter, then you drain and you then get to a steady state. That difference between quarter on quarter, as long as it's within the range, for us, it's not something that we want to control at that level as long as we maintain a customer ramp strategy.\n\n**Blayne Curtis** (Managing Director and Senior Equity Analyst)\nThanks so much.\n\n**Operator**\nOne moment for our next question. Our next question comes from Chris Danely with Citi. Your line is open.\n\n**Chris Danely** (Managing Director and Senior Semiconductor Analyst)\nHey, thanks guys. Just a couple of questions digging on the gross margins. Is the 5% of business that's going away next year, is that going to be gross margin accretive? If so, how much? How does the silicon carbide business fit into the overall gross margin ledger? Are those gross margins lower than the corporate average now? How do we get those back to the 53% target? Thanks.\n\n**Thad Trent** (CFO)\nYeah, Chris, so the silicon carbide gross margin today is below the corporate average, primarily because of underutilization. The key to getting those back to the corporate average is obviously volume and leveraging that manufacturing footprint that we have, which we will do over time as that business continues to ramp. In terms of the exits, long term, that is going to be diluted to margins. Currently, it's somewhere around the corporate average. When you think about our aspirations to get to a 50%+ gross margin, that business is not going to support that aspiration. That's the reason to exit it now. We've said that we've undercalled this for a few years here, or maybe overcalled it, expecting to exit it faster. Long term, it will be diluted. Short term, it will be neutral, just given the fact that it's around the corporate average today.\n\n**Thad Trent** (CFO)\nWe will be right-sizing manufacturing as we go through this as well. That's what I said in my prepared remarks. We are matching the FabRight capacity with these planned exits.\n\n**Chris Danely** (Managing Director and Senior Semiconductor Analyst)\nOkay. For my follow-up, just real quick, what % of your auto business is China? How would you expect that to trend over the next couple of years?\n\n**Hassane El-Khoury** (President and CEO)\nYeah, we don't, look, we don't break auto China. We're disclosing auto as a whole and China as a whole. We're not getting into that level of detail from the revenue cut. We expect China to be a target market for us. We have a 50% share that will continue to grow as revenue grows and as the number of units keeps growing. We're very happy with our position in China. Just to remind everybody, our focus in China is really where we add on the efficiency and the range. Every win that we have in China is tied to the quality and the performance of the products. That's how we differentiate, not just against some of our Western peers, but how we differentiate against some of the local peers. We will maintain that level of differentiation.\n\n**Hassane El-Khoury** (President and CEO)\nI talked about we introduced our trench silicon carbide already with some wins behind it. That is the way we're going to keep and stay ahead of everybody from a competition perspective. That's the reason we're winning in China and really outside of China.\n\n**Chris Danely** (Managing Director and Senior Semiconductor Analyst)\nOkay. Thanks, Hassane.\n\n**Operator**\nOne moment for our next question. Our next question comes from Jim Schneider with Goldman Sachs. Your line is open.\n\n**Jim Schneider** (Senior Equity Analyst)\nGood morning. Thanks for taking my question. I was wondering, with respect to the Q3 guidance, you talked about automotive being up in the quarter. I'm assuming that given your commentary, you're less sure about industrial and other being up. I was wondering if you can maybe give us a little bit of color on what you'd expect going into Q3 for there. I'm assuming that data center piece of other would be much stronger. Maybe just kind of clarify whether you expect to be auto, excuse me, industrial would be up, flat, or down. Thank you.\n\n**Hassane El-Khoury** (President and CEO)\nYeah, the comment I made on automotive is exactly that, but I made it specifically on automotive relative to the second quarter being the kind of the trough as we ran. Just to clarify my comment, we expect every end market, auto, industrial, and other to be up in the third quarter. Other will be up higher, driven by the ramps that we see in these markets that we put under others, which includes AI, of course.\n\n**Thad Trent** (CFO)\nYeah, to give you a little more specific expectations there, we expect auto and industrial to be up low single-digit %. We think other is going to exceed that, will be up in the mid to high single-digit % range.\n\n**Jim Schneider** (Senior Equity Analyst)\nThat's very helpful. Thanks. Maybe if you could give us any kind of color on, you know, with auto, you talked about the U.S. and Europe being a little bit weaker. I don't think that's particularly surprising to anybody, but can you maybe talk about the reasons for that? Is it purely tariff-based uncertainty in terms of their end market uncertainty, or do you think there's a little bit of excess inventory or buffer stocks still trying to work down internally? Thank you.\n\n**Hassane El-Khoury** (President and CEO)\nI would say it's all of the above. I mean, I don't know what to point specifically at. It's not an industry or a market. Every customer has their pain points. Some have some inventory. We don't believe that's a broad statement from an inventory perspective. You have the tariff and you have just a general uncertainty of end market demand. You see customers waiting to the last minute to place an order, and that's the cautious approach that we're taking. We've been more right than wrong in our approach. We're going to continue to manage to the visibility and to what we can see. When you think about auto and, or sorry, in general, Europe and North America, it's really all of the above that we all read in the headlines.\n\n**Jim Schneider** (Senior Equity Analyst)\nThank you.\n\n**Operator**\nOne moment for our next question. Our next question comes from Quinn Bolton with Needham & Co. Your line is open.\n\n**Quinn Bolton** (Managing Director of Equity Research)\nHey guys, thanks for letting me ask a question. Thad, I just wanted to come back on that utilization impact. I think you said each point of utilization is 25-30 basis points, but you said there's 900 basis points of underutilization charges including guidance. It kind of implies you need to get to 98% utilization to get that full 900 basis points. I thought you guys in the past had said full utilization was more low to mid 80s. Can you just clarify, you know, kind of what, where do you see full utilization?\n\n**Thad Trent** (CFO)\nYeah, good question. Previously, we had said fully utilized for us was kind of in that mid 80% range. Post the impairment that we've done in Q1, that is now kind of in the low 90%, call it somewhere around 92%, right? If you do that math on the 25-30 basis points for every point of utilization, you get to somewhere around 700 points of improvement. There's also another 200 basis points of FabRight initiatives that we're still taking. That'll get you to that 900 between the two combinations. Our expectation now is on the lower footprint, our fully utilized is now kind of in that low 90% range. It's improved.\n\n**Quinn Bolton** (Managing Director of Equity Research)\nGot it. The rest, sort of from the 46% or so to 53%, that would all be mix and new products.\n\n**Thad Trent** (CFO)\nYeah, exactly. Exactly.\n\n**Quinn Bolton** (Managing Director of Equity Research)\nGot it.\n\n**Thad Trent** (CFO)\nAs well as the new script. Sorry, one more thing. As well as the Fab divestitures, right? You got about another 200 bps of the Fab divestitures that we'll recognize.\n\n**Quinn Bolton** (Managing Director of Equity Research)\nGot it. Okay. Hassane, you'd mentioned the smart power stages, both single and dual phase, and I think you said you're sampling now. I'm wondering if you could give us, you know, is that sort of about a year-long qualification timing? Do you think you could ramp faster? Maybe a similar question just on the 800 VDC rack opportunity. Would you expect that to sort of ramp in the 2027 timeframe, given, you know, I think what NVIDIA has stated about its 800 VDC rack timeline?\n\n**Hassane El-Khoury** (President and CEO)\nGiven the sensitivity with the mentioning customers, whatever we have specifically on that opportunity is listed in the press release.\n\n**Quinn Bolton** (Managing Director of Equity Research)\nOkay. How about just the smart power stages then?\n\n**Hassane El-Khoury** (President and CEO)\nThe power stages is really a standard design cycle. We're expecting anywhere, you know, you can think about it as the 12 to 18 months qual cycle in production. Of course, that depends on end adoption. If there's any change in the roadmap, the most important thing is we're tied up on a roadmap specific with the XPU suppliers. As they ramp and deploy their new platforms, we will be ramping with them. Obviously, we are in production on ours, so that the single SPS is ahead. As we sample, our qual happens with the customer. They're kind of different stages. That's just to highlight, we have a roadmap and we have a good cadence of new products now starting to get into that AI data center space across the whole power tree from high power JFETs to really SPS close to the GPU or XPU.\n\n**Hassane El-Khoury** (President and CEO)\nWe've talked about it the last few years that we needed the new product engine to kick up. That's happening, and those are kind of the proof points that I'd like to highlight.\n\n**Quinn Bolton** (Managing Director of Equity Research)\nPerfect. Thank you, Hassane.\n\n**Operator**\nOne moment for our next question. Our next question comes from Joshua Buchalter with TD Cowen. Your line is open.\n\n**Joshua Buchalter** (Senior Equity Research Analyst)\nHey guys, thank you for taking my question. I wanted to ask about inventory levels. I believe last quarter you mentioned that you were expecting them to peak in Q2 and then decline for the rest of the year. Is that still the right way to think about inventories for the year and any amounts that you expect to take out through the balance of 2025? How should we think about utilization rates? I'm a bit surprised to see them up when you're trying to bleed inventory given revenue is up modestly in the guidance for third quarter. Thank you.\n\n**Hassane El-Khoury** (President and CEO)\nYeah, now keep in mind the utilization is flat quarter on quarter. The calculation now is 68%, but if you normalize to pre-impairment, it's 60%, right? It's flat quarter on quarter. The new calculation gets you to 68% utilized given that we have a smaller footprint and less capacity. First part of your question.\n\n**Joshua Buchalter** (Senior Equity Research Analyst)\nInventory.\n\n**Hassane El-Khoury** (President and CEO)\nOh, inventory, yeah. Inventory, yeah, we're still on track here. We think we're peaking in inventory in Q2. We think it'll be down slightly here in Q3. I would expect in Q4 we continue to see that trend as we burn through that strategic inventory. That's always been our path. Our path is that, you know, we'll bridge, that was bridge inventory for the fab transitions and silicon carbide, but we will be burning through that. That's a nice tailwind to cash flow.\n\n**Joshua Buchalter** (Senior Equity Research Analyst)\nOkay, thank you. I appreciate the color there. I'm sorry to keep picking at gross margins, but I wanted to ask about pricing. I think last quarter you mentioned, you know, pricing a bit more aggressively to defend market share. How did that develop interquarter, and any changes in the pricing environment that you've seen over the last 90 days? Thank you.\n\n**Hassane El-Khoury** (President and CEO)\nNo change to the pricing environment. It's actually stable within our expectations. There's nothing new here.\n\n**Joshua Buchalter** (Senior Equity Research Analyst)\nOkay, thank you both.\n\n**Operator**\nOne moment for our next question. Our next question comes from Gary Mobley with Loop Capital. Your line is open.\n\n**Gary Mobley** (Managing Director and Senior Equity Analyst)\nHi guys, thanks for taking my question. I believe you said roughly a $300 million revenue headwind in fiscal year 2026 or roughly 5% of revenue as you exit non-core business. How much of a headwind is it for fiscal year 2025? Should we think about it as spread over eight quarters, roughly $30 to $40 million per quarter headwind? Is it linear like that, or is there any sort of deduction?\n\n**Thad Trent** (CFO)\nYeah, for 2025, it's roughly, we're expecting about $200 million of exits. Year to date, we're on track through Q2 of $100 million. Like I said earlier, we've continued to overcall this. We think we're going to exit it faster. That pushes $100 million out into next year in terms of the exit. That is the impact of 2025.\n\n**Gary Mobley** (Managing Director and Senior Equity Analyst)\nAppreciate that. I was hoping you can give us an update on the East Fishkill bring-up, the sort of, you know, where you're at and, you know, looking forward to what the impact of gross margin might be.\n\n**Hassane El-Khoury** (President and CEO)\nYeah, so from East Fishkill, obviously it's the utilization impact overall that Thad mentioned from our fab network. East Fishkill is part of that fab network, so it comes with the utilization. The important thing is we already have our power products, our silicon power products qualified and shipping from there, high voltage and medium to low voltage. Our image sensor qualification is on track as expected. The Trayo has started, I wouldn't call it a soft ramp at 5 million units already, but that's again a brand new product that we ramped up with a brand new technology in East Fishkill. The fab is running and qualified where we want to qualify. Right now it's primarily driven by utilization. From a technology perspective, we're pretty happy with the performance.\n\n**Gary Mobley** (Managing Director and Senior Equity Analyst)\nThank you both.\n\n**Operator**\nOne moment for our next question. Our next question comes from Vijay Rakesh with Mizuho. Your line is open.\n\n**Vijay Rakesh** (Managing Director and Senior Analyst)\nYeah, hi, thanks Hassane. Just a quick question on the section 232, please. Obviously, a lot of noise around that. How are you guys preparing for that? What are you expecting in terms of, you know, when this happens? Thanks. Then follow up.\n\n**Hassane El-Khoury** (President and CEO)\nI mean, I don't know, Vijay, if anybody told you I have a crystal ball better than my peers, but I think the way we prepare for it is we remain focused on what we can't control. We're talking about our footprint, our fab footprint, our manufacturing footprint as a competitive advantage. That has been recognized by customers, especially as the whole tariff talk has been for a few quarters now. The 232, I believe, will be very similar to the changes that we have to go through with customers. The thing is, there's no planning to be done here because we don't know where it's going to land on either side, except the fact that we need to maintain flexibility and we need to maintain the focus on what we can control.\n\n**Vijay Rakesh** (Managing Director and Senior Analyst)\nGot it. In terms of silicon carbide, obviously, good to see you guys picking up some shares there. One of your peers declared bankruptcy. Just wondering how that's playing out from a business perspective. Obviously, people might be moving or reallocating, but just wondering how that's kind of playing out on the roadmap. Thanks.\n\n**Hassane El-Khoury** (President and CEO)\nYeah, look, from a roadmap perspective, that doesn't have an impact. I've always maintained my focus on we're going to win, we're going to win because of our own products and because of our own investment, not because one of our peers are struggling. We're going to win because of things we are doing. Having said that, the changes in one of our peers with the bankruptcy, obviously that is not the trigger that forced customers to think otherwise. We all know they struggled way before the bankruptcy filing. I think a lot of roadmap changes from our customer, a lot of sourcing decisions have already been made. That to me is all, I would say, part of the baseline, part of the funnel, part of the ramps. I wouldn't call the bankruptcy as a trigger.\n\n**Vijay Rakesh** (Managing Director and Senior Analyst)\nThank you.\n\n**Operator**\nOne moment for our next question. Our next question comes from William Stein with The Truist Securities. Your line is open.\n\n**William Stein** (Semiconductor and Artificial Intelligence Equity Research Analyst)\nGreat. Thank you for taking my question. I'd like to also dig into silicon carbide for a moment. I think one of the things that came out in the last quarter or so, Hassane, is that perhaps for some of your customers, there's been an interest in purchasing chips instead of modules. Modules had been the story. Now we're hearing more about trench and some other maybe aspects of individual chip design. Can you comment on that change? If customers continue to choose chips over modules, does that influence your long-term thinking about the attractiveness of this market for you? Thank you.\n\n**Hassane El-Khoury** (President and CEO)\nYeah, by the way, I guess the shift or the change in mix between modules and what we call die is not new. That's been happening for a few years. That's already part of our baseline. As far as your reference to trench, that's totally independent of die versus module. Trench is another step in device design. It was planar with our M3. Our planar performed better than everybody else's trench. We introduced and we have been winning with our new trench, which is our latest generation. We're winning because of the performance. Whether we put it in, whether we sell it to a customer as die, or we sell it to customers as a module, and we do provide both still, we win because of the performance of that die.\n\n**Hassane El-Khoury** (President and CEO)\nWe win more when we put it in our own module because we know how to design a module that fits our die specifically. A lot of our designs that are ramping, for example, even in China, are a mix of die sales or module sales. We maintain the flexibility for what the customer supply chain wants to do and what they feel their core competencies are. Some customers have core competencies to make a module, some do not, and they prefer to buy our modules. We're here to offer flexibility. We've always said our intent is always to provide the most optimal solution to solve the customer problem and bring value. Value is in range of efficiency, and that comes on the die side with our trench technology. It does not change our view of the market.\n\n**Hassane El-Khoury** (President and CEO)\nObviously, from our results and the market share that we have been gaining and ramping, we've shown success no matter what the mix is, and we'll continue to do that. The name of the game here is maintain R&D, maintain investment in key areas to provide differentiation. That's the markets we're in.\n\n**William Stein** (Semiconductor and Artificial Intelligence Equity Research Analyst)\nIf I can follow up in a similar area, one of the big consumers of silicon carbide has discussed a migration to a hybrid inverter from silicon carbide to silicon carbide combined with IGBT. I think they said that they intend to reduce SiC by 75% in that traction inverter, but I think they haven't done it yet. I wonder if you're seeing that influence your go-forward view of this market, if it changes anything for you. Thank you.\n\n**Hassane El-Khoury** (President and CEO)\nNo change. This is not, again, it's not the commentary from one customer. If you go back two years ago, in our analyst day, Simon already showed how the migration or the mix is going to be for higher end, higher range, higher performance will be silicon carbide. As you go to more mainstream, you'll end up with a hybrid all the way down to there's still life in IGBT. Those commentaries are nothing new. I've addressed them multiple times. That doesn't change our view of the market. Our competitiveness in the market is to be able to provide a slew of technologies from silicon carbide, trench, planar, all the way to highly differentiated IGBTs because some vehicles still have IGBT on one axle, silicon carbide on another axle, or full IGBT. It does not change the view of the market.\n\n**Hassane El-Khoury** (President and CEO)\nWe will continue to win based on the performance of the product specifically.\n\n**William Stein** (Semiconductor and Artificial Intelligence Equity Research Analyst)\nThanks, Hassan.\n\n**Operator**\nOne moment for our next question. Our next question comes from Harsh Kumar with Piper Sandler. Your line is open.\n\n**Harsh Kumar** (Managing Director and Senior Research Analyst)\nYeah, hey guys. Question for maybe Hassane. Hassane, as you think about the recovery and maybe the fuel for recovery, you talked about 900 basis points of underutilization. Can I ask if there's an element of written-off inventory here as well that might come into play as you look at recovery?\n\n**Hassane El-Khoury** (President and CEO)\nNo, no. When you talk about like reserve inventory or written-off inventory, no, because we have a very disciplined approach on what you reserve and what inventory we write off. Inventory we write off does not have demand. It cannot be part of the recovery. When we talk about purely the 900 basis point being on utilization, it is purely demand-driven that will drive utilization with healthy inventory that we build and ship to customers. If you recall, we saw the shift in market before a lot of our peers. We took down our utilization ahead of most of our peers and ahead of the market really softening. That puts us in a much better position from the inventory we have.\n\n**Hassane El-Khoury** (President and CEO)\nWe are already draining our inventory, and as demand picks up, we can pick up more utilization on the fab that will help the margin, help cash flow when we shift the bridge inventory. Everything we've done and the discipline we've shown all the way here is what's going to drive that healthy recovery without any kind of side notes.\n\n**Thad Trent** (CFO)\nYeah, Harsh, if you go back to our base inventory, take out the strategic, it's 121 days, right in our sweet spot, right? It's very healthy. We don't see an inventory risk on that. The strategic is just a matter of time of burning that through as demand comes back. Those are products that typically have long lives to them. We don't see, as we sit here today, a significant risk to any write-off of inventory.\n\n**Harsh Kumar** (Managing Director and Senior Research Analyst)\nUnderstood. As my follow-up, can I ask, you've got the legacy piece that you mentioned, $50 million to, I think, $150 million to $100 million you'll peel off this year. You've also got some growth areas, which you call as other, that are showing outsized growth. I was curious if you can help us understand what are the major components of the other outside of the AI data center piece and then maybe how big it is.\n\n**Hassane El-Khoury** (President and CEO)\nYeah, look, the primary focus for the others bucket that I will talk about is really the AI data center. We have some client computing there, a very small part of our business. That's why we put it in other. We're not breaking those out. As far as AI data center, it's still showing a lot of growth. It's showing per expectations because we're investing in that business. As we get more and more into that business and it becomes sizable, we may talk about it more in more detail. For now, we're just keeping it in other, and that's really the driver for the growth you're seeing there.\n\n**Harsh Kumar** (Managing Director and Senior Research Analyst)\nOkay, fair enough. Thanks, guys.\n\n**Operator**\nLadies and gentlemen, this concludes the Q&A portion of today's conference. I will now turn the call back over to Hassane El-Khoury, President and CEO, for any closing remarks.\n\n**Hassane El-Khoury** (President and CEO)\nThank you all for joining us. I want to take a moment to thank our global teams for their relentless execution, our customers for their continued partnership, and our shareholders for their ongoing support. Together, we are building a more resilient and higher quality business, and I'm confident that the strategic progress we've made this quarter positions ON Semiconductor for long-term success. Thank you.\n\n**Operator**\nLadies and gentlemen, this concludes today's presentation. You may now disconnect and have a wonderful day.",
      "fetched_at": "2026-02-04T15:46:25.141Z"
    },
    {
      "ticker": "ON",
      "title": "ON Semiconductor Corporation (ON) Q1 FY2025 earnings call transcript",
      "published_date": "May 5, 2025, 9:00 AM EDT",
      "fiscal_year": "2025",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/ON/earnings/ON-Q1-2025-earnings_call-314426.html",
      "content": "**Operator**\nGood day and thank you for standing by. Welcome to the Onsemi First Quarter twenty twenty five Earnings Conference Call. At this time, participants are in a listen only mode. After the speakers' presentation, there will be a question and answer session. Please be advised today's conference is being recorded.\n\n**Operator**\nI would now like to hand the conference over to your speaker today, Parag Agarwal. Please go ahead.\n\n**Parag Agarwal** (Vice President, Investor Relations and Corporate Development)\nThank you, Kevin. Good morning, and thank you for joining Onsemi's first quarter of twenty twenty five results conference call. I'm joined today by Hassan Al Khoury, our President and CEO and Thad Tran, our CFO. This call is being webcast on the Investor Relations section of our website at www.onsemi.com. A replay of this webcast along with our first quarter earnings release will be available on our website approximately one hour following this conference call and the recorded webcast will be available for approximately thirty days following this conference call.\n\n**Parag Agarwal** (Vice President, Investor Relations and Corporate Development)\nAdditional information is posted on the Investor Relations section of our website. Our earnings release and this presentation include certain non GAAP financial measures. Reconciliation of these non GAAP financial measures to the most directly comparable GAAP financial measures and a discussion of certain limitations when using non GAAP financial measures are included in our earnings release, which is posted separately on our website in the Investor Relations section. During the course of this conference call, we will make projections or other forward looking statements regarding future events or the future financial performance of the company. We wish to caution that such statements are subject to risks and uncertainties that could cause actual events or results to differ materially from projections.\n\n**Parag Agarwal** (Vice President, Investor Relations and Corporate Development)\nImportant factors that can affect our business, including factors that could cause actual results to differ materially from our forward looking statements are described in our most recent Form 10 ks, Form 10 Qs, and other filings with the Securities and Exchange Commission and in our earnings release for the first quarter. Our estimates or other forward looking statements might change and the company assumes no obligation to update forward looking statements to reflect actual results, changed assumptions, or other events that may occur except as required by law. Now, let me turn it over to Hassan. Hassan?\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nThank you, Parag. Good morning and thanks to everyone for joining us on the call. Despite a challenging macroeconomic landscape, we delivered Q1 revenue of $1,450,000,000 and non GAAP earnings per share of $0.55 both exceeded the midpoint of our guidance with non GAAP gross margin of 40%. Our focus remains on streamlining our operations through our fab right approach and investing in R and D to deliver differentiated products to our customers. Both initiatives aim to deliver gross margin expansion as the market recovers.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nIn an uncertain geopolitical environment, our manufacturing network is a source of competitive advantage as we have proactively established a flexible and geographically diversified supply chain for our customers that not only enhances supply resilience, but also reduces our risk exposure. With 19 front and back end facilities in addition to our external network, we are well positioned to respond effectively to tariff related concerns. Based on our understanding of current tariff policies, our expectation is that there will be minimal direct impact to our business. At this time, we expect no major issues in servicing our global customer base and are assisting these customers to minimize their impact by optimizing our supply chains. Although we began to see early signs of stabilization with favorable booking trends towards the end of the first quarter in certain parts of the industrial market, inventory digestion persists and customers remain cautious as I described last quarter.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nWhile customers optimize their working capital in this extended downturn, we have used pricing to defend or increase share in strategic areas over the long term and expect low single digit pricing decline in certain parts of our business. On the revenue side, following a strong Q4, our automotive revenue in the first quarter declined 26% sequentially, in line with our expectations. Our industrial revenue was better than expected, decreasing only 4% sequentially. The traditional parts of the industrial market are starting to show signs of recovery. You'll recall this was the first part of industrial to show signs of weakness going into the downturn.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nMedical and Aerospace and Defense also increased sequentially and our AI data center revenue, which we report as part of our other bucket, more than doubled year over year in the first quarter. Our differentiated intelligent power and sensing solutions enable us to deliver the performance and power efficiency that our customers need to thrive in their space. Through the downturn, we continued investing to diversify our portfolio and deliver differentiation as the market landscape continues to evolve. In automotive, while inventory digestion persisted in the first quarter, leading OEMs are adopting our silicon carbide in their next platform architectures. We have extended our technology leadership with our fourth generation ELISAQ MOSFET devices based on trench architecture.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nWe have already secured a new seven fifty volt plug in hybrid electric vehicle or PHEV designed with one of our major U. S. Automotive OEMs. This signals the beginning of a transition from silicon to silicon carbide in new PHEV platforms to extend vehicle range and reach a broader customer base, adding to our penetration in full battery electric vehicles or BEVs, where we continue to gain share over incumbents. Based on the latest electric vehicle launches in China, most of which were unveiled last week at the Shanghai Auto Show, we expect to have our silicon carbide in nearly 50% of the new models.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nMost of these new models are set to ramp in late twenty twenty five, including a PHEV with our silicon carbide. Broader adoption of SiC and PHEVs is expected over the next few years as OEMs redesign hybrid platforms to meet tightening global emission standards and capitalize on the performance offered by silicon carbide technology to extend the range. We're also winning with our image sensors in automotive applications, which continue to be a differentiator for Onsemi. The superior performance of our technology makes Onsemi the partner of choice for the top automakers. In the first quarter, we began shipments of our eight megapixel image sensor to the leading OEM in China with a global footprint where we expect to be designed into ADAS systems for their low, mid and high end vehicles.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nAnother OEM based in Asia has selected our eight megapixel image sensor for their next generation ADAS platform. In AI data center, we continue to make progress in our strategy by leveraging our strengths in intelligent power. Silicon carbide and silicon powered devices anchor that strategy and are instrumental in every branch of the power tree. At the entry point of power into the data center, we are capitalizing on the transition to modular UPS systems with our ELISAQ power module solutions, delivering higher efficiency and power density than traditional silicon solutions. We are shipping to the three largest UPS suppliers, and with a new platform win that began ramping in Q1, we expect our revenue for UPS to grow between 4050% for the full year over 2024.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nWithin the power supply unit and the battery backup unit, our silicon carbide JFET combined with our T10 trench FETs to create a winning high power AC to DC solution. SIG JFETs are essential in the transition from three kilowatt to five kilowatt PSUs required in the next generation architecture, and only ON Semi has this distinctive technology. SIG JFET is superior in these high current solutions, because it offers the lowest on resistance in a given footprint. Similarly, our T10 MOSFETs offer industry leading ultra low RDS on and reduced switching losses. We are ramping with a large U.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nS. Hyperscaler securing the majority share in their PSU and BBU. We are expanding our portfolio of power solutions using a combination of FETs and power management ICs to address the intermediate bus conversion and V Core branch of the PowerTree. With the launch of our Trejo platform last November, we introduced our expanding portfolio, including voltage translators, LDOs, ultra low power analog front ends, ultrasonic sensors, multi phase controllers for clients, and single pair Ethernet controllers for automotive zonal architecture applications. Advancements through the Treo platform are enabling us to accelerate development and deliver innovative solutions to our customers across automotive, medical, industrial and AI data center markets at accretive margins.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nWe have already recognized diverse production revenue from the Treo platform and are well on our way to doubling the number of products available year over year as we build the franchise towards delivering on our $1,000,000,000 commitment by 02/1930. As we look ahead, while the semiconductor industry is navigating complex macroeconomic factors, there is an increasing need for semiconductors to improve power efficiency and sensing capabilities in rapidly evolving sectors like AI data centers, automotive and industrial. Through this downturn, we have maintained our strategic direction and we have continued to deliver value to our customer base on the performance of our technology. We are focused on operational excellence and are well positioned for recovery with gross margin expansion as we continue to realize the benefit of our Fab Right initiatives. Let me now turn it over to Thad to give you more detail on our results and approach going into the second quarter of twenty twenty five.\n\n**Thad Trent** (EVP &amp; CFO)\nThanks, Hassan. While it was a challenging start to the year, continuing to focus on operational excellence has allowed us to drive cost out of our operations to focus on free cash flow generation. We exceeded the midpoint of our guidance with revenue of $1,450,000,000 and non GAAP earnings per share of $0.55 while Q1 free cash flow increased 72% year over year. We increased our share buyback to 66% of free cash flow, repurchasing $300,000,000 of shares in the first quarter. With our large capital investment behind us, we are confident in our liquidity and strong balance sheet and believe returning capital to shareholders is the best use of capital.\n\n**Thad Trent** (EVP &amp; CFO)\nFor 2025, we intend to increase our share repurchase to 100% of free cash flow. As of today, there is approximately $1,500,000,000 remaining on our repurchase authorization, and we expect free cash flow will remain strong with the cost control actions we have taken, aggressive working capital management and limited capital investments. Last quarter, I told you that we would be moving aggressively and with urgency in making structural changes to expand gross and operating margins and generate strong free cash flow in the future. In the first quarter, we took two significant steps to benefit the company in the long term and better position us for a market recovery. First, as part of our FabRite initiative, we reduced our internal fab capacity by 12% through our manufacturing realignment program to lower our fixed cost structure.\n\n**Thad Trent** (EVP &amp; CFO)\nThese actions will reduce our ongoing depreciation cost by approximately $22,000,000 on an annualized basis, and we expect to see the benefit on the income statement in Q4 of this year. We'll continue to rationalize our manufacturing footprint, gross margin expansion towards our long term target and providing greater leverage in our business model as the market recovers. The second action in Q1 was a company wide restructuring initiative. We made the difficult decision to reduce our global workforce by 9% and further reduce our non manufacturing sites, driving sustainable efficiencies across the company. These actions are expected to generate approximately $25,000,000 of savings in Q2 versus Q1, with an additional $5,000,000 per quarter of savings realized in the second half of the year.\n\n**Thad Trent** (EVP &amp; CFO)\nThese actions are structural rather than temporary, and will drive incremental leverage in both gross and operating margin for the long term. Coupled with our lower capital intensity, we remain on track to our targeted 25% to 30 free cash flow margin for the year. Turning to financial results for the quarter, a slowdown in demand across all end markets resulted in revenue of $1,450,000,000 above the midpoint of our guidance. Automotive and Industrial accounted for 80% of revenue in the first quarter. Automotive revenue was $762,000,000 which decreased 26% sequentially, driven by weakness in Europe and seasonality in Asia, mainly in China due to Chinese New Year.\n\n**Thad Trent** (EVP &amp; CFO)\nRevenue for the Industrial was $400,000,000 down 4% sequentially, while our Medical and Aerospace and Defense businesses continue to grow, Traditional and Industrial remained stable. Outside of Auto and Industrial, our other businesses increased 1% quarter over quarter, mainly driven by client computing business offset by normal seasonality in wireless. Looking at the first quarter split between the business units, revenue for the Power Solutions Group or PSG was $645,000,000 a decrease of 20% quarter over quarter and 26% year over year. Revenue for the Analog and Mixed Signal Group or AMG was $566,000,000 a decrease of 7% quarter over quarter and a decrease of 19% year over year. Revenue for the Intelligent Sensing Group or ISG was $234,000,000 a 23% decrease quarter over quarter.\n\n**Thad Trent** (EVP &amp; CFO)\nISG revenue decreased 20% over the same quarter last year. Turning to gross margin in the first quarter, GAAP gross margin was 20.3%, which includes restructuring charges as a part of our manufacturing realignment program. Non GAAP gross margin was 40%, down five thirty basis points sequentially and five ninety basis points from the quarter a year ago. Non GAAP gross margin declined in line with guidance due to the lower revenue and under absorption with lower utilization levels over the last few quarters. Manufacturing utilization increased slightly from 59% in Q4 to 60%, which does not include any impact from our capacity reduction actions.\n\n**Thad Trent** (EVP &amp; CFO)\nNow, let me give you some additional numbers for your models. GAAP operating expenses for the first quarter were $868,000,000 as compared to $328,000,000 in the first quarter of twenty twenty four. GAAP operating expenses increased sequentially as it includes restructuring charges of $539,000,000 Non GAAP operating expenses were $315,000,000 compared to $314,000,000 in the quarter a year ago. GAAP operating margin for the quarter was negative 39.7% and non GAAP operating margin was 18.3%. Our GAAP tax rate was 13.5% and non GAAP tax rate was 16%.\n\n**Thad Trent** (EVP &amp; CFO)\nDiluted GAAP earnings per share for the first quarter was a loss of $1.15 as compared to earnings of $1.4 in the quarter a year ago. Non GAAP earnings per share was $0.55 as compared to 1.8 in Q1 of twenty twenty four. GAAP diluted share count was $421,000,000 shares and our non GAAP diluted share count was $422,000,000 shares. Turning to the balance sheet, cash and short term investments was $3,000,000,000 with total liquidity of $4,100,000,000 including $1,100,000,000 undrawn on our revolver. Cash from operations was $6.00 $2,000,000 and free cash flow increased 72% year over year to $455,000,000 representing 31% of revenue.\n\n**Thad Trent** (EVP &amp; CFO)\nCapital expenditures during Q1 were $147,000,000 Inventory was down quarter over quarter on a dollar basis by $164,000,000 and increased by three days to two nineteen days. This includes one hundred days of bridge inventory to support fab transitions in silicon carbide. We expect this inventory to peak in the second quarter. Excluding the strategic builds, our base inventory is healthy at one hundred and nineteen days. Distribution inventory declined another $27,000,000 with weeks of inventory increasing to 10.1 versus 9.6 in Q4.\n\n**Thad Trent** (EVP &amp; CFO)\nOur plan to support the mass market has continued to pay dividends, resulting in another 29% increase in customer count year over year. We do not expect a material change in the weeks of inventory over the near term. Looking forward, let me provide you the key elements of our non GAAP guidance for the second quarter. As a reminder, today's press release contains a table detailing our GAAP and non GAAP guidance. First, our guidance is inclusive of our current expectation that there is no material direct impact of tariffs announced as of today.\n\n**Thad Trent** (EVP &amp; CFO)\nGiven our current visibility, we anticipate Q2 revenue will be in the range of $1,400,000,000 to $1,500,000,000 Our non GAAP gross margin is expected to be between 36.538.5%, which includes share based compensation of $8,000,000 Our second quarter guide includes 900 basis points of non cash under absorption charges and we expect utilization to decline slightly in Q2. Approximately half of the sequential gross margin decline is from the increased under absorption in Q2 and the remaining is attributable to unfavorable pricing as we are seeing low single digit price declines. Moving on to non GAAP operating expenses, we expect OpEx to be in the range of $285,000,000 to $300,000,000 including share based compensation of 29,000,000 We expect our non GAAP other income to be a net benefit of $11,000,000 with our interest income exceeding interest expense. We expect our non GAAP tax rate to be approximately 16% and our non GAAP diluted share count is expected to be approximately $419,000,000 shares. This results in non GAAP earnings per share to be in the range of $0.48 to $0.58 We expect capital expenditures in the range of 70,000,000 to $90,000,000 We took difficult steps in the first quarter to right size and refocus the company on the key drivers to achieve our long term ambitions.\n\n**Thad Trent** (EVP &amp; CFO)\nBy continuing to lean into our fab right strategy and focus on higher value product lines, we are committing to building a solid foundation that will be a tailwind when the macro environment becomes more robust. In the meantime, we will remain cautious in our approach and position ourselves to capitalize in the future on strong customer relationships with our intelligent power and sensing platforms. With that, I'll turn the call back over to Kevin to open up the line for Q and A. Thank you.\n\n**Operator**\nOur first question comes from Ross Seymore with Deutsche Bank. Your line is open.\n\n**Ross Seymore** (Managing Director)\nHi, guys. Thanks for letting me ask the question. I guess my first one on the revenue side of things. You guys have been consistent with your conservatism, but the flat guide seems to be a bit below the kind of up low single to high single digit sequential growth that your peers are seeing. Is there anything structurally different at ON that would keep you from experiencing the same sort of upturn that others have started to allude to?\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nHey, Ross. No, it's not really structural. It's really depending on the end markets that we versus our peers are exposed to. As you know, we have a big focus on automotive for EV specifically. EV outside of China still has not seen the recovery.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nChina, as I've mentioned, we've gotten a lot of the wins. That's where most of the ramp is happening in the second half of twenty twenty five. So other than just within the markets, whether you're broad or more focused on submarkets like we are for the EV, that's the only thing I could point to.\n\n**Ross Seymore** (Managing Director)\nAnd for my follow-up, perhaps for Thad, on the gross margin side of things. The charge that you took and then generally looking forward, how what are the metrics we should use to think about gross margin? You've been very overt with your second quarter. But what do we think about, say, half or relative to revenue growth? How much of it is just utilization based, absorption based?\n\n**Ross Seymore** (Managing Director)\nOr are there many ideals that Aon has? Just any metrics to help us hone in on that would be great.\n\n**Thad Trent** (EVP &amp; CFO)\nYes. So, as I mentioned, we took about 12% of our capacity offline, and that was late in the first quarter. So, you didn't really see much of an impact of that in the first quarter. As we go forward with this new footprint, the incremental as utilization goes up for every point of utilization, it's now 25 to 30 basis points of gross margin improvement. Previously that was 20 to 25.\n\n**Thad Trent** (EVP &amp; CFO)\nSo it's increased because of taking that capacity offline. As I mentioned, there's about $22,000,000 of depreciation savings on an annualized basis. We'll start to see that hitting the P and L in Q4 just because of the lag with the inventory bleed, it takes time for that to hit. But as we go forward, the gross margin expansion in the short term is all about utilization. So as the market recovers, utilization will go up.\n\n**Thad Trent** (EVP &amp; CFO)\nNow we are expecting utilization to go down slightly here in Q2. But if we based on early signs of stabilization recovery, we're hoping that we'll see some improvement later in the year. And then we'll see that impact hitting us in late twenty twenty five and in 2026.\n\n**Ross Seymore** (Managing Director)\nThank you.\n\n**Operator**\nOne moment for our next question. Our next question comes from Vivek Arya with Bank of America. Your line is open.\n\n**Vivek Arya** (Managing Director)\nThanks for taking my question. I had a question on pricing. I think Hassan or Tad, in the past you had mentioned your pricing to value, right, and suggested that pricing could stay kind of more resilient. But now I think you're suggesting that pricing could be a headwind, that it could go down low single digit. And I'm curious, you know, what has changed?\n\n**Vivek Arya** (Managing Director)\nIf anything, is it a geographic issue? Is it a product? Is it a competitive headwind? Just, you know, what has changed on the pricing side? And how much of this flat Q2 sales is because of pricing?\n\n**Vivek Arya** (Managing Director)\nAnd then how much is pricing a headwind when we look at the back half of the year?\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nYes. So what changed, obviously, we've been in this downturn. It's a very extended downturn. And we have to react to market condition or competitive threats that some of our competitors are using pricing. And we are going to use the pricing to defend and increase share in forward looking programs.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nSo I don't see that as my comments as going back to the old pricing ways, whereas the first quarter obviously, it's not in the first quarter for us, it's the second. So it's not a plan that I can give you what it is by quarter or what it is for the second half. We're using it as a tool. We have forward looking programs that are actually beneficial from a gross margin perspective that we will defend or even penetrate and increase share based on pricing decisions we make today. So, we are going to take it as a tool, but it is a different environment we are operating in.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nIt's not geographical, it is not specific to a product, it's really what I would call is more opportunistic approach to it. From the revenue side, I wouldn't read any more into from the revenue in Q2. It's not the revenues specifically or the top line, it's more on demand driven. It is not really on the pricing impact specifically.\n\n**Vivek Arya** (Managing Director)\nOkay. And then, my follow-up question, I think, Pat, you mentioned something on gross margin. When we look at Q2, the low end is 36.5%. And I think you mentioned that some of it was because of under absorption and some of it was pricing. So, if we start to hypothetically see sales grow from Q3 and Q4, what should be the new range of gross margins that we should be thinking about for the back half of the year?\n\n**Vivek Arya** (Managing Director)\nLike even a broad range, I think, would be useful in kind of aligning the models. Thank you.\n\n**Thad Trent** (EVP &amp; CFO)\nYeah. So, as I was saying earlier, the impact of utilization is about a two quarter delay for it to hit the P and L, right, as you've got to burn through roughly two hundred days of inventory to see that benefit. So it takes about two quarters for that to impact. Given that we're expecting Q2 utilization to step down here slightly in Q2, that'll be a little bit of a headwind. So if you think about the rest of this year, we're likely going to be kind of in this, let's use the midpoint of our guidance, kind of in this range.\n\n**Thad Trent** (EVP &amp; CFO)\nAgain, we think that this is temporary, it's utilization driven. If you take that 900 basis points of under absorption, you add it to guide that gives you an indication of kind of where our standard margins in and kind of where we think sustainability is in the short term. But for the remainder of this year, I think we're going to be kind of in this kind of tight range here with improvement coming, assuming that utilization does improve as the market recovers later in the second half. So I think there's a nice tailwind going forward. I think for the next couple of quarters, are kind of in this, let me call it 37.5%, thirty eight % range, depending on utilization.\n\n**Vivek Arya** (Managing Director)\nThank you.\n\n**Operator**\nOne moment for our next question. Our next question comes from Chris Danely with Citi. Your line is open.\n\n**Christopher Danely** (Analyst)\nHey, thanks guys. So given the pricing environment and you're saying you're using pricing to defend market share, can you just give us an update on that $350,000,000 to $400,000,000 non core business that you're going to exit? Is that still the plan? Has the size of that changed? How rapidly do you think you're going to exit that this year?\n\n**Christopher Danely** (Analyst)\nOr will you try and defend your market share and use pricing on that business? Thanks.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nYes. So what I specifically on the pricing, we still expect to exit that. We've always said this is more market dependent than anything else. I do include some of the pricing in there, just to offset some of the utilization in the short term. But it is not on that specific, what I would call the non core exits that we are planning.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nWe're not defending it to the point where we want to keep it. You can think about it as it helps with utilization. We'll modulate it in the short term, but our expectation remains.\n\n**Thad Trent** (EVP &amp; CFO)\nYes. And Chris, I would add, in the first quarter, we walked away from about $50,000,000 of that business. We still think that $300,000,000 is probably the likely number for the year. It will be market dependent. If we can hold margins on that in a favorable range, we will keep it.\n\n**Thad Trent** (EVP &amp; CFO)\nSo I think it's really going to be dependent on what how the market plays out and the recovery plays out.\n\n**Christopher Danely** (Analyst)\nOkay, great. And for my follow-up, it sounds like there's some nice momentum on silicon carbide exiting this year. Any update on, I guess, the long term growth rate you're expecting there? And then how about the gross Do you still think you can get that business to 50%?\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nYes. From a long term range, obviously, we're not guiding. We're still expecting growth. We're expecting to be the market share leader in that business based on the traction we've had today and really the wins in the outlook of the wins, just the ones we're ramping in 2025. I mentioned some of the trends for going to the plug in hybrids with silicon carbide.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nWe have been penetrating that, which will ramp in the outer years. So the outlook remains unchanged. We're still very bullish about the prospects of our silicon carbide within that market and the position we will keep and gain. As far as gross margin, we do believe that the gross margin today, the gross margin is really more impacted by the underutilization. If you recall, we added the capacity for the market that didn't really turn out.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nWe modulated a little bit on the capacity that we kept online. But from a standard margin perspective, we are still pricing on value. And as we grow into the capacity that we installed, we still believe we have the best cost structure in the industry.\n\n**Christopher Danely** (Analyst)\nThanks Hassan.\n\n**Operator**\nOur next question comes from Joshua Buchalter with TD Cowen. Your line is open.\n\n**Joshua Buchalter** (Director - Equity Research)\nHey, guys. Thank you for taking my question. For my first one, I kind of want to look backwards. I mean, entering the year, you guys called out that I think demand had gotten appreciably worse. It looked like in the quarter, things tracked to where you were expecting.\n\n**Joshua Buchalter** (Director - Equity Research)\nBut your peers didn't didn't really flag all that much of a demand deterioration in the quarter. Can you maybe look back and reflect on what's happened over the last few months in particular for On Semi? And in particular, was this in your view an inventory issue that you guys needed to clean up or were there legitimate pockets of demand that weakened? Thank you.\n\n**Thad Trent** (EVP &amp; CFO)\nYeah, look, the quarter played out pretty tightly, I mean, to what we expected. We were above the midpoint of our guidance. The industrial was more favorable than we expected. Automotive was right on to what we expected going into the quarter. And our other business, small piece of it, small piece of the total was favorable as well-being up 1%.\n\n**Thad Trent** (EVP &amp; CFO)\nSo I think in terms of what we saw within the quarter, it pretty much came in line with what we expected. We did see some early signs of stabilization in the industrial market, specifically like the traditional industrial side of that business. There are some pockets that are still down, but we took that as a favorable sign coming out of the quarter. Now, there is uncertainty, given the tariff situation, but there's some early signs of stabilization, which gives us some hope.\n\n**Joshua Buchalter** (Director - Equity Research)\nOkay, thank you. Then I was also hoping for a little more, can you maybe explain a bit of what's in the $283,000,000 restructuring charge that was in gross margin? Was that primarily inventory write downs? And could you speak to sort of how you're thinking about your on books and channel inventory now? Thank you.\n\n**Thad Trent** (EVP &amp; CFO)\nYes. Okay, there's a lot there. So, on the restructuring, we did a restructuring and then we also did a capacity reduction as well. So, impairment of some of our assets. What hit the gross margin line was as a part of the manufacturing realignment program, we did take inventory out as we took capacity out in some of the areas as we're defocusing there and as our manufacturing footprint changed.\n\n**Thad Trent** (EVP &amp; CFO)\nSo we had some consumables and other inventory that we took as a part of that charge. What hit the OpEx line obviously was restructuring charges associated with more of the restructuring activity rather than the FabRite activities.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nOn the distribution, there's no change in our distribution. Obviously, we're taking a very disciplined approach to channel inventory. Although the weeks are, call it flattish around the ten, which is the sweet spot of where we believe we're going to be long term. We said between nine and eleven weeks. We actually drained dollars out of the channel as we remain cautious on the outlook.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nObviously, for our distribution inventory, we're always cautious not to ship in more than what we can see demand for, and we'll remain disciplined on that. So, no change and no impact to the DC inventory.\n\n**Thad Trent** (EVP &amp; CFO)\nYeah, and then on the inventory in the balance sheet, we have two nineteen days. It did go down by $164,000,000 Part of that is the write off that we took as a part of the restructuring activities. But if you look at our base inventory, exclude the fab transitions and silicon carbide, it's at one hundred and nineteen days. So it's healthy, our target has always been one hundred to one hundred and twenty days, so we're within that target. I expect inventory will be peaking here in the second quarter and will start to drain in Q3 and Q4 as the fab transitions continue to get executed and we stop buying from the divested fabs that we divested a few years ago. So inventory should be peaking here.\n\n**Joshua Buchalter** (Director - Equity Research)\nOkay, thank you. I apologize for my three for one question.\n\n**Operator**\nOne moment for our next question. Our next question comes from Blayne Curtis with Jefferies. Your line is open.\n\n**Crawford Clarke** (Senior Equity Research Associate)\nHi, this is Crawford Clark on for Blayne Curtis with Jefferies. Thanks for taking my question and congrats on the results. I wanted to ask about the industrial segment. I think you've talked a little bit about it thus far in response to some other questions. But it sounds like some of your competitors are talking about maybe a little bit more of a broad based recovery in their end markets.\n\n**Crawford Clarke** (Senior Equity Research Associate)\nI know you mentioned some strength in aerospace and defense and medical, but was hoping you might be to put a finer touch on some of the trends you're seeing outside of those two sub segments. Thanks.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nYes, obviously, I can only focus and comment on the markets or the submarkets in industrial we're focusing on strategically and not as a broad base, because we're not a broad based industrial supplier. So I would say outside of some of the energy infrastructure, everything is up. So I would say broadly, it is starting to see signs of recovery. That's what Thad said, including some of the, what we call the consumer side of industrial. And if you recall, that was the first one that actually went into the downturn.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nSo we're starting to see signs of recovery there. So from a green shoot and stabilization perspective, we're actually more positive about industrial now. There's a few pockets, but again, there's still uncertainty given just the geopolitical environment and the tariffs. Outside of that, we do see stabilization and we do see signs of that recovery.\n\n**Crawford Clarke** (Senior Equity Research Associate)\nGot it. Very helpful. And then if you could just talk a little bit about your expectations for demand within the automotive segment by geography. I know people are calling out strength. In China.\n\n**Crawford Clarke** (Senior Equity Research Associate)\nObviously, quarter was a little bit tougher given some trends related to Chinese New Year, but if you could talk again about your expectations for demand in auto by geography?\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nYes. Same thing.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nWe do see strength in China automotive specifically driven by EVs, and for us it's driven by new ramps for silicon carbide as I've mentioned. Coming out of the Shanghai Auto Show, we do see the models that we are in, the models that are going to production. We said we're about 50% of these new models that are ramping. We expect that to start ramping in the second half.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nTherefore, our automotive market, China specifically, other regions, we'll see. But from a positive outlook, I would say China automotive and China EV is the focus, and we see that as remaining favorable. Yes. And let me give\n\n**Thad Trent** (EVP &amp; CFO)\na little more color to your first question on the guidance going forward. We expect industrial and the other bucket both to be up kind of mid to high single digits quarter on quarter. We think auto is going to be down, again, just as Sasan talked about kind of in that high single digit percentage as well. But to your point, we're seeing industrial strength and we're seeing it continue in the second quarter.\n\n**Crawford Clarke** (Senior Equity Research Associate)\nGreat. Thanks, guys.\n\n**Operator**\nOne moment for our next question. Our next question comes from Quinn Bolton with Needham and Company. Your line is open.\n\n**Quinn Bolton** (Senior Analyst)\nHey guys, I think before your capacity actions, you guys had sized the business to have a 45% gross margin at $1,700,000,000 of revenue at a 65% utilization rate. Post the fab capacity actions you've taken, are there new metrics you can give us sort of just to help level set as demand recovers, utilizations recover where gross margins could go over the next year or two?\n\n**Thad Trent** (EVP &amp; CFO)\nWell, yes, I think I gave the data point earlier that every point of utilization is now 25 to 30 basis points of gross margin improvement. So if you think about us today, roughly at 60% stepping down slightly in the second quarter in terms of utilization, you can do the math getting back up to 85%. I also gave the data point that we're the gross margins in Q2 are expected to be negatively impacted by 900 basis points of under absorption. So, as I said, the gross margin is going to be driven by utilization in the short term.\n\n**Quinn Bolton** (Senior Analyst)\nGot it. But the standard, I guess, then utilization or standard gross margin would be about 46.5%, right? If I take the midpoint of the range, add that 900%, that's where you would sort of get back to as utilizations increase. But is that utilization getting back to 65%, seventy five %? Or should we just use the 25 to 30 basis points?\n\n**Quinn Bolton** (Senior Analyst)\nRight. Of utilization is that as and assume that's pretty linear.\n\n**Thad Trent** (EVP &amp; CFO)\nYeah, that's right. That's right. So 25 to 30 basis points is the right move. The 900 basis points is assuming you get back to fully utilized, right? So that'll take us a while to get there, but your math is absolutely right.\n\n**Quinn Bolton** (Senior Analyst)\nOkay. Great. Thank you.\n\n**Operator**\nOne moment for our next question. Our next question comes from Gary Mobley with Loop Capital. Your line is open.\n\n**Gary Mobley** (Managing Director &amp; Senior Equity Analyst)\nHi, guys. Thanks for taking my question. Hassan, you've highlighted a couple of times a 50%, win rate for silicon carbide based models introduced in the Shanghai Auto Show recently. It sounds very impressive, but maybe if you could just establish a little more context, you know, in terms of what market share position you're coming from. Obviously, that's a huge market opportunity and just sort of size the dollar impact that that can eventually translate into.\n\n**Gary Mobley** (Managing Director &amp; Senior Equity Analyst)\nAnd did you have to concede on pricing against some of the China for China suppliers to win that business?\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nYeah. So first, from a market share perspective, we do expect that 50%, specifically in China. If you notice, it's the only really EV market that is growing with the 800 volt focus 800 volt battery, which yields to a 1,200 volt silicon carbide device. We do maintain the share there. We see that share increasing.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nObviously, I'm not giving a guidance on the dollars until the customers start ramping. We do see a big ramp in the second quarter already, and that will continue through the second half of the year. So, we do see those programs ramping. When I say we see it, we see it in the backlog. We're starting to prep for those shipments.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nSo, from a market penetration, I think we can say we have well penetrated the market. It is not a pricing discussion. It is more of a capability discussion. It's not really competing with the local. You mentioned China for China or local vendors for silicon carbide.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nOur competition in China specifically is really more with our standard peers, our global peers rather than the local, because we're still ahead on performance. I made the brief comment in the call. We introduced our trench or sampled our trench, and we're going to start to see as the new wave of these products to go to market, we'll start revenue on our trench in 2026. So, we have a very strong roadmap on silicon carbide. It is not specifically related to pricing.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nIt is more on performance of the product, which ends up saving a ton of money for our customers on their system level side, whether it's lower batteries or smaller system cost. That's the reason we win. And like I said, we've maintained and increased our share in China, and we'll continue to do that. It's a big focus market for us.\n\n**Gary Mobley** (Managing Director &amp; Senior Equity Analyst)\nThanks, Sasan. Just a quick follow-up. It sounds like, and correct me if I'm wrong, that OpEx could trend down maybe another $5,000,000 per quarter off that $292,500,000 base that you're guiding to for the second quarter?\n\n**Thad Trent** (EVP &amp; CFO)\nYes, that's right. You'll get about $5,000,000 per quarter in Q3 and Q4.\n\n**Gary Mobley** (Managing Director &amp; Senior Equity Analyst)\nGot it. Thank you.\n\n**Operator**\nOne moment for our next question. Our next question comes from Vijay Rakesh with Mizuho. Your line is open.\n\n**Vijay Rakesh** (Managing Director)\nYeah. Hi, Hassan. Just a quick question on the pricing side. Is that commentary on pricing specific to on or is that what you're seeing in the industry? If you could give us some color on silicon versus silicon carbide, what do you see in terms of pricing?\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nI have a follow-up. Yeah, I don't believe the pricing is ON specific. I think a lot of my peers have talked about it. A lot of my peers have talked about it in the context of the annual price negotiations and so on. I talk about it a little differently.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nI talk about it as a pocket of pricing in order to maintain or even increase our share, especially in the outlook given where most of our customers are. So it's not something specific, and it is not related to silicon or silicon carbide specifically. I'm not breaking it down to that because we are using it as tool. Now one thing on the pricing as well, a lot of people fail to also look at along with any of these low single digit pricing declines that we talked about, we're working on cost improvements for our products as well, which are usually at that range or slightly above. So forward looking, as we gain the share and we ramp, we are expecting to offset most of the pricing declines with cost actions.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nThat's why we feel comfortable doing it in the short term to maintain and grow the share. But in the long run, we usually we've always offset any pricing discussions with cost actions. And you've seen the cost actions today with the fab realignment or capacity realignment discussions that we've had. We're going to continue to do that. I'm not seeing it as a concerning approach or concerning sign. It doesn't change our trajectory in the gross margin. We still have very strong gross margin expansion opportunities ahead of us.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nThat's why we are setting up the company for. And as the market recovers, you're to start seeing all of that come through the P and L.\n\n**Vijay Rakesh** (Managing Director)\nGot it. Thanks. And just a quick follow-up on the auto side, the high single digit percent down sequentially. Is that so are you seeing some headwinds from the auto tariffs or auto parts? Or Can you give us some more color on that? Thanks.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nYeah, look, we said we don't have a direct impact on the tariff for our business. That's the only thing I can comment on at this point, because look, the tariff is one day yes, one day no. It's too soon to talk about any impact indirect impact, meaning to us, therefore an impact to our customers. That's too soon to call that. That's where we, in our guide, we talked about we remain cautious.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nBased on what we know today, there's no direct impact. However, there could be indirect impact, but that is a time based question, which I don't have an answer to. That's therefore the best thing I can give you is our cautiousness in the guide and our outlook.\n\n**Thad Trent** (EVP &amp; CFO)\nWe also haven't seen any material pull ins or push outs as it relates to tariffs. So, as Hassan said, no direct impact, indirect over long term, we'll see what happens. But in the short term, we haven't seen any customer activity that would give us concern.\n\n**Vivek Arya** (Managing Director)\nGot it. Thanks.\n\n**Operator**\nOne moment for our next question. Our next question comes from Harlan Sur with JPMorgan. Your line is open.\n\n**Harlan Sur** (Executive Director - Equity Research)\nGood morning. Thanks for taking my question. Your shipments to direct customers were better for the second consecutive quarter. In fact, over the past two quarters, your direct business is up 3% versus your disty business down about 34%. Do your direct customers have just have less excess inventories, and therefore, maybe you guys are shipping more towards consumption trends? Any color on the large divergence would be helpful.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nNo, not really anything to read into that. A lot of our distribution business also, or half of our distribution business is going to customers that we deal with directly. The other half of our distribution is more on fulfillment. So I wouldn't read a lot into it, but we did talk about some of the pockets of inventory subsiding as far as the inventory drain, which is translating into better than expected industrial and green shoots of industrial. I look at all of these overall as a single outlook or single indication to where the markets are, but not specifically disty or direct.\n\n**Harlan Sur** (Executive Director - Equity Research)\nI appreciate that. And then part of the weaker dynamic back in 4Q was a lower book of turns business. You saw better bookings trends towards the end of this particular quarter or the reported March. Did that include your turns business? And what's in your guidance for this quarter, June, are you guys assuming similar, higher, lower turns percentage versus 1Q?\n\n**Thad Trent** (EVP &amp; CFO)\nYes, Harlan, I would say, we saw strengths, right? We saw strengths late in the quarter in terms of order patterns, right? And specifically in the industrial side of the house. As we look into Q2, we still need turns, right. I mean, I think customers are booking at lead time just given the uncertainty, but we still need turns.\n\n**Thad Trent** (EVP &amp; CFO)\nAnd I would say it's pretty consistent with how we entered the first quarter as well. No material change other than order patterns, think, have gotten a little more stable, a little more predictable.\n\n**Harlan Sur** (Executive Director - Equity Research)\nGreat. Thank you.\n\n**Operator**\nOne moment for our next question. Next question comes from Tore Svanberg with Stifel. Your line is open.\n\n**Tore Svanberg** (Managing Director)\nYes. Thank you. I had a longer term question on on Treo. Hassan, you reiterated the 1,000,000,000 for 02/1930, and you did talk about some design wins. Just could you help us a little bit where are you getting these design wins?\n\n**Tore Svanberg** (Managing Director)\nAnd could we start to see already some material revenue in TRIO next year?\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nYes. That's a good question. First off, our exposure with Trejo is really very broad. I gave some examples that span from automotive, from AI data center, and from industrial, medical. The beauty of the platform is it's very versatile as far as going from high performance analog to high power drivers and high power PMICs and so on.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nSo overall, we're very, very pleased with the traction. I talked about we remain on track to double the number of products year on year. That remains on track and a focus for the team. And really, we're starting to ship revenue this year. As far as material revenue, of course, it's a ramping business, ramping product revenue, and more importantly, at more favorable margins.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nWe talked about the margin profile for that Treo platform being 60% to 70%. That remains true as we start the ramp and will continue as we expand. As far as material revenue in 2026, obviously it's going to be more material than it is this year. But material from a company, you're still not going to see it at a company level given the scale of our other business, and other business is ramping as well. But where we are today based on where we expect it to be, we're on track, actually slightly ahead, but we're very excited about the promise of the franchise that we've built.\n\n**Tore Svanberg** (Managing Director)\nYes. Thank you for that color. As my follow-up for Todd, CapEx six percent of revenue this quarter, with the new footprint, how should we think about CapEx for the second half of the year?\n\n**Thad Trent** (EVP &amp; CFO)\nYeah, for the whole year, like there's some lumpiness, right, in terms of the CapEx just based on timing of equipment coming in. But most of our CapEx now is just maintenance CapEx. So for the year, should think about CapEx as being in that mid single digit percentage of revenue. With the lower capital intensity, this is what's given us confidence in the free cash flow and why we're increasing our buyback to 100% of free cash flow.\n\n**Tore Svanberg** (Managing Director)\nThank you.\n\n**Operator**\nOne moment for our next question. Our next question comes from David Williams with The Benchmark Company. Your line is open.\n\n**David Williams** (Equity Research Analyst)\nHey, good morning. Thanks for taking the question. I guess first is, can you kind of give us a revenue run rate to get that full capacity utilization, just kind of given what you've taken out this quarter?\n\n**Thad Trent** (EVP &amp; CFO)\nLook, I don't have a specific number as you think about it sitting here because it's going to depend on internal versus external. I think if you model the downside of kind of as capacity came out or utilization decreased, it's likely the same going up. So we manufacture about 70% of our products in house, but I think it's going to be very linear as revenue increases, but I don't have a top line because it depends on mix, If higher value products are ramping first, that will have a different impact than lower ASP products. But I think from a modeling standpoint, you should just look at the downside and the upside is very similar.\n\n**David Williams** (Equity Research Analyst)\nThanks for the color there. And then just kind of secondly, and I think Hassan you spoke to this earlier, but just wondering what you're seeing in terms of the silicon carbide competitive dynamics within the domestic market in China. It sounds like we're seeing more of that, but just kind of curious how you're seeing that. Obviously, performance is better, but how do you think this plays out over the next twelve to eighteen months? Could we see that shift back into maybe the more domestic side given the tariff situation? Thanks.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nYeah. I don't think we are in the same bucket as some of the local. The local, they're not really competing at the stage where we are with our customers. I mentioned most of our competition are the global peers, not really the local. Now, is there going to be just like IGBT, a small sliver in the market that's really not looking for performance, but just an onoff switch that would potentially use the local, yeah, but that's not really a focused market for us.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nSo, where we play, which is really performance, especially as the automotive OEMs in China want to compete on a global scale, which most of them do, they're going to be focusing really on performance, really on integration and a system level performance impact, which is really us, and we come in the lead. We're seeing that in my mention on the 50% penetration, just based on the Shanghai Auto Show from a few weeks ago. So with that, it gives me comfort. Now, obviously, we're not sitting still. I talked about introducing our Trench, which is again yet a new generation for us versus the peer global peer and versus the local vendors in China.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nSo, we're not standing still from an R and D. As they develop their local solutions, we're going to maintain our technology leadership. It is not a question of tariff in this case, because as you know, our silicon carbide is manufactured outside of The U. S. From a global footprint as well, and our flexibility in our supply chain gives us a lot of options to serve the customers.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nBut most of the decision at a customer level is really made on technology and our performance. That's how we've always won. That's how we continue to win.\n\n**Operator**\nThank you. One moment for our next question. Our next question comes from Christopher Rolland with Susquehanna. Your line is open.\n\n**Christopher Rolland** (Senior Equity Analyst)\nThanks for squeezing me in guys. Hassan, perhaps just back to your last answer there. Just as we think about potential reciprocal tariffs, you were talking about flexibility in your footprint. Some people have a China for China strategy. How do you serve China without these reciprocal tariffs?\n\n**Christopher Rolland** (Senior Equity Analyst)\nAnd do you increase a fabless relationship in country? I know you deal with SMIC, I think. Do you increase that relationship? What is the kind of flexibility that you do have to address reciprocal tariffs in China, let's say?\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nYeah. So, first, I don't want to ponder on what the tariff could or could not be, given just the volatility of the tariff situation one day versus the other. I will give you what we are doing, which is what we control. First off, we are in China, and we do have manufacturing in China. We have a couple of our sites.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nOur manufacturing sites are actually in China. We do have foundry relationships. So, we are not looking at China from the outside, we're looking at China from the inside. So, therefore, for me, I'm not worried about the impact of it. We have a lot of 19 factories total globally.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nIt gives us full flexibility. Most of our products are qualified in more than one location, which means from servicing the customers, whether customers in China or customers in China that would export, we are very well positioned for it. Of course, we're always looking at our strategic footprint, whether we do something specifically in China or not, but there has to be a strategic need for it, not just in reaction to a tariff that may or may not be there. So, look at it from a technology perspective. We look at it from a competitive advantage perspective.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nWe do feel very competitive with our existing footprint, and we'll continue to address that.\n\n**Christopher Rolland** (Senior Equity Analyst)\nThank you for that. As a second question, just as I look at DSD inventory, this is the lowest level of DSD inventory you guys have had in quite some time. And so I'm just wondering, is there a change in strategy here? Or is it just a reflection of the softer outlook? How do you guys know that this is the right level?\n\n**Christopher Rolland** (Senior Equity Analyst)\nAnd I would have think, given the macro uncertainty, your disties would also want more geographic based inventory and flexibility there. So why drain the channel at this point in time? Yeah, just is this where we're going to hold these inventory levels?\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nNo. So, you think about it from our weeks of inventory, we are where we want it to be. That's our sweet spot. I said we're focused on ninety, eleven weeks, and we'll go up or down depending on if we have a ramp in the following quarter or not. So, we will manage the business within that range.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nAs far as the dollars, we've always said we maintain a very high discipline on this inventory. I'll tell you, distribution will take more inventory from us. But however, what we are waiting on is a really sustainable recovery. We've seen starts of it. So, as the top line revenue grows into the outlook, then we will continue to feed the inventory in the channel to service the customer.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nBut for us, it is a customer focused effort. I mentioned earlier, 50% of our distribution is what we call named customers. So we do have outlook, we do have forecasts, and we do have really backlog from these customers directly, whether we service them through the distribution or not. So we don't see that as a, call it, a strategic drain of inventory, but more of a management of the inventory with the outlook that we see in the macro environment. From a dollar perspective, that very well can change as we see more sustainable signs of recovery, but you can expect the weeks of inventory to remain in that range that we've described.\n\n**Operator**\nThanks, Hassan. Ladies and gentlemen, this does conclude the Q and A portion of today's conference. I'd like to turn the call back over to Hassan Elkari, President and CEO, for any closing remarks.\n\n**Hassane El-Khoury** (Executive Director, President &amp; CEO)\nThank you for joining us on the call this morning. As we navigate the rest of this year, on behalf of the executive team, I'd like to express my gratitude to our global employees, our customers, and our shareholders for their commitment and dedication to OnSami. Thank you.\n\n**Operator**\nLadies and gentlemen, this does conclude today's presentation. You may now disconnect, have a wonderful day.",
      "fetched_at": "2026-02-04T15:46:28.944Z"
    }
  ]
}