{
  "ticker": "QCOM",
  "last_updated": "2026-02-04T15:41:33.107Z",
  "total_transcripts": 4,
  "transcripts": [
    {
      "ticker": "QCOM",
      "title": "QUALCOMM Incorporated (QCOM) Q4 FY2025 earnings call transcript",
      "published_date": "Nov 5, 2025, 4:45 PM EST",
      "fiscal_year": "2025",
      "quarter": "Q4",
      "url": "https://finance.yahoo.com/quote/QCOM/earnings/QCOM-Q4-2025-earnings_call-364254.html",
      "content": "**Operator**\nLadies and gentlemen, thank you for standing by. Welcome to the Qualcomm Fourth Quarter Fiscal 2025 Earnings Conference Call. At this time, all participants are in listen-only mode. Later, we will conduct a question-and-answer session. If you'd like to ask a question during this time, press Star then the number one on your telephone keypad. To destroy your question, press Star then the number two. If you're using a speakerphone, please pick up your handset before pressing the numbers. Please limit your questions to one question and one follow-up. As a reminder, this conference is being recorded November 5th, 2025. Playback number for today's call is 877-660-6853. International callers, please dial 201-612-7415. The playback reservation number is 137-56092. I would now like to turn the call over to Mauricio Lopez-Hodoyan, Vice President of Investor Relations. Mr. Lopez-Hodoyan, please go ahead.\n\n**Mauricio Lopez-Hodoyan** (VP of Investor Relations)\nThank you, and good afternoon, everyone. Today's call will include prepared remarks by Cristiano Amon and Akash Palkhiwala. In addition, Alex Rogers will join the question-and-answer session. You can access our earnings release and a slide presentation that accompanied this call on our Investor Relations website. In addition, this call is being webcast on Qualcomm dot com, and a replay will be available on our website later today. During the call today, we will use non-GAAP financial measures as defined in Regulation G, and you can find the related reconciliations to GAAP on our website. We will also make forward-looking statements, including projections and estimates of future events, business or industry trends, or business or financial results. Actual events or results could differ materially from those projected in our forward-looking statements.\n\n**Mauricio Lopez-Hodoyan** (VP of Investor Relations)\nPlease refer to our SEC filings, including our most recent 10-K, which contain important factors that could cause actual results to differ materially from the forward-looking statements. Now to comments from Qualcomm's President and Chief Executive Officer, Cristiano Amon.\n\n**Cristiano Amon** (CEO)\nThank you, Mauricio, and good afternoon, everyone. Thanks for joining us today. In Fiscal Q4, we delivered another strong quarter with revenues of $11.3 billion and non-GAAP earnings per share of $3. Both of which exceeded the high end of our guidance range. QCT revenues of $9.8 billion, up 9% sequentially, were driven by strong end customer demand for Snapdragon-powered premium-tier Android handsets, continued traction for automotive Snapdragon digital chassis, and strength in IoT across industrial, Wi-Fi 7 access point, 5G fixed wireless, and smart glasses. In addition, all three QCT revenue streams exceeded our expectations, including record automotive quarterly revenues in excess of $1 billion. Licensing business revenues were $1.4 billion. Fiscal 2025 non-GAAP revenues of $44 billion were up 13% year over year, with record QCT annual revenues of $38.4 billion.\n\n**Cristiano Amon** (CEO)\nUp 16% year over year, including automotive and IoT revenue growth of 36% and 22% year over year, respectively. We deliver 18% year over year growth in total QCT non-APL revenues above our prior estimates. We remain on track to achieve our Fiscal 2029 long-term revenue commitment as outlined at our 2024 Investor Day. I will now share some key highlights from the business. At Snapdragon Summit in September, we introduced our Snapdragon 8 Elite Gen 5 mobile platform for next-generation flagship AI smartphones. This platform is equipped with our custom-built third-generation Orion CPU, the fastest mobile CPU ever, along with an upgraded NPU and GPU. With the Snapdragon 8 Elite Gen 5, we continue to set the pace of innovation in mobile processors. This year marked our 10th Snapdragon Summit with simultaneous events held in Maui and Beijing.\n\n**Cristiano Amon** (CEO)\nValidating the strength of our Snapdragon ecosystem, leading China OEMs, including Xiaomi, Honor, Vivo, and OnePlus, announced their flagship phones at our event. More than 1,100 partners, analysts, tech influencers, and press attended in person, and our keynotes captured over 26 million unique views across both events. Together with our announcement, Snapdragon Summit generated over 547 million social media impressions. In addition, our Snapdragon Insiders community of tech enthusiasts, developers, and fans has grown to more than 20 million members worldwide. Our highly differentiated technology continues to drive increased brand visibility, and during the quarter, Qualcomm debuted at 39 on the Interbrand Top 100 Global Brands list for 2025, reflecting the strength of Snapdragon. For the first time ever, Kantar's BrandZ Most Valuable Global Brands list included Snapdragon, where we ranked number 38.\n\n**Cristiano Amon** (CEO)\nAlso, at Summit, we unveiled our newest platforms for premium laptops, the Snapdragon X2 Elite and X2 Elite Extreme. Once again, our industry-leading processors continue to outperform competitors, surpassing Intel and AMD in both speed and power efficiency. Our latest NPU sets a new benchmark as the world's fastest AI engine for laptops, also exceeding Intel and AMD in performance. With the new Orion Gen 3, we have the world's first 5 GHz CPU for the ultra-mobile laptop category with extended battery life. We now expect approximately 150 designs to be commercialized through 2026 and remain optimistic about the continued momentum for Snapdragon-powered AI PCs. As AI transforms human-computer interactions, intelligent wearables, and specifically smart glasses are evolving into personal AI devices that can connect the user directly to an AI agent or model.\n\n**Cristiano Amon** (CEO)\nThis emerging category is growing at a remarkable pace and has reached an inflection point fueled by very strong demand for smart glasses from Meta. This quarter alone, Meta introduced several new Snapdragon-powered styles, including the Ray-Ban Meta Second Generation Glasses, the Oakley Meta Vanguard Performance Glasses, and the Meta Ray-Ban Display and Neuro Band. In addition to Meta, our leadership in this space is reflected by the 30 designs in production or development with our global partners. They include Samsung, which recently launched Galaxy XR, a truly multimodal AI headset and the first device for Google's new AI-native operating system, Android XR. We achieved a significant milestone in automotive with the launch of Snapdragon RidePilot, our first full-system solution for L2+ automated driving. Developed in close collaboration with BMW, it debuted in the automaker's BMW iX3 EV SUV.\n\n**Cristiano Amon** (CEO)\nPowered by our advanced self-driving software stack, Snapdragon RidePilot sets a new standard in automated driving. It is designed for universal compatibility and seamless integration with automakers, unlocking L2+ driver-assistant features like hands-free highway driving and urban navigation for vehicles worldwide. Snapdragon RidePilot is currently validated in 60 countries and extends to 100 in 2026. The broad interest from leading automakers globally is exceeding our expectations. At IAA Mobility, Qualcomm and Google announced an expanded partnership, including the integration of Google Gemini models to our suite of Snapdragon digital chassis solutions. Together, we will enable automakers to build and deploy personalized AI agents that act as an in-vehicle assistance, bringing multimodal edge-to-cloud AI to next-generation software-defined vehicles. In industrial IoT, we completed our acquisition of Arduino, a premier open-source hardware and software company with an IoT development ecosystem of more than 30 million users worldwide.\n\n**Cristiano Amon** (CEO)\nThis builds on our acquisitions of Edge Impulse and Foundry.io and accelerates our plans to provide a comprehensive edge AI development platform for a broad set of applications. With these new assets, we're expanding our portfolio to a wide range of customers and verticals, further cementing our position as a leader of AI for the edge. Additionally, we recently released the Arduino UNO Q single-board computer. Powered by a Dragonwing processor, this full-stack edge AI platform enables the rapid development of solutions for applications ranging from smart home automation to industrial robotics, drones, and more. AI data center growth is moving from training to dedicated inference workloads, and this trend is expected to accelerate in the coming years. The mass adoption and continuous use of AI applications is driving the industry to look for competitive alternatives that prioritize power-efficient performance and cost.\n\n**Cristiano Amon** (CEO)\nWe announced our entry into this market and recently unveiled our AI inference-optimized AI200 and AI250 SoCs and associated accelerator cards and racks. We're very pleased to have Humane as our first customer for these solutions, with a target deployment of 200 megawatts starting in 2026. Looking ahead, we're executing on a multi-generation roadmap with an annual cadence. I would like to share that we're looking forward to providing an update in the first half of 2026 on our data center plans, including our roadmap performance and differentiated memory and compute technology. We'll also highlight our progress in other areas, including advanced robotics, next-generation ADAS, industrial edge AI, and 6G devices and AI-powered RAN.\n\n**Cristiano Amon** (CEO)\nAs we execute on our strategy and expand our IP and capabilities, we believe we are one of the best-positioned companies to lead the expansion of AI to the edge, edge-to-cloud hybrid AI, and develop a power-efficient cloud inferencing solution. I will now turn the call over to Akash.\n\n**Akash Palkhiwala** (CFO)\nThank you, Cristiano, and good afternoon, everyone. Let me begin with our fourth fiscal quarter results. We're pleased with our strong non-GAAP performance, with revenues of $11.3 billion and EPS of $3, both of which were about the high end of our guidance. QTL revenues of $1.4 billion and EBT margin of 72% were about the midpoint of our guidance, driven by slightly higher handset units. QCT delivered revenues of $9.8 billion and EBT of $2.9 billion, with year-over-year growth of 13% and 17%, respectively. QCT EBT margin of 29% was at the high end of our guidance. QCT handset revenues of $7 billion increased 14% on a year-over-year basis, reflecting increased demand for premium Android handsets powered by our Snapdragon 8 Elite Gen 5 platform.\n\n**Akash Palkhiwala** (CFO)\nQCT IoT revenues of $1.8 billion grew 7% year-over-year, driven by strength across industrial and networking products and increased demand for AI smart glasses powered by our Snapdragon platform. In QCT Automotive, we surpassed $1 billion quarterly revenue milestone, delivering 17% year-over-year revenue growth as the adoption of our Snapdragon digital chassis platform continues to accelerate. With the recent enactment of the One Big Beautiful tax bill, we now expect our non-GAAP tax rate to remain in the 13%-14% range going forward, and we anticipate lower cash tax payments relative to prior expectations. This new legislation resulted in a non-cash charge of $5.7 billion in the fourth fiscal quarter to reduce the value of our deferred tax assets. This charge is excluded from non-GAAP metrics but impacts our GAAP results. Before turning to guidance, I'd like to take a moment to highlight our strong performance in fiscal 2025.\n\n**Akash Palkhiwala** (CFO)\nWe are incredibly pleased with our execution, with non-GAAP revenues of $44 billion and EPS of $12.03, representing year-over-year growth of 13% and 18%, respectively. In QCT, we achieved 16% year-over-year revenue growth, driven by double-digit increases across all revenue streams, with IoT up 22% and automotive growing 36%. We also delivered QCT operating margins of 30% in line with our long-term target we've previously outlined. Over the past five years, our non-Apple QCT revenues grew at a 15% compounded annual growth rate. Similarly, over the last two years, our non-Apple QCT revenues grew by 17% and 18%, respectively. Lastly, we generated record free cash flow of $12.8 billion, and consistent with our commitment, we returned nearly 100% to stockholders through repurchases and dividends through the year.\n\n**Akash Palkhiwala** (CFO)\nNow turning to guidance, in the first fiscal quarter, we expect to deliver record results, with revenues in the range of $11.8 billion-$12.6 billion and non-GAAP EPS of $3.30-$3.50. In QTL, we estimate revenues of $1.4 billion-$1.6 billion and EBT margins of 74%-78%. In QCT, we expect record revenues of $10.3 billion-$10.9 billion and EBT margins of 30%-32%. We anticipate record QCT handset revenues with low teens percentage growth sequentially, primarily driven by new flagship Android handset launches powered by Snapdragon. Following our outperformance for QCT IoT revenues in the fourth quarter, we expect a sequential decline consistent with last year, driven by seasonality in consumer products. In QCT Automotive, following a record fourth quarter, we estimate revenues in the first fiscal quarter to remain flat to slightly up on a sequential basis.\n\n**Akash Palkhiwala** (CFO)\nLastly, we forecast non-GAAP operating expenses to be approximately $2.45 billion in the quarter. In closing, as we approach one year since outlining our growth strategy at Investor Day, I'd like to provide an update on the progress towards our $22 billion fiscal 2029 revenue target across automotive and IoT. In automotive, we've established ourselves as the most strategic silicon partner for OEMs globally. The accelerating adoption of our Snapdragon digital chassis platform and 36% year-over-year revenue growth in fiscal 2025 puts us on track to achieve our $8 billion revenue target. Across IoT, the increasing importance of artificial intelligence, high-performance low-power computing, and connectivity, validated by our 22% year-over-year revenue growth in fiscal 2025, reinforces our confidence in achieving our $14 billion revenue target.\n\n**Akash Palkhiwala** (CFO)\nIn industrial, increasing customer engagement and growth in design win pipeline, combined with our recent acquisitions to unlock access to 30 million users, underlines our confidence in strong revenue growth through the end of the decade. In XR, we're exceeding prior expectations on strong demand for AI smart glasses, and we remain the platform of choice for smart glasses and mixed reality devices across leading global OEMs and ecosystems. In PCs, we extended our technology leadership with the recent launch of Snapdragon X2 Elite and X2 Elite Extreme platforms, which deliver multi-generational performance increases across CPU, GPU, and AI. Given our strong pipeline of approximately 150 design wins, we're optimistic about the growth potential for Snapdragon-powered AI PCs as we expand our presence across global consumer and enterprise channels.\n\n**Akash Palkhiwala** (CFO)\nIn networking, our continued innovation and leadership in Wi-Fi, 5G, edge processing, and AI, combined with our integrated platform approach, positions us to drive content growth and adoption globally. As Cristiano outlined, beyond our revenue target, we're also pursuing incremental opportunities across data center and robotics. Finally, I want to thank our employees for exceptional execution and continuing to deliver industry-leading technologies and products. This concludes our prepared remarks. Back to you, Mauricio.\n\n**Mauricio Lopez-Hodoyan** (VP of Investor Relations)\nThank you, Akash. Operator, we're now ready for questions.\n\n**Operator**\nThank you. To cue a question, press star then the number one. To throw your question, press star two. If you're using a speakerphone, please pick up your handset before pressing the numbers. One moment, please, for the first question, which will come from the line of Joshua Buchalter with TD Cowen. Please proceed with your questions.\n\n**Joshua Buchalter** (Analyst)\nHey, guys. Thanks for taking my question and congrats on a stellar set of results in a bumpy backdrop. I wanted to start with the data center business. I realize you're going to provide more details in the first half of 2026, and my questions might get punted as a result. Maybe you could spend a few minutes talking about what you see as Qualcomm's right to win in the data center space and any details you can provide on the specs of the AI200 and 250 beyond what you were able to offer in the press release when the Humane engagement was announced. Lastly, on this topic, last quarter, you called out, I believe, a hyperscale engagement. I assume that's distinct from the Humane engagement and any details on timing there. Thank you.\n\n**Cristiano Amon** (CEO)\nHey, Josh. Thanks for your question. Thank you. Yes, look, we're very excited. I think this is the next chapter of, I think, the process we have been in Qualcomm to changing the company, diversifying the company, spending our IP. I think that's one of the reasons I think we made acquisitions such as AlphaWave. We think there are two areas that we outlined that we can participate in the data center. We were incredibly excited about the size of the opportunity in the next phase, I think, of data center build-out where there's going to be real competition. We go from training to inference. We have been focused in two areas. One is we believe we have one very strategic asset in the industry, which is a very competitive, power-efficient CPU that is both for the head node of AI clusters as well as general-purpose compute.\n\n**Cristiano Amon** (CEO)\nWe also have been building what we think is a new architecture dedicated for inference. The focus has been increased compute density and simplified the architecture for the data center in terms of increased performance per watt. It's all going to be about generating the most amount of tokens with the least amount of power, and that's our right to play. We're excited about what we're doing that has been in development. It's something that we're actually doing in a very disciplined manner. We spend a lot of time with our early experimentation with AI100 to develop the software. We're now building AI200, AI250, both the SoC, the card, the rack solutions. We're pleased with what we're seeing. We will provide more details on that, as you outlined, early next year.\n\n**Cristiano Amon** (CEO)\nSpecific to your questions, I think we were in discussion with our hyperscaler. We're very pleased with the outcome of that conversation, and that's going to be part of our update. When we provide details on the roadmap, the performance, the KPI, we'll be able to show details of the solution as well as our customer engagement. We are in conversation with a lot of companies. It's clear the market wants competition for this. In a typical Qualcomm way, we're just going to be focused on executing and show the products performing. Like I said, this is exciting. It's a new chapter of our expansion, and alongside robotics, those are kind of new opportunities for us.\n\n**Joshua Buchalter** (Analyst)\nI appreciate all the color there and looking forward to the updates. For my follow-up, I wanted to ask about the handset market. You highlighted your ongoing momentum in the Android space as driving growth in the fourth quarter or the, excuse me, calendar fourth quarter in your prepared remarks. There's been a lot of noise, I think, about your lead Android customer potentially looking to use an internal modem more than they have in recent years. Could you maybe just talk about your visibility into your share at that customer, and any sort of share that you would expect, how you would expect that over the next year or so? Thank you.\n\n**Cristiano Amon** (CEO)\nLook, thanks for the question. I actually want to spend a little bit of time on this because I sense that there's potential for a lot of noise when noise is actually not required. I think, first of all, there is one thing that is happening with our Snapdragon and our premium tier Snapdragon Android, which has been very consistent, and this has happened over the past few years. The premium tier is expanding. I think if we look at the overall market, we have this trend that is very healthy, and the premium tier is expanding and is adding more compute. That is the reason why our Android business, even on a market that is relatively flat, which is a handset market, we continue to grow our content, ASPs, and earnings because we see premium tier expanding.\n\n**Cristiano Amon** (CEO)\nA lot of the upside we have in the handsets is primarily driven by the Android premium tier. Second part is our relationship with Samsung. We have said for a number of years, a number of reasons, and this has been true in the past, I think, several years, that what used to be a normal relationship at a 50% share, the new baseline is about 75% share. That is always going to be our financial assumption. When we out-execute, sometimes we get more than 75%. On Galaxy S25, we got 100%. Our assumption for any new Galaxy is always going to be 75%. That is our assumption for Galaxy S26.\n\n**Operator**\nThe next question comes from the line of Samik Chatterjee with J.P. Morgan. Please proceed with your questions.\n\n**Samik Chatterjee** (Analyst)\nHi. Thanks for taking my question. Cristiano, you mentioned on the data center side, starting with that, you mentioned the price performance for the inferencing. Performance that you're trying to deliver. I mean, most of the training clusters that we've sort of seen the other incumbents sort of talk about, the ranges of installation cost is somewhere in the sort of $30 billion-$40 billion per gigawatt that we're hearing of. Can you just right-size us in terms of when you're thinking about the deployment on a gigawatt basis? What kind of cost performance or price performance are you thinking of relative to these inferencing workloads that you can support on the AI200 or AI250? Also trying to get to sort of what revenue implications are for Humane when you sort of deploy 200 megawatts with them. I have a follow-up, please.\n\n**Cristiano Amon** (CEO)\nOkay. I'm going to try to give as much color as I can without getting ahead of the update we're going to provide next year. First, let's just have a broader discussion about revenue. What we said before, that we expect data center products to start leading to a revenue ramp beginning in fiscal 2028. I think as a result of the Humane engagement and our progress on the AI accelerator, I think we're pulling this forward into fiscal 2027. You should expect now, from what we said before, I think data center revenue is going to start to become material in fiscal 2027. I think that's the extent of what I can provide at this moment. It's about a one-year pulling. The second thing is we are getting interest.\n\n**Cristiano Amon** (CEO)\nYou should assume the companies that are having to deploy as much compute as they need in the data center for inference, especially now that you see the constraints that you have on power, the constraints that you have on the amount of compute density. I think we have a lot of folks interested. We will not have conversations if we did not have a solution that is competitive. We will show the KPIs of the platform, I think, when we have a roadmap update early next year.\n\n**Samik Chatterjee** (Analyst)\nOkay. Okay. Got it. Maybe the second one. Similar to Josh's question, I think, Akash, if I'm interpreting the market's reaction to your strong numbers, there seems to be that concern about what March looks like with the change in share of the primary Android customer. Typically, on the handset side, your quarter-over-quarter decline into March has been sort of this high single-digit pace. Is that still a good run rate with sort of the lower level of share, or would you sort of guide us otherwise? I think that's really what the market seems to be sort of concerned about at this point. Thank you.\n\n**Cristiano Amon** (CEO)\nYes, Sameek, thanks for the question. We're not guiding beyond first quarter at this point. When you look at our strong business momentum exiting fiscal 2025, you see the benefit of that showed up in our results, also showing up in the December quarter guidance. That carries forward into the rest of the fiscal year. The only additional thing I'd note is just a reminder that we expect to close our AlphaWave acquisition in the first calendar quarter of 2026. Otherwise, I think the business momentum is strong and just a couple of factors that you outlined.\n\n**Operator**\nThe next question comes from the line of Timothy Arcuri with UBS. Please proceed with your questions.\n\n**Timothy Arcuri** (Analyst)\nThanks a lot. Akash, when you talked about September, you said that the beat was driven mostly by premium Android, but it seemed like it came a little more from your top customer because before you were saying to take like 30% of units out, and that was like $500 million, roughly. It seems like nowhere near that much came out from that customer. I mean, it was kind of barely down year-over-year. Can you just square that? Also, as part of that, can you speak to how much that customer is as kind of a baseline assumption for December? I think we've seen that the model that has their modem and it's not really selling very well. I would assume that that's a tailwind for you also in calendar Q4. I had a second question. Thanks.\n\n**Cristiano Amon** (CEO)\nSure, Tim. As we had said earlier, we expected to be in three of the four models of the phone that was launched. That is exactly what happened. Share, of course, is based on how sell-through plays out. Specifically, on the September quarter question, we already had kind of demand from the customer that was factored into the guidance we gave. The upside we saw was not from Apple. It was really driven by Android customers and primarily premium tier with the launch of our new Snapdragon chip. When you look at the sequential trend as well, as I mentioned, we're forecasting approximately low teens sequential revenue growth in the handset revenue stream for QCT and primarily driven by Android as well. There is some benefit from Apple, but the primary driver for the growth quarter-over-quarter is actually Android premium tier shipments.\n\n**Cristiano Amon** (CEO)\nOkay. Thanks. Is there any update on the negotiation with Huawei for a license? It seems like it's kind of dragging on a little bit. Can you just talk about that?\n\n**Alex Rogers** (President of Qualcomm Technology Licensing and Global Affairs)\nYeah. This is Alex. Thanks for the question. No, we actually do not have an update now. Discussions are still underway. Really nothing substantive to say beyond that.\n\n**Operator**\nThe next question comes from the line of Stacy Rasgon with Bernstein Research. Please proceed with your questions.\n\n**Stacy Rasgon** (Senior Analyst)\nHi, guys. Thanks for taking my questions. You noted the non-Apple QCT revenue was up 18% year-over-year. Even if I take out the auto and the IoT, it is clear that the Android piece was up like pretty strong double digits year-over-year. Am I right in assuming that is all content or primarily content given I do not think units grew that much? Is that the right sort of pace of further content increase that we ought to be thinking about as we go forward?\n\n**Cristiano Amon** (CEO)\nYeah. Stacy, you're obviously doing the math right. There are two primary drivers on this. One is just the mix shift of units up. This is a trend that we've seen over the last several years. Sometimes it's thought of as a developed market trend, but that's not true. It's across all developing regions as well. The devices that are purchased continue to move up. That shows up in the benefit to our revenue stream. The second trend is within premium tier. Content continues to grow as we deliver more and more capable chips and more capable handsets are being delivered as a result of it. Those are the two primary drivers of the long-term trend of our handset business.\n\n**Stacy Rasgon** (Senior Analyst)\nGot it. Thanks. If I could have a quick follow-up. Just the Snapdragon Android strength in September and December. Is that primarily China? Is there any concerns there? I mean, is that just the timing of the launches? Any thoughts on pull forward or anything like that? Anything we ought to be thinking about there?\n\n**Cristiano Amon** (CEO)\nYeah. No, there's no pull forward there. I think what we've seen is most of our China customers, actually all the major customers, have already launched devices. The initial reception to the devices has been very positive. We'll see a lot of our global customers launch devices as well later this quarter going into early next year. It is just a reflection of kind of normal purchase patterns around the launch of these devices and the great initial consumer reaction to the launches.\n\n**Operator**\nThe next question is from the line of Chris Caso with Wolfe Research. Please proceed with your questions.\n\n**Chris Caso** (Analyst)\nYes, thank you. A question again on AI data center. I realize you're going to provide some details coming up, but there's some specs out there, which is why we ask. From what we've seen, what was in the press release was perhaps a different architecture than what we've seen others attack the market with. DDR memory, PCI Express, and that. Should we interpret that as sort of a first approach by Qualcomm with more to come? Or is this rather a different sort of philosophy for attacking the market? You talked about being more efficient on power consumption. Is this sort of attacking the market differently than what's in the market today?\n\n**Cristiano Amon** (CEO)\nI think the answer to the question is yes. For us, I think we're approaching this thinking about what the future architecture should look like. We had said before, and I think we have thought about this for the edge as well, which means when we think about dedicated inferencing clusters, and the goal is to actually have the highest possible compute density at the lowest possible cost and energy consumption to generate tokens, we thought that maybe an architecture that is beyond the GPU and what you've traditionally been doing with GPU and HBM is what we should be doing. That's where developing and we have to execute. That's the focus on the company right now.\n\n**Chris Caso** (Analyst)\nGot it. Just back on handsets, and you talked about a mix shift towards the premium tier. To what extent has the growth that you've seen in handsets been driven by Snapdragon ASPs? And obviously, wafer prices are going up as you go to finer geometries. Maybe talk about the impact of higher ASPs on handset growth, both now and going forward, and how the industry absorbs those higher ASPs.\n\n**Cristiano Amon** (CEO)\nYeah. I think there's a long-term trend that we've seen. This is a conversation that we have every year, but we continue to see just very strong demand for more capable chips, more capable processing in these premium tier chips. The competition between the OEMs drives it. The demand for consumers doing more activity on the phone drives it. We know the next couple of chips that we are making, and we're already in advanced discussions with our customers. We feel pretty confident that there are legs to this trend over the next several years. The second factor that I outlined is important to keep in mind as well. This very significant mix shift towards more premium devices is not about content growth within the tier, but it's more about more capable devices being purchased by consumers.\n\n**Cristiano Amon** (CEO)\nThat is a multi-year trend as well that we're continuing to see going forward.\n\n**Operator**\nThe next question is from the line of Tal Liani with Bank of America. Please proceed with your question.\n\n**Tal Liani** (Research Analyst)\nHi, guys. Thank you. If I look at this quarter, you grew handsets by 14%. It looks like next quarter, you're guiding again 600 basis points above market growth or about market expectations for QCT. When you look at next quarter, what are the components of this outperformance? Can you go over kind of IoT, autos, and handsets? Where do you think you can perform better than you initially thought last quarter, etc.? Can you give us a little bit of a color on how next quarter is behaving of the QCT breakdown? Thanks.\n\n**Cristiano Amon** (CEO)\nTal, just to confirm, your question is about the December quarter, first fiscal quarter?\n\n**Tal Liani** (Research Analyst)\nYes, first fiscal quarter. Sorry. The question is about the guidance for next quarter. Yes.\n\n**Cristiano Amon** (CEO)\nYeah. Perfect. Specifically in automotive, we had a record quarter in September, so approximately $1.1 billion. We are guiding flat to slightly up in automotive. We do think that we're in this very strong position as additional cars get launched with our capabilities in them, we will continue to grow revenue through the year. IoT is similarly positioned, right? We saw significant upside relative to our guidance within the September quarter, and we're positioned to continue to grow revenue. Starting first quarter, going into the rest of the fiscal year as well. Within handsets, the upside that you're seeing in the December quarter is really the success of our launch of our new chip. We've seen all the major OEMs launch devices with it. As I said earlier, strong consumer reaction, and that is reflected in our financial forecast.\n\n**Cristiano Amon** (CEO)\nOn a sequential basis, as I mentioned earlier, we are forecasting low teens sequential revenue growth in the handset stream in QCT.\n\n**Tal Liani** (Research Analyst)\nMy follow-up is on a historical perspective. When you launch a product into China and it's into the Chinese New Year, is first fiscal quarter the strongest quarter? From a seasonality point of view, what happens for the next few quarters from a historical perspective?\n\n**Cristiano Amon** (CEO)\nI mean, as you've seen in the past, we expect our first fiscal and second fiscal quarter to be the stronger quarters in the year. Usually, the June quarter, the third fiscal quarter, is the lower quarter. That seasonality should be consistent with what you've seen before in the handset business.\n\n**Operator**\nThe next question has come from the line of CJ Muse with Cantor Fitzgerald. Please proceed with your question.\n\n**CJ Muse** (Analyst)\nYeah. Good afternoon. Thank you for taking the question. Wanted to kind of focus on QCT. EBT margins. And revenues grew 5% year-on-year, yet margins were down 100-plus basis points. And I'm curious, is that a function of mix, or is that a function of higher manufacturing costs. Or is it simply R&D investments for future revenue growth?\n\n**Cristiano Amon** (CEO)\nYeah. I think when you look at the year-over-year trend, I think you should think of we are investing in the data center area, which, over the last several years, we've been kind of just focusing OpEx on moving from mature businesses into growth areas. Data center is incremental to the investment profile that we have.\n\n**CJ Muse** (Analyst)\nOkay. It's very helpful. I guess just to hone in on your non-Android handset business. Is there an update in terms of how we should model that for calendar 2026?\n\n**Cristiano Amon** (CEO)\nNo change to what we've said on share within Apple versus what we've said in the past.\n\n**Operator**\nThe next question comes from the line of Ben Reitzes with Melius Research. Please proceed with your question.\n\n**Ben Reitzes** (Analyst)\nHey, guys. Thanks a lot. I just wanted to touch back on the data center again. So you're going to be updating us in the next calendar year. Previously, you had an analyst day where you put out these long-term targets for 2029. I would assume that the smallest opportunity was in XR at $2 billion. I would assume if we're going to have an event and go through something like this, this has the opportunity to be something pretty material, bigger than the smallest opportunity outlined at the last analyst day. It was $2 billion for XR by 2029 and more like another multi-billion opportunity. Can you guys clarify that?\n\n**Cristiano Amon** (CEO)\nYeah, Ben, that's a great observation. I think we're seeing this market take off very fast, especially AI smart glasses. We definitely feel like we're significantly ahead of the guidance that we had provided and very significant upside opportunity. I mean, if you kind of step back and think about the broader opportunity around personal AI, and you could think of it as the glasses form factor or the watch form factor or hearables form factor, this could be a very, very large market. If that plays out as we suspect it might, it would create significant upside opportunity.\n\n**Ben Reitzes** (Analyst)\nYeah. Sorry. Just to clarify, though, my question, and I appreciate that, is that if you're going to outline the data center opportunity and have a special event. Could we assume that it's a multi-billion opportunity, something that you would call out that's at least as big, if not bigger, than anything you laid out at your last analyst day, which is the smaller opportunities are $2 billion-$4 billion?\n\n**Cristiano Amon** (CEO)\nBen, no, thanks for the question. I understand it now. Yes, it's upside on that number. Success in this area, I think, presents to us a potential multi-billion dollar revenue opportunity in a couple of years. That's how we're thinking about it right now.\n\n**Operator**\nThank you. That concludes today's question and answer session. Mr. Amon, do you have anything further to add before joining the call?\n\n**Cristiano Amon** (CEO)\nI just want to thank all of our partners, our employees. We are continuing to change Qualcomm into a very diversified company. We are probably one of the few companies among all the semiconductor companies that can go from 5 watts to 500 watts with very flexible and very broad technology capabilities. I think one thing that we take pride of in every industry that we enter, we have a platform that is a leading technology platform. We are excited about the future of the company. We are just going to keep executing on this strategy. Thank you very much for supporting our call.\n\n**Operator**\nLadies and gentlemen, this concludes today's conference call. You may now disconnect.",
      "fetched_at": "2026-02-04T15:41:12.108Z"
    },
    {
      "ticker": "QCOM",
      "title": "QUALCOMM Incorporated (QCOM) Q3 FY2025 earnings call transcript",
      "published_date": "Jul 30, 2025, 4:45 PM EDT",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/QCOM/earnings/QCOM-Q3-2025-earnings_call-340561.html",
      "content": "**Operator**\nLadies and gentlemen, thank you for standing by. Welcome to the Qualcomm Third Quarter Fiscal twenty twenty five Earnings Conference Call. At this time, all participants are in a listen only mode. Later, we'll conduct a question and answer session. As a reminder, this conference is being recorded 07/30/2025.\n\n**Operator**\nThe playback number for today's call is 8776606853. International callers, please dial (201) 612-7415. Playback reservation number is 1300000754332. Would now like to turn the call over to Mauricio Lopez Odoyen, Vice President of Investor Relations. Mr. Lopez Odoyen, please go ahead.\n\n**Mauricio Lopez-Hodoyan** (VP - IR)\nThank you, and good afternoon, everyone. Today's call will include prepared remarks by Christian Ramon and Akash Palkawala. In addition, Alex Rogers will join the question and answer session. You can access our earnings release and a slide presentation that accompany this call on our Investor Relations website. In addition, this call is being webcast on qualcomm.com and a replay will be available on our website later today.\n\n**Mauricio Lopez-Hodoyan** (VP - IR)\nDuring the call today, we will use non GAAP financial measures as defined in Regulation G and you can find the related reconciliations to GAAP on our website. We will also make forward looking statements, including projections and estimates of future events, business or industry trends or business or financial results. Actual events or results could differ materially from those projected in our forward looking statements. Please refer to our SEC filings, including our most recent 10 ks, which contain important factors that could cause actual results to differ materially from the forward looking statements. And now to comments from Qualcomm's President and Chief Executive Officer, Cristiano Ramon.\n\n**Cristiano Amon** (President &amp; CEO)\nThank you, Mauricio, good afternoon, everyone. Thanks for joining us today. In fiscal Q3, we delivered revenues of $10,400,000,000 and non GAAP earnings per share of $2.77 which was near the high end of our guidance range. Our chipset business delivered revenues of $9,000,000,000 reflecting strength in automotive and IoT and ongoing growth in handsets. Automotive and IoT revenues increased 2124% year over year respectively.\n\n**Cristiano Amon** (President &amp; CEO)\nOur licensing business revenues were $1,300,000,000 Our momentum in automotive and IoT is the result of strong execution of our growth and diversification strategy. We remain on track to meet our fiscal twenty twenty nine target for combined automotive and IoT revenues of $22,000,000,000 We're forecasting fiscal twenty twenty five to be the second consecutive year of greater than 15% year over year growth in total QCT non Apple revenues. I will now share some key highlights from the business. In handsets, we extended our Xiaomi collaboration with a multi year agreement. Snapdragon eight Series platforms will power multiple generations of Xiaomi's flagship devices for China and global markets with volume increasing each year of the agreement.\n\n**Cristiano Amon** (President &amp; CEO)\nThe Snapdragon eight Elite continues to set the pace of innovation in mobile processors and is leading the transition to AI smartphones with 124 designs shipped or announced today. AI usage in smartphones is increasing. For example, Samsung noted that 70 of Galaxy S25 users are utilizing Galaxy AI and usage of Google Gemini AI has nearly tripled among S25 users compared to the S24. Looking ahead, we expect the range of own device in AgenTek AI use cases will continue to expand and reshape the mobile industry. We are optimistic about the Android ecosystem's leadership in AI.\n\n**Cristiano Amon** (President &amp; CEO)\nAs we reach the one year mark of our entry into AI PCs, we are encouraged by the steady progress we're seeing with our Snapdragon X series platforms. Multiple new devices launched during the quarter from leading OEMs such as Acer, Dell, HP, Lenovo, Microsoft and Samsung and we remain on track for more than 100 designs to be commercialized through 2026. Snapdragon is transforming personal computing experiences and the design traction we're seeing from major customers reflect confidence in our technology roadmap, product portfolio and long term commitment to PCs. In the 2025, according to third party sources Snapdragon based PCs continue to make up approximately 9% of Windows laptops sold above the $600 price tier in retail U. S.\n\n**Cristiano Amon** (President &amp; CEO)\nWith the top five European countries. While we are at the beginning of our journey into PCs, we remain excited about the long term opportunity and continue to work toward our target of achieving $4,000,000,000 in revenue by fiscal twenty nineteen. In XR, Snapdragon continues to be the platform of choice for smart glasses and mixed reality devices. We now have 19 designs from our global partners. Demand for Meta's AI smart glasses continue to exceed expectations and they recently expanded the portfolio with the launch of the new Meta Oakley smart glasses and introduction of new Ray Ban styles.\n\n**Cristiano Amon** (President &amp; CEO)\nXiaomi's new AI glasses launched in the quarter were also well received. All three are powered by the Snapdragon AR1 Gen one platform. At the Augmented World Expo USA, we conducted the world's first demonstration of 1,000,000,000 parameter model running locally on smart glasses powered by our next generation Snapdragon AI platform. We also introduced a smart ring controller reference design as a new input device for discrete and intuitive interactions. Our Snapdragon digital chassis solutions continue to see strong traction across the automotive ecosystem with 12 new designs during the quarter and a total of 50 vehicle launches this fiscal year.\n\n**Cristiano Amon** (President &amp; CEO)\nWe're incredibly excited about BMW's upcoming Neuya class vehicles, which will launch globally with our new ISO safety certified ADAS tech later this year. This will include our Snapdragon Ride platforms and our jointly developed driving stack which meet safety standards in The U. S. And Europe. More details about the deployment certifications and capabilities will be shared at the IAA Mobility Show in September.\n\n**Cristiano Amon** (President &amp; CEO)\nOur Snapdragon Ride platforms and driving stack are also gaining momentum more broadly with 20 OEMs programs for various highway and urban navigate on autopilot solutions. The majority of these programs will launch in the next eighteen months across all global regions. In industrial IoT, we continue to expand our ecosystem of partners and we're pleased with the traction of our Dragon Wing platforms. At Computex, we announced new collaborations with DigiWin and ITNA to utilize our AI on prem appliance solution and AI inference suites for enterprise automation. We also expanded our work with IBM on their Maximo AI assistant powered by Watson XAI.\n\n**Cristiano Amon** (President &amp; CEO)\nOur broad range of OEMs and partners now includes companies such as ASUS IoT, Dell, Everfocus, iBase, Lenovo, Deloitte, END, Humane, Palantir and many others. We're also gaining traction with our industrial grade Dragon Wing IQ series with up to 100 tops of AI inference performance as well as the Dragonwing Intelligent Video Suite, a platform designed to extract intelligence from any video frame and create intelligent reasoning workflows for enterprises across many verticals. We've also seen continued strength in edge networking driven by strong demand for Wi Fi seven gateway platforms across retail and carrier customers and for five gs enabled fixed wireless access platforms for our carrier customers. Now, I would like to provide an update on our expansion into the data center. This represents a new growth opportunity for Qualcomm and is a logical extension of our diversification strategy as we continue to demonstrate leadership in CPU performance and NPU efficiency.\n\n**Cristiano Amon** (President &amp; CEO)\nAs inference games scale, cloud service providers are building dedicated inferencing clusters focused not only on performance, but also efficiency, specifically tokens per dollar and tokens per watt. These factors combined with the shift from merchant x86 CPUs to custom ARM compatible CPUs for both cloud computing and AI head node create an entry point for Qualcomm. We're currently building NPU based AI inference accelerator cards as well as custom SoCs for general purpose and AI head node compute solutions utilizing our Orion CPU. We also reached an agreement to acquire AlphaWave IP Group plc, a global leader in high speed wire connectivity and compute technologies for data centers, AI, data networking and data storage. The acquisition is expected to close during the 2026 subject to customary closing conditions.\n\n**Cristiano Amon** (President &amp; CEO)\nAlpha Wave's leading IP and data center design capabilities are key assets that will complement our Orion CPU and Hexagon NPU processors and help accelerate our roadmap. While we are in the early stages of this expansion, we are engaged with multiple potential customers and are currently in advanced discussions with a leading hyperscaler. If successful, we expect revenues to begin in the fiscal twenty twenty eight timeframe. Additionally, we signed an MOU with Humane to develop AI data centers in Saudi Arabia and deliver highly efficient and scalable cloud to edge hybrid AI inferencing solutions for local and international customers. We also announced that our Orion CPUs can be integrated with NVIDIA GPUs for high performance factories using the NVIDIA NVLink Fusion architecture.\n\n**Cristiano Amon** (President &amp; CEO)\nWe will provide further updates as we make progress. Over the past twelve months, we have continued to see AI and generative AI advance at an accelerated rate and we're both excited and confident in the opportunities this is creating for Qualcomm across all our businesses. As GenAI changes the human computer interface and AgenTek AI experiences continue to evolve, the mobile industry is being redefined and a new generation of personal AI devices are emerging. Smart glasses and wearables such as smart watches, earbuds and other form factors are being transformed into personal AI devices as they connect the user directly to the AI agent and model. These devices are quickly transitioning from simply extending smartphone experiences to now providing new and unique personalized AI and agentic use cases.\n\n**Cristiano Amon** (President &amp; CEO)\nThese devices will evolve independently of the smartphone ecosystem and become a significant opportunity. Given our technology leadership in mobile, XR and wearables and the breadth of our P and product portfolio, we expect to be the industry preferred solution provider in this new category. Specifically, personal AI devices will require Snapdragon's always on cloud connectivity, five gs and micro power Wi Fi, power efficient processing on device AI best in class imaging, audio, video, sensors and context capabilities. Meta AI smart glasses are currently the best example of personal AI. We're very optimistic about the trends we see in this area with major AI players, application developers and device makers investing in this space.\n\n**Cristiano Amon** (President &amp; CEO)\nPhysical AI is another technology that is reshaping industries and creating new opportunities particularly in robotics. Robotics require high performance computing including powerful on device extended battery life, reliable connectivity, a higher level of silicon integration and advanced computer vision and sensor fusion to interpret and understand real world information in real time and make decisions locally. These requirements are perfectly aligned with our strengths in our technology and product portfolio. Our right to play in this new segment is similar to our expansion into automotive. Furthermore, our experience in industrial and safety grade silicon, perception and sensing technologies and ADAS and autonomy provide a very competitive foundation to develop highly differentiated solution for autonomous robots, next generation industrial automation and humanoid robotics.\n\n**Cristiano Amon** (President &amp; CEO)\nWe're incredibly excited about this opportunity for which third party estimates indicate a potential TAM of $1,000,000,000,000 in the next decade. I would now like to turn the call over to Akash.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nThank you, Cristiano. Good afternoon, everyone. Let me begin with our third fiscal quarter results. We delivered revenues of $10,400,000,000 and non GAAP EPS of $2.77 which was near the high end of our guidance range. QTL revenues of $1,300,000,000 and EBT margin of 71% were above the midpoint of our guidance.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nQCT delivered revenues of $9,000,000,000 and EBT of $2,700,000,000 with year over year growth of 1122% respectively. QCT EBT margin of 30% was at the high end of our guidance range. QCT handset revenues increased 7% year over year to $6,300,000,000 reflecting strong demand for premium tier handsets enabled by our Snapdragon eight Elite platform. QCT IoT revenues grew 24% year over year to $1,700,000,000 The outperformance relative to expectations was driven by increased demand for our Snapdragon AR1 chipset, the clear industry leader in emerging AI smart glasses category. We delivered another record quarter in QCT Automotive with revenues of $984,000,000 an increase of 21% year over year, driven by content growth in new vehicle launches with our Snapdragon digital chassis platform.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nLastly, we returned $3,800,000,000 to stockholders, including $2,800,000,000 in stock repurchases and $967,000,000 in dividends, aligned with our commitment to return 100% of our free cash flow in the fiscal year. Before turning to guidance, a quick reminder that our fourth quarter and fiscal twenty twenty five includes thirteen weeks relative to a fourteen week quarter in the year ago period. For the fourth quarter, we are forecasting revenues of 10,300,000,000.0 to $11,100,000,000 and non GAAP EPS of 2.75 to $2.95 In QTL, we estimate revenues of 1,250,000,000.00 to $1,450,000,000 and EBT margins of 69% to 73%. In QCT, we expect revenues of $9,000,000,000 to $9,600,000,000 and EBT margins of 27% to 29%. We anticipate QCT handset revenues to grow approximately 5% sequentially consistent with typical historical trends despite lower Apple revenues.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nWe estimate QCD IoT revenues to be flat sequentially and QCD Automotive revenues to reach $1,000,000,000 in the fourth fiscal quarter. Lastly, we estimate non GAAP operating expenses to be approximately $2,350,000,000 in the quarter. In closing, we are very pleased with our performance in fiscal twenty twenty five as we continue to execute on the financial metrics we outlined at our Investor Day last year. Based on the midpoint of our guidance, we are positioned to deliver revenue and non GAAP EPS growth of 1216% respectively relative to fiscal twenty twenty four. We are forecasting fiscal twenty twenty five to be the second consecutive year of greater than 15% year over year growth in total QCT non Apple revenues.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nWe anticipate QCT IoT and automotive revenues to grow by approximately 2035% respectively, reinforcing our confidence in achieving our fiscal twenty twenty nine target of $22,000,000,000 in combined automotive and IoT revenues. We are pleased to see our customer relationships strengthening during a time of global trade volatility, including the upcoming global ADAS launch with BMW and the recently signed strategic agreement with Xiaomi. We remain focused on maximizing shareholder returns by executing across a broad range of growth and diversification opportunities while maintaining operating discipline. Lastly, I'd like to invite you to tune into our upcoming Snapdragon Summit event taking place on September to learn more about our technology leadership and new product launches. This concludes our prepared remarks. Back to you Mauricio.\n\n**Mauricio Lopez-Hodoyan** (VP - IR)\nThank you, Kash. Operator, we're now ready for questions.\n\n**Operator**\nThank you. Our first question comes from the line of Joshua Buchalter with TD Cowen. Please proceed with your questions.\n\n**Joshua Buchalter** (Director - Equity Research)\nHey guys, thanks for taking my question. I wanted to start with the handset market. I think you just spoke to 5% growth in the September despite the lower share that you communicated at Apple. Can you speak to the drivers there? I mean, I think Xiaomi was up meaningfully in the quarter, which is typical in the June.\n\n**Joshua Buchalter** (Director - Equity Research)\nBut I think investors are worried about some level of pull ins. Are you seeing any evidence of that specifically related to China? Thank you.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nHi, Josh, it's Akash. We're not seeing any evidence of pull in. I think the upside that we guided in the September in handset revenue stream is really driven by our new product launch. As I mentioned in my prepared remarks, we're going to announce our new chip at the September and we are already working with several OEMs for launch of new devices based on a tremendous interest in it. And what you're seeing is really people getting ready for launch of new devices.\n\n**Joshua Buchalter** (Director - Equity Research)\nGot it. Thank you. And to follow-up, I wanted to ask about the data center business and hyperscale engagement you mentioned specifically. Any details you can give us on the scope of that engagement? Is that for an ARM based CPU?\n\n**Joshua Buchalter** (Director - Equity Research)\nIs it an accelerator? And you mentioned fiscal twenty twenty eight is potential if that converts. Is that the right timeframe to think about contribution from your data center business more broadly at other customers as well? Thank you and congrats on the results.\n\n**Cristiano Amon** (President &amp; CEO)\nThank you. Thank you, Joshua. This is Cristiano. We can't really disclose more other than what we said in the script. We are in advanced discussions.\n\n**Cristiano Amon** (President &amp; CEO)\nWe have been executing on a product. As we said before, we always felt that we had IP that were very relevant to the data center. I think the AlphaWave provides complementary IP allow us to build custom SoC products and we're pleased with the way we're developing this. I am sure we'll be able to share more as we probably conclude some of those discussions.\n\n**Operator**\nOur next question is from the line of Samik Chatterjee with JPMorgan. Please proceed with your question.\n\n**Samik Chatterjee** (MD &amp; Equity Research Analyst)\nHi. Thanks for taking my questions. Christian, maybe I can follow-up on the data center road map here or the sort of thought process and strategy around it. Less so maybe but in terms of how do you envision sort of Alphawave integrating into the sort of portfolio of the stack capability that you have currently? And in relation to just thinking about sort of how you're going about selecting customers that you want to approach What's typically sort of in terms of thinking about customization relative to standardization of the chipsets? How you're sort of thinking about deal sizes that would make sense for you in the longer run for this business? Any thoughts around that? Thank you. And I have a follow-up.\n\n**Cristiano Amon** (President &amp; CEO)\nVery good. Thank you for your question. I know there's a lot of topics in that question. I'm trying to probably give an overview. As we said before and we said in the script, we have been focused on building two products.\n\n**Cristiano Amon** (President &amp; CEO)\nOne is ability to leverage our CPU asset. And that happens in two situations. One of course is a general purpose CPU. We've been very focused on hyperscalers. They have first party workloads for ARM compatible CPU.\n\n**Cristiano Amon** (President &amp; CEO)\nThe other one is the head unit for inferencing clusters. As AI start to get scale and we really look of how we're starting to see inference taking over training. There's a new dynamic in the marketplace, which is about ability to be efficient with tokens per dollar as well as energy. That creates an opportunity for us. For that, we have been building accelerator cards and we will be building a rack as well.\n\n**Cristiano Amon** (President &amp; CEO)\nAnd those are the two areas that we're building product roadmap. We're very focused on customers. They have the ability to put first party workloads or inferencing cluster. The Alpha Wave IP is important. It provide us the ability to scale out and provide connectivity.\n\n**Cristiano Amon** (President &amp; CEO)\nWe believe it's leading connectivity in the industry. And that should inform you the type of customers that we've been focusing on. We think there's a very large TAM as you know. There is an opportunity for Qualcomm to play if you have leading IP. Of course, as this is a new market for us and we have been planning for it, we're going to be very careful about making disclosures.\n\n**Cristiano Amon** (President &amp; CEO)\nWe're going to wait until they become factual and we're excited about the engagement we have today. We are in advanced negotiations with one significant customer and hopefully that creates a halo effect that could validate our platform and create other opportunities down the road. Thank you.\n\n**Samik Chatterjee** (MD &amp; Equity Research Analyst)\nThank you for that. And for my follow-up, in the handset business for the fiscal 3Q here, you had 7% revenue growth year over year, which I think did sort of miss modestly you're getting to last quarter for about 10% growth. So maybe if you can shed any color in terms of if you did see any parts of the market that were weaker than you expected in the quarter? And then maybe similarly, when you when I think about your guidance for fiscal fourth quarter here, it looked like you're getting to about a high single digit growth even as Apple even with the impact of Apple. So maybe you've imparted out in terms of this how the strength is because that seems like a pretty robust number for fiscal fourth quarter even with the loss of capital revenues?\n\n**Akash Palkhiwala** (CFO &amp; COO)\nYes. Samik, it's Akash. On the third quarter, we had a slightly weaker mix than we expected. As you know that this is a quarter that is seasonally weaker for us as there are no flagship launches. And that mix is really the weaker mix is more than offset by the strength you're seeing in the September, where as I mentioned earlier to Josh's question, we're launching the new chip.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nWe have flagship launches coming in at the end of the quarter and we are seeing the demand increase because of that reason.\n\n**Operator**\nOur next question comes from the line of Stacy Rascon with Bernstein Research. Please proceed with your question.\n\n**Stacy Rasgon** (MD &amp; Senior Analyst)\nHi guys. Thanks for taking my question. Given the guidance into September, but the dynamics around Apple and everything else, I mean, would you consider normal seasonal into December quarter? How should we think about drivers as you currently see them against that normal against that seasonal trend? How should we expect things?\n\n**Stacy Rasgon** (MD &amp; Senior Analyst)\nIf there's anything else funky going on in December that we should know about that would influence results versus what might be more typical?\n\n**Akash Palkhiwala** (CFO &amp; COO)\nYes. Stacy, it's Akash. Assuming you're asking about the December quarter, note we expect normal revenue seasonality for all businesses, of course, adjusted for the lower share in Apple phone launches that we've previously discussed, but nothing else to highlight in all other businesses.\n\n**Stacy Rasgon** (MD &amp; Senior Analyst)\nI mean, what would you consider normal seasonal then?\n\n**Akash Palkhiwala** (CFO &amp; COO)\nWell, we're not specifically guiding the quarter at this point, but I think you've seen a trend in the last several years and you'd expect the same quarterly trend just adjusted for the lower Apple volume for the share we've provided.\n\n**Operator**\nThank you. Our next question is from the line of Joe Moore with Morgan Stanley. Please proceed with your question. Mr. Moore, your line is live for question.\n\n**Operator**\nPerhaps you're on mute. Thank you. Our next question will be from the line of Chris Caso with Wolfe Research.\n\n**Chris Caso** (Managing Director)\nYes.\n\n**Chris Caso** (Managing Director)\nThank you. If I could just expand upon some of the commentary with regard to the December. My understanding is last year, the Chinese OEMs started pulling forward the launch a little bit of some of the flagship devices. Also, as we were last year, there was an extra week in the quarter. So and I guess maybe just some more granularity on the puts and takes on December taking that into account.\n\n**Chris Caso** (Managing Director)\nHow much of a lift is that in the December? And then does that turn into a more of a headwind as you go into the March?\n\n**Akash Palkhiwala** (CFO &amp; COO)\nYes. I think, Chris, the business remains very strong. So whether you look at the Android business, automotive, IoT, all the trends continue with the growth rates that we've previously outlined for the business. So there's nothing significant or unique that I want to point out there. I think we've talked about the Apple share dynamics, so that is a factor.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nBut outside of that, I think you should think of this as a very strong quarter for us. Seasonally, the strongest quarter for us is December and that will still be true regardless of the lower Apple share.\n\n**Chris Caso** (Managing Director)\nGot it. Okay.\n\n**Chris Caso** (Managing Director)\nIf I could follow on with the data center business and you don't understand that you can't talk so much about some of the progress and design wins that you hope to have on that until they become factual. What about from a spending side? And moving into a new line of business, what's going to be the impact on spending? And then as AlphaWave closes, what will be the effect of that on sort of revenue expenses and EPS?\n\n**Akash Palkhiwala** (CFO &amp; COO)\nYes. So from a spend perspective, Chris, the way we've managed OpEx over the last several years, you've seen us very small growth in OpEx over the last four years. And the way we've managed it is really kind of absorbing the salary increases and reallocating existing spend towards diversification and growth. And really the hiring as we go forward is really going to be focused on new skills that are required to execute on our plan. And so to the extent that there are new skills required to execute on the data center diversification assets, we will invest in that.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nBut outside of that, we plan to be pretty careful managing OpEx going forward.\n\n**Operator**\nOur next question comes from the line of Ross Seymar with Deutsche Bank. Please proceed with your question.\n\n**Ross Seymore** (Managing Director)\nHi, guys. Thanks. I may ask a couple of questions. Just want to get into the OEM side. Akash, you've been very clear about what's happening on the Apple side of things.\n\n**Ross Seymore** (Managing Director)\nBut recently, you've seen Samsung launch a couple of models with its own processor. I just wondered, how do you compare and contrast that against the x85 that you guys are rightly excited about going forward? Do you think you will maintain the 100% share on the Galaxy S generation or is that decision not quite made yet? Any color on that would be helpful.\n\n**Cristiano Amon** (President &amp; CEO)\nHey, Raj, thanks for the question. We have been talking about the framework of our relationship with Samsung and we have been executing multi year, multi generation agreement with Samsung and we have defined the new baseline of our share in the order of 75%. Anything above that is upside. So that's our planning assumption. And when we outperform, I think we end up you started to see what you saw in Galaxy S25.\n\n**Cristiano Amon** (President &amp; CEO)\nCompeting against the Samsung own platform is nothing new for Qualcomm. We've been doing that for decades. But I think historically, we have seen a relationship with Samsung continue to move up to higher level of share and that's the baseline assumption. 75% is the baseline. That's the contract to a share everything above that is upside.\n\n**Ross Seymore** (Managing Director)\nThank you for that color. I guess as a follow-up and it probably would align to that also within handsets. You've talked about at least the premium tier flagship tier of having roughly double digit ASP or content increases going forward with all the capabilities that you're offering. Does that still hold true? Does it accelerate decelerate with the x85? Just any update on that would be great.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nYes. So if you think about our Android business in the fiscal twenty twenty five, it grew over fiscal twenty twenty four by approximately 10%. So that is higher than the target we'd set at Investor Day. And it's a reflection of the strength of our roadmap, our competitive positioning and the fact that this is a market where the volume is moving up to higher tiers where Qualcomm has a very strong position. The other thing I just want to highlight is we did give a metric both in Mayan and Cristiano's prepared remarks is over the last two years kind of our non Apple revenue stream in QCT has grown annually at more than 15%.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nSo that should give you a key benchmark as you think about how the company is positioned to grow going forward as well. And this aligns with the fiscal twenty twenty nine targets we set at Investor Day.\n\n**Operator**\nThe next question comes from the line of Tal Liani with Bank of America. Please proceed with your question. Tyler, your line is live for question. Perhaps you're on mute.\n\n**Tal Liani** (Technology Analyst)\nAbout China handsets. The proportion of China is going up. And if Samsung you said you're working with an assumption of 75 for Samsung. So if Samsung is going to go down from 100% for the Galaxy to 75%, China would further go up in percentage of QCT revenues. How do you see the China growth trends when it comes to the domestic market and international markets?\n\n**Tal Liani** (Technology Analyst)\nWhat's the outlook from your perspective? And what's the risk of competition within the Chinese market? Thanks. I have just a follow-up question on margins, but I'll keep it separate.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nTal, our position in China continues to be very strong. I think the evidence of that is the announced agreement that we announced with Xiaomi during the quarter. This is a multiyear agreement for premium phones with increasing volumes every year and they're going to use our chip for launches within China and globally as well. In addition, they'll also be the first OEM to launch with our next Snapdragon eight Elite chip, which comes out over the next couple of months. And the relationship really has expanded over the last couple of years.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nWe've gone from phones to automotive. They introduced smart glasses with our chips, wearables, tablets. So it's a very broad relationship and it's just an example of relationships we have with other Chinese OEMs as well. So you should consider this as a very well positioned sustained business for us. Within Samsung, as you can see in fiscal in 2026, they launched most of their devices with hard chip, but they did launch Flip with their own.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nAnd so we're slightly below 100% share. And as we go to next year, I think our agreement as Cristiano outlined carries over and we're in a very good position to maintain our scale there as well.\n\n**Cristiano Amon** (President &amp; CEO)\nLet me just add add a different perspective. So I'm going to agree with Akash, but I'll provide probably a comment of questions that we usually we don't get. Look, have been doing business in China for thirty years. We actually started down at the three gs. And I think what we learned by doing business in China, we actually learned how to move at China's speed.\n\n**Cristiano Amon** (President &amp; CEO)\nAnd I think if you look at the position in Qualcomm in China, they only improve over the years. And as Akash outlined, not only we've been well positioned in the phone business, we're well positioned with some of the fastest growing OEMs in the auto business and that is expanding now into industrial, into robotics and other areas. So another way to look into this is Qualcomm has became a very competitive company and learned how to compete in China and have been serving well. I think the market we expected to that to continue to be the case.\n\n**Tal Liani** (Technology Analyst)\nGot it. Maybe just a question on margins, a quick one. I see that when I look at gross margin, operating margin, I see that there is kind of you managed to maintain a very healthy operating margin despite the fluctuations in Apple revenues. So I just want to ask you a question I'm getting from investors quite often. What are the implications of the decline in Apple?\n\n**Tal Liani** (Technology Analyst)\nWhat are the implications on margins? Are they positive or negative? Thanks.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nYes. I think we're very happy with the margin profile of the business. I mean, we will be at close to 30% margin this year, which is the target we have set for the long term. As you look forward, the growth opportunity that we have in auto IoT far exceeds the scale of the Apple revenue. So I think we have the ability to continue to grow revenue and manage the margin profile as a result of it.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nAnd so no change to our long term target margin versus what we've said in the past.\n\n**Operator**\nThank you. Our last question comes from the line of Ben Reisis with Melius Research. Please proceed with your question.\n\n**Ben Reitzes** (MD &amp; Head - Technology Research)\nHey guys, thanks a lot. I appreciate it. I wanted to ask about the data center. You're buying AlphaWave for 2,400,000,000.0 You have big ambitions there, it sounds like, for FY 2028. What is what are your thoughts on doing having more of a tuck in acquisition strategy there or even going bigger to get big fast and get a hold of customers if you have such great IP.\n\n**Ben Reitzes** (MD &amp; Head - Technology Research)\nI was just wondering if you kind of give your a little bit more of the strategy. Is it more alpha waves coming or would you ever consider a bigger acquisition? Thanks.\n\n**Cristiano Amon** (President &amp; CEO)\nThanks Ben for your question. Look, at this point, we're very focused on actually driving Alpha Wave to closure and building our product roadmap. I think we feel that it provides the IP that is complementary to what we have and allow us to build a competitive position. This is a new initiative for Qualcomm as I outlined. And like we have done for the rest of our business, as opportunity becomes available, we're always going to be looking how to complement the roadmap.\n\n**Cristiano Amon** (President &amp; CEO)\nRight now, we're really focused on driving Alpha Wave to closure.\n\n**Ben Reitzes** (MD &amp; Head - Technology Research)\nAll right. Thanks. And can I just ask a quick follow-up on your comments around Gemini and Galaxy AI use in the Android area? And just can you just draw that out a little more? Obviously, there's a perception that the Apple products are a little behind in AI.\n\n**Ben Reitzes** (MD &amp; Head - Technology Research)\nAnd what that means for you over the long term, whether you're really optimistic about that, maybe even past the your fiscal first quarter and just any more color there? Thanks.\n\n**Cristiano Amon** (President &amp; CEO)\nYes. Consistent to what we have been saying, we're to see AI use cases on phones to gain traction. And there's also another interesting data point. I think if you look of the overall share of AI models, you see Gemini actually increasing dramatically over other models. We have seen I think the advantage of the Android ecosystem in terms of majority of AI as more and more use cases become agentic or you started to see AI as part of the applications.\n\n**Cristiano Amon** (President &amp; CEO)\nI expect that it creates excitement about the Android ecosystem, expand its SAM, any drives, upgrade cycles. Those are all positive things from a mobile business. So I will think that what AI is doing is making connectivity more relevant again, because of voice utilization is driving more computing, more capable devices and exactly changing the use cases. And the rate of utilization, it's very encouraging what I said in the call about 3x between Galaxy S24 and Galaxy S25 and I think I expect that to continue to accelerate.\n\n**Operator**\nThank you. This concludes today's question and answer session. Mr. Ramon, do you have anything further to add before joining the call?\n\n**Cristiano Amon** (President &amp; CEO)\nThank you all for attending the call. I'd like to thank our employees, our partners and we appreciate following Qualcomm. We'll continue to execute on our strategy. We feel that the company is on the right trajectory, especially as we look for growth and diversification beyond handsets and AI continue to be a great opportunity for us. Thank you very much.\n\n**Operator**\nLadies and gentlemen, this concludes today's conference call. You may now disconnect.",
      "fetched_at": "2026-02-04T15:41:16.053Z"
    },
    {
      "ticker": "QCOM",
      "title": "QUALCOMM Incorporated (QCOM) Q2 FY2025 earnings call transcript",
      "published_date": "Apr 30, 2025, 4:45 PM EDT",
      "fiscal_year": "2025",
      "quarter": "Q2",
      "url": "https://finance.yahoo.com/quote/QCOM/earnings/QCOM-Q2-2025-earnings_call-313791.html",
      "content": "**Operator**\nLadies and gentlemen, thank you for standing by. Welcome to the Qualcomm Second Quarter Fiscal Year twenty twenty five Earnings Conference Call. At this time, all participants are in a listen only mode. Later, we'll conduct a question and answer session. As a reminder, this conference is being recorded, 04/30/2025.\n\n**Operator**\nPlayback number for today's call is (877) 660-6853. International callers, please dial (201) 612-7415. Playback reservation number is 1375278. I would now like to turn the call over to Mauricio Lopez Odoyen, Vice President of Investor Relations. Mr. Lopez Odoyen, please go ahead.\n\n**Mauricio Lopez-Hodoyan** (VP, Investor Relations)\nThank you, and good afternoon, everyone. Today's call will include prepared remarks by Christian Ramon and Akash Palakkawala. In addition, Alex Rogers will join the question and answer session. You can access our earnings release and a slide presentation that accompany this call on our Investor Relations website. In addition, this call is being webcast on qualcomm.com and a replay will be available on our website later today.\n\n**Mauricio Lopez-Hodoyan** (VP, Investor Relations)\nDuring the call today, we will use non GAAP financial measures as defined in Regulation G and you can find the related reconciliations to GAAP on our website. We will also make forward looking statements, including projections and estimates of future events, business or industry trends or business or financial results. Actual events or results could differ materially from those projected in our forward looking statements. Please refer to our SEC filings, including our most recent 10 ks, which contain important factors that could cause actual results to differ materially from the forward looking statements. And now to comments from Qualcomm's President and Chief Executive Officer, Cristiano Mon.\n\n**Cristiano Amon** (President &amp; CEO)\nThank you, Mauricio, and good afternoon, everyone. Thanks for joining us today. In fiscal Q2, we delivered non GAAP revenues of $10,800,000,000 and non GAAP earnings per share of $2.85 Revenues of $9,500,000,000 from our chipset business were driven by strength across handsets, automotive and IoT, all exceeding revenue expectations.\n\n**Cristiano Amon** (President &amp; CEO)\nAutomotive and IoT revenues increased 5927% year over year respectively. Licensing business revenues were $1,300,000,000 Demand for our industry leading platforms continues to expand as high performance connectivity and processing at the edge are increasingly important and AI becomes more pervasive across industries. We have the industry's broadest product and IP portfolio, a strong track record of establishing a technology leadership position in every industry we enter and a clear vision for the future. As we navigate the current macroeconomic and trade environment, we remain focused on driving the next wave of AI smartphones and growing our non handset revenues to $22,000,000,000 by fiscal twenty twenty nine. We are excited by the ongoing developments in generative AI, including the proliferation of smaller models.\n\n**Cristiano Amon** (President &amp; CEO)\nIn just six months, the AI landscape has been redrawn with a wide array of new consumer and enterprise applications. New players have emerged and AI video models are becoming more dependable, marking a significant expansion in capabilities. Additionally, smaller Gen AI models that can run directly on device are also advancing rapidly. It now takes only a few months to match the performance of their larger cloud based counterparts compared to twelve months just a year ago. Several new state of the art small language and multimodal models were recently released including Microsoft Fi, Google Nano, MetaLama, Mr. Minnestral, OpenAI Whisper and Alibaba Quen. Some of these models are already running on Snapdragon platforms. As these trends continue, the opportunity for Qualcomm is significant. I will now provide some key highlights from across the business starting with mobile. At Mobile World Congress, we announced our x85 four gs platform, the world's most advanced AI powered modem to antenna system delivering substantial improvements in speed, efficiency, coverage and power consumption.\n\n**Cristiano Amon** (President &amp; CEO)\nThe x85 sets new benchmarks and brings connectivity leadership to the Android ecosystem. It also supports five gs advanced capabilities with ultrafast peak download speeds of up to 12.5 gigabits per second and delivers the connectivity required for hybrid and agentic AI experiences. High performance low latency five gs is essential for AI applications, ensuring seamless and timely data transmission and information retrieval for real time processing and decision making. According to Google, the x85 is designed for mobile AI and is the perfect match for Android in the agentic experiences of the Gemini era. This modem delivers breakthrough five gs speeds, network reliability and intelligent connectivity to Android phones, cementing Android and Qualcomm Technologies leadership in the mobile AI world.\n\n**Cristiano Amon** (President &amp; CEO)\nThe x85 was also positively received by many of the largest operators in The U. S, China and Japan who are excited about the superior connectivity x85 brings to five gs smartphones, the improved network performance and reliability and potential for new AI powered services. The x85 will be shipping in handsets, automotive and IoT products starting in the second half of the year. Within smartphones, we expect this platform to be available exclusively on Android devices. In handsets, we continue to gain design traction with our Snapdragon eight Elite, the industry's most powerful smartphone platform.\n\n**Cristiano Amon** (President &amp; CEO)\nTo date, we have 90 flagship designs shipped or announced globally across major Android OEMs. During the quarter, subsidies in China had a positive impact on growing the premium tier, which has continued to expand over the last several years. Additionally, we're incredibly excited to see our customers launching innovative new flip style devices featuring Snapdragon eight Elite. This is now a flagship smartphone category. As an example, the recently announced flip style Motorola Razr Ultra twenty twenty five comes with Moto.ai, a suite of AI powered features such as Catch Me Up, which summarizes notifications and prioritizes urgent messages, Remember This, which saves screenshots, photos and notes to recall later and Magic Canvas, which lets users create AI generated images as wallpapers.\n\n**Cristiano Amon** (President &amp; CEO)\nIt also integrates Perplexity AI, Google Gemini, Microsoft Copilot and MetaLama. We remain excited about the PC opportunity for Snapdragon and we're making progress toward achieving $4,000,000,000 in revenues by fiscal twenty nineteen. We're extremely focused on driving new OEM designs, expanding markets and channels, growing into the enterprise and increasing the ecosystem of native applications. Since the launch of the first Snapdragon X Power devices in mid-twenty twenty four, we have more than 85 designs in production or development and we're targeting more than 100 designs to be commercialized to 2026. In the first calendar quarter of twenty twenty five, according to third party sources, Snapdragon based PCs made up approximately 9% of Windows laptops above the $600 price tier in retail U.\n\n**Cristiano Amon** (President &amp; CEO)\nS. And the top five European countries. We now have more than seven fifty native applications running on Snapdragon X, including over 100 for the enterprise. Additionally, there are over 1,400 games running on the platform. Microsoft has continued to add new Copilot plus AI capabilities.\n\n**Cristiano Amon** (President &amp; CEO)\nThis includes the rollout in March and April of expanded live captions, which offers real time audio and video translations in English during virtual meetings, podcast or video playback and new voice access functions that enable users to interact with the AI assistant using natural language voice commands. Consumers can also experience recall, improved Windows search and click to do, making it easier to pick up where you left off, find what you're looking for and do more with less time. We also continue to partner with Microsoft on their signature Surface PCs. In XR, favorable consumer reception for smart glasses continues, particularly as AI enables more compelling use Meta continues to add more capabilities to their Ray Ban smart glasses powered by Snapdragon.\n\n**Cristiano Amon** (President &amp; CEO)\nThese include enhanced AI assistant interactions, video AI support, location recall, live speech translation and more. In addition to Meta, in Samsung's upcoming Android XR headset, we're pleased to report that we now have more than 15 designs of smart glasses from our global partners. Smart glasses are now the best example of a new device category gaining scale because of AI. We remain confident in our ability to achieve $2,000,000,000 in XR revenues by fiscal twenty twenty nine. We continue to see strong demand in automotive for the Snapdragon digital chassis and we are on course to reach our fiscal twenty twenty nine revenue target of $8,000,000,000 During the quarter, we secured 30 new designs including five ADAS programs as well as designs from Chinese automakers such as NIO, Zeeker, Great Wall, Dongfeng and more.\n\n**Cristiano Amon** (President &amp; CEO)\nWe also saw 14 commercial vehicle launches from global automakers utilizing our platforms with a total of 29 commercial vehicle launches since the start of the fiscal year. Additionally, last week at the Shanghai Auto Show, we announced new collaborations with Visteon and Patel to create next generation AI intelligent cockpit solutions based on our Snapdragon cockpit elite. And with this SV to jointly deliver a suite of pre integrated ADAS solutions that support L1 and L2 plus functions. Fiscal Q2 was a strong quarter for Industrial IoT with notable new partnerships and recently the completion of two strategic acquisitions increasing our confidence in executing on our industrial IoT revenue target of $4,000,000,000 by fiscal twenty nineteen. In a major step toward advancing industrial intelligence at the edge, we're collaborating with Palantir to integrate their Ontelligent enterprise systems and AI capabilities on our advanced platforms.\n\n**Cristiano Amon** (President &amp; CEO)\nThis collaboration will enhance real time insights and data driven decisions in remote and offline environments, enabling OEMs and enterprises to deploy scalable AI solutions for manufacturing, industrial and automotive applications. We acquired Edge Impulse, one of the industry's leading edge AI development platforms, which enables more than 170,000 developers to build solutions for a wide range of applications such as asset tracking and monitoring, manufacturing, anomaly detection and predictive maintenance systems using various AI capabilities, including computer vision, time series data, audio events and speech recognition. The development platform includes a comprehensive set of tools and features for data collection and preparation, model training, deployment and monitoring, all with an easy to use user friendly interface requiring little or no code at all. As AI accelerates the next phase of digital transformation, Edge Impulse combined with our AI hub creates a true world class industrial development platform for the age of intelligence. We also acquired Focus AI, a leader in computer vision at the edge for an intelligent end to end edge AI and cloud management solution that enables real time insights and analysis.\n\n**Cristiano Amon** (President &amp; CEO)\nFocus AI solutions are now part of the new Qualcomm Dragon Wing Intelligent Video Suite enhancing our video analytics AI portfolio. Finally, in edge networking, we launched the Dragonwing fixed wireless access Gen four Elite platform based on the x85 and is the world's first five gs advanced FWA platform. It includes an AI co processor that delivers up to 40 TOPS of AI processing power to optimize wireless connectivity across five gs broadband and Wi Fi seven and unlocks new Gen AI capabilities at the network edge. I would now like to turn the call over to Akash.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nThank you, Krishana, and good afternoon, everyone. I'll start with our second fiscal quarter earnings. We are pleased to announce non GAAP revenues of $10,800,000,000 and non GAAP EPS of $2.85 both of which are above the midpoint of our guidance. QTL revenues of 1,300,000,000 and EBITDA margin of 70% were flat on a year over year basis and slightly below the midpoint of our guidance due to lower handset units in emerging regions. QCT delivered revenues of $9,500,000,000 an EBT margin of 30%, with revenues at the high end of our guidance due to upside across handsets, IoT and automotive.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nQCT handset revenues grew 12% year over year to $6,900,000,000 reflecting the benefit of increased premium tier Android shipments. QCT IoT revenues of $1,600,000,000 increased 27% versus a year ago period, driven by demand for our products with connectivity, processing and AI technologies. We delivered QCT Automotive revenues of $959,000,000 reflecting 59% year over year growth on increased content in new vehicle launches with our Snapdragon digital chassis platforms. Lastly, we returned $2,700,000,000 to stockholders, including $938,000,000 in dividends and $1,700,000,000 in stock repurchases. Now turning to guidance.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nI'll first address the macroeconomic environment, including the impact of tariffs. There's uncertainty around the impact of the global trade landscape on demand across our businesses. Our guidance for the upcoming quarter is based on our current assessment of the financial impact of tariffs as they stand today. As the situation remains dynamic, we'll continue to closely monitor for potential changes. For the third fiscal quarter, we are forecasting revenues of 9,900,000,000.0 to $10,700,000,000 and non GAAP EPS of $2.6 to $2.8 We estimate QTL revenues to be approximately flat on a year over year basis, reflecting normal seasonality for handset units with revenues of 1,150,000,000.00 to $1,350,000,000 and EBT margin of 67% to 71%.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nIn QCT, we expect revenues of $8,700,000,000 to $9,300,000,000 and EBT margin of 28% to 30%. At the midpoint, this reflects year over year revenue growth of approximately 12%, led by strength in handsets, IoT and automotive. We expect QCT handset revenues to increase approximately 10% on a year over year basis, driven by growth in Android. We estimate QCT IoT and automotive revenues to grow approximately 1520%, respectively, versus a year ago period, driven by the same factors I outlined in our second quarter results. Lastly, we estimate non GAAP operating expenses to be approximately $2,250,000,000 In closing, we are very pleased with our strong results in the first half of fiscal twenty twenty five, with revenue and non GAAP EPS growth of 1721%, respectively, versus a year ago period.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nWe are increasing our capital return target to 100% of free cash flow in fiscal twenty twenty five, reflecting confidence in our strong cash flow generation and financial targets outlined at our recent Investor Day. As the global trade environment continues to evolve, we remain focused on our execution priorities, including our relationships with customers and partners globally and investing in our industry leading technology and product road map. Despite the near term macro uncertainty, our business strategy remains unchanged, and we remain committed to our long term financial framework. Our disciplined capital allocation and balance sheet flexibility position us for success across varying market scenarios. This concludes our prepared remarks. Back to you, Mauricio.\n\n**Mauricio Lopez-Hodoyan** (VP, Investor Relations)\nThank you, Kosh. Operator, we are now ready for questions.\n\n**Operator**\nThank you. The first question comes from Joshua Buchalter with TD Cowen. Please proceed with your question.\n\n**Joshua Buchalter** (Director - Equity Research)\nHey, guys. Thanks for taking my question and congrats on the solid results in a difficult backdrop. My first question, could you maybe spend a couple of minutes talking through what kind of assumptions you're baking into, in particular your guidance in the handset market? I mean, there's pretty widespread concerns of tariff related pull ins, are you seeing any signs of that yet? And in particular, largest customer was up pretty meaningfully year over year.\n\n**Joshua Buchalter** (Director - Equity Research)\nSo was there any change in order patterns there? Thank you.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nYes. Thanks, Josh, for the question. Our approach on tariffs is really our guidance reflects our current assessment of the financial impact from it. We do not see any material direct impact to us at this point. The landscape obviously is dynamic, so we're closely monitoring.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nBut we're very focused on things we control and very focused on supporting our customers as well. One thing to remember is when you look at our supply chain, we have a very diversified global supply chain. And so that positions us very well to navigate challenges that might happen as a result of tariffs. And then maybe specifically on your question of pull ins, we have not seen any material pull ins from our customers. So this reflects kind of reasonable consistent ordering patterns from them. And that's what's reflected in our guidance.\n\n**Joshua Buchalter** (Director - Equity Research)\nUnderstood. Thank you. I have to follow-up. I think a quarter ago, you expressed some optimism, but certainly didn't include it any Huawei royalty revenue in the model. Any updates to share on those negotiations, obviously, given the difficult backdrop to be signing deals right now? Thank you.\n\n**Alex Rogers** (President, QTL and Global Affairs)\nJosh, this is Alex. There really aren't any updates. Discussions will be ongoing, but we don't have any updates right now.\n\n**Operator**\nThe next question is from Sadamik Chatterjee with JPMorgan. Please proceed with your questions.\n\n**Samik Chatterjee** (Executive Director)\nHi. Thanks for taking my question. So maybe if I can start on the IoT segment and just in relation to the it seems like that is the segment you saw the most upside related to your own expectations for the quarter. If you can just flesh out what drove that upside? And maybe just going back to following up on the last question as well, like is that a segment that you've seen any evidence of pull forward of demand? And then I have a quick follow-up.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nHi, Samik. It's Akash. So in the IoT area, we saw tremendous growth in the quarter. We reported results. So 27% year over year growth.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nAnd we saw growth across all three areas, so consumer, networking and industrial. The largest growth contributor was actually industrial. As we've discussed in the past, we have this premise of where the market is going, which is a transition from microcontrollers to microprocessors and AI. And we're seeing the benefit of our technology portfolio as it applies to that transition. And so we're at the front end of the transition in our minds.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nAnd some of the upside in the quarter came through the benefit that came from that transition. Maybe the last thing I'll highlight is when you step back and look at all the different areas in our IoT revenue stream, which is PC, XR, industrial networking, our technology is becoming more relevant than ever to each of those areas. So that's what gives us confidence in our long term forecast.\n\n**Samik Chatterjee** (Executive Director)\nOkay. Got it. Got it. And then maybe for my follow-up, if I can ask you about your M and A pipeline and strategy here. Just when I look at Focus dot ai and Edge Impulse, obviously, don't know those businesses as closely, but how should we think about some of these acquisitions enhancing the capabilities in the current end markets that you're trying to diversify and enhance your position in relative to maybe some acquisitions adding to the existing end markets and giving you more growth pillars in terms of additional incremental end markets that you can go into with some acquisitions? Thank you.\n\n**Cristiano Amon** (President &amp; CEO)\nSamik, this is Cristiano. Thanks for the question. Look, this is very consistent to what we said before and I kind of point you back to the plan we outlined on our last Investor Day. If you look, we had made acquisitions in the past to create our automotive business, which we feel very confident about how complete our roadmap is. We made acquisitions such as Nuvia, which enable us to create an opportunity in compute.\n\n**Cristiano Amon** (President &amp; CEO)\nAnd we have been saying that the next focus for the company was to really augment our IoT space and especially in industrial. As Akash outlined, we're 100% convinced there's a significant opportunity for advanced computing and AI at the edge in industrial. And what you see us doing with Edge and Pulse with Focus dot ai is actually building a software platform that we can scale our technology to all those different verticals and we'll probably continue to augment the platform with those types of acquisitions.\n\n**Operator**\nOur next question comes from Timothy Arcuri with UBS. Please proceed with your question.\n\n**Timothy Arcuri** (Managing Director)\nA lot. Akash, typically Thanks I know there's a lot of uncertainty, but is there anything besides just the macro that you would sort of point us away from thinking of that as like a normal Q3?\n\n**Akash Palkhiwala** (CFO &amp; COO)\nYes, Tim. You're right. I mean, as we look at the fourth quarter, obviously, the underlying factor there is the macro environment. And so we've reflected the best information we have today, and we're going to watch obviously monitor that closely. In QCT, specifically, when you look at Android, automotive and IoT, we expect normal seasonality, both from a quarter over quarter and year over year perspective.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nAnd then within the Apple product business, as we have said, we expect our share to go lower in the launches that happen in fall twenty twenty five. So we're forecasting approximately 70% share in that launch. And the rest of the factors kind of consistent with what you'd expect.\n\n**Timothy Arcuri** (Managing Director)\nGreat. And then just on China, there's a few offsetting factors. I know you did speak about the stimulus helping the market, but there's also tariffs and trade. So how do you handicap your China business? Are you seeing signs of the customers wanting to move away from U.\n\n**Timothy Arcuri** (Managing Director)\nS. Suppliers like you and move more to MediaTek? How do you weigh those factors? Thanks.\n\n**Cristiano Amon** (President &amp; CEO)\nHey, Tim, thanks for the question. This is Cristiano. Look, at this point, we feel their position is strong because it has to do with how unique our product is and how relevant our product is for the global ambition for of our customers. I think we remind everyone that when we look at our China exposure, there are the products that stay within China, but there is a significant volume that goes from China to the rest of the world. And I think that's what drives uniqueness I think of the Snapdragon position there.\n\n**Cristiano Amon** (President &amp; CEO)\nAnd there are couple of data points. I think just a couple of weeks ago, had the Shanghai Auto Show. We had a number of new partnerships including an expansion of the pipeline with new design wins in auto. We have seen no signs of a slowdown in design traction on Qualcomm products within our Chinese base and that includes smartphones, PC, automotive, XR and we're excited about some traction in industrial as well. Thank you.\n\n**Operator**\nOur next question is from the line of Stacy Rasgon with Bernstein. Please proceed with your question.\n\n**Stacy Rasgon** (Analyst)\nHi, guys. Thanks for taking my questions. I wanted to first ask about chipset gross margins. It looks like they were down a bit in Q2, maybe 90 bps or so. They seem like they're being guided up similar amount in Q3.\n\n**Stacy Rasgon** (Analyst)\nBut like why were they down in Q3 and Q2, especially given with within handsets, the presumed mix toward more premium, given the weakness in the emerging region smartphones that you talked about? Was it just mix between like the different segments or just like what was going on there?\n\n**Akash Palkhiwala** (CFO &amp; COO)\nYes. So Stacy, this is Akash. It's really the mix across tiers and segments as well, right? We saw some upside that came through on lower tiers that kind of made us very small difference in gross margin. But kind of when you step back and think about broader gross margin trend, we are pretty happy with kind of both our actuals and guidance and there's no new information versus what we've told you before. It's just how the mix plays out between quarters.\n\n**Stacy Rasgon** (Analyst)\nGot it. Thank you. And for my follow-up, so I know you talked about no direct impact from tariffs, but you said you're baking in what you're seeing. Like what are you baking in for the indirect effective tariffs? Like you talked about Android being seasonal, I guess, the September, which doesn't sound like you're baking in or suggesting any potential for demand destruction if tariffs or anything get put back on this.\n\n**Stacy Rasgon** (Analyst)\nHow should we be thinking about like the actual specific assumptions you're putting on the market in the wake of the current macro and the tariff situation as we go through the year?\n\n**Akash Palkhiwala** (CFO &amp; COO)\nSure. So Stacy, what I said is we do not see any material direct impact. There is smaller direct impact and some minor changes in demand. We are reflecting that and so it's in our numbers. But nothing that really is significant enough to change the direction of our guidance. So that's the data point I was giving.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nIn terms of indirect impact, that's obviously something that we're watching closely. Difficult for us to predict that at this point.\n\n**Operator**\nOur next question is from the line of Joe Moore with Morgan Stanley. Please proceed with your question.\n\n**Joseph Moore** (Managing Director)\nGreat. Thank you. You guys are continuing to show really strong results in auto in what's been a tough market for others. And you're talking about a doubling by fiscal twenty nineteen from here. Can you talk about the growth drivers there?\n\n**Joseph Moore** (Managing Director)\nWhen does ADAS start to kick in more as a growth category? And just what is it that gives you that confidence in that multiyear forecast?\n\n**Cristiano Amon** (President &amp; CEO)\nHi, Joe. This is Cristiano. There are a couple of drivers. I think if you remember when we outlined and disclosed the pipeline, we said one third of that was ADAS. And we also had Flex is really becoming a reality.\n\n**Cristiano Amon** (President &amp; CEO)\nWe have some interesting designs and some upcoming SOPs with Flex that has both the digital cockpit and ADAS in the same chipset. But the key drivers of the revenue is really the mix improvement with more digital cockpit, more computing content and then in the ADAS coming up. On ADAS alone, I think we just announced in the quarter five new designs of ADAS.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nAnd Joe, to quickly add a data point to it. When you kind of step back and look at within the auto market, the car is being transformed. We play in the market that is being transformed. So digitization of car is happening, and we play in the area that is actually growing significantly, both in terms of the penetration within established base of the auto market, but then also the silicon content multiplies as you get into the new type of cars. And so we are playing in this tremendous growth area within the car market, and that's what you're seeing in our numbers show up.\n\n**Joseph Moore** (Managing Director)\nGreat. Thank you.\n\n**Operator**\nOur next question is from Chris Caso with Wolfe Research. Please proceed with your question.\n\n**Chris Caso** (Managing Director)\nYes. Thank you. First question is with regard to handsets and you talked about that being up about 10 year on year. Could you break out the relative strength of I guess the two buckets that would drive that the China business and then your other large customer? And you also mentioned some impact from some of the subsidies that were happening in China.\n\n**Chris Caso** (Managing Director)\nCould you give some more detail of that? And perhaps is that sustainable demand? Or would perhaps that cause some pull forward as well?\n\n**Akash Palkhiwala** (CFO &amp; COO)\nYes. From a subsidy perspective in China, what we've seen is really the total units for the March came in line with expectations. We are continuing to see a stronger mix play out, and this has been a trend for the last several years. So if you think about premium tier handsets over $400 they have increased from 21% of the installed 21% of new devices sold in 2019 to about 30 now in 2024. And so that part of the market is expanding.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nOur customers are gaining share. And that is really what is informing the upside for us, both in the results quarter and the guidance quarter. And that's the primary driver of growth for us.\n\n**Chris Caso** (Managing Director)\nGot it. Thank you. I guess with regard to the PC business and you gave some data points on the in your prepared remarks. I know that your product line has changed a bit, so you can attack some lower price points there. What does that mean for the growth of the PC business within IoT this year?\n\n**Chris Caso** (Managing Director)\nAnd as you attack some of those lower price points, are the margins on those products similar to what your IoT business is today?\n\n**Akash Palkhiwala** (CFO &amp; COO)\nYes. So if you think about what we've done in the PC business, we started at the top of the road map and established ourselves as the performance leader. And since then, we've introduced a total of four platforms, which addresses PCs all the way down to $600 And then the next generation of chips will come out later this year as well. So very, very happy with how the road map is playing out. In terms of design wins, we expect 100 devices to be commercialized by in 2026.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nWe have greater than 85 design wins today. And in terms of applications being ported and games being ported, we have now ported 1,400 games onto the platform and seven fifty native applications. So that's kind of preparing ourselves for ramp in the market. The data point that Cristiano provided in his prepared remarks is for Windows devices greater than 600 in U. S.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nAnd the top five EU markets, we have approximately 9% share in the March. So very happy with how the traction is playing out and it positions us to achieve our target.\n\n**Cristiano Amon** (President &amp; CEO)\nYes. Just want to maybe as a reminder, when you go back to our Investor Day, we're kind of projecting 12% share by fiscal twenty nineteen. So I think that gives us confidence we're on the right track.\n\n**Operator**\nOur next question is from the line of Christopher Rolland with Susquehanna International. Please proceed with your question.\n\n**Christopher Rolland** (Senior Equity Analyst)\nHey, guys. Thanks for the question. I guess my first one is, if you guys could address maybe competition, whether you guys are seeing either more or less pressure, particularly at the high end. And kind of related, would you say that CSS designs that might provide APs out of the box for handset OEMs, would you ever consider that a threat or probably just a very low level threat to your business? Thank you.\n\n**Cristiano Amon** (President &amp; CEO)\nThanks for the question, Chris. I'm assuming you're asking about the competitive landscape in smartphones. So that's what I'm going to address. Competitive landscape has not changed for us at all. I think if we break that down by customer group, I think we have on Samsung a relationship that is very stable.\n\n**Cristiano Amon** (President &amp; CEO)\nWe have been competing for decades with their own silicon. We have changed the baseline of that business. It used to be 50% level. Now our baseline share is about 75% level. And we have been executing multi year agreements with that customer.\n\n**Cristiano Amon** (President &amp; CEO)\nSo I think no changes in the competitive landscape. When you look about the competition for China based customers, the competition is really between two players, Us and MediaTek. I think we like the fact that the premium tier has expanded. We always have said it's a large enough market for two players and that's the competitive landscape we see going forward.\n\n**Christopher Rolland** (Senior Equity Analyst)\nExcellent. And Cristiano, maybe my second one here around AI. You guys have been really successful in AI, adding NPU, adding ASP as a result. But maybe Intel suggested that this isn't the case in PC. They're not getting better ASPs for increasing AI capabilities.\n\n**Christopher Rolland** (Senior Equity Analyst)\nSo I guess my question is, I guess, first kind of philosophical. Why does this work so well in mobile? And then for your future products going forward here, do you think there's still that link more AI, more NPU, more ASP? Or is this an upgrade cycle that's really taken place and kind of ASP expansion from here related to AI might be more difficult?\n\n**Cristiano Amon** (President &amp; CEO)\nThis is a great question. Actually, Chris, I love this question. So thank you. I am so I wanted to unpack this and I think they're two separate conversations. So I'm going to start with the philosophical as you pointed out.\n\n**Cristiano Amon** (President &amp; CEO)\nIt's interesting. There's it seems to be a little bit of an impatience I think about what's happening with AI, especially with mobile and PCs. But what you have to look is really the trend. And I think that's what's really important. And I will unpack the difference between phone and PC.\n\n**Cristiano Amon** (President &amp; CEO)\nIn phones, it's crystal clear, especially when you look at the maturity of AI today, the ability to have an assistant that does things for you, even for productivity, you see now more clarity on use cases being developed for smaller screen. When you have a smaller screen, some of those systems are incredibly useful for you. And where we are in the cycle right now, it's kind of similar to what we saw in the feature phone to smartphone transition. You're in the part of the cycle that most of the new features come from the OEM and from the OS provider on AI. And then eventually they're going to start coming from third party developers and that's where it gets scale.\n\n**Cristiano Amon** (President &amp; CEO)\nSo we like the trend. It's driving more NPU content into the phone, it's driving ASP and it's going to be a game about once this thing is deployed at scale with a number of new use cases about who can deliver more NPU performance without compromising battery life. And I think that's kind of most of our investment is in this area. We like everything we see. I think there's impatience people expected everybody like tomorrow to buy an AI smartphone, but the trend is good and again measured by the number of use cases where the beginning of third party developers building use cases.\n\n**Cristiano Amon** (President &amp; CEO)\nPC is a little different. PC, the first when we enter the PC space, it's about we can deliver multi day battery life and faster CPU in a better form factor. Now, it's the same exact trend. It is a little bit different. I think that's why things like DeepSeek is incredibly helpful understanding a smaller model running on the PC.\n\n**Cristiano Amon** (President &amp; CEO)\nAnd four capabilities that you use AI all the time, there is an economic aspect of running that on the devices at the edge. So, think what we're seeing right now is we're winning PC designs because we have a better laptop. It's faster. It is smaller multi day battery life. But the PC AI, it's just at the beginning as more and more SaaS companies, especially as they get pressure from competition, smaller models make the cloud and the devices of the edge now competing for inference.\n\n**Cristiano Amon** (President &amp; CEO)\nYou're going to see more of those use cases and then the NPU is going to shine. And I think that you started to see that from the OS vendor, Microsoft talks about it a lot because they're building the AI use cases as an OS. But next, you're going to see that third party and it's going to be the same dynamics that we're on the phone. So we remain encouraged by it. I think it's going to create a positive cycle and we are investing to have the best NPU out there. Thank you.\n\n**Operator**\nThank you. Our last question is from Ross Seymar with Deutsche Bank. Please proceed with your question.\n\n**Ross Seymore** (Managing Director)\nHi, Thanks for asking a couple of questions. Akash, they're both going to I think be for you. So the first one is you mentioned about the market share at your U. S. Customer going down to about 70% in this generation.\n\n**Ross Seymore** (Managing Director)\nI wanted to see what that means on the OpEx front for you. You guys have done a great job of controlling the OpEx dollars. But as that business goes away in the trajectory you've said many times before, how does the OpEx change and maybe the margin structure of Qualcomm during that exit from that main customer?\n\n**Akash Palkhiwala** (CFO &amp; COO)\nYes, Ross. Thanks for the question. I think our strategy around OpEx has been very clear and we put this in place a couple of years ago where the idea was to keep the existing scale of the OpEx investment and transition the investment from handsets while still maintaining leadership in handsets to these new areas that we are focusing on within automotive and then PCXR and industrial within IoT. So that is the framework under which we are operating. We're continuing to move investment into those areas to create this tremendous growth opportunities for us.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nAnd then on the revenue side, as kind of Apple revenue goes down, we're looking we are very optimistic that the targets we laid out replaces that revenue and puts us in a good place from an overall P and L perspective. So that's the framework that we outlined at Investor Day as well and that's what we're executing on.\n\n**Ross Seymore** (Managing Director)\nGreat. And one more for you quickly. You guys boosted the free cash flow return to 100% return to shareholders. What was the reasoning behind doing that? I think everybody will obviously take it and it's a positive sign, but just wanted to see what the catalyst was.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nWell, I think we've had very strong cash flow for the last couple of years. And so we've seen our cash balance grow. And so it is an opportunity given where the stock price is, it's an opportunity for us to leverage that cash balance and increase our buybacks. But we are doing it while, of course, maintaining our strategic flexibility for M and A. And it's the same framework we laid out at Investor Day, not fundamentally changing how we think about it, but there's an opportunity and we're investing as a result.\n\n**Operator**\nThank you. That concludes today's question and answer session. Mr. Amont, do you have anything further to add before adjourning the call?\n\n**Cristiano Amon** (President &amp; CEO)\nYes. Just a few comments. Thank you all for listening to our call. I would like to say a big thank you to all of our employees, especially our supply chain teams that have been doing a lot of great work. Thanks for all of our customers.\n\n**Cristiano Amon** (President &amp; CEO)\nAnd I just want to leave you with this thought. As navigate those times, this is a company that is not it's experienced a little of uncertainty. We always ask ourselves, is our technology relevant? And I think this is a time that we actually never feel stronger about their technology roadmap and how the company is positioned to be relevant to a number of different industries. So that's our North Star.\n\n**Cristiano Amon** (President &amp; CEO)\nWe'll continue to execute to that. And I look forward to see you all in the next quarter. Thank you.\n\n**Operator**\nLadies and gentlemen, this concludes today's conference call. You may now disconnect.",
      "fetched_at": "2026-02-04T15:41:20.387Z"
    },
    {
      "ticker": "QCOM",
      "title": "QUALCOMM Incorporated (QCOM) Q1 FY2025 earnings call transcript",
      "published_date": "Feb 5, 2025, 4:45 PM EST",
      "fiscal_year": "2025",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/QCOM/earnings/QCOM-Q1-2025-earnings_call-253984.html",
      "content": "**Operator**\nand gentlemen, thank you for standing by. Welcome to the Qualcomm First Quarter Fiscal twenty twenty five Earnings Conference Call. At this time, all participants are in listen only mode. Later, we will conduct a question and answer session. As a reminder, this conference is being recorded 02/05/2025.\n\n**Operator**\nPlayback number for today's call is (877) 660-6853. For international callers, please dial (201) 612-7415. The playback reservation number is 130Seven-fifty899. I would now like to turn the call over to Mauricio Lopez Edoyen, Vice President of Investor Relations. Mr. Lopez Edoyen, please go ahead.\n\n**Mauricio Lopez-Hodoyan** (VP, Investor Relations)\nThank you, and good afternoon, everyone. Today's call will include prepared remarks by Christiana Mon and Akash Palkawala. In addition, Alex Rogers will join the question and answer session. You can access our earnings release and a slide presentation that accompany this call on our Investor Relations website. In addition, this call is being webcast on qualcomm.com and a replay will be available on our website later today.\n\n**Mauricio Lopez-Hodoyan** (VP, Investor Relations)\nDuring the call today, we will use non GAAP financial measures as defined in Regulation G, and you can find the related reconciliations to GAAP on our website. We will also make forward looking statements, including projections and estimates of future events, business or industry trends or business or financial results. Actual events or results could differ materially from those projected in our forward looking statements. Please refer to our SEC filings, including our most recent 10 K, which contain important factors that could cause actual results to differ materially from the forward looking statements. And now to comments from Qualcomm's President and Chief Executive Officer, Cristiano Mon.\n\n**Cristiano Amon** (President &amp; CEO)\nThank you, Maurizio, and good afternoon, everyone. Thanks for joining us today. In fiscal Q1, we delivered record revenues of $11,700,000,000 and non GAAP earnings per share of $3.41 Our chipset business achieved record revenues of $10,100,000,000 the first ten billion dollars quarter for QCT, including record quarterly handset and automotive revenues. Licensing business revenues were $1,500,000,000 We're off to a great start in fiscal 'twenty five. Our mobile roadmap is the strongest in our history with exceptional traction for Snapdragon in premium tier handsets and we are delivering growth across our diversification initiatives.\n\n**Cristiano Amon** (President &amp; CEO)\nThis quarter, automotive and IoT revenues grew 61% year over year and 36% year over year respectively. We are committed to achieving $22,000,000,000 on non handset revenues by 2029 as outlined during our twenty twenty four Investor Day. Our advanced connectivity, computing and edge AI technologies and product portfolio continue to be highly differentiated and increasingly relevant to a broad range of industries. We also remain very optimistic about the growing edge AI opportunity across our business, particularly as we see the next cycle of AI innovation and scale. DeepSeq R1 and other similar models recently demonstrated that AI models are developing faster, becoming smaller, more capable and efficient and now able to run directly on device.\n\n**Cristiano Amon** (President &amp; CEO)\nIn fact, DeepSig R1 Distill models were running on Snapdragon powered smartphones and PCs within just a few days of its release. As we enter the era of AI inference, we expect that while training will continue in the cloud, inference will run increasingly on device, making AI more accessible, customizable and efficient. This will encourage the development of more targeted, purpose oriented models and applications, which we anticipate will drive increased adoption and in turn demand for Qualcomm platforms across a range of devices. With the industry's most powerful and efficient AI processors for the edge, we're well positioned to drive this transition and benefit from this upcoming inflection point. Let me now share some key highlights from the business.\n\n**Cristiano Amon** (President &amp; CEO)\nIn handsets, we're pleased that the recently launched Samsung Galaxy S25 series of smartphones will be powered by the Snapdragon eight Elite for Galaxy globally. The Snapdragon eight Elite for Galaxy delivers the latest AI experiences showcasing one of the best integrations of GALAX AI and Google Gemini. We are encouraged by the number of AI features, which has nearly doubled in the GALAX S25 series. We expect this trend to continue as part of the transition to AI smartphones. We're extremely proud of this launch and our long standing strategic partnerships with Samsung and Google.\n\n**Cristiano Amon** (President &amp; CEO)\nAs a reminder, the Snapdragon eight Elite is our most powerful mobile platform to date, featuring the industry's fastest custom CPU, the most powerful NPU, incredible GPU performance and the best camera. In addition to Samsung, we're very pleased with the design traction and strong end customer demand for recently launched Snapdragon eight Elite Power flagship smartphones by Chinese OEMs. Our design win momentum in PCs has also increased with more than 80 designs in production or development on our category leading Snapdragon X series platforms, and we're targeting more than 100 designs to be commercialized through 2026. Importantly, we recently announced our newest compute platform, the Snapdragon X, specifically designed to address PCs in the $600 price range, further expanding our addressable opportunity. Snapdragon X features best in class performance, multi day battery life, powerful on device AI and CoPilot Plus experiences.\n\n**Cristiano Amon** (President &amp; CEO)\nWe look forward to PCs powered by Snapdragon X from leading OEMs, including Acer, Asus, Dell, HP and Lenovo in the coming months. In partnership with Lenovo, we introduced the world's first mini desktop AI PCs powered by the Snapdragon X series. These devices redefine compact computing in a new form factor ideal for developers, consumers and enterprises. The number of NPU powered on device AI experiences running natively on Snapdragon has continued to grow with more than 50 AI applications now optimized for Windows 11, including apps for enterprise collaboration, productivity, creativity and more. Microsoft also announced it is bringing NPU optimized versions of DeepSeek R1 directly to CoPilot Plus PCs beginning with the Qualcomm Snapdragon X series.\n\n**Cristiano Amon** (President &amp; CEO)\nAdditionally, the broader app ecosystem continues to expand with Snapdragon native apps now including 20 of the most popular VPNs, 50 of the most popular security and cloud storage apps as well as new applications for creators. While we're still in the early phase of the transition to CoPilot plus PCs, we are pleased with consumer reception for our Snapdragon X series, which has exceeded our expectations. According to Sirkanah, in December, Snapdragon X series had more than 10% share of the greater than $800 window laptops in U. S. Retail.\n\n**Cristiano Amon** (President &amp; CEO)\nIn XR, we remain the preferred solutions provider for VR, MR and AR across major OEMs and ecosystems, and our strategic long term collaborations with Meta and other key partners are playing a key role in growing this area. The Snapdragon based Ray Ban meta glasses continue to exceed expectations as they adopt more AI features. We remain optimistic that we are at the beginning of an inflection point for smart glasses to gain scale as they become wearable AI. Additionally, at the recent XR unlocked event, Google announced Android XR and we are pleased that the first device available for purchase later this year will be built by Samsung and powered by the Snapdragon XR platform. We continue to expand our industrial IoT portfolio of products and solutions, and we are encouraged by the positive reception across multiple industry verticals, including energy and utilities, robotics, manufacturing, warehousing and logistics, retail, enterprise and commercial.\n\n**Cristiano Amon** (President &amp; CEO)\nAt CES, we introduced our AI on prem appliance and inference suite, which enables generative AI inference and computer vision workloads to run on dedicated on premises hardware, allowing sensitive customer data, fine tune models and inference loads to remain within the enterprise. The AI Inference suite provides ready to use AI applications and agents, tools and libraries to easily operationalize AI and GenAI applications in a variety of deployments on premise or in the cloud. Our first wave partners for these new platforms include Honeywell, IBM and others. We also announced the next evolution of Qualcomm Aware, our cloud based asset visibility platform. As a horizontal enablement platform, Qualcomm Aware allows for a highly integrated way to add cloud based observability and insights, geolocation, fine indoor positioning, firmware updates and device management services to connected devices.\n\n**Cristiano Amon** (President &amp; CEO)\nIn edge networking, we're pleased with the momentum in Wi Fi seven with recent product launches from Cisco, Charter, eero, Netgear, Nokia and Ubiquiti. We're also seeing strong traction for our five gs fixed wireless access with next generation design wins at operators in North America and India. We continue to strengthen our position in automotive as the industry's leading technology partner for the software defined vehicle, AI powered in cabin systems, advanced driver assistance and connected car experiences. At CES, we announced new collaborations with Alpine, Amazon, Google, Leapmotor, Mahindra and Hyundai Mobis, which will use Snapdragon digital chassis solutions to drive AI powered in cabin and advanced driver assistance systems. We also expanded our partnerships with several Tier one suppliers to now utilize the Snapdragon Cockpit Elite platform, including with Panasonic Automotive Systems, Garmin and DISA SV.\n\n**Cristiano Amon** (President &amp; CEO)\nThese collaborations will bring advanced intelligence, including generative AI to all levels of software defined vehicles, enabling automakers to build safe and extraordinary user experiences. We're very pleased with the strong industry reception to Snapdragon Cockpit Elite platform since its launch late last year. Our new collaboration with Hyundai Mobis will combine the Snapdragon RIDE FLAC system on chip and the Snapdragon RIDE automated driving stack with Hyundai Mobius cutting edge software and sensors. This will deliver a comprehensive system solution that powers advanced infotainment and advanced driver assistance systems, bringing a one of a kind user experience to future vehicles. Another significant milestone was the launch of the Snapdragon Digital Chassis Workbench, a cloud based workflow for developers building this software defined vehicle.\n\n**Cristiano Amon** (President &amp; CEO)\nTo complement the hardware and software of the Snapdragon Digital Chassis, Workbench provides a complete development and test environment to build and deploy automotive applications. Finally, we remain very pleased with the execution of our QTL business in recent years and we're well positioned to maintain fiscal 'twenty four revenue scale going forward. Over the past year, we've extended key agreements with major OEMs and we're poised to shortly execute new long term license agreements with two additional large OEMs. We also recently signed Transient to a long term four gs license to go along with the five gs license signed in the last fiscal year. Our progress reaffirms QTL as the industry's most extensive licensing program of cellular essential patents.\n\n**Cristiano Amon** (President &amp; CEO)\nBefore I turn the call over to Akash, I would like to provide an update on the ARM versus Qualcomm trial from December 2024. The jury's verdict vindicated Qualcomm's CPU innovations and affirm that Qualcomm's contract with Arm provides a license for Qualcomm's products containing our proprietary Orion CPUs in industries such as smartphones, automotive, next generation PCs, IoT and data center. In addition, ARM recently notified us that it was withdrawing its 10/22/2024 notice of breach and indicated that it has no current plan to terminate the Qualcomm architecture license agreement. We're excited to continue to develop performance leading world class products that benefit consumers worldwide that include our incredible Orion custom CPUs. I will now turn the call to Akash.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nThank you, Cristiano, and good afternoon, everyone. I'll start with a summary of our record performance in the first fiscal quarter. We are pleased to announce revenues of $11,700,000,000 and non GAAP EPS of $3.41 both of which were above the high end of our guidance. QTL revenues of $1,500,000,000 and EBT margin of 75% were in line with expectations. QCT delivered record revenues of 10,100,000,000 which was above the high end of our guidance on outperformance across Android handsets, IoT and automotive.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nQCT handsets revenues were a record $7,600,000,000 with 13% year over year growth reflecting higher volume and content increase in Android premium tier driven by industry leading performance of our newly launched Snapdragon eight Elite platform. Higher volume in Android Premium Tier in the quarter was driven by stronger end consumer demand for recently launched flagship smartphones and global share in Samsung Galaxy S25 devices. UCT IoT revenues of $1,500,000,000 increased 36% year over year, driven by new product launches with our industry leading processors and on device AI capability across consumer networking and industrial. We delivered our sixth consecutive quarter of record QCT automotive revenues of $961,000,000 representing 61% year over year growth on continued content increase in new vehicle launches as automakers deploy our high performance low power computing and connectivity chips to bring next generation experiences to consumers. QCT EBT margins of 32% exceeded the high end of our guidance, reflecting the benefit of revenue upside and operating leverage.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nQCT EBT dollars of $3,200,000,000 increased by 25% versus the year ago period. Lastly, we returned $2,700,000,000 to stock holders, including $1,800,000,000 in stock repurchases and $942,000,000 in dividends. Now turning to guidance. For the second fiscal quarter, we are forecasting non GAAP revenues of $10,200,000,000 to $11,000,000,000 and non GAAP EPS of $2.7 to $2.9 In QTL, we estimate revenues of $1,250,000,000 to $1,450,000,000 and EBT margins of 69% to 73%, reflecting normal seasonality for handset units. In QCT, we expect revenues of $8,900,000,000 to $9,500,000,000 and EBT margins of 29% to 31% with strong year over year growth across handsets, IoT and automotive.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nWe expect QCT handset revenues to grow by approximately 10% on a year over year basis, including the benefit of increased shipment for Samsung Galaxy S25 smartphones. On a sequential basis, the decline in QCT handset revenues is primarily driven by seasonality in shipments to Apple. We expect IoT and automotive revenues to grow by approximately 1550% respectively versus the year ago period, driven by the strong product momentum I just outlined. Lastly, we estimate non GAAP operating expenses to be approximately $2,250,000,000 In closing, we are very pleased with our strong first quarter results with new records across the following metrics: total company revenue, non GAAP EPS, QCT revenues, QCT handset revenues and QCT automotive revenues. In QTL, we finalized renewal negotiations for long term licenses with two key Chinese OEMs and expect to execute those agreements shortly.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nWe also recently signed Transient to a long term four gs license in addition to the five gs license signed in the last fiscal year. With these additional long term agreements, we expect fiscal twenty twenty five QTL revenues to be consistent with fiscal twenty twenty four. Our recent product announcements at CES across PC, automotive, consumer and industrial IoT, along with the continued performance leadership in premium tier Android handsets, underscore our position as the connected computing leader across edge devices. Lastly, as AI approaches an inflection point of scaling at the edge, our leadership in high performance on device inference solutions positions us to benefit as we lead this transition. This concludes our prepared remarks. Back to you, Mauricio.\n\n**Mauricio Lopez-Hodoyan** (VP, Investor Relations)\nThank you, Kaush. Operator, we're now ready for questions.\n\n**Operator**\nThank First question comes from the line of Joshua Buckhalter with TD Cowen. Please proceed with your question.\n\n**Joshua Buchalter** (Director - Equity Research)\nHey guys, thanks for taking my question. I guess to start, I wanted to clarify the QTL guidance. So you're talking to sort of flat or levels in fiscal twenty twenty five versus 2024. I know you signed the two agreements recently. Could you maybe speak to how we should think about your assumptions on overall unit shipments and the royalty per unit tracking through the year? Thank you.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nJoshua, it's Sakash. I think our overall assumption on the market is that it is either flat or gross low single digits on a year over year basis. Now of course, this doesn't take into account upside opportunities in terms of the China subsidy and the AI replacement rate. But the baseline assumption is what goes into the QTL forecast that we just gave.\n\n**Operator**\nOur next question comes from the line of Sameek Chatterjee with JPMorgan. Please proceed with your question.\n\n**Samik Chatterjee** (Executive Director)\nHi, Sameek. Thank you for taking my questions. And I have a couple of questions, but maybe if I can start off on the PC platform and particularly Snapdragon X. Maybe, Cristiano, if you can sort of talk about how you're sort of thinking about 2025 and 2026 playing out in terms of device launches on your Snapdragon platform for PCs? And particularly more interested in hearing how you're now thinking about the adoption curve between enterprises and consumers?\n\n**Samik Chatterjee** (Executive Director)\nWhat are you hearing from the OEM partners in terms of how to think about the adoption curve relative to enterprise and consumer as we go look for the next couple of years? And I have a quick follow-up after that.\n\n**Cristiano Amon** (President &amp; CEO)\nVery good, Samek. Thank you for your question. Look, we're very happy with the trajectory that we are on PCs. Maybe I'll start answering the question by providing some bookends, right? We said at the Investor Day last year that we expect to get $4,000,000,000 in Windows PC revenue by 2029.\n\n**Cristiano Amon** (President &amp; CEO)\nWe actually said at that time $4,000,000,000 out of a $35,000,000,000 if I'm not mistaken, Sam, which if you calculate, you assume a share about 12% of the market we're addressing. I think we started very well with a number of designs. One metric that we have is the design traction continue. We have now over 80 design wins launched or in development across the X Series, and we're targeting commercialization of more than 100 devices as we go to 2025 to 2026. So design traction is good.\n\n**Cristiano Amon** (President &amp; CEO)\nIt continued to increase this, which is a good sign. The second data point we actually provided on the script is, we look at The United States retail. We started to expand retail in different markets. We look at United States, which one of the priority markets that we had. And the data shows that the sale within the sale of U.\n\n**Cristiano Amon** (President &amp; CEO)\nS. Retail of Windows laptops above $800 we had more than 10% share, which is actually consistent with the projection we made of how we're going to grow under five years. And we like the metric that's early in the process. We're still starting. As I said, we'll continue to expand in markets.\n\n**Cristiano Amon** (President &amp; CEO)\nWe like the results today and the design traction has continued to increase. The first wave was consumer. Now it's being deployed towards commercial. That's why we have emphasis of showing a lot of the commercial applications now native on Snapdragon from VPN, from security, etcetera. And we're excited, especially because of that, we launched a new product to expand the addressability to now $600 price laptops, which were not compromising AI.\n\n**Cristiano Amon** (President &amp; CEO)\nAnd as I mentioned in the call, actually a few days after Microsoft announced DeepSeq R1 running on Snapdragon X Series laptops first. So actually, we're starting, we're happy with the traction. Consistent with our long term projections, we're just going to keep executing.\n\n**Samik Chatterjee** (Executive Director)\nGot it. Got it.\n\n**Samik Chatterjee** (Executive Director)\nThank you for that. And maybe for my follow-up, I can sort of take the cue from what Akash mentioned for the last question, which is China market for smartphones and the subsidies that you're seeing, sort of what are you seeing on the ground in terms of response for the from the consumer to the subsidies? And what are you sort of thinking in terms of the impact to overall the Chinese smartphone OEM and their sort of growth sustainability? And I don't know if Akash, you gave the number in terms of what growth you saw with the Chinese OEMs Chinese Android OEMs this quarter, but how are you thinking about sort of the growth trajectory going forward with them, particularly in light of these subsidies? Thank you.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nSure. So let me address it in parts. So as it relates to the subsidy, as you know, they just began in January. So we are not that far into the cycle. And so we'll have a better view of it next quarter.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nIn terms of historical reference point, in the past, we've seen that when subsidies have come in, it has improved the size of the market. So there is an opportunity that comes with it, but it's not something that is contemplated yet in our second quarter guidance. Now, let me go back to first quarter because that's where I made the volume comment as well. If you look at the first quarter upside that we had in handsets, very strong performance, record performance and there were two drivers. First is the content increase year over year that we have discussed in detail as more capability gets added to the chipset, it shows up in our price points.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nThe second was the volume increase that we saw on a year over year basis as well. And when you really look at the volume increase and break it down into drivers, we had higher share of course at Samsung. They are using us globally in the GS25. So that helps purchases that went into the December before the phone launch. The second is we saw higher end consumer demand in China for premium devices.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nAnd if you think about how that happens, it's a long term trend that we've seen in China that the premium tier continues to grow and it's a benefit that showed up in the quarter as well. The second is our customers are gaining share in the China market. And so that is a benefit that translates through as well. So very we feel very good about all those drivers. They're all sustained long term drivers in our business that positions us well as we look at the second half of the fiscal year.\n\n**Operator**\nOur next question is coming from the line of Stacy Rasgon with Bernstein Research. Please proceed with your question.\n\n**Stacy Rasgon** (Analyst)\nHi guys. Thanks for taking my questions. For the first one, I wanted to ask about the QTL guide flat year over year. So in the Q, it suggests that you're still negotiating with Huawei and I'm assuming the QTL guide for Q2, which is a little lighter than the normal, has no Huawei in it because of that. Does the annual guide for flat year over year assume that you do not settle Huawei?\n\n**Stacy Rasgon** (Analyst)\nAnd if you do renegotiate and get some money for there, would there be upside to that number based on your current assumptions?\n\n**Alex Rogers** (President, Qualcomm Technology Licensing (QTL) and Global Affairs)\nAssumptions?\n\n**Alex Rogers** (President, Qualcomm Technology Licensing (QTL) and Global Affairs)\nSo, basically, what we've managed to accomplish over the last year or so is essentially signing up everybody to extensions. So, we've had a really good run of execution with bringing in transient for four gs, which is a significant development because they've popped up the ranks of OEMs in terms of unit volume, very high up the ranks actually. So, the four gs complements, the five gs license that we have them signed up to and they're transitioning to more five gs content in their overall product offering. And then, we have these last two significant Chinese OEMs that we've signed up or that we finished negotiations with and the execution is just pending return from the Lunar New Year holiday. The Huawei discussions are still in play.\n\n**Alex Rogers** (President, Qualcomm Technology Licensing (QTL) and Global Affairs)\nSo, the numbers don't actually include the potential from a renewal with Huawei. And basically, everything else is taken care of.\n\n**Stacy Rasgon** (Analyst)\nGot it. So that flat guidance doesn't include any quality settlement, to be clear?\n\n**Akash Palkhiwala** (CFO &amp; COO)\nCorrect. Neither the second quarter guidance or the full year comment.\n\n**Stacy Rasgon** (Analyst)\nGot it. That's great.\n\n**Stacy Rasgon** (Analyst)\nAnd for my follow-up, I just want to note, we've seen a fair amount of just in general personal electronics strength recently. And there's some thoughts that maybe some of it might be related to sort of pre tariff pull forward. I don't know if you guys would be able to have any view on that, but do you have any comments on what you might see and whether or not the threat of tariffs might be driving some pre builds or increased demand in the near term?\n\n**Cristiano Amon** (President &amp; CEO)\nYes, absolutely not. I think it's funny, Stacy, we expect everybody to be asking this question. We actually are seeing it's pretty simple, right? So number one is higher than expected, I think, share of Samsung with the launch of GS25 globally. The second thing is end customer demand in China.\n\n**Cristiano Amon** (President &amp; CEO)\nAnd we have data on the sell through. It is basically Snapdragon eight Elite has been quite successful. Demand on smartphones launching will exceed our expectations. It's built on what Akash said. The trend of premium tier continue to expand.\n\n**Cristiano Amon** (President &amp; CEO)\nSmartphone is number one consumer electronic device purchase. I think there is a positive launch of AI features. Customers build great devices. They are gaining share in the premium tier. And that is what we're driving demand.\n\n**Cristiano Amon** (President &amp; CEO)\nAnd as Zakash outlined, all of our smartphone products, products from our customers in China using Elite, The price points that they launch those devices in the market, they're all eligible for the subsidy. So that's not contemplated in the Q2 guide, which it could be an interesting development. We saw they usually further expand the premium tier. But this is no inventory. This is no build out ahead of tariffs. This is end customer demand.\n\n**Operator**\nThe next question is from the line of Chris Caso with Wolfe Research. Please proceed with your question.\n\n**Chris Caso** (Managing Director)\nYes, thanks. Good evening. I guess following on with those comments, Cristiano, how should we think about June now? Because typically, June, there are no flagship launches and that has some effect on QCT. Given the share gain at Samsung, does that affect the seasonality for June at all? And how should we be thinking that in general?\n\n**Akash Palkhiwala** (CFO &amp; COO)\nYes. I think, Chris, you're right in terms of understanding our seasonality. When you look at the last several years, the framework across quarters, it is driven by the timing of the flagship launches. And so as a result, we expect kind of first quarter to be the high point from an EPS perspective and third quarter is the low point because you don't have as many flagship launches in it. On your question on specifically on Samsung, Samsung is in kind of the impact of the higher share is included in the first quarter and the second quarter guide as well.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nAnd so it will be included in third and fourth quarter as well. So I don't think it fundamentally changes the seasonality across the quarters.\n\n**Chris Caso** (Managing Director)\nGot it. As a follow-up, if you could address some of the higher price points that you're seeing on Snapdragons now and certainly there are more features in there because of AI, but to some extent it's also about cost too because the wafer costs are higher. What's the impact of that on Qualcomm, not just from a quarter basis, but looking a little bit out, should we expect ASP to be a tailwind for you? And then how are your OEM customers dealing with that? Is it a factor of we're just going to see a mix higher to higher end phones?\n\n**Chris Caso** (Managing Director)\nOr will is that going to result in higher ASP?\n\n**Akash Palkhiwala** (CFO &amp; COO)\nChris, the primary driver here is that there is a consumer demand for more capable smartphones. And so as we go from generation to generation, we're adding a lot more capability on the processing side, on AI side and connectivity and that is showing up in the price points in our chip. So that's the primary driver. Of course, as you're aware, TSMC price increases for three and four nanometer does did kick in, in January. And so as we've said in the past, our objective there is to reflect the cost increases in ASPs over a period of time.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nSo those are the really the key drivers. When you step back, I think the one of the messages that Krishanu gave earlier is an important one is that the overall market, it's not just about each tier kind of having a more capable chip, but a mix shift across tiers and a larger market for premium devices.\n\n**Operator**\nThank you. The next question is from the line of Ross Seymore with Deutsche Bank. Please proceed with your questions.\n\n**Ross Seymore** (Managing Director)\nThanks for letting me ask a question. Just want to ask a more cyclical question, probably most applicable to your IoT segment. That business has been very strong year over year, but you've had a couple of quarters with negative sequential comps. Is that just normal seasonality? Or is there cyclicality involved that some of your broad based peers are seeing?\n\n**Ross Seymore** (Managing Director)\nJust kind of want to judge where we are in that cyclical trend.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nYes, Ross. There's definitely one of the big drivers on the quarterly profile is because of consumer IoT and that does have cyclicality involved because you're building for the holiday season. And then when we get into the March, of course, you're past that point. When you look at the other two parts of our IoT business, which is industrial and edge networking, we're consistently seeing strength across the quarters.\n\n**Ross Seymore** (Managing Director)\nGreat to hear. I guess as a follow-up question then switching gears to the gross margin, Nikash, congratulations again. It looks like you kept that in QCT pretty much flat sequentially despite your thought that it was going to go down in the December. Is that something that is just structurally going to be a little higher than that, I guess, kind of implied 48% to 49% range? And if so, what's changed?\n\n**Akash Palkhiwala** (CFO &amp; COO)\nYes. The gross margin, both in our December and our March, benefits from the fact that we have stronger premium tier volume that improves the mix overall mix of our portfolio and that shows up in gross margin. So that's kind of primary driver of the strength. And so as you see the mix changes, it will flow through the margin numbers. But yes, we are very happy just like you that the margins have been very strong.\n\n**Operator**\nOur next question is from the line of Timothy Arcuri with UBS. Please proceed with your questions.\n\n**Timothy Arcuri** (Managing Director)\nThanks a lot. I had two. Cristiano, is there any evolution in the way you're thinking about the modem situation at your large customer? I know there's been some back and forth on that recently. Is there any change there?\n\n**Timothy Arcuri** (Managing Director)\nAre you feeling like maybe you'll be there a little bit longer than you had expected? That's the first question.\n\n**Cristiano Amon** (President &amp; CEO)\nYes. The answer is no. I think we're really operating with the assumptions. I think we've been very clear, I think, what those things are. We expect 20% share for the launch that happens in 2026 and the current agreement ends after that.\n\n**Cristiano Amon** (President &amp; CEO)\nWe're assuming no renewal, so which means nothing in 2027. For 2025 launches, we expect share to be between 10020%. So we don't know. But I think we've been very clear about how we're modeling that business, and I think that's the assumption going forward.\n\n**Timothy Arcuri** (Managing Director)\nThanks a lot. Akash, can you give us an idea of how big the PC business was within IoT? You said you were 10% I think of the $800 or sorry, the above $800 laptop market in The U. S. I'm guessing you did about $100,000,000 a little bit more than $100,000,000 in December. Is that close? Thanks.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nYes, Tim, it's Akash. So from an overall revenue perspective, I think the way we've set it up is we've set targets long term for '29 for each of these areas and we plan to give an annual update on each of those targets. We're not breaking it down every quarter by area. To me, what's the most important thing on the PC is the market that we were playing in, which is devices over $800 and our focus on retail to begin with, we're very happy that we were able to get 10% share. I think just as Kushano said earlier, if we equate that to our long term target, which is 12% of the overall market, that's a great start towards the number we'd set up.\n\n**Operator**\nThank you. Our last question is from the line of Tal Biyani with Bank of America. Please proceed with your questions.\n\n**Tal Liani** (Analyst)\nHi, guys. I want to focus on a 20% growth of smartphones and QCT this quarter. And the question is how long will this continue? The market itself is not growing. There was last quarter there was growth in China that was very strong. This quarter we had the initial of Samsung.\n\n**Tal Liani** (Analyst)\nSo can you talk about longevity of the current trend? How long can it continue? Could you grow even if the market doesn't grow? And then just an update on China demand? Thanks.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nSure, Tal. So let me break it down. If you look at our year over year performance in QCT handsets, we were up 13%. And as I said earlier, the drivers of those is really a combination of higher volume and higher ASPs. The ASPs as content increase, which we've talked about, we've seen consistently that continue to increase over the last several years.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nAnd as we look forward, we think that's very sustainable, just we're adding a lot more capability to the device and the consumers are looking for that opportunity. In terms of volume, one of the key metrics for us is the fact that the premium tier continues to grow. So, if you look at the last three or four years, devices greater than $400 have gone from being 21% of the market to now over 30% of the market. And so that is a trend that's incredibly positive for us because that's the market that we are very strong in. And so we have a combination of the units within that part of the market is growing very quickly and within that our content is growing as well.\n\n**Akash Palkhiwala** (CFO &amp; COO)\nAnd those are the two factors that drive the handset growth of 13% on a year over year basis. When you look at the March, we're guiding handset growth of 10% on a year over year basis, which is again a very strong number. So pretty happy with how we are set up in that business and both in the first half of the year and it positions us well as we look forward. Can you repeat a question on that, Tal, please?\n\n**Tal Liani** (Analyst)\nI said just China. China was strong the last few quarters. Can you give a maybe I missed it, but what's the current trends in China?\n\n**Akash Palkhiwala** (CFO &amp; COO)\nYes. I think China definitely is strong in the premium tier. We've seen that part of the market grow. We've also seen our customers gain share within that market. And then last thing is, we're going to have subsidies come in and so that is a potential that benefits that part of the market as well. So pretty, I think positive tailwinds for us there.\n\n**Operator**\nThank you. That concludes today's question and answer session. Mr. Ramon, do you have anything further to add before joining the call?\n\n**Cristiano Amon** (President &amp; CEO)\nJust I'd like to",
      "fetched_at": "2026-02-04T15:41:24.825Z"
    }
  ]
}