{
  "ticker": "STM",
  "last_updated": "2026-02-04T15:45:23.980Z",
  "total_transcripts": 4,
  "transcripts": [
    {
      "ticker": "STM",
      "title": "STMicroelectronics N.V. (STM) Q4 FY2025 earnings call transcript",
      "published_date": "Jan 29, 2026, 3:30 AM EST",
      "fiscal_year": "2025",
      "quarter": "Q4",
      "url": "https://finance.yahoo.com/quote/STM/earnings/STM-Q4-2025-earnings_call-394283.html",
      "content": "**Operator**\nLadies and gentlemen, welcome to the STMicroelectronics full year 2025 earnings release conference call and live webcast. I am Sandra, the Chorus Call operator. I would like to remind you that all participants are in listen-only mode and the conference is being recorded. The presentation will be followed by a Q&A session. You can register for questions at any time by pressing Star and 1 on your telephone. For operator assistance, please press star and zero. The conference must not be recorded for publication or broadcast. At this time, it is my pleasure to hand over to Jérôme Ramel, EVP Corporate Development and Integrated External Communication. Please go ahead, sir.\n\n**Jérôme Ramel** (EVP Corporate Development and Integrated External Communication)\nThank you, Maura, and thank you, everyone, for joining our fourth quarter and Full Year 2025 Financial Results Call. Hosting the call today is Jean-Marc Chery, ST President and Chief Executive Officer. Joining Jean-Marc on the call today are Lorenzo Grandi, President and CFO, and Marco Cassis, President, Analog, Power & Discrete, MEMS and Sensors Group, and Head of STMicroelectronics Strategy, System Research and Application and Innovation Office. This live webcast and presentation material can be accessed on ST Investor Relations website. A replay will be available shortly after the conclusion of this call. This call will include forward-looking statements that involve risk factors that could cause ST results to differ materially from management expectations and plans.\n\n**Jérôme Ramel** (EVP Corporate Development and Integrated External Communication)\nWe encourage you to review the Safe Harbor statement contained in the press release that was issued with the result this morning and also in STM's recent regulatory filing for a full description of these risk factors. Also, to ensure all participants have an opportunity to ask questions during the Q&A session, please limit yourself to one question and a brief follow-up. Now, I'd like to turn the call over to Jean-Marc Chery, ST President and CEO.\n\n**Jean-Marc Chéry** (President and CEO)\nThank you, Jérôme. Good morning, everyone, and thank you for joining ST for our Q4 and full year 2025 earnings conference call. I will start with an overview of the fourth quarter and the full year 2025, including business dynamics, and I will hand over to Lorenzo for the detailed financial overview. I will then comment on the outlook and conclude before answering your questions. Starting with Q4, we delivered revenues at $3.33 billion, above the midpoint of our business outlook range, driven by higher revenues in personal electronics and, to a lesser extent, in communication equipment and computer peripherals and industrial, while automotive was below expectations. Gross margin of 35.2% was also above the midpoint of our business outlook range, mainly due to better product mix.\n\n**Jean-Marc Chéry** (President and CEO)\nExcluding impairment, restructuring charges, and other related phase-out costs, diluted earnings per share was $0.11, including certain negative one-time expenses impact of $0.18 per share. Q4 revenues marked the return to year-over-year growth. During the quarter, we further worked down inventories both in our balance sheet and in distribution, and we generated a positive $257 million free cash flow. Looking at the full year 2025, net revenues decreased 11.1% to $11.8 billion, mainly driven by a strong decrease in automotive and, to a lesser extent, in industrial, while personal electronics and communication equipment and computer peripherals both grew. Gross margin went 33.9% down from 39.3% in full year 2024. Excluding impairment, restructuring charges, and other related phase-out costs, diluted earnings per share was $0.53. We invested $1.79 billion in net CapEx while generating free cash flow of $265 million. Let's now discuss our business dynamics during Q4.\n\n**Jean-Marc Chéry** (President and CEO)\nIn automotive, during the quarter, we grew revenues 3% sequentially. Year-over-year revenues declined, but with continued improvement in the trend. Automotive design momentum progressed with design wins across both electric and traditional vehicle domains for applications such as onboard chargers, DC-DC converters, powertrain, and vehicle control electronics. These included design wins for power semiconductors, smart power devices, automotive microcontrollers, analog, and sensors. These awards, supported by engagements with various OEM and tier-one ecosystems, strengthened our position as a key supplier to the automotive industry. Regarding the acquisition of NXP's MEMS sensor business, the transaction we announced in July is still expected to close in H1 2026. Industrial revenues were better than expected, showing increases of 5% sequentially and 5% year-over-year. Importantly, inventories in distribution further decreased and are now normalizing.\n\n**Jean-Marc Chéry** (President and CEO)\nIn industrial, our portfolio of microcontrollers, sensing technologies, and analog and power devices is strongly positioned to support industrial transformation trends and the need of physical AI. During the quarter, we saw design wins across industrial automation and robotics, building automation, power systems, healthcare, and home appliances. In November, we held our STM32 Summit, where we announced several key innovations, including the first microcontroller built on an 18-nanometer process, a next-generation wireless microcontrollers, and an updated suite of edge AI software tools. For personal electronics, fourth quarter revenues were above our expectations, down 2% sequentially, reflecting the seasonality of our engaged customer programs. During the quarter, we strengthened our position in mobile platform and connected consumer devices, both with our engaged customer programs as well as our open market, offering for devices such as our sensors, secure solutions, and power management products.\n\n**Jean-Marc Chéry** (President and CEO)\nRevenues for communication equipment and computer peripherals were up 23% sequentially, better than expected. In AI and data center infrastructure, we continue to reinforce our position, supporting the increasing demands for higher power density and energy efficiency. During the quarter, we secured multiple design wins for silicon and silicon carbide-based power solutions, supporting next-generation AI compute architectures. We also continue to work with customers to bring our silicon photonics technology to the market. The strong momentum in optical connectivity technologies for data centers also contributed to a significant rise in demand for our high-performance microcontrollers used in pluggable optics. The low Earth orbit satellite business, based on our BiCMOS and panel-level packaging technologies, continued to progress during the quarter, with shipments ramping to our second-largest customer.\n\n**Jean-Marc Chéry** (President and CEO)\nMoving to sustainability, we remain on track for our key 2027 commitments: carbon neutrality in all direct and indirect emissions from Scope 1 and 2, and focusing on product transportation, business travel, and employee commuting emissions for Scope 3, and 100% renewable energy sourcing. A major milestone this year was the launch of Singapore's largest industrial district cooling system at our Ang Mo Kio facilities in Q4. We also continue to maintain our strong presence in the major sustainability indices where we were honored to be recognized in the TIME World's Most Sustainable Companies list for the second consecutive year. Now, over to Lorenzo, who will present our key financial figures.\n\n**Lorenzo Grandi** (President and CFO)\nThank you, Jean-Marc, and good morning, everyone. Let's have a detailed review of the fourth quarter, starting with revenues on a year-over-year basis by the product segment. Analog products, MEMS and sensors grew 7.5%, mainly due to imaging. Power and discrete products decreased by 31.6%. Embedded processing revenues were up 1.2%, with higher revenues in general purpose microcontrollers and automotive microcontrollers, offsetting declines in connected security and custom processing products. RF and optical communication grew 22.9%. By end-market communication equipment and computer peripherals and personal electronics both grew by about 17%. Industrial grew by about 5%, while automotive decreased by about 15%. Year-over-year sales increased 0.6% to OEM and decreased 0.7% to distribution. On a sequential basis, power and discrete was the only segment to decrease by 3.9%.\n\n**Lorenzo Grandi** (President and CFO)\nAll the other segments grew, led by RF and optical communication, up 30.5%, while embedded processing and analog products, MEMS and sensors, were up respectively 3.9% and 1.1%. By end-market sequential growth was led by communication equipment and computer peripherals, up 23%. Industrial was up 5%, and automotive was up 3%, while personal electronics declined 2%. Turning now to profitability, gross profit in the fourth quarter was $1.17 billion, decreasing 6.5% on a year-over-year basis. Gross margin was 35.2%, decreasing 250 basis points year-over-year, mainly due to lower manufacturing efficiencies and, to a lesser extent, negative currency effect and lower level of capacity reservation fees. On a sequential basis, gross margin improved by 200 basis points. Q4 gross margin included about 50 basis points of negative impact resulting from a non-recurring cost related to our Manufacturing Reshaping program.\n\n**Lorenzo Grandi** (President and CFO)\nNet operating expenses, excluding restructuring, amounted to $906 million in the fourth quarter, slightly increasing year-over-year due to unfavorable currency effect. They were slightly better than expected, reflecting our continued cost discipline and the initial benefit from our cost savings initiative. For the first quarter 2026, we expect net OpEx to stand at about $860 million, decreasing quarter-over-quarter. As a reminder, these amounts are net of other income and expenses and exclude the restructuring. In the fourth quarter, we reported $125 million operating income, which included $141 million for impairment, restructuring charges, and other related phase-out costs. These charges are related to the execution of the previously announced company-wide program to reshape our manufacturing footprint and resize our global cost base.\n\n**Lorenzo Grandi** (President and CFO)\nExcluding these non-recurring items, Q4 non-GAAP operating margin was 8%, with analog products, MEMS and sensors at 16.2%, power and discrete -30.2%, embedded processing at 19.2%, and RF and optical communication at 23.4%. Fourth quarter 2025 net loss was $30 million, including certain one-time non-cash income tax expenses of $163 million, compared to a net income of $341 million in the year-ago quarter. Diluted earnings per share was -$0.03, compared to $0.37 of last year. Excluding the previously mentioned non-recurring item related to the impairment, restructuring charges, and other related phase-out costs, non-GAAP net income stood at $100 million, and non-GAAP diluted earnings per share stood at $0.11, including certain negative one-time tax expenses impact of $0.8 per share. Looking now at our full year 2025 financial performance, net revenue decreased 11.1% to $11.8 billion in terms of the revenue by end market.\n\n**Lorenzo Grandi** (President and CFO)\nAutomotive represents about 39% of our total 2025 revenues, personal electronics about 25%, industrial about 21%, and communication equipment, computer peripherals about 15%. By customer channel, sales to OEMs and distribution represent 72% and 28%, respectively, of total revenue in 2025. By region of customer origin, 43% of our 2025 revenues were from the Americas, 31% from Asia-Pacific, and 26% from EMEA. Gross margin decreased to 33.9% for 2025, compared to 39.3% for 2024, mainly due to lower manufacturing efficiencies and, to a lesser extent, the price and mix, lower level of capacity reservation fees, negative currency effect, and higher unused capacity charges. Operating income stood at $175 million compared to $1.68 billion in 2024. Excluding $376 million for impairment, restructuring charges, and other related phase-out costs, non-GAAP operating margin was 4.7%. On a reported basis, net income was $166 million, and EPS was $0.18.\n\n**Lorenzo Grandi** (President and CFO)\nOn a non-GAAP basis, they stood respectively at $486 million and $0.53. Net cash from operating activities totaled $2.15 billion, compared to $2.97 billion in 2024. Net CapEx expenditure was $1.79 billion in 2025, in line with our revised expectation, and lower than the $2.53 billion of 2024. Free cash flow was $265 million positive in 2025, compared to the $288 million positive over the previous year. Inventory at the end of the year was $3.14 billion, compared to the $3.17 billion at the end of the third quarter and the $2.79 billion one year ago. Days sales of inventory at quarter-end were 130 days, slightly better than our expectation, compared to the 135 days for the previous quarter and 122 days in the year-ago quarter. Cash dividends paid to stockholders in 2025 totaled $321 million. In addition, during 2025, ST executed share buybacks totaling $367 million.\n\n**Lorenzo Grandi** (President and CFO)\nST maintained its financial strength with a net financial position that remained solid at $2.79 billion as at the end of December 2025, reflecting total liquidity of $4.92 billion and total financial debt of $2.13 billion. Now back to Jean-Marc, who will comment on our outlook.\n\n**Jean-Marc Chéry** (President and CEO)\nThank you, Lorenzo. Now, let's move to our business outlook for Q1 2026. We are expecting Q1 2026 revenues at $3.04 billion, a decrease of 8.7% sequentially, plus or minus 350 basis points. We expect our gross margin to be about 33.7%, plus or minus 200 basis points, including about 220 basis points of unused capacity charges. This business outlook does not include any impact for potential further changes to global tariffs compared to the current situation. In terms of net CapEx for 2026, we plan to invest about $2.2 billion to support capacity addition for selected growth drivers like those for Cloud Optical Interconnect and our Manufacturing Reshaping plan. To conclude, 2025 turned out to be a challenging year for the end market we serve, characterized by continued inventory correction in automotive and industrial, in particular the first part of the year.\n\n**Jean-Marc Chéry** (President and CEO)\nThe second half was better, with gradual improvement of the revenue trend and a return to year-on-year growth in the fourth quarter. We are entering 2026 with better visibility and entering 2025 with the inventory correction in distribution progressively improving. Beyond the evidence of a cycle recovery, ST will benefit from the following company-specific growth drivers. In automotive, we see solid momentum in our engaged customer programs in ADAS, where we expect to grow this year and in the coming years. In silicon carbide power devices, following a significant contraction in 2025, we anticipate a return to revenue growth in 2026, with revenues projected to recover to 2024 levels by 2027. In sensors, we see strong demand both in MEMS and imaging sensors, and our planned acquisition of NXP MEMS business will strengthen our leading position across the automotive and industrial segment.\n\n**Jean-Marc Chéry** (President and CEO)\nIn industrial, in general purpose MCUs building on market share gains 2025 and a roadmap of new product launch for 2026, we are on track to return to our historical market share of about 23% by 2027. In personal electronics, where we continue to see strong momentum in our engaged customer programs in sensors and analog, we should keep on benefiting from increased silicon content in 2026 and beyond. In communication equipment, computer peripherals, in data centers, including Cloud Optical Interconnect and power and analog for AI servers and data centers, with the current market dynamic, we believe we can deliver $1 billion revenue before 2030, with already $500 million in 2026. In low Earth orbit satellites, we are expanding our customer base, and we anticipate continued revenue growth as low Earth orbit constellation projects expand globally and penetrate new applications such as direct-to-cell constellation.\n\n**Jean-Marc Chéry** (President and CEO)\nLastly, ST is uniquely positioned to address humanoid robotics through our broad portfolio spanning MCUs, MEMS, optical sensors, GNSS, and power management. We are already generating revenues through engagements with major OEMs, and we estimate our current addressable bill of material at about $600 per system. Thank you, and we are now ready to answer your questions.\n\n**Operator**\nWe will now begin the question and answer session. Anyone who wishes to ask a question or make a comment may press star and one on the telephone. You will hear a tone to confirm that you have entered the queue. If you wish to remove yourself from the question queue, you may press star and two. Participants are requested to disable the loudspeaker mode while asking a question. In the interest of time, please limit yourself to one question only. Anyone who has a question may press star and one at this time. Our first question comes from François-Xavier Bouvignies from UBS. Please go ahead.\n\n**François-Xavier Bouvignies** (Equity Research Executive Director)\nThank you very much. My first question, maybe for Jean-Marc, I wanted to come back to what you said about the outlook. I mean, if we look at your revenue guidance down 8.7% for fourth quarter, this is below seasonal, better than seasonal, sorry, of -11%. If we take into account less days, it's actually significantly above seasonal. I was wondering, I mean, this is looking quite interesting. If we compare to other peers like TI yesterday or ADI and microchip, you see a number of your peers talking about above seasonal. I mean, what's your view on the trajectory from here? Do you think this above seasonal trend can carry on a little bit, or we shouldn't get carried away like we did in the last two years where we had many false starts?\n\n**François-Xavier Bouvignies** (Equity Research Executive Director)\nDo you see a very genuine evidence of a cycle recovery from here?\n\n**Jean-Marc Chéry** (President and CEO)\nWell, we will not guide for 2026 today clearly, but we are confident in our ability to grow organically for next year. Well, it's clear that we enter in a better and healthier situation compared to 2025. If you remember last quarter, I already shared with you that we were seeing a backlog that we're building during the quarter, better than the usual seasonality. Today, with the visibility we have on the Q2, that generally speaking, plus let's say low mid-single digit, we absolutely see no reason that we will not be at least capable to deliver it. Well, more important, I think, beyond the cycle is to share with you that we see for the company some specific growth driver. Well, first of all, in automotive, clearly, we will have the sensor.\n\n**Jean-Marc Chéry** (President and CEO)\nAt a certain moment when we will complete the acquisition of NXP, of course, it will bring additional revenues. This is obvious. But we see also positive momentum on the ADAS, ASICs, and the silicon carbide after last year that was pretty challenging. Well, in industrial, clearly, the dynamic is really strong. Thanks to the inventory correction gone, but more important is our portfolio. We have done a tremendous effort in the introduction of new products in 2025 and 2026, and this will contribute beyond the cycle. For personal electronics, our engaged customer program, you know that we have the visibility. I confirm to you. We confirm that it will support us beyond the cycle. Last but not the least, data center.\n\n**Jean-Marc Chéry** (President and CEO)\nClearly, in 2026, Cloud Optical Interconnect means both Photonics ICs and analog mixing by BiCMOS ICs, plus our high-performance general purpose microcontroller will contribute because you know that the connectivity engine of the server will move to optical one. This will be certainly an acceleration. As well, we will start to contribute to the power supply unit and to the server from the grid to the processor. Well, last but not the least, beyond the cycle, in 2026, we see also low Earth orbit satellite communication with our engaged customer program, so with our ASICs, really positive. Well, this will be a bit offset by the capacity fee reservation. But all in all, I confirm really our confidence level to grow organically in 2026 and because we have, let's say, significant growth driver beyond the cycle of the market.\n\n**François-Xavier Bouvignies** (Equity Research Executive Director)\nThank you, Jean-Marc. Yes, maybe on the gross margin side, I mean, with it, I mean, obviously, it's a concern for the market. You deliver the guidance is in line on the gross margin, but 33.7%. But when I look at the consensus, it has 35.6% of gross margin for the year. It would assume a recovery from here. With the top line that you described nicely, should we see as well an improvement of gross margin from the level in Q1?\n\n**Lorenzo Grandi** (President and CFO)\nMaybe I take this one, Jean-Marc, about the gross margin. Today, of course, gross margin will depend on the evolution of the revenue in the course of the year, as explained by Jean-Marc, we expect, let's say, to increase. But the gross margin today that we see in Q1, we believe, is clearly the lowest point in the year, this expectation of 33.7%. We will see some increase. This increase is also driven by the fact that we expect to have constantly a reduction in our unused capacity charges during the year. We expect some mild increase for the second quarter and then a more significant increase also driven by the seasonality of the revenues in the second half of the year. Yes, at this stage, we can say that the expectation for us is to have an increase in our gross margin all over the year.\n\n**François-Xavier Bouvignies** (Equity Research Executive Director)\nThank you.\n\n**Lorenzo Grandi** (President and CFO)\nThank you.\n\n**Jean-Marc Chéry** (President and CEO)\nThank you, François-Xavier. Maura, next question, please.\n\n**Operator**\nThe next question comes from Andrew Gardiner from Citi. Please go ahead.\n\n**Andrew Gardiner** (Managing Director and Head of European Technology Equity Research)\nThank you for the question. Good morning, all. I was interested, Jean-Marc, in digging a bit deeper into the automotive space. Clearly, your largest end market and the one where we're still seeing the most difficulty in terms of getting through the bottom of this cycle. There's a number of end market data points out there that are, I suppose, still causing investors questions in terms of the health of the market, tariff threats back and forth, admittedly, but also not helping. I'm just wondering, can you give us a bit more detail in terms of how you're seeing your customers behave? Do you think inventory is absolutely at a bottom in terms of the automotive channel and at the OEMs and the tier ones? What kind of confidence do you have as we look into the future quarters that we can return to stronger demand trends?\n\n**Jean-Marc Chéry** (President and CEO)\nWell, first of all, clearly, when we see our Q4 revenue in automotive, it was slightly below our expectation and mainly, in fact, driven by the pulling from inventory a little bit lower than expected from some tier one. Well, that means that the automotive market for, let's say, legacy application clearly is pretty soft. Inventory correction is certainly gone, but there is a kind of softness of this kind of application. Well, what will be positive on automotive is clearly what is around, let's say, electronic architecture, the new software-defined electronic architecture calling for more complex MPU, MCUs definitively. This will be an important growth driver.\n\n**Jean-Marc Chéry** (President and CEO)\nWell, we know that the electrical power trend will be still an important driver, but here it is more the competition landscape that changed completely compared to a few years ago because you see that out of, let's say, more than 30 million vehicles produced in China, more than half are battery-based. Compared to America, where it is more marginal in terms of production, and in Europe, it is below one-third. Here is more a question of the competition is in China. You know that in China is more complex to compete. But the power trend, electronics, the demand is there. So all in all, I think the automotive market, based on 90, 92, 93 million vehicles, out of which 17-18 million vehicles battery-based and a similar number in hybrid, is still changing in terms of mix.\n\n**Jean-Marc Chéry** (President and CEO)\nAs well, from the car classification, is more middle-end or premium car, even this car now onboard some electronics. The market is not yet stable. That's the reason why we have to be, let's say, cautious to adapt ourselves. But we see a different situation compared to entering in 2025, where we face very strong inventory correction in Q1 last year, if you remember, from our main customer. Well, this will not be repeated. It is more, let's say, a progressive stabilization of the market in terms of mix of car, electrical, hybrid, thermal combustion engine, and mix of car between high premium, premium, and middle class, and mix between China, APEC, Europe, and Asia. This is something we have to, of course, closely monitor and adapt ourselves with our supply chain. This is how we see the automotive market.\n\n**Andrew Gardiner** (Managing Director and Head of European Technology Equity Research)\nThank you, Jean-Marc. Just a quick follow-up, given you mentioned China at length there. How is the partnership with Sanan progressing? Is that going as you anticipated? Is it helping your competitiveness in that market, or is it still too early?\n\n**Jean-Marc Chéry** (President and CEO)\nNo, clearly, so we will start to ramp up the facilities now. We have modelized, we know exactly the efficiency of this fab. Clearly, it will be a key success factor in our capability to compete on the Chinese market.\n\n**Andrew Gardiner** (Managing Director and Head of European Technology Equity Research)\nThank you.\n\n**Jean-Marc Chéry** (President and CEO)\nThank you, Andrew. Maura, can we move to the next question, please?\n\n**Operator**\nThe next question comes from Joshua Buchalter there from TD Cowen. Please go ahead.\n\n**Joshua Buchalter** (Managing Director of Equity Research)\nHey, guys. Thank you for taking my questions. I actually wanted to drill into the personal electronics segment a little bit more. I think there's some concerns of disruption or even pull-ins in the short term due to higher memory costs. It came in better in the quarter. Maybe you could walk through what the drivers you're seeing are there and if you're seeing any changes in order pattern. I believe you called out higher silicon content in 2026. Was that referring to expectations for your largest customer this year? Thank you.\n\n**Jean-Marc Chéry** (President and CEO)\nYes, you know that our revenue are mainly driven by our biggest customer and more on the high-end kind of product, which are in some extent less sensitive to the memory price. At this stage, with the visibility we have, first of all, we don't see significant impact detected by us. I confirm that we expect to keep growing in personal electronics driven by our main customer in 2026, thanks to our increased device-based on silicon and not module content increase in 2026. So far, PE will be a growth driver for us in 2026.\n\n**Joshua Buchalter** (Managing Director of Equity Research)\nThank you for the color there. Then I think the last couple of quarters, you've been kind enough to give us your Book-to-bill ratios in auto and industrial. It seems like things are getting better on the industrial side in particular. Can you update us, I guess, on those metrics and whether you're mostly done with the channel inventory clearing on the industrial side? Thank you, and congrats on the solid results.\n\n**Jean-Marc Chéry** (President and CEO)\nNo, in industrial, the book-to-bill was well above parity, clearly. Also, beyond your question, I can tell you that the POS were growing, let's say, between low teens mid teens, which is good news. We continue to decrease our inventory. But on automotive, the book-to-bill is a little bit more complex because we have some few key customers that are putting orders in one shot for six months. The book-to-bill must be, let's say, assessed on a one-year moving average or six months moving average. Corrected from this, let's say, abnormal, let's say, process, the book-to-bill was parity on automotive.\n\n**Joshua Buchalter** (Managing Director of Equity Research)\nGot it. Thank you.\n\n**Jean-Marc Chéry** (President and CEO)\nThanks, Josh. Maura, next question, please.\n\n**Operator**\nThe next question comes from Stéphane Houri from ODDO BHF. Please go ahead.\n\n**Stéphane Houri** (Head of Equity Research)\nYes, hello. Good morning. Thank you for taking the question. I just wanted to come back a bit on the scenario for the year. I know you're not guiding, but historically, you've been saying that the second half is like 15% above the first half. That's the normal seasonality. Then on the top of that, you may have some specific programs. With the starting point you guide on Q1, and when I look at the consensus for the full year, it seems to be banking on something lower than that because of the starting point in Q1. Can you just confirm that you see now that the inventory correction is done normal seasonality throughout the year and maybe give some comments about the additions of some customer engage program? Thank you.\n\n**Jean-Marc Chéry** (President and CEO)\nNo, on the inventory correction, what we communicated, either Lorenzo or myself, is to say, by end of Q2, we do believe will be halt the excess of inventory. This today, I can confirm this would be the case. It's already the case from many product families. We are still here and there some pocket of excess inventory versus what we consider a standard. But looking at the current dynamic, POS, POP, by end of Q2, this will be gone. Now it's sure that in H2 will be exposed directly to the end demand. Well, about, again, what we consider engaged customer program beyond the cycle, let's say we can split in two major ones, three, I have to say. Well, one is the usual personal electronic. Why we say it's beyond the cycle is because silicon content increased.\n\n**Jean-Marc Chéry** (President and CEO)\nWe have the visibility with the current visibility we have. This will help us to grow beyond the cycle of personal electronics. Assuming our main customer will perform in market share as he really well performed in 2025, so this will drive our growth. Well, then moving to clearly communication equipment and computer peripherals. Communication equipment. Communication equipment, it is clear that for ST, the low Earth orbit satellite communication, is an important driver because thanks to our capability to supply and compete, our growth is driven by our largest customer in this field of activity, and as far as we see, it is pretty successful. Certainly, this year will be another demonstration of the success. Now, since two quarters, we are supporting our second largest customer that is growing as well. It is clearly beyond the cycle.\n\n**Jean-Marc Chéry** (President and CEO)\nThis will be a significant growth driver beyond the cycle for ST. Well, last but not the least is AI data center. You know that on AI data center, we were, let's say, a bit in delay for what we call the device addressing the power stage. But here we are in, let's say, a process to progressively close the gap and offer solutions to our customers. But clearly, where we will be at the head of the business dynamic, it is in the optical engine of the Cloud Optical Interconnect. It's Photonics ICs, BiCMOS ICs, and high-performance general microcontroller. This will contribute to the growth of ST significantly in 2026 beyond the cycle. Well, then moving to the more, let's say, traditional market focus we have, so automotive and industrial.\n\n**Jean-Marc Chéry** (President and CEO)\nWell, ADAS ASIC, last year was a challenging one because we saw some inventory correction on, let's say, some legacy ASIC. But this year, clearly, with the visibility we have, this will be a booster of growth. Finally, our SiC MOSFETs after the difficult year of 2025 will grow again. I can confirm to you that up to now in Q1, we have a good book-to-bill on silicon carbide that is very encouraging. And definitely, our sensor contribution with the acquisition of NXP MEMS plus the existing imaging sensor and existing MEMS we have. Well, and I am very pleased that beyond the inventory correction done on general purpose microcontroller, the proliferation of our new products are really paying back very well. And I am really confident that in 2027, we come back to our historical market share. And 2026 will be an important step to demonstrate it.\n\n**Jean-Marc Chéry** (President and CEO)\nThis is basically, in a few words, how we can describe 2026.\n\n**Stéphane Houri** (Head of Equity Research)\nOkay. Thank you very much, Jean-Marc. Maybe I have a small follow-up on the gross margin comments. I think last quarter, you said that you think you would end up Q4 2026 above the level of Q4 2025 in gross margin. Do you still feel confident with what you see developing, the mix, the underloading charges, etc., etc.?\n\n**Lorenzo Grandi** (President and CFO)\nYeah. Yes, I confirm that at this stage, the expectation is lengthy Q4 this year. 2026 should be better than Q4 2025.\n\n**Stéphane Houri** (Head of Equity Research)\nOkay. Very clear. Thank you very much.\n\n**Jean-Marc Chéry** (President and CEO)\nThank you, Stéphane. Maura, next question, please.\n\n**Operator**\nThe next question comes from Domenico Ghilotti from Equita. Please go ahead.\n\n**Domenico Ghilotti** (Co-Head of Research)\nGood morning. A couple of questions. The first is on the unused charges. You are guiding for a significant drop in Q1. I'm trying to understand, so despite the lower sales, I'm trying to understand if you see these numbers at the bottom and if you are already benefiting from the efficiency plan that you carried out. The second is some color on, if you can, on the second client in low Earth orbit. Should we assume that it is a significant number or just, let's say, starting entrance of a new client or an add-on, but not particularly relevant?\n\n**Lorenzo Grandi** (President and CFO)\nMaybe I take the one on the unused charges. Yes, unused charges are declining in the first quarter. There is the main ingredient of the declining in this quarter is the fact that, as you know, we are progressing with our programs to reshaping our manufacturing infrastructure.\n\n**Lorenzo Grandi** (President and CFO)\nThis program is progressively reducing our capacity in six inches for silicon carbide, 150 millimeters for silicon carbide, and 200 millimeters for silicon. We started, let's say, to move ahead on this plan. This is, if you want, something that is mechanical. At the end, the capacity is reduced. We are now moving our product on the existing capacity on one side, eight inches for the silicon carbide and 300 millimeters for the silicon. That's why we see the level of unused capacity notwithstanding that the revenues are lower in respect to the previous quarter to reduce. This trend will continue. Unused capacity will not disappear in the year, but will significantly reduce in the year and will be one driver for our improvement in the gross margin in the course of 2026.\n\n**Jean-Marc Chéry** (President and CEO)\nAbout the second question, yes, it's significant. If not, we will not mention. But I can just confirm you two numbers. In Q4, our CCP segment grew sequentially 23% and year-over-year 22%. Definitely, it is linked to the low Earth orbit satellite business we have, and it is driven both by our first customer and then by the second one. At 22, 23% growth sequential and year-over-year, so you can conclude it is significant.\n\n**Domenico Ghilotti** (Co-Head of Research)\nThank you.\n\n**Jean-Marc Chéry** (President and CEO)\nThank you.\n\n**Jean-Marc Chéry** (President and CEO)\nMaura, next question, please.\n\n**Operator**\nThe next question comes from Sandeep Deshpande from J.P. Morgan. Please go ahead.\n\n**Sandeep Deshpande** (Stock Analyst)\nHi. Thanks for letting me on. My question is about your fab loading into the current quarter. Given what is happening with the gross margin in the current quarter, how is the fab loading going through in the quarter, and how is the mix shifting overall in terms of the gross margin? Because you have a revenue decline, but the gross margin is declining. Are you reducing your fab loading this quarter? Are you increasing your fab loading? My follow-up question associated with that is how the mix, particularly associated with your better margin microcontroller products, is shifting.\n\n**Lorenzo Grandi** (President and CFO)\nIn the quarter, as I was saying before, the unused capacity charges are mainly related to the fact that we are moving out capacity, reducing capacity in certain specific fabs, where, of course, we are now moving production in different fabs, 300 millimeters, so reducing our capacity. At the end, when you look at the level of loading, we are not overloading our production, let's say, in the quarter. Clearly, if you look at the inventory and you look at where it will be the dynamic of the inventory in the quarter, as usual, you know that there is this seasonality in our inventory in which in the first half, our inventory is somehow increasing and then decreasing in the second part of the year.\n\n**Lorenzo Grandi** (President and CFO)\nAt the end, what it will be, the impact is that now the expectation is to end the quarter Q1 in the range of 140 days of inventory compared to the 130 days where we stand today. But I repeat, this is more related, let's say, to the normal dynamic of our inventory over the year than, let's say, loading our manufacturing infrastructure in a way that is, the impact on unused capacity charges is mainly related to the fact that we started with our programs to reduce capacity in some specific area. Clearly, the impact, the positive impact, let's say, of this in terms of gaining efficiency and so on will come probably later, as you know, in our, let's say, manufacturing infrastructure. We do expect our program to start to yield a positive impact in our manufacturing efficiency more in 2027 than this year.\n\n**Lorenzo Grandi** (President and CFO)\nBut one of the impacts that's visible is the reduced level of unloading, together also with the expectation of growth in terms of revenues. This we will see during the year, let's say, depending on the level of growth.\n\n**Sandeep Deshpande** (Stock Analyst)\nMy follow-up question is regarding, Jean-Marc, about your microcontroller business, which is, if you look at your embedded processing segment, it grew 1.2% year-on-year. I mean, many of your peers in this market are seeing better growth at this point. Why is ST growth in a key segment for ST lagging at this point, or is something else happening in that division?\n\n**Jean-Marc Chéry** (President and CEO)\nOn the embedded processing segment, clearly, the growth dynamic we have on general purpose microcontroller is, let's say, at least consistent with our peers. Why it is a little bit offset? It is offset by our automotive microcontroller because, okay, up to now, our automotive microcontroller are more the microcontroller that will be, let's say, for some model of car moving to the software-defined vehicle architecture removed, clearly. I already explained that we have done a strong effort in 2025 to rework the roadmap of our micro, but this will be payback, okay, more, let's say, end of 2027 and 2028. For the time being, yes, we suffer on the automotive microcontroller that is, let's say, partially offsetting the real good health of the general purpose.\n\n**Jean-Marc Chéry** (President and CEO)\nBut the general purpose microcontroller, let's say, maybe I can share with you one number, okay, for Q1, the embedded processing solution segment will grow up low 30s, so above 30% year-over-year. You can imagine that the growth of general purpose will be really strong. Well, then, let's say, the secure microcontroller are growing a little bit less because driven by the market. Okay, of course, we have some offset linked to the automotive micro. But I can confirm to you that our general purpose microcontroller are performing or overperforming the market.\n\n**Sandeep Deshpande** (Stock Analyst)\nThank you.\n\n**Jean-Marc Chéry** (President and CEO)\nThank you, Sandeep. Maura, I think we have time for one more question.\n\n**Operator**\nThe next question comes from Sébastien Sztabowicz from Kepler Cheuvreux. Please go ahead.\n\n**Sébastien Sztabowicz** (Equity Analyst)\nYeah. Hi, everyone. Thanks for taking my question. Coming back to the transformation program, have you made any specific progress so far? Notably on the manufacturing front, and are you still on track to reach your savings ambition for the end of 2027? The second one is more on the OpEx trend. Q1, we know where it will stand. But for the full year, where do you see OpEx trending? How do you see the startup cost impacting the OpEx 2026? Do you plan to accelerate a little bit further the cost-cutting actions for OpEx? Thank you.\n\n**Lorenzo Grandi** (President and CFO)\nIn terms of our reshaping programs, I would say that it is progressing in line with the expectation. In the course of 2025, the main, let's say, impact was related to the savings in our OpEx that indeed, when you look at the overall, are declining, notwithstanding, let's say, the negative impact of the euro-dollar. At this stage, in the course of 2026, as I said, we will start, let's say, progressively to transfer some activity from silicon carbide to eight-inch in silicon to the 300 mm. As I was saying before, it is now expected to yield the benefit in our manufacturing infrastructure efficiency of this program toward the second part of 2027 and 2028. My short answer here is yes. We are on track in respect to what we have communicated previously. This is the situation.\n\n**Lorenzo Grandi** (President and CFO)\nIn respect to the expenses of 2026, but now the expectation remains substantially the same, means that at the end, at this level of exchange rate, including the impact of the hedging, we should be able to stay with a net OpEx, means including other income and expenses on a low single-digit increase, something in that range, mainly driven by the fact that we will have a reduction in other income and expenses in respect to the one of 2025 due to the phase-out cost. Because, of course, let's say, from one side, we reduce the capacity in our manufacturing six-inch, eight-inch, but on the other side, we have a progressive phase-out from these steps that will be reported in this line. It's a temporary effect, but it will be there during 2026.\n\n**Sébastien Sztabowicz** (Equity Analyst)\nOkay. Thank you.\n\n**Jean-Marc Chéry** (President and CEO)\nThank you. Thank you, Sebastien. Thank you, everyone. I think this is ending our call for this quarter. Thanks very much, all of you, for being there. We remain here at your disposal should you need any follow-up questions. Thank you.\n\n**Operator**\nLadies and gentlemen, the conference is now over. Thank you for choosing Chorus Call, and thank you for participating in the conference. You may now disconnect your lines. Goodbye.",
      "fetched_at": "2026-02-04T15:45:02.513Z"
    },
    {
      "ticker": "STM",
      "title": "STMicroelectronics N.V. (STM) Q3 FY2025 earnings call transcript",
      "published_date": "Oct 23, 2025, 3:30 AM EDT",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/STM/earnings/STM-Q3-2025-earnings_call-339116.html",
      "content": "**Operator**\nLadies and gentlemen, welcome to the STMicroelectronics third quarter 2025 earnings release conference call and live webcast. I am Moira, the Chorus Call Operator. I would like to remind you that all participants will be in listen-only mode and the conference is being recorded. The presentation will be followed by a Q&A session. You can register for questions at any time by pressing 1 on your telephone. For operator assistance, please press star 0. The conference must not be recorded for publication or broadcast at this time. It's my pleasure to hand over to Jerome Ramel, EVP Corporate Development and Integrated External Communication. Please go ahead.\n\n**Jerome Ramel** (EVP Corporate Development and Integrated External Communication)\nThank you, Maura, thank you everyone for joining our third quarter 2025 financial results call. Hosting the call today is Jean-Marc Chery, STMicroelectronics President and Chief Executive Officer. Joining Jean-Marc on the call today are Lorenzo Grandi, President and CFO, and Marco Cassis, President, Analog, Power and Discrete, MEMS and Sensors Group and Head of STMicroelectronics Strategy, System Research, Application and Innovation Office. This live webcast and presentation materials can be accessed on the ST Investor Relations website. A replay will be available shortly after the conclusion of this call. This call will include forward-looking statements that involve risk factors that could cause STMicroelectronics results to differ materially from management expectations and plans.\n\n**Jerome Ramel** (EVP Corporate Development and Integrated External Communication)\nWe encourage you to review the Safe Harbor statement contained in the press release that was issued with the results this morning and also in STMicroelectronics most recent regulatory filings for a full description of these risk factors. Also, to ensure all participants have an opportunity to ask questions during the Q&A session, please limit yourself to one question and a brief follow-up. Now I'd like to turn the call over to Jean-Marc Chery, STMicroelectronics President.\n\n**Jean-Marc Chery** (President and CEO)\nThank you, Jerome. Good morning, everyone, and thank you for joining STMicroelectronics for our Q3 2025 earnings conference call. I will start with an overview of the third quarter, including business dynamics. I will then hand over to Lorenzo for the detailed financial overview and will then comment on the outlook and conclude before answering your questions. Starting with Q3, we delivered revenues at $3.19 billion, $17 million above the midpoint of our business outlook range, with higher revenues in personal electronics while automotive and industrial performed as anticipated, and CCP was broadly in line with expectations. All end markets but automotive are now back to year-on-year growth. Gross margin of 33.2% was slightly below the midpoint of our business outlook range, reflecting product mix within automotive and within industrial, excluding impairments, restructuring charges, and other related phase of costs. Diluted earnings per share was $0.29.\n\n**Jean-Marc Chery** (President and CEO)\nDuring the quarter, we managed to work down inventories both in our balance sheet and in distribution, and we generated a positive $130 million free cash flow. Let's now discuss our business dynamics during Q3. In automotive, during the quarter, we grew revenues about 10% sequentially in line with expectations, driven by all regions except Americas. Our book-to-bill came above parity. We expect to grow mid-single digits in the fourth quarter compared to the third quarter, which would be the third consecutive quarter of sequential growth. During the quarter, we continued to execute our strategy. For car electrification, we had wins with both silicon and silicon carbide devices for electric vehicle applications such as traction inverter and onboard charger designs. One new application where we see silicon carbide being used is inverters for full active suspension.\n\n**Jean-Marc Chery** (President and CEO)\nHere, we had a design win with a module solution for a key Chinese electric vehicle maker. Another key element is a switch to electronic fuses to support zonal and domain architectures both in 12 volt and 48 volts. Here, we added to our pipeline of designs for our EFUSE controller with leading electric vehicle makers and qualified our products for volume ramp up. Other wins in the quarter included microcontrollers for DC-DC management in electric vehicle powertrain, body control modules, and HVAC systems across multiple vehicle models. In car digitalization, we are executing our microcontroller product roadmap with a strong lineup of new solutions across both our Airbase Stellar and STM32A product families. Designing activity continues globally with engagement from both large scale automotive OEMs and tier one suppliers. In legacy application, we had several significant wins based on our smart power technologies.\n\n**Jean-Marc Chery** (President and CEO)\nIn applications where we lead such as airbags, steering and braking solutions with our automotive grade sensors, we continue to see strong designing momentum and growing opportunities. Wins in the quarter included MEMS sensors for road noise cancellation and door control and both MEMS and imaging sensors for in-cabin monitoring. Shortly after our results announcement in July, we announced that we entered into a definitive transaction agreement for the acquisition of NXP's MEMS sensor business for a purchase price of up to $950 million in cash, complementing and expanding our current leading MEMS sensor technology and product portfolio. The transaction remains subject to customary closing conditions including regulatory approvals and is on track to close in H1 2026.\n\n**Jean-Marc Chery** (President and CEO)\nIn industrial, revenues were in line with expectations, showing increase of 8% sequentially and 13% year over year, back to year on year growth for the first time since the third quarter of 2023. Importantly, inventories in distribution further decreased in Q4. We expect to grow revenues low single digits sequentially as we continue to decrease inventories in distribution. During the quarter, we saw strong designing activity for our power analog portfolio across a range of applications. These included factory automation, power systems, medical equipment, motor control, white goods, solar inverters and metering. We also continue to expand the use of our industrial sensors in robotics including robots and cobots and humanoid robots, an area where we see demand for significant number of sensors. We also had wins in medical devices like insulin pumps and fall detectors.\n\n**Jean-Marc Chery** (President and CEO)\nIn embedded processing, we continue to win designs with our STM32 microcontrollers for a wide range of industrial applications with products from all parts of the portfolio from high end to wireless to specialized functions. These included power supply and optical modules for AI servers, industry automation and robotics, energy storage, home applications, metering and white goods. We have a full pipeline of new products and software coming to market in the next quarters, and you will hear more about this during our STM32 Summit in November. For general purpose microcontroller, we grew revenues both sequentially and year over year, and we are on the right trajectory to return to our historical market share of about 20% to 23%.\n\n**Jean-Marc Chery** (President and CEO)\nFor personal electronics, third quarter revenues were above our expectations, up 40% sequentially, reflecting the seasonality of our engaged customer programs, but also increased silicon content, which also translated into year over year growth. Further strengthening of our unique position as a sensor supplier with both MEMS and optical sensing solutions, we signed a new license agreement with Metalenz. This new agreement broadens our capability to produce advanced metasurface optics, leveraging ST's 300mm semiconductor and optics manufacturing capabilities. This opened up new opportunities from smartphone applications like biometrics, LIDAR, and camera assets to robotic gesture recognition and object detection. Revenues for communication equipment and computer peripherals were broadly in line with expectations and up 4% sequentially. For AI data centers, we had multiple wins with silicon and silicon carbide devices for high power solutions.\n\n**Jean-Marc Chery** (President and CEO)\nAlthough last quarter we announced that we are working closely with Nvidia on a new architecture for 800 volt DC AI data center, leveraging our power portfolio by combining silicon carbide, gallium nitride, and silicon based technologies with advanced custom design at both chip and package level.\n\n**Jean-Marc Chery** (President and CEO)\nI am.\n\n**Jean-Marc Chery** (President and CEO)\nPleased to underline that we recently completed full power testing on a prototype GaN-based solution, successfully demonstrating over 98% energy conversion efficiency. Silicon photonics is another key technology for future data center and AI factories. STMicroelectronics now heads the Starlight Consortium, a collaborative R&D program across the full value chain with key suppliers and customers to develop high-speed optical solutions for data center AI, telecommunications, and automotive from the substrate to the final products. During Q3, we have seen an increased demand for photonics ICs prototypes to be launched in the next quarter and beyond in our 300mm wafer fab. This confirms that photonics ICs will be a revenue growth driver for STMicroelectronics in the near term.\n\n**Jean-Marc Chery** (President and CEO)\nIn low Earth orbit satellites, we have further strengthened our leadership position in the rapidly growing low orbital and broadband market by beginning shipment to a second global customer, leveraging our winning combination of BiCMOS technology for front-end modules and panel-level packaging for user terminals. Our business in this segment is well positioned for steady growth driven by several satellite constellations. Now over to Lorenzo, who will present our key financial figures.\n\n**Lorenzo Grandi** (President and CFO)\nThank you Jean-Marc and good morning everyone. Let's start with a detailed review of the third quarter, starting with the revenues on a year-over-year basis by reportable segment. Analog products, MEMS and sensor was up 7.0% mainly due to imaging. Power and discrete products decreased 34.3%. Embedded processing revenues grew 8.7% mainly due to general purpose MCO. RF and optical communication declined 3.4%. By end market, industrial increased by about 13%, personal electronic by about 11%, communication equipment and computer peripheral by about 7%. Automotive was still decreasing by about 17% but showing some improvement in respect to the 24% decline recorded in the second quarter. Year over year, sales to OEMs decreased 5.1% while revenues from distribution increased 7.6%. Back to year-over-year growth for the first time since the third quarter 2023. On a sequential basis, power and discrete was the only segment to decrease by 4.3%.\n\n**Lorenzo Grandi** (President and CFO)\nAll the other segments grew, led by analog products, MEMS and sensor up 26.6% with embedded processing up 15.3% and RF and optical communication up 2.4%. All our end markets grew, led by personal electronics up by about 40% followed by automotive up by about 10%, with industrial and communication equipment and computer and peripheral up respectively by about 8% and 4%. Turning now on profitability, gross profit in the third quarter was $1.06 billion, decreasing 13.7% on a year-over-year basis. Gross margin was 33.2%, decreasing 460 basis points on a year-over-year mainly due to lower manufacturing efficiencies, negative currency effect, lower level of capacity reservation fees and to a lesser extent the combination of sales price and product mix. Total net operating expenses excluding restructuring amounted to $842 million in the third quarter.\n\n**Lorenzo Grandi** (President and CFO)\nBroadly stable on a year-over-year, they were better than expected reflecting notably our continued cost discipline with the first benefits of the resizing of our global cost base. For the fourth quarter of 2025 we expect net of tax to stand at about $950 million, increasing quarter on quarter due notably to calendar days effect. This would lead the net OPEX for the full year 2025 to decline by 2.5% compared to 2024 despite unfavorable currency effect. As a reminder, these amounts are net of other income and expenses and exclude restructuring. In the third quarter we reported $180 million operating income, which included $37 million for impairment, restructuring charges, and other related phase-out costs. These reflect impairment of assets and restructuring charges predominantly associated with the previously announced company-wide program to reshape our manufacturing footprint and resize our global cost base.\n\n**Lorenzo Grandi** (President and CFO)\nExcluding this non-recurring item, which is partially non-cash, Q3 non-U.S. GAAP operating margin was 6.8%, with analog products, MEMS and sensor at 15.4%, power and discrete at -15.6%, embedded processing at 16.5%, and the ref optical communication at 16.6%. This quarter 2025, the net income was $237 million compared to $351 million in the year-ago quarter. Diluted earnings per share were $0.26 compared to $0.37, excluding the previously mentioned non-recurring items. Non-U.S. GAAP net income and diluted earnings per share were respectively $267 million and $0.29. Net cash from operating activity decreased 24.1% on a year-over-year basis in the third quarter to $549 million. Third quarter net CapEx was $401 million compared to $565 million in Q3 2024. Free cash flow was a positive $130 million in the third quarter compared to $136 million in the year-ago quarter.\n\n**Lorenzo Grandi** (President and CFO)\nInventory at the end of the third quarter was $3.17 billion, a reduction of about $100 million compared to the end of the second quarter. Days sales of inventory at the quarter end were 135 days, slightly better than our expectation and compared to 166 days for the previous quarter and 130 days in the year-ago quarter. Cash dividends paid to stockholders in the third quarter totaled $81 million. In addition, ST executed share buybacks of $91 million. ST maintains its financial strength with a net financial position that remained solid at $2.61 billion as at the end of September 2025, reflecting total liquidity of $4.78 billion and total financial debt of $2.17 billion. It is worth to mention that in the course of the third quarter we repaid in full in cash $750 million for the first tranche of our 2020 convertible bond.\n\n**Lorenzo Grandi** (President and CFO)\nNow back to Jean-Marc who will comment on our outlook.\n\n**Jean-Marc Chery** (President and CEO)\nThank you, Lorenzo. Let's move to our business outlook for Q4 2025. We are expecting revenues at $3.28 billion, an increase of 2.9% sequentially, plus or minus 350 basis points. We expect our gross margin to be about 35% plus or minus 200 basis points, including about 290 basis points of unused capacity charges. This business outlook does not include any impact for potential further changes to global trade tariffs. Compared to the current situation, the midpoint of this outlook translates in full year 2025 revenues of about $11.75 billion. This represents a 22.4% growth in the second half compared to the first half, confirming signs of market recovery. Gross margin for the full year is expected to be about 33.8%.\n\n**Jean-Marc Chery** (President and CEO)\nFinally, to optimize our investments in the current market conditions, we have reduced our net CapEx plan, now slightly below $2 billion for full year 2025 compared to a range of $2 billion to $2.3 billion previously. To conclude, in the fourth quarter, we expect to report further sequential revenue improvement, with revenues now broadly stabilized on a year over year basis as well as an increased gross margin while continuing to decrease inventories in distribution. We are on the right path to improve our gross margin in the medium term through the reduction of unused capacity charges, the reshaping of our manufacturing footprint, and definitively our product mix improvement in a context marked by signs of market recovery.\n\n**Jean-Marc Chery** (President and CEO)\nOur strategic priorities remain clear: accelerating innovation, executing our company wide program to reshape our manufacturing footprint and resize our global cost base, which remain on schedule to deliver the targeted savings, and strengthening free cash flow generation. Thank you, and we are now ready to answer your questions.\n\n**Operator**\nWe will now begin the question and answer session. Anyone who wishes to ask a question or make a comment may press star and one on their touchtone telephone. You will hear a tone to confirm that you have entered the queue. If you wish to remove yourself from the question queue, you may press N2. Participants are requested to use only handsets while asking a question. In the interest of time, please limit yourself to one question only. Anyone who has a question or a comment may press star N1 at this time. The first question comes from the line of Francois Bouvigny from UBS. Please go ahead.\n\n**Francois Bouvignies** (Research Analyst)\nThank you very much. My first question is on the top line, I mean you guided plus 3% quarter on quarter, 2.9% to be precise. It seems to be below your seasonal at, you know, plus 7% quote unquote, if I'm not wrong. I mean, you can remind us maybe the seasonality. Can you explain to us as to why, you know, you are a bit below seasonal in Q4 for the top line and the drivers? Secondly, on the gross margin, I mean it's nice to see this improvement of 180 basis points quarter on quarter. How sustainable is this gross margin? I mean, if you have any seasonality, product mix, you know, should we extrapolate this dynamic of 35% into 1H26? Just trying to understand, you know, the work you have done on gross margin, how sustainable it is at least in 1H26 would be great. Thank you.\n\n**Jean-Marc Chery** (President and CEO)\nWe'll take the revenue seasonality, and on the revenue seasonality of Q4, basically there are two effects. The first effect is on automotive because on automotive, even if we will grow quarter over quarter 6%, year on year it is still minus 12%. Why? Because 80% of this performance gap is explained by two reasons. It is a decrease of capacity reservation fees compared to last year, and it is overall volume of one important customer of STMicroelectronics in the field of electric vehicle. This is what is explaining why in Q4 we are below the seasonality. The second explanation to be below the seasonality in Q4 is because in industrial we continue to decrease inventory in distribution, so our POP revenue recognition is significantly below the POS.\n\n**Jean-Marc Chery** (President and CEO)\nHowever, on the other verticals like personal electronic, communication equipment, computer peripheral, and other legacy on automotive or industrial in the field of power energy, basically we are at the seasonality we expect.\n\n**Lorenzo Grandi** (President and CFO)\nAbout gross margin in Q4, the gross margin, the main positive driver, let's say when we look at the sequential increase of our gross margin moving from the result of Q3 and the expectation of Q4, is clearly improved manufacturing efficiency. That is, if you remember, let's say in the first half and also in Q3, we were impacted by a significant negative impact on the manufacturing efficiencies that was due to the very low level of production that we had, especially in the first half of the year. There is also some improvement in terms of new charges when we look, let's say, to how we will move in the first approach next year. We have to remind that clearly there are two negative effects that will impact moving forward.\n\n**Lorenzo Grandi** (President and CFO)\nOne effect is related to the fact that there will be some reduction entering 2026 of the capacity reservation fees, and definitely you know that in the first part of the year there is some seasonality in terms of our revenues, let's say irrespective to the second part of the year. Do not forget that there is also the renegotiation of the pricing that will impact. Even if we see today not a significant drop, we think that it will be something in the range of low single digit, mid single digit decline. On the positive side, we will have, let's say, still continued positive impact.\n\n**Lorenzo Grandi** (President and CFO)\nOn.\n\n**Lorenzo Grandi** (President and CFO)\nManufacturing and continue to reduce level of unsaturation. At this stage, it's a little bit too difficult to size, let's say, the level of gross margin because it will depend also on the level of the revenues. This is directionally the trend that we will have moving entering in the next year. Thank you.\n\n**Francois Bouvignies** (Research Analyst)\nThank you very much.\n\n**Jerome Ramel** (EVP Corporate Development and Integrated External Communication)\nMoira, next question please.\n\n**Operator**\nThe next question comes from the line of Joshua Buchalter from TD Cowen. Please go ahead.\n\n**Joshua Buchalter** (Senior Equity Research Analyst)\nHey guys, good morning and thank you for taking my question. Maybe to follow up on that last one, could you maybe spend a couple minutes talking about how you're thinking about managing utilization rates right now? It seems like you're taking things back up. Are you at the point where you feel comfortable building a little bit of inventory downstream and or on your balance sheet, given the comments you mentioned, you're going into some negative seasonality into 1Q, but it sounds like utilization rates are going to be up in the fourth quarter and the first quarter. Could you maybe just spend a couple minutes talking about what you're seeing there?\n\n**Joshua Buchalter** (Senior Equity Research Analyst)\nThank you.\n\n**Lorenzo Grandi** (President and CFO)\nNow for the inventory, clearly let's say as you have seen, we try to keep control on the level of inventory in the current quarter. We think to stay substantially stable in number of days. This is our expectation in respect to Q3. The positive point is that entering in the next year, clearly let's say as I said, that there is our seasonality, the normal seasonality. That means that in general the inventory in the first half of the year is a little bit higher also in number of days irrespective to the second part of the year. You have to consider that entering next year, let's say we start to have some decrease in terms of overall capacity linked to the fact that we started to have some benefit coming from our reshaping of the manufacturing infrastructure. This will somehow mitigate the level of unused moving in 2026.\n\n**Lorenzo Grandi** (President and CFO)\nThis is let's say one of the drivers that we see in terms of progressively improve in terms of the utilization rate together of course with some growth in thermal revenues.\n\n**Jerome Ramel** (EVP Corporate Development and Integrated External Communication)\nDo you have any?\n\n**Joshua Buchalter** (Senior Equity Research Analyst)\nOkay, got it. Thank you.\n\n**Joshua Buchalter** (Senior Equity Research Analyst)\nThank you.\n\n**Joshua Buchalter** (Senior Equity Research Analyst)\nI was hoping to ask about the industrial segment. It looks like book to bill went back to parity. Is anything major going on there? Are any geographies better or worse, and maybe how would you categorize the health of the general purpose microcontroller business underneath there? Basically, should we assume we're sort of shifting back to normal now?\n\n**Joshua Buchalter** (Senior Equity Research Analyst)\nThank you.\n\n**Jean-Marc Chery** (President and CEO)\nIn industrial we see different dynamic. When we go on some sub segment we see a growth and dynamic market pronounced for power energy. Basically all sub segments of this one are growing and it is going more definitively than the smart industrial means the factory automation. We can say that robotics is so far good, but overall the factory automation is really soft. More than all the industrial which are volume driven means consumer driven. The up cycle is pretty soft. The takeaway we can have on the industrial is what is related power energy infrastructure and robotics is now upcycled pretty, pretty solid. What is related volume and consumer is a very soft upcycle. Looks like inventory are digested, but the visibility is pretty short, is pretty low. That's the reason why the customer are still putting order on short term.\n\n**Jean-Marc Chery** (President and CEO)\nHere our decision is to continue to manage the distribution very closely and continue to adjust our pop below their POS forecast to continue to decrease inventory. Inventory and general purpose microcontroller came back what we classified normal means a level of months of inventory that enable short term business. We have still some pocket of other inventory on some specific product like power discrete or sometimes general purpose microcontroller. We are going in the right direction. This is the dynamic we are seeing on industrial market.\n\n**Jerome Ramel** (EVP Corporate Development and Integrated External Communication)\nThank you, Josh. Moira, next question, please.\n\n**Operator**\nThe next question comes from Tristan Guerra from Bayard. Please go ahead.\n\n**Tristan Guerra** (Analyst)\nHi, good morning. Wanted to see how linear is the reduction in capacity reservation fees that you expect in 2026 from the $150-200 million reduction that you're looking at for this year. Is there a big drop in Q1, or is it going to be pretty linear throughout all of next year?\n\n**Lorenzo Grandi** (President and CFO)\nIn terms of capacity reservation fees, it works in this way. Let's say substantially, the capacity reservation fees that are ruled by contract with the carmakers are quite constant over the year in terms of million dollars. You can have a little bit higher, a little bit lower during the various quarters of the year, but they are not linearly going down. Let's say they are substantially quite flattish, I would say, quarter after quarter. Clearly, when the contract expires, that is at the end, for instance, of 2025, many of these contracts are expiring. Yes, you have the decline, and then the decline remains. The level that you get in the first quarter will remain substantially similar all over the other quarters. This is the way that it works.\n\n**Lorenzo Grandi** (President and CFO)\nWhat we will see in Q1 will be this reduction, and then after that it will stay stable, more or less stable, during the course of 2026 at the level of capacity reservation.\n\n**Jerome Ramel** (EVP Corporate Development and Integrated External Communication)\nDo you have another one?\n\n**Tristan Guerra** (Analyst)\nYes, thanks. Just a quick follow-up. Of course, it's going to depend on end demand, but any sense of or when you think POP can get back in line with point of sales in industrial next year?\n\n**Jean-Marc Chery** (President and CEO)\nGlobally, POP will be aligned with POS. Each time our product line reaches the target of inventory we don't want to exceed, this is okay. A lesson we learned from the past, and now we are really disciplined on this point. You cannot see the POP overall; we have to look at the POP in detail by product line. I repeat, no. Our microcontroller is pretty well aligned, so our POP is really driven by the end demand POS and by region. I have to say, where China, APEC, America are pretty okay, and Europe is still soft. For the other product line, we are still in a mode where the POP is below the POS. However, we expect to go back to normal in H1 2026, most likely Q2.\n\n**Jerome Ramel** (EVP Corporate Development and Integrated External Communication)\nThank you, Tristan.\n\n**Tristan Guerra** (Analyst)\nThank you very much.\n\n**Jerome Ramel** (EVP Corporate Development and Integrated External Communication)\nMoira, next question please.\n\n**Operator**\nThe next question comes from Stefan Huri from ODDO BHF. Please go ahead.\n\n**Stéphane Houri** (Head of Equity Research)\nYes. Good morning everyone. I have a first question about the CapEx budget because you're adjusting downward the CapEx for the end of this year. I guess this is in the course of managing your capacity by the end of the year and also an expectation of 2026. What are you reducing at the moment, and how do you look at 2026 in terms of CapEx at a point where you're transforming your tool from 200mm to 300mm? Thank you.\n\n**Jean-Marc Chery** (President and CEO)\nWe reduce the CapEx. In fact, there are two dynamics. There is a dynamic driven by our plan where, you know, we want to close the 200mm fab, so Agrate and Crolles. Of course, we need to put the CapEx to increase the capacity at the right level in Agrate 300 and in Crolles 200. Here, we have not specially limited the dynamic because the demand is pretty solid. The other main important action is a CapEx for 200mm conversion on silicon carbide because we will close the 150mm. Here, we have limited the CapEx driven by the demand, which is below what we expected one year ago. The main impact of capacity limitation is on, let's say, silicon carbide. After that, it is more spread across test assembly, where we clearly adjust the capacity to what we need and no more.\n\n**Jean-Marc Chery** (President and CEO)\nGenerally speaking, it is more adaptation to mix rather than volume increase.\n\n**Jerome Ramel** (EVP Corporate Development and Integrated External Communication)\nYou have a follow-up, Stefan?\n\n**Stéphane Houri** (Head of Equity Research)\nYes, a small one.\n\n**Stéphane Houri** (Head of Equity Research)\nJust to ask you if with the next NXP situation you do really receive phone calls or kind of rush orders from your customer, or you see nothing for the moment. Thank you.\n\n**Jean-Marc Chery** (President and CEO)\nWe are sure that the carmaker and the tier one of the automotive industry have clearly taken the lesson of the previous short term period, and they have enabled many sources to prevent such issues. Of course, as the other semiconductor player, STMicroelectronics is part of this process. More than that I have no comment.\n\n**Stéphane Houri** (Head of Equity Research)\nOkay, thank you.\n\n**Jerome Ramel** (EVP Corporate Development and Integrated External Communication)\nThank you. Stephane Moira, next question please.\n\n**Operator**\nNext question comes from Didier Scemama from Bank of America. Please go ahead.\n\n**Didier Scemama** (Managing Director and Senior Analyst)\nYes, good morning. Thanks for taking my question. I have the first question maybe on your inventory and related to that, on what you're thinking about in terms of factory loadings for the first half. I think one of your peers already announced last week or earlier this week, sorry, that they would reduce factory loadings to reduce inventory, especially in the context of a shallow recovery. It looks like your inventory is tracking about 30, 40, and 50 days above where they used to be. Are you thinking about taking down further factory utilization in the first half?\n\n**Lorenzo Grandi** (President and CFO)\nI guess now in terms of inventory, I would say that yes, you're right, it's a little bit higher in respect to what was our historical ending of the year. A little bit higher. At the end, I think that when we look next year, I think the dynamic of our, we will continue to keep under control the inventory. The dynamic of the inventory will, let's say, be as usual, a little bit increasing during the first half of the year to go back to decreasing the second part of the year in terms of, let's say, unloading factory utilization. I think that moving in 2026 there will be an improvement, notwithstanding we will continue to keep under control our inventory.\n\n**Lorenzo Grandi** (President and CFO)\nThis improvement, as I was saying before, is due to the fact that we do expect some, let's say, increase in terms of our revenues looking at the evolution of the market. The other element is that we start to, let's say, reduce capacity in some of our fabs that we aim, let's say, to progressively close in the course of the by the end of 2027. We will start, of course, to move out some equipment and this will reduce the capacity and this will reduce the level of use them.\n\n**Didier Scemama** (Managing Director and Senior Analyst)\nGot it. I think last quarter you said that the gross margins were impacted by, if I remember correctly, roughly 70 basis points of the 140 at 70 basis points of FX headwinds and 70 basis points of, you know, related to basically the manufacturing transition from 6 to 8 and 8 to 12. Is there any of that in Q4?\n\n**Lorenzo Grandi** (President and CFO)\nNo, no. Moving from Q2 to Q3, the FX was overall an impact of 140 basis points. Q2 to Q3, related to the combination of these two effects, but very different. Something in the range of 120 basis points was the FX and around 20 basis points was the impact of these extra costs related to our programs. In this quarter, clearly the FX is a minor impact because it's quite stable. It's a little bit negative because we move from 1.14 to 1.15, ranging in the range of 20 basis points negative impact. It's not so material. While these extra costs related to the activity to reduce the capacity and to start to move products from one side to the other is impacting our gross margin expected for Q4 between 30 to 40 basis points.\n\n**Lorenzo Grandi** (President and CFO)\nThis is the 30, something ranging between 30 to 40 basis points of extra cost. Understood.\n\n**Didier Scemama** (Managing Director and Senior Analyst)\nJust a clarification because it wasn't clear. Your OpEx guide for Q4 is $915 million, right? It's not $950 million.\n\n**Lorenzo Grandi** (President and CFO)\nNo, no, it's 915. This is driven by the fact that we have a negative calendar days impact for two reasons. The calendar is longer, and the vacation in Europe is, let's say, less than what we benefited in the course of the previous quarter. On the other side, we will continue with our, let's say, program to reduce account in expenses, and this will bring us some benefit.\n\n**Didier Scemama** (Managing Director and Senior Analyst)\nThank you so much.\n\n**Jerome Ramel** (EVP Corporate Development and Integrated External Communication)\nThank you. Allison Malkin, next question please.\n\n**Operator**\nThe next question comes from Sandeep Deshpande from JP Morgan. Please go ahead.\n\n**Sandeep Deshpande** (Analyst)\nYeah, hi, good morning. Thanks for letting me on. My question is regarding the trends into the first quarter. I mean you normally have a weaker first quarter. Would you expect the utilization rates to go down? Given all the other factors you've talked about in the earlier questions, there is a downtick associated with the capacity reservation fees. Should we expect your gross margin in the first half of the year to be weaker than where it is at the moment? I have a quick follow up after that.\n\n**Lorenzo Grandi** (President and CFO)\nYeah, in terms of gross margin, it is true that in the first half the seasonality is not favorable, and yes, there are the lower capacity reservation fees on the other side. Irrespective of where we stand today, our expectation is that the level of unused charges will decrease. The decrease is not due to the fact that we aim to increase our inventory. There is some seasonality in our inventory. The decrease, as I was trying to explain before, is mainly driven by the fact that we start to reduce the capacity. It means that we will start some transfer of equipment and this, or let's say not utilization of equipment, is due to the fact that we progressively, in some fabs, started to reduce the capacity aimed at the end, let's say, to move to close this fab.\n\n**Lorenzo Grandi** (President and CFO)\nWe will start, and this will progressively impact our capacity and to some extent our annual capacity.\n\n**Sandeep Deshpande** (Analyst)\nThanks.\n\n**Sandeep Deshpande** (Analyst)\nI mean, a follow-up to that essentially, quickly on that, would be is your number of days in Q1 lower than in Q4, or is it anything different? My main question is about 2026 overall. I mean, on the revenue, do you have any new engaged programs with your customers which will improve revenue significantly, either in the first half or into the second half? Particularly, no.\n\n**Lorenzo Grandi** (President and CFO)\nI confirm, Sandipa, that in Q1, Q1 will be shorter in terms of number of days than Q4. Q4 is longer in terms of days than the normal 91, and the calendar next year, Q1 will be shorter than the normal 91. It's a little bit the same trend that we have seen this year, let's say, in terms of calendar. Yes, I confirm that there is a shorter calendar in Q1.\n\n**Jean-Marc Chery** (President and CEO)\nFirst of all, about next year 2026 Q1, with the current visibility, we.\n\n**Jean-Marc Chery** (President and CEO)\nHave.\n\n**Jean-Marc Chery** (President and CEO)\nThe loading of the backlog we have seen in Q3 and we are seeing today, but we don't see a specific reason why we will not be at the usual seasonality of Q1 revenue versus Q4, which is generally speaking really slightly above minus 10%. Moving forward, of course.\n\n**Jean-Marc Chery** (President and CEO)\nBut.\n\n**Jean-Marc Chery** (President and CEO)\nIt's evident depends on market dynamic. I would like to say that for 2026, first of all, in the second half we will clearly see the normalization of inventory everywhere. We really expect that in H2 2026 we will have no other inventory point number one. Point number two, next year compared to 2025, the silicon carbide will be a year of growth because 2025 is a year of transition where basically we have cumulative headwinds related to one specific customer, some program not going at the expected speed in Europe. You know, we are not specially still present in China, but seek next year will be a growth driver. After, we have our exposure to fast growing segment clearly that already give us sign of growth like advanced driver-assistance systems with our main customer that already provided some, let's classify, upside and MEMS as well.\n\n**Jean-Marc Chery** (President and CEO)\nDefinitively one point is our increasing content in terms of value and silicon in our main customer. All in all, we do believe that Q1 we have no sign that the seasonality will be impacted by other factors that we do not control. In H2 we will be as well as the usual seasonality of growth H2 versus H1. Do we grow more like because this year we grew 23% and the usual seasonality is 15% H2 versus H1. Here we need to have a little bit more booking in Q1 and in Q2 to confirm.\n\n**Jean-Marc Chery** (President and CEO)\nMy takeaway is yes, we will have, let's say, idiopsychotic growth driver on top of the, let's say, upcycle of the market that we are seeing today, even if this upcycle market of automotive and industrial should be classified at this stage soft, and with some sub segments pretty dynamic like the one related to infrastructure.\n\n**Sandeep Deshpande** (Analyst)\nThank you, thank you so much.\n\n**Jean-Marc Chery** (President and CEO)\nVery careful.\n\n**Jerome Ramel** (EVP Corporate Development and Integrated External Communication)\nMoira, next question please.\n\n**Operator**\nThe next question comes from the line of Jerome Ramel from Jefferies. Please go ahead.\n\n**Operator**\nHi, good morning. Thanks for taking the question. I just wanted to go back to the power discrete business where your margins are still very weak at minus 15% in the third quarter. What can be the drivers to improve that? You talked about silicon carbide improving in Q3, I'm sorry, in 2026. Would that revenue come mainly from your Sanan JV to Chinese customers? Will that help your overall profitability given low utilizations in Europe? Do you need to take any further action to try and improve the profitability there in power discretes, given the kind of competitive environment in that industry? My follow up is just a small clarification on a previous answer. Your 30 to 40 basis points of manufacturing inefficiency from the conversion and shutting down, etc.\n\n**Operator**\nDoes that continue till you reach the end of that journey, which is when you fully close down your 200mm and transition to 300mm, or does that drop off before that?\n\n**Operator**\nThanks.\n\n**Jean-Marc Chery** (President and CEO)\nLorenzo, with a comment about the improvement driver of power discrete profitability, while Marco will comment on the dynamic of power and discrete revenue, because as I have already anticipated in my last answer. Clearly, silicon carbide for us in 2025 is a transition period. Lorenzo, you answered the last question well.\n\n**Lorenzo Grandi** (President and CFO)\nYes, I can take it clearly. I will let Marco explain what are the drivers. At the end, let's say clearly next year we do expect a recovery in terms of the top line. At least we learned that this year we were impacted by a significant inefficiency in our manufacturing environment for the power and discrete in general, and for the silicon carbide in particular, due to the fact that we were working at a very low level of saturation for these steps. There are the following drivers that we expect to recover in terms of profitability. Having a higher level of revenues clearly will help to better load our infrastructure. Don't forget that silicon carbide will be the first to move, let's say in the course of next year from the 6 inch to the 200mm to the 8 inch.\n\n**Lorenzo Grandi** (President and CFO)\nThis will bring, clearly, some positive in the medium term in terms of profitability. Moving up in terms of revenues will improve significantly our expense to sales ratio that today has been impacted by the fact that revenues are quite depressed. At the end, these are the main drivers that we see together with the fact that we are improving and we are moving to the next generation of silicon carbide that gives also some benefit in terms of performance for what concerns the profitability. Before I pass to Marco, I just clarify the point of this extra 30 basis points on gross margin. Yes, this is mainly related to the duplication of mask related to the qualification of processes. This will continue.\n\n**Lorenzo Grandi** (President and CFO)\nThe amount will be more or less in this range for sure over the next part of 2026 and probably also in the second part, because we will continue with this program. This will probably be peaking in the first half of 2026, then it will go down. This is something that we need to expect to have as we have this activity, this activity to migrate our products from one fab that is going to be closed to another fab.\n\n**Marco Cassis** (President, Analog, Power and Discrete, MEMS and Sensors Group and Head of Strategy, System Research, Application, and Innovation Office)\nOkay, we take on the dynamics. We'll have basically two dynamics in 2025 that will help to start the growth. First of all, as Jean-Marc has said, during the first half of 2025 we will keep reducing and will be clean in terms of inventory in power in this grid. Here I'm speaking mainly about the non-silicon carbide portion. This will allow the market dynamics next year to restart having year-over-year growth, specifically on silicon carbide. As Jean-Marc has already anticipated, 2025 is a transition year. Meaning is that we are experiencing lower volumes and inventory correction from our main customers. I would like to underline this is happening while we still are maintaining stable our commercial contractual level of market share. This is happening since the beginning of 2025. During 2025 these dynamics are not yet offset by Europe and China.\n\n**Marco Cassis** (President, Analog, Power and Discrete, MEMS and Sensors Group and Head of Strategy, System Research, Application, and Innovation Office)\nThere is yet not strong contribution from the electrification programs in Europe and China. During next year we will start seeing growth in these two regions that will help the 2026 overall growth of the silicon carbide versus 2025. I hope that this answers your question.\n\n**Marco Cassis** (President, Analog, Power and Discrete, MEMS and Sensors Group and Head of Strategy, System Research, Application, and Innovation Office)\nYes.\n\n**Marco Cassis** (President, Analog, Power and Discrete, MEMS and Sensors Group and Head of Strategy, System Research, Application, and Innovation Office)\nThank you very much.\n\n**Jerome Ramel** (EVP Corporate Development and Integrated External Communication)\nThank you, Jonathan. Thank you, everyone. This is ending our call for this quarter, so thank you for being with us today. We remain here at your disposal should you need any follow-up questions. Sorry for the ones that didn't have time to ask a question there. Thank you very much.\n\n**Operator**\nLadies and gentlemen, the conference is now over. Thank you for choosing Chorus Call and thank you for participating in the conference. You may now disconnect your lines. Goodbye.",
      "fetched_at": "2026-02-04T15:45:06.906Z"
    },
    {
      "ticker": "STM",
      "title": "STMicroelectronics N.V. (STM) Q2 FY2025 earnings call transcript",
      "published_date": "Jul 24, 2025, 3:30 AM EDT",
      "fiscal_year": "2025",
      "quarter": "Q2",
      "url": "https://finance.yahoo.com/quote/STM/earnings/STM-Q2-2025-earnings_call-333610.html",
      "content": "**Operator**\nLadies and gentlemen, welcome to the ST Microelectronics Second Quarter twenty twenty five Earnings Release Conference Call and Live Webcast. I am Moira, the Chorus Call operator. The conference must not be recorded for publication or broadcast. At this time, it's my pleasure to hand over to Geraint Ramel, EVP Corporate Development and Integrated External Communications. Please go ahead.\n\n**Jerome Ramel.** (EVP - Corporate Development &amp; Integrated External Communication)\nThank you, Myra. Thank you everyone for joining our second quarter twenty twenty five financial results call. Hosting the call today is Jean Marc Chery, ST President and Chief Executive Officer. Joining Jean Marc on the call today are Lorenzo Grande, President and CFO and Marco Cassis, President, Analog Power and Discrete, MEMS and Sensor Group and Head of ST Microelectronics Strategy, System Research and Application and Innovation Office. These live webcasts and presentation materials can be accessed on Investor Relations website.\n\n**Jerome Ramel.** (EVP - Corporate Development &amp; Integrated External Communication)\nA replay will be available shortly after the conclusion of this call. This call will include forward looking statements that involve risk factors that could cause ST's results to differ materially from management's expectations and plans. We encourage you to review the Safe Harbor statement contained in the press release that was issued with the results this morning and also in ST most recent regulatory filings for a full description of these risk factors. Also to ensure all participants have an opportunity to ask questions during the Q and A session, please limit yourself to one question and a brief follow-up. Now I'd like to turn the call over to Jean Marc Chery, ST President and CEO.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nThank you, Jerome. Good morning, everyone, and thank you for joining ST for our Q2 twenty twenty five earnings conference call. I will start with an overview of the second quarter, including business dynamics. I will then hand over to Lorenzo for the detailed financial overview and will then comment on the outlook and conclude before answering your questions. So starting with Q2.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nWe delivered revenues at $2770000000.00.56000000 dollars above the midpoint of our business outlook range with Automotive slightly below our expectations, which was customer specific, more than offset by higher revenues in Personal Electronics and Industrial. Gross margin of 33.5% was in line with the midpoint of our business outlook range. Let's now discuss our business dynamics during Q2. In Automotive, during the quarter, we grew revenues about 14% sequentially, driven in particular by Asia Pacific excluding China and The Americas. Our book to bill came back below parity driven by some specific customer dynamics.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nWhile the current situation on trade and tariffs is creating uncertainty on the level of car production, we confirm that Q1 was a low point for automotive revenues. We expect sequential growth in the third quarter versus the second quarter. During the quarter, we continued to execute our strategy for car electrification. We had wins with both silicon carbide and silicon devices and modules for multiple new DC DC converter and onboard charger designs, as well as with our Smart Power and SmartFuse solutions for electric vehicle power systems. In a continuing challenging automotive market environment, we remain focused on building our pipeline of business and solid execution of our roadmaps in Power and Discrete for car electrification.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nIn car digitalization, we saw further traction with our portfolio of automotive microcontrollers. We are making good progress in executing our road map with many new products set to launch in 2025 and 2026 across our air based Stellar and STM32A product families. We are also continuing to see strong design win momentum globally with both large scale OEMs and Tier one suppliers. One significant win in Q2 was for a one box braking system by a leading electric vehicle maker in China. Moving to legacy applications, where we have a broad portfolio of application specific products based on our smart power technologies and leading position in multiple domains such as airbags, door zone and braking solutions.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nA notable win here was a high volume airbag solution with a world leader in automotive electronic safety systems, the third generation of a long term partnership. With our automotive grade sensors, we continue to see strong design in momentum and opportunities. Wins in the quarter included MEMS sensors for ADAS, airbag control and infotainment systems as well as an imaging sensor for in cabin monitoring. There are also a growing number of opportunities for sensors to improve the driving experience with applications such as road noise cancellation, occupancy monitoring and seat position sensors. In Industrial, Q2 revenues were above expectations with strong sequential growth and continued year over year improvement, confirming that Q1 was the bottom.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nI would also like to highlight that specifically for general purpose microcontrollers, we are back to year on year growth. In terms of months of inventory in distribution overall, we are now back to a normal situation in China, close to normalization in other Asian countries and improving, but still above normal in other geographies. In Q2, our book to bill ratio remained above 1% and bookings continued to increase sequentially, supporting our expectation of further sequential growth in the third quarter compared to the second quarter. During the quarter, we made strong progress with our designing activity for our power and analog portfolio across a range of applications. These included power systems, industrial fans and drives, motor control, white goods, solar inverters, air conditioning, metering and power for data servers.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nFor data servers, we announced that we are working closely with NVIDIA on a new high power density DCDC architecture for AI data centers that will operate at 800 volt DC. This will enable higher power density, more compact designs and a lot less cabling and metal ports. To deliver the needed solution, ST is putting together a combination of its most advanced technologies enabled by silicon materials, silicon carbide and gallium nitride as well as smart power processes like BCD using galvanic isolation. Our portfolio of industrial sensors also gained momentum in applications like container tracking, white goods and livestock monitoring. Moving to embedded processing.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nOur SCM32 microcontrollers have continued to gain traction with the broad developer community. Use of our software ecosystem continues to grow strongly and we are now close to 1,500,000 unique users on a twelve month following basis versus the 1,300,000 unique users for 2024. As mentioned earlier, in Q2, we were back to year over year growth for our general purpose microcontrollers with both sequential and year over year growth in the high teens. This confirms the strength of our product portfolio and our global ecosystem. In Personal Electronics and to a lesser extent in Communication Equipment and Computer Peripherals, Q2 revenues were above our expectations.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nWe continue to be excited by growth opportunities in our engaged customer programs, driven by both increased content in Personal Electronics and the expanding low earth orbiting satellite market. In terms of corporate development activities, at the May, we held our Annual General Meeting of Shareholders. All proposed resolution were approved by the shareholders. For sustainability, we have received two notable recognition for our public commitments, reporting and environmental and social performance. ST has been recognized in the Time World's Most Sustainable Companies list for the second consecutive year.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nWe have been ranked twenty fifth most sustainable company globally and first in the electronics, hardware and equipment category. We have also been recognized for leadership on climate and water security by the global environmental non profit CDP with a place on its A list for tracking climate change and a rating of A- for water security. Now over to Lorenzo, who will present our key financial figures.\n\n**Lorenzo Grandi** (President &amp; CFO)\nThank you, Jean Marc, and good morning everyone. Let's start with a detailed review of the second quarter, starting with the revenues on a year over year basis. By reportable segment, analog product MEMS and sensor was down 15.2%, mainly due to a decrease in analog to lesser extent a decrease in imaging, while MEMS grew double digit. Power and Discrete product decreased 22.2%. Embedded processing revenues declined 6.5%, mainly due to custom processing.\n\n**Lorenzo Grandi** (President &amp; CFO)\nRF and optical communication declined 17.9%. By end market, automotive declined by about 24%, industrial by about 8%, while personal electronic communication equipment and computer peripheral each declined by about 5%. Year over year sales to OEMs decreased 15.312% to distribution. On a sequential basis, all segment contributed to the growth. Embedded processing, power and discrete and RF and optical communication reported double digit growth respectively 14.1%, 12.910.1%.\n\n**Lorenzo Grandi** (President &amp; CFO)\nAnalog products, MEMS and sensor also grew by 5.9. All our end markets grew, led by industrial, up by about 15%, followed by automotive, up by about 14%, with communication equipment, computer peripheral and personal electronic hub, respectively, about 63%. Turning now to profitability. Gross profit in the second quarter was $26,000,000 decreasing 28.5% on a year over year basis. Gross margin was 33.5%, decreasing six sixty basis points year over year, mainly due to unfavorable product mix, lower manufacturing efficiency and to a lesser extent, unused capacity charges.\n\n**Lorenzo Grandi** (President &amp; CFO)\nTotal net operating expenses, excluding restructuring, amounted to $869,000,000 in the second quarter, in line with our expectations and declining 6% on a year over year basis. For the third quarter of twenty twenty five, we expect net OpEx to stand at about $860,000,000 slightly decreasing quarter on quarter despite the negative effect, reflecting our ongoing cost discipline and the first benefits of the resizing of our global cost base. As a reminder, these amounts are net of other income and expenses and exclude restructuring. In the second quarter, we reported 133,000,000 operating loss, which included $190,000,000 for impairment, restructuring charges and other related phase out costs, reflecting impairment of asset and restructuring charges predominantly associated with the previously announced company wide program to reshape our manufacturing footprint and resize our global cost base. Excluding these non recurring items, which is mostly non cash, Q2 non U.\n\n**Lorenzo Grandi** (President &amp; CFO)\nS. GAAP operating margin was 2.1% positive, with analog MEMS and sensor at 7.5%, power and discrete minus 12.5%, embedded processing 13.5% and RF optical communication at 17.9%. Q2 twenty twenty five net income was a negative $97,000,000 compared to a positive $353,000,000 in the year ago quarter. Diluted earnings per share were negative at $0.11 compared to a positive of $0.38 Excluding the previously mentioned non recurring items, non U. S.\n\n**Lorenzo Grandi** (President &amp; CFO)\nGAAP net income and diluted earnings per share were respectively a positive $57,000,000 and a positive $0.06 Net cash from operating activities decreased 49.6 in Q2 to $354,000,000 on a year over year basis. Second quarter net CapEx was $465,000,000 compared to the $528,000,000 in Q2 twenty twenty four. Free cash flow was a negative $152,000,000 in the second quarter compared to a positive $159,000,000 in the year ago quarter. Inventory at the end of this quarter was $3,270,000,000 compared to $2,810,000,000 in Q2 twenty twenty four. Day sales of inventory at quarter end was one hundred and sixty six days and slightly above our expectation, mainly due to currency impact compared to the one hundred and sixty seven days for the previous quarter quarter and to one hundred and thirty days in the year ago quarter.\n\n**Lorenzo Grandi** (President &amp; CFO)\nWe expect days of inventory to significantly decrease in the third quarter compared with the second quarter. Cash dividends paid to stockholders in Q2 twenty twenty five totaled $81,000,000 In addition, ST executed share buybacks of $92,000,000 ST maintained its financial strength with a net financial position that remained solid at 2,670,000,000.00 as of 06/28/2025, reflecting total liquidity of $5,630,000,000 and a total financial debt of $2,960,000,000 Now back to Jean Marc, who will comment on our outlook. Thank you, Lorenzo. Let's move to our business outlook for Q3 twenty twenty five. So we are expecting Q3 twenty twenty five revenues at $3,170,000,000 plusminus three fifty basis points.\n\n**Lorenzo Grandi** (President &amp; CFO)\nAt the midpoint, our Q3 net revenues will increase 14.6% sequentially and decrease by 2.5% year over year with all end markets, but automotive back to year on year growth.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nWe expect our gross margin to be about 33.5% plusminus 200 basis points, including about three forty basis points of unused capacity charges. Compared to the second quarter, gross margin is also impacted by about 140 basis points of negative sequential impact resulting mainly from currency effect and from the start of the nonrecurring costs related to our manufacturing reshaping program. This business outlook does not include any impact for potential further changes to global trade tariffs compared to the current situation. For the full year 2025, we plan to maintain our net CapEx plan between $2,000,000,000 and $2,300,000,000 mainly to execute the reshaping of our manufacturing footprint. To conclude, we expect Q3 revenues to show solid sequential growth driven by a cyclical recovery and our engaged customer programs.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nThis will enable a continued year over year improvement. Our priorities remain supporting our customers to designing our products, accelerating new product introduction and executing our company wide program to reshape our manufacturing footprint and resize our global cost base. Finally, I confirm we are executing our plan to deliver annual cost savings in the high triple million dollar range exiting 2027. Thank you and we are now ready to answer your questions.\n\n**Operator**\nWe will now begin the question and answer session. The first question comes from the line of Jean Marc D'Armenon from Jefferies. Please go ahead.\n\n**Janardan Menon** (Managing Director)\nHi. Thanks for taking the question. Yes, my question is mainly on gross margin. I was could you just pull out the one off effect from your manufacturing reshaping program in your Q3 gross margin guidance? And then I was wondering whether you could comment on how you expect gross margin to evolve into subsequent quarters.\n\n**Janardan Menon** (Managing Director)\nI mean, sales are growing and utilization levels are growing. So how would you expect what would be the various puts and takes that you would expect gross margin evolution beyond Q3? Thank you.\n\n**Lorenzo Grandi** (President &amp; CFO)\nI'll take the question, Giovanni. Thank you for the question, Jonathan. But in terms of the gross margin of Q3, first of all, I want to clarify the gross margin, but pricing are not collapsing. Let's say, pricing are in line with what was our expectation. So at the midpoint of our sequential basis gross margin is negative impacted, as we said, by this 140 basis point that is resulting mainly from currency effect and to a lesser extent from the start of nonrecurring costs related to our manufacturing pre shipping program.\n\n**Lorenzo Grandi** (President &amp; CFO)\nYou asked me more or less to size, I would say that in this 140 basis point around 20% of this 140 basis is related to the reshaping of the manufacturing, let's say, program. Please, this negative impact is offset by the lower weight of unused capacity charges. In Q2, was three seventy basis point impact. In Q3, it's more in the range of three forty basis points. And some improving manufacturing efficiency, even if we have to remind you that in Q3 these efficiencies still suboptimal.\n\n**Lorenzo Grandi** (President &amp; CFO)\nWe have some basis points that is related to the fact that we have not yet let's say at the best our efficiency. The combination of price and mix, I would say that is pretty neutral to the gross margin on a sequential basis, let's say. So these are the main drivers, would say that are impacting our gross margin in the third quarter. But irrespective to what is the expectation moving forward, directionally based on the current level of euro dollar that we say spot in the range of 1.17 that in Q4 should bring us in an effective rate that is in the range of 1.15 for euro dollar, we should see a nice improvement in respect to Q3, driven by less unused capacity charges, enhanced manufacturing efficiency, partially of course offset by weaker U. S.\n\n**Lorenzo Grandi** (President &amp; CFO)\nDollar. Clearly, in Q4, gross margin will depend ultimately on the level of revenues and where it will be positioned, let's say, the euro dollars. At this stage, it's a little bit more difficult to be more specific than that.\n\n**Janardan Menon** (Managing Director)\nUnderstood. So you do have any visibility on Q4? Would you at this stage expect that your revenue further improve in Q4? Or is it too early to call that?\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nWe expect our revenue in Q4 to grow sequentially.\n\n**Janardan Menon** (Managing Director)\nUnderstood. Thank you.\n\n**Jerome Ramel.** (EVP - Corporate Development &amp; Integrated External Communication)\nThank you, Jonathan. Next question please.\n\n**Operator**\nThe next question comes from Joshua Buchalter from TD Cowen. Please go ahead.\n\n**Joshua Buchalter** (Director - Equity Research)\nHey guys, thank you for taking my question. There's obviously a lot of uncertainty out there given the geopolitical environment. I was wondering if you could maybe speak to any potential changes in your customers' order patterns or the prospect of any potential customers who are who could have been pulling in parts. Have you seen any changes downstream? Thank you.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nWhen we see our dynamic from the beginning of the year, basically, the good news that in Q3, all our, let's say, verticals will grow sequentially and year on year, except the automotive specific to one customer. And I would have been delighted that Q3 would have been the turning point, but we are about minus 2% year over year, which is US80 million dollars Well, be aware that 90% of this US80 million dollars gap versus the turning point is in fact intangible. It is a capacity fee reservation from carmaker that has decreased by $70,000,000 So from product perspective, customer demand, we are basically at the turning point, which is very positive. Now about our customer engaged programs in our market. In personal electronics, in computer equipment, communication equipment, computer peripheral, basically, okay, we have no surprise, no change.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nWell, in Industrial, you know that is more fragmented. It is distribution. Well, clearly now we are in the up cycle. Well, will the speed of the turning point, okay, will depend on the macro economy. Automotive.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nAutomotive, okay, what is the situation we have to manage and acknowledge? Well, we know that basically in front of us, we have a market of 90,000,000 vehicles, out of which 30,000,000 vehicles are battery electrical vehicle and hybrid electrical vehicle. The challenge we have managed altogether is that the competition landscape, the mix inside the automotive market is much, much less stable than two, three years ago. Why? Because there is a strong dynamic between Chinese competition, European changing mind about electrical car, America as well and so on.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nSo we are not protected time to time quarter to quarter to have once customer specific change. And this is what happened clearly in Q2 and is confirmed in Q3. Well, so this is only this automotive market. We have to pay attention. But what will make us confident moving forward is the strength of our product portfolio, clearly our large customer base.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nAnd I repeat, in automotive, in Q3, we grow sequentially, not yet year over year, but in Q4, we will grow again sequentially.\n\n**Joshua Buchalter** (Director - Equity Research)\nOkay. But you did not observe any pull ins in the June?\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nNo.\n\n**Joshua Buchalter** (Director - Equity Research)\nOkay. Thank you.\n\n**Joshua Buchalter** (Director - Equity Research)\nAnd then for my follow-up, I got a few inbounds from investors regarding the Mobileye foundry relationship with TSMC when that came out earlier in the month. Could you maybe speak to which parts you're still providing? And then maybe I realize the IQ five and six are on seven nanometer. How we should expect that customer to trend over the next few years and maybe speak to the engagement there?\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nNo, it is well known. We use the technology of TSMC starting IQ five generation. But IQ five, IQ six and IQ seven, ST, okay, did the design and all, let's say, the enablement and the support, okay, the engineering support. So from this announcement, okay, we don't expect any surprise from our revenue for the next three, five years at least.\n\n**Joshua Buchalter** (Director - Equity Research)\nGot it. Thank you. Appreciate the color.\n\n**Jerome Ramel.** (EVP - Corporate Development &amp; Integrated External Communication)\nThanks, Josh. Next question please.\n\n**Operator**\nThe next question comes from the line of Francois Bouvigny from UBS. Please go ahead.\n\n**François-Xavier Bouvignies** (Head - Europe Tech Hardware &amp; Semiconductor)\nThank you very much. So my question would be, Jean Marc, early June, I believe you said that you would reach at least the midpoint of the guidance in Q2. And I guess when you said that you had in mind to do better than just roughly in line like you did today. And then you said you would maybe without tariff grow year over year and now you're getting from minus 2.5% year over year. So what happened since early June?\n\n**François-Xavier Bouvignies** (Head - Europe Tech Hardware &amp; Semiconductor)\nI mean, seems that things deteriorated. And if I understand correctly, is it only a customer program? And just trying to understand what happens in June for because it seems a bit short of what maybe you would have hoped. I just want to understand the moving parts. Thank you.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nWell, thank you for your question. Well, I anticipated it a little bit in my former answer. Look at facts. What is the dynamic on your year over year growth for ST? So Q1 was minus 27%, Q2 minus 40% and we land close to minus 20%, so minus 2% basically in Q3 at the midpoint of our guidance.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nSo it's US80 million dollars gap. Well, I repeat, this US80 million dollars for your consideration because what is important is customer demand, volume, so the flow of product. Well, 90% of this gap is related to intangible. Well, yes, intangible is revenue, but it is not okay flow of product. It does not measuring the capability of ST to address its addressable market.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nSo this is a positive point. But I would have expect, okay, to compensate this 90% of intangible by a stronger dynamic, okay, on automotive. Well, unfortunately, okay, we have one customer specific change in the forecast of Q3 that prevent us to move to this position. But on automotive, again, the sequential growth in Q3 will be pretty solid because we expect, okay, let's say, high single digit growth in automotive in Q3 and we will grow again in Q4. So yes, there is one customer specific, but nothing related to the overall market dynamic.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nI repeat what I said a few minutes ago. Now we have to acknowledge that for a while, we will have in front of us an automotive market moving forward growing. Again, 90,000,000 vehicles, at least one third is related to a mix of battery based electrical and hybrid electrical, but with competition landscape changing at a very dynamic way. We have to manage and we are not protected time to time to have one customer specific. And yes, okay, not at the level of our expectation.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nWell, this we can manage, but this is a situation we have to face that is completely different than a few years ago. So I of course regret okay to not be on the turning point of Q3. But again I repeat 90% of the gap is intangible. The rest is really customer specific. The good news is Industrial, Personal Electronics, Computer, Peripheral and Communication Equipment grew significantly year over year.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nAutomotive grew significantly on a sequential basis and we grow again in Q4.\n\n**François-Xavier Bouvignies** (Head - Europe Tech Hardware &amp; Semiconductor)\nThat's very helpful. Thank you, Jean Marc. And just to clarify, this customer change, is it a market share shift? I mean, it structural? Or is it just an order inventory or forecast adjustments? It temporary or longer term?\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nIt is absolutely not a market share loss. It is specific to the customer. I cannot comment, but I am pretty sure that long term this customer will recover.\n\n**François-Xavier Bouvignies** (Head - Europe Tech Hardware &amp; Semiconductor)\nGot it. Thank you very much.\n\n**Jerome Ramel.** (EVP - Corporate Development &amp; Integrated External Communication)\nThanks, Olivier. Next question please.\n\n**Operator**\nThe next question comes from the line of Sandeep Deshpande from JPMorgan. Please go ahead.\n\n**Sandeep Deshpande** (Service Desk Team Lead)\nYes, hi. Thanks for letting me on. My question is regarding Q4. You mentioned Jean Marc that you will grow sequentially in Q4. But will you based on what you see today, will you be able to grow year on year in Q4 across the board at the company, excluding some of these issues you've had in Q3 based on what you see today?\n\n**Sandeep Deshpande** (Service Desk Team Lead)\nAnd I mean following up on your earlier response, do you see an impact in this guidance from the new U. S. Rules on EVs, etcetera, which could have an impact on silicon carbide or any of your other businesses? Thank you.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nThank you, Sandeep, for the question. What I can the fact we have in our hand is that the backlog that is positioned on Q4 today, if we compare exactly at the same date the quarter of Q3, it is showing So a significant sequential if the booking of Q3 because I repeat, okay, we are also facing market situation that are turning up from a cyclical point of view, but also the visibility is pretty short. But it is clear that if we have a booking dynamic in Q3 on a similar path of what we have seen in Q2 and in Q1. Now we should expect in Q4 to grow sequentially and then okay to be at the turning point or very close to the turning point. But again this is the mechanics okay, we are following.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nSo yes, we expect to grow sequentially in Q4 taking into account the portfolio. And under the assumption, we will see a booking dynamic similar of what we have seen in Q1 and Q2. Finally, okay, we should be in position to grow year over year in Q4. But again, we will not be protected against something specific customer that decide, okay, to decrease inventory because he want to prefer, okay, to protect 2023. So we are not protected this singularity, okay, with some customer.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nOverall, it means what? It means the trend is positive, the dynamic is positive, STs come back on a growth trajectory. But the overall environment and specifically the market of automotive is not strong enough to generate okay a buffer of backlog in order to absorb all the variation. So altogether of course, we have to communicate very carefully and accurately to monitor this dynamic. So this is the point. The other point of the question was\n\n**Jerome Ramel.** (EVP - Corporate Development &amp; Integrated External Communication)\nwhat was the second part?\n\n**Sandeep Deshpande** (Service Desk Team Lead)\nThe other part of the question was on whether any of the dynamics you're seeing in Q3 and then beyond are to do with the new U. S. Tax bill, which has implications on EVs?\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nNo. It's nothing significant specific to this point. Again, what we are acknowledging and reviewing our mid plan on silicon carbide and electrical vehicle is a dynamic. But I guess everybody has acknowledged and understand that compared to three years ago in 2025, the volume of electrical car is basically 5,000,000 car less that was forecasted five years ago. So what is important is to look the trend.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nThen the second trend is a mix between battery based and hybrid vehicle. So we have to understand, okay, with all the set of regulation constraints that worldwide are implemented and then the competition of the Chinese carmaker, all this trajectory of growth will move. And this is what's matter for us in order to design our manufacturing capacity. What I can say in silicon carbide, the main important for us now is to close the six inches as fast as we can, start the eight inches, adjust the capacity to the market demand. And we confirm that we strongly believe that we can keep 30% market share on this market.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nDifferent past two, three years ago for sure. But okay, we adapting ourselves and silicon carbide midterm, okay, will be a growth driver of the company.\n\n**Sandeep Deshpande** (Service Desk Team Lead)\nThank you.\n\n**Jerome Ramel.** (EVP - Corporate Development &amp; Integrated External Communication)\nDo you have any follow ups, Sandeep?\n\n**Sandeep Deshpande** (Service Desk Team Lead)\nYes. No, I'm fine. Thank you.\n\n**Jerome Ramel.** (EVP - Corporate Development &amp; Integrated External Communication)\nThank you. Next question please.\n\n**Operator**\nThe next question comes from the line of Stefan Uri from ODDO BHF. Please go ahead.\n\n**Stéphane Houri** (Head of Equity Research)\nYes. Good morning, everyone. I have two questions. First one is about the comments you made earlier about the gross margin. I think you used the term nice gross margin improvement to be expected in Q4.\n\n**Stéphane Houri** (Head of Equity Research)\nAnd I just wanted maybe to come back on the reasons for that and also the impact of the ForEx if the dollar stays And I have a follow-up. Thank you.\n\n**Lorenzo Grandi** (President &amp; CFO)\nI take this question. Thank you for this question. Clearly, let's say, what are the drivers that we do expect in Q4 to substantially, let's say, help a sequential increase in our gross margin. On one side, clearly, we were expected that our unused capacity charges will decline in respect to what we have in Q3. This is expected Q3.\n\n**Lorenzo Grandi** (President &amp; CFO)\nHave to say that if you compute the new capacity charge in $1,000,000 let's say you see that in Q3 are at the end similar to the one that we had in Q2. This is due to the fact that in Q3, we will, let's say, put a stronger control on our inventory. We do expect to achieve something in the range in terms of days for our inventory, one hundred and forty days. So means that at the end, unloading charges still are significant in during this quarter, will decrease in next quarter in Q4. The other element that you have to take in mind is that Q3 is still impacted by a negative efficiency.\n\n**Lorenzo Grandi** (President &amp; CFO)\nYes, from our manufacturing. Yes, it's improving when we look, let's say, the sequential dynamic moving from Q2 to Q3, but still is not at the optimal level. We will continue to improve in Q4. So this means that this is another driver that will help, let's say, the improvement of our gross margin in the next quarter. But this is assuming that, let's say, the exchange rate will stay substantially similar to the one that we have today.\n\n**Lorenzo Grandi** (President &amp; CFO)\nClearly, there will be some negative impact because the impact of our hedging policy will be a little bit lower than what we have, let's say, in the current quarter. But at the end, let's say, most of the negative impact of the exchange rate has been already reflected in the Q3 gross margin. So this will not be unless there is still another big movement in the euro dollar, it should not be, let's say, another element, assuming I repeat that we stay more or less at the level of the spot that we have today. So these are the dynamic that we see moving from Q3 to Q4 for our gross margin. So some improvement related to these impacts.\n\n**Stéphane Houri** (Head of Equity Research)\nOkay. Thank you very much. And the follow-up is about the industrial market because we talked a lot this morning about the weakness of automotive revenues compared to the expectations. But I just wanted to understand what is the driver for the recovery in Industrials. Is it inventory replenishment, pull in, sorry, or real demand behind that?\n\n**Stéphane Houri** (Head of Equity Research)\nAnd yes, if you can give some color, that would be helpful. Thank you.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nWell, first of all, know that a significant part of the industrial market for us is done through the distribution. So what is positive is POS. So the sales of our distributor increased in Q2 both sequentially and year on year. And our POP were below the POS. So we are seeing a dynamic where the revenue recognition we have the POP is below the POS.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nThe POS is growing both sequentially and year over year. So inventory at distribution are going to a normalization, I have to say, in Asia Pacific, excluding China, back totally to normal in China and still a bit higher than normal, okay, in EMEA and America. But the dynamic is again industrial distribution, POS growing both sequentially and year over year. POP, as I described, below the POS. So it is not inventory replenishment.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nIt is real demand. Then after from other OEM pretty fragmented, clearly the growth is driven by a more smart industrial for us and in a lesser extent for power and energy. Now we don't see, I repeat, also this is the opportunity I say that any effect of pulling on industrial, especially from China for ST. So there is zero pulling in China from Chinese customer or distributor for ST. So we are immune against that.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nAnd as far as products are related, one of the main driver, which is very encouraging news is the general purpose. The general purpose microcontroller again went back to both sequential growth and year over year high teens, So showing the strength of our portfolio and ecosystem. But today it is not the same case on general purpose analog. Why? Because on general purpose analog, we have still some other inventory that we are controlling with our PoP and Power Discrete a little bit similar.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nSo this is basically the key driver of the industrial market. Distribution because of POS and demand, Then the Smart and Industrial, lesser extent, power energy. From product, it is a general purpose microcontroller. And in a less extent, for sure, purpose analog and power and discrete because still some of our inventory that we are controlling. So we control our POP.\n\n**Stéphane Houri** (Head of Equity Research)\nOkay. Thank you very much.\n\n**Jerome Ramel.** (EVP - Corporate Development &amp; Integrated External Communication)\nThank you, Stephane. Next question, please.\n\n**Operator**\nThe next question comes from the line of Gian Marco Bonacina from Banca Acros. Please go ahead.\n\n**Gianmarco Bonacina** (Head of Equity Research)\nYes, good morning. A couple of questions. The first one is on gross margin again. I think early June, as Gian Marco said that when the company will reach again 3,600,000,000.0 to €3,800,000,000 that could be about 600 basis point improvement, I guess, over the level of Q2 or Q1, I'm not sure. So given the euro dollar now is approaching 120, can we expect this level of improvement maybe going into next year or the year after could be a little bit lower, so maybe 400 to 500 basis points?\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nThank you for your questions. So I'll pass to Lorenzo to answer.\n\n**Lorenzo Grandi** (President &amp; CFO)\nClearly, we were modeling our gross margin, if you remember, and we will say that the level of our, let's say, model intermediate model $18,000,000,000 we were modeling with an exchange rate in the range of 1.09, let's say. Clearly, when we are at this level, there is an impact that you see when we move from this 1.09 that substantially was the one of last quarter. Now we are moving to 115. We have an impact that we size between 120, we said 140 basis points, including also some small adjustment. Clearly, let's say, moving an exchange rate, the spot rate, this will worsen.\n\n**Lorenzo Grandi** (President &amp; CFO)\nLet's say, you have to consider that, yes, there is the negative impact of the FX, but still we have, let's say, some leverage, let's say, in term of gross margin. Because today, we are still impacted by significant amount of annual charge and when we will be at that level of revenues, these will substantially disappear. So we are talking about three forty basis points in Q3. Then you have also to consider that there is a negative impact related to the manufacturing efficiency that is not yet at the optimal, let's say, 11. Then there is another impact that we needed to consider that is somehow, let's say, impacting negatively our gross margin that we are not still in an optimized mix.\n\n**Lorenzo Grandi** (President &amp; CFO)\nIt means that, let's say, for instance, our, let's say, level of overall industrial that is at the end, let's say, the one that is more accretive to our gross margin, still stay at the level that is not the one that we should be in our, let's say, portfolio of revenues. It is now more closer to 20%, 21% than the 25, 26% that we do expect, let's say, in a more normal situation for our company. So all these elements, we do expect that we will improve our gross margin. Clearly, let's say, it remains that the model was, let's say, done an FX that was 109. So we need also to see where the Thank position in exchange\n\n**Gianmarco Bonacina** (Head of Equity Research)\nyou. Just a quick follow-up more strategically on China because we read the June an article in DigiTimes saying that Chinese automakers are moving to align with government directives by planning to use, let's say, domestically developed and manufactured automotive chips. And the article mentioned that in case there was a choice between a fully China chip and one designed by a foreign firm at fabricated in China, many automakers will opt for the former. So can you remind us roughly how much is your exposure in terms of sales to Chinese OEM and Tier one? And we know that you have a strategy China for China.\n\n**Gianmarco Bonacina** (Head of Equity Research)\nSo do you see this as, let's say, enough to, let's say, offset this potential headwind that this article was mentioning? Thank you.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nSo waiting to deliver the exact numbers. Yes, I confirm that we built our strategy for China for China that I repeat is encompassing not only manufacturing localized, but also design, application labs, customer support, competence center in order, okay, to be seen as a Chinese player, I have to say. Well, this strategy is, let's say, very active on power, so silicon carbide and microcontroller. And we do believe that will be a strategy enabling ST to compete against local player, okay, and to be perceived by official authorities as local player. But we are not proven that some specific company owned by the state in fact, okay, will apply strictly this kind of rules.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nBut overall, okay, our Chinese customer as all are pragmatic. If we offer them a supply chain, local application support, design, quality labs, reliability labs, okay, they will manage us as local player. So we do believe our strategy, okay, will mitigate a lot, okay. This effect, yes, again, if there is some specific company honored by the state, okay, we it will be difficult to prevent this kind of dynamic. And then about the exposure,\n\n**Lorenzo Grandi** (President &amp; CFO)\nour revenues to Chinese customer quarter in China is in the range of depends on the quarter, of course, but it depends, let's say, but it's in the range between 13%, 14% of our total revenues. What we sell to the headquarter Chinese customer.\n\n**Gianmarco Bonacina** (Head of Equity Research)\nOkay. Just in for automotive, right?\n\n**Lorenzo Grandi** (President &amp; CFO)\nNo, this is the total. But for automotive, it's very similar. I would say that at the end, let's say, when you take automotive Okay.\n\n**Gianmarco Bonacina** (Head of Equity Research)\n13% over 40x percent. Okay.\n\n**Jerome Ramel.** (EVP - Corporate Development &amp; Integrated External Communication)\nThank you. Next question please.\n\n**Operator**\nThe next question comes from the line of Lee Simpson from Morgan Stanley. Please go ahead.\n\n**Lee Simpson** (Analyst)\nThanks for fitting me in.\n\n**Jerome Ramel.** (EVP - Corporate Development &amp; Integrated External Communication)\nHi Lee.\n\n**Lee Simpson** (Analyst)\nCan you hear me?\n\n**Operator**\nWe can hear Okay. You\n\n**Lee Simpson** (Analyst)\nGood morning, everyone. So I just wanted to ask about general purpose microcontrollers and the pricing there. I did look from our channel checks as though things were very strong in April, stable in May, but somewhat erratic going through June. So I just wanted to get a sense for how you thought the pattern was for pricing on general purpose microcontrollers into the second half and if indeed this might vary by region? And then the second question I had was really on the timing of readiness for the 800 volt DCDC supply for the PSU.\n\n**Lee Simpson** (Analyst)\nWe are hearing that it's quite difficult to meet that spec as delivered by NVIDIA and whether or not you had confidence that you could hit the full 800 volt supply? Thanks.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nThank you for your questions. So Lorenzo will comment on the price, and I will let Marco to comment on the NVIDIA opportunity.\n\n**Lorenzo Grandi** (President &amp; CFO)\nSebastian, on the pricing pricing in general purpose microcontroller, what I can tell you is that above, we see really, let's say, low single digit pricing part. We have not detected any strange behavior, I have to say. But clearly, let's say, maybe region by region, the dynamic is a little bit different. But at the end, I can confirm that, let's say, on the general purpose, this is the what we see today. Use nothing particularly, let's say, strange in term of behavior.\n\n**Lorenzo Grandi** (President &amp; CFO)\nAnd yes, you may have some socket in which maybe there is a competition a little bit more aggressive and so on. But at the end, I would say we are with a price in the range of low single digit that is what we have seen since the beginning of the year. Nothing particularly different. So Marco, on\n\n**Marco Cassis** (President of Analog, MEMS &amp; Sensors Group)\nthe Yes. On the internal world, yes, you're right. Sure, it is challenging from the in terms of specification, as you know, at least our proof of concept, which is in the hands of NVIDIA and which we are working very closely with them. It's a combination of different components. So you have the GaN, have the SiC, you have the galvanic isolation drivers to drive to the board overall.\n\n**Marco Cassis** (President of Analog, MEMS &amp; Sensors Group)\nI'm confident it's some of the components are more mature than others. So the wide band gap material are fine. We're still working to develop drivers, Galvanica is ready to make sure that the overall performance will be there. It's a work in progress. So far, so good.\n\n**Marco Cassis** (President of Analog, MEMS &amp; Sensors Group)\nWe have things to fix, but I think that I do not see real roadblocks at this stage that we cannot handle. Of course, it's a work in progress.\n\n**Lee Simpson** (Analyst)\nJust on that point as a work in progress, it does seem to suggest this is maybe second half twenty twenty six, early twenty twenty seven as a sales impact rather than anything sooner?\n\n**Marco Cassis** (President of Analog, MEMS &amp; Sensors Group)\nThis is too early to say. It's a big change in terms of architecture. And we will do everything we can to be as soon as possible ready to support. We are confident that we can be part of the early adopters, but too early to say.\n\n**Lee Simpson** (Analyst)\nVery clear. Thank you.\n\n**Jerome Ramel.** (EVP - Corporate Development &amp; Integrated External Communication)\nThank you, Lee. We have time for very quick question for the last one.\n\n**Operator**\nThe last question for today is from Sebastian Stavovic from Kepler Cheuvreux. Please go ahead.\n\n**Sébastien Sztabowicz** (Head - IT Hardware &amp; Semis Sector Research)\nHello, everyone, and thanks for taking my question. Going back to the inventories in the distribution channel, could you please quantify the level of inventories in the channel today? You were mentioning last quarter bit less than two months of excess of inventory. I would I would say curious to know where we are today. The second one is linked to a pricing environment in China and specifically on silicon carbide.\n\n**Sébastien Sztabowicz** (Head - IT Hardware &amp; Semis Sector Research)\nWe are seeing some price war hedging between the EVOEM there. Who do you see prices for silicon carbide building there? And do you have any kind of visibility on your design that are expected to ramp in China on silicon carbide from 2026? Or it's too early to know what will be the pace of ramp of those designs? Thank\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nThank you. Lorenzo will take the question on the channel inventory, and Marco will comment on the silicon carbide in China.\n\n**Lorenzo Grandi** (President &amp; CFO)\nYes. In respect to the inventory, I would say that during Q3, our inventory and distribution has progressed in the right direction. It's true that when we were meeting, let's say, in Q2 after our earnings release of the Q1 quarter, let's say, our inventory in average was within excess in the range of two months. Now I have to say that has declined at least by one month in average. So we are in average, let's say, still with some excess of inventory.\n\n**Lorenzo Grandi** (President &amp; CFO)\nIt's not across the board in the sense that now we see some families like, for instance, general purpose that are normalized in term of inventory, especially in some regions that we are really at the normal level, even slightly before. Maybe there is some difference region by region. Other family are suffering still a little bit more in terms of normalization of the inventories, like in some product line in analog. But I would say that now the situation in distribution is getting in the right direction. We see now, let's say, the inventory moving down, let's say, and being, let's say, more in line with our target expectation.\n\n**Lorenzo Grandi** (President &amp; CFO)\nStill some excess, but moving in the right direction in term of reduction.\n\n**Marco Cassis** (President of Analog, MEMS &amp; Sensors Group)\nOn silicon carbide for China, yes, you're right. The price pressure in China on silicon carbide is a strong price pressure, but we are counteracting this, first of all, with accelerating the introduction of the new generations that are bringing advantages both in terms of performances and in terms of the size of the components. So generation four is introduced, are working for the generation five. Let's not forget that we have also a manufacturing footprint that is going to make us competitive also for that market, which means we are moving, as Jean Marc was saying, from six to eight inches and specifically in China, we are going to have our manufacturing in Sanand that will start end of this year and beginning of next one. We are addressing also we are expanding, addressing not only the automotive, but much more now also the industrial market.\n\n**Marco Cassis** (President of Analog, MEMS &amp; Sensors Group)\nSo all these components together should materialize in a growth in on the Chinese market. Clearly, the dynamics are strong, but I think we are pretty well equipped to counteract the dynamics that you will see in that market. China for us will be an important engine of growth in the years to come. I hope this answers your question.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nWe anticipate 2026, okay, to be again after the point of '25, okay, a year of growth for silicon carbide.\n\n**Sébastien Sztabowicz** (Head - IT Hardware &amp; Semis Sector Research)\nOkay. Thank you.\n\n**Jerome Ramel.** (EVP - Corporate Development &amp; Integrated External Communication)\nThank you. Thank you, Sebastian. Thanks everyone. This concludes our conference call for today. If you have any further questions, please reach out the Investor Relations team. Thank you very much.\n\n**Jean-Marc Chery** (President, CEO &amp; Chair of Managing Board &amp; Executive Committee)\nThank you. Bye bye.\n\n**Operator**\nLadies and gentlemen, the conference is now over. Thank you for choosing Chorus Call and thank you for participating in the conference. You may now disconnect your lines. Goodbye.",
      "fetched_at": "2026-02-04T15:45:11.220Z"
    },
    {
      "ticker": "STM",
      "title": "STMicroelectronics N.V. (STM) Q1 FY2025 earnings call transcript",
      "published_date": "Apr 24, 2025, 3:30 AM EDT",
      "fiscal_year": "2025",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/STM/earnings/STM-Q1-2025-earnings_call-310746.html",
      "content": "**Operator**\nLadies and gentlemen, welcome to the STMicroelectronics First Quarter 2025 Earnings Release Conference Call and Live Webcast. I am Moira, the call operator. I would like to remind you that all participants will be in listen-only mode and the conference is being recorded. The presentation will be followed by a Q&A session. You can register for questions at any time by pressing star and one on your telephone. For operator assistance, please press star and zero. The conference must not be recorded for publication or broadcast. At this time, it's my pleasure to hand over to Jérôme Ramel, Executive VP, Corporate Development, Integrated Marketing and Communications. Please go ahead.\n\n**Jérôme Ramel** (EVP of Corporate Development Integrated Marketing and Communications)\nThank you, everyone, for joining our First Quarter 2025 Financial Result Call. Hosting the call today is Jean-Marc Chéry, ST President and Chief Executive Officer. Joining Jean-Marc on the call today are Lorenzo Grandi, President and CFO, and Marco Cassis, President, Analog, Power & Discrete, MEMS and Sensors Group, and Head of STMicroelectronics’ Strategy, System Research and Applications, Innovation Office. This live webcast and presentation materials can be accessed on the ST Investor Relations website. A replay will be available shortly after the conclusion of this call. This call will include forward-looking statements that involve risk factors that could cause ST results to differ materially from management expectations and plans. We encourage you to review the Safe harbor statement contained in the press release that was issued with the result this morning and also in STMicroelectronics' recent regulatory filing for a full description of these risk factors. Also, to ensure all participants have an opportunity to ask questions during the Q&A session, please limit yourself to one question and a brief follow-up. Now, I'd like to turn the call over to Jean-Marc Chéry, ST President and CEO.\n\n**Jean-Marc Chéry** (President and CEO)\nThank you, Jerome. Good morning, everyone, and thank you for joining ST for our Q1 2025 Earnings Conference Call. I will start with an overview of the first quarter, including business dynamics, and I will hand over to Lorenzo for the detailed financial overview. I will then comment on the outlook and conclude before answering your questions. starting with Q1. In a persistently uncertain environment, our first quarter net revenues were in line with the midpoint of our business outlook range, driven by higher revenues in Personal Electronics, offset by lower revenues in automotive and industrial compared to expectations. Q1 gross margin was slightly below the midpoint of our business outlook range, mainly due to product mix. On a year-over-year basis, Q1 net revenues decreased 27.3% to $2.52 billion. Gross margin decreased to 33.4% from 41.7%.\n\n**Jean-Marc Chéry** (President and CEO)\nOperating margin decreased to 0.1% from 15.9%, and net income decreased 89.1% to $50 million. 56, sorry. Let's now discuss our business dynamics during Q1. In automotive, we expect Q1 to be the low point of our automotive revenues. During the quarter, we saw lower revenues across all geographies. The current situation on trade and tariffs is creating uncertainty in car production levels, leading to a slight downward revision of forecasts for the year, more pronounced for electric vehicle volumes. Despite this, our book-to-bill ratio was above one. In dollar terms, bookings were also up significantly quarter on quarter. During the quarter, we continued to execute our strategy in car electrification. We had wins with both silicon carbide and silicon devices and modules for new onboard charger and traction inverter designs, as well as with our smart power and smart fuse solutions for electric vehicle power systems.\n\n**Jean-Marc Chéry** (President and CEO)\nWe remain focused on solid execution in power and discrete for car electrification in a continuing challenging market environment. In car digitalization, we saw further traction with our portfolio of automotive microcontrollers. Automotive microcontrollers are one of our revenue growth drivers beyond the medium-term horizon. We are confirming strong progress in executing our roadmap with many new products set to launch in 2025 and in 2026 across our Stellar and STM32A product families. We are also continuing to see strong designing momentum in China, EMEA, and the Americas with both large-scale OEMs and Tier 1s. During Q1, our Stellar P microcontroller family was selected in a dual inverter powertrain application by a fast-growing OEM in China, and we continue to expand our business with our current high-volume automotive microcontrollers in applications like high-vacuum air compressed systems.\n\n**Jean-Marc Chéry** (President and CEO)\nTo support the challenges of developing software-defined vehicles, we recently announced our extensible memory offer for Stellar microcontrollers. ST's proprietary PCM technology enables the smallest memory cell size for the automotive market. Thanks to this, our customers can benefit from increased headroom to continuously innovate their products over time and in the field while also simplifying logistics. In ADAS, we saw our customer Mobileye's EyeQ6H being adopted to improve safety and driving comfort in high-volume vehicles. This enables hands-free driving, smart parking, and improved occupant and pedestrian detection with a single integrated system. We also introduced our newest family of global navigation satellite system receivers and an advanced driving system for ADAS and autonomous driving. They are the industry's first to integrate multi-constellation and a quad-band signal processing in a single die.\n\n**Jean-Marc Chéry** (President and CEO)\nWith our automotive-grade sensors, we have a number of wins for ADAS vehicle angle detection and occupancy monitoring applications. Also, this is a clear growth opportunity for us in the midterm. In industrial, we expect Q1 to be the low point in terms of revenues. In Q1, orders were also up versus Q4, and overall inventory decreased, particularly for Smart Industrial and, to a lesser extent, Power & Energy. By region, the improvement in inventory was driven by Asia, while we have not seen significant improvement in Europe and in Americas. Our book-to-bill ratio was above one. During the quarter, we had wins for our power and another portfolio across a range of applications. This included motor control, industrial drives, white goods, solar panels, air conditioning, and data switches. At the end of March, we signed a development and manufacturing agreement for gallium nitride technology with Innoscience.\n\n**Jean-Marc Chéry** (President and CEO)\nIt includes a joint development initiative on GaN technology, as well as a reciprocal agreement allowing each company to use the other front-end manufacturing capacity. This allows ST to accelerate our roadmap in GaN technology to complement our silicon and silicon carbide offering. For ST, this is a further step in the China for China operating model, coming on top of the joint venture with Sanan for front-end manufacturing of silicon carbide and the foundry agreement with HHGrace on multiple technologies, including 40 nm node. In embedded processing, our STM32 microcontrollers continued to gain traction with the broad developer community. Facing the current challenging market conditions, we were able to reconfirm our number one ranking of the general-purpose microcontroller market in 2024, with a market share that has consistently grown sequentially from Q2 2024 onward.\n\n**Jean-Marc Chéry** (President and CEO)\nIn 2024, our software ecosystem grew 30% to over 1.3 million unique users, and we continued to see a strong growth trend in the first quarter of 2025. One area of particularly strong growth is in edge AI projects developed on our tools. Over the past 12 months, we saw over 160,000 projects, more than twice the number in the previous 12 months. We continued to reinforce our portfolio and ecosystem with new innovative products, leveraging our proprietary 40-nanometer and 18-nanometer process node technologies. In 2025-2026, we plan to introduce 18 new lines leveraging embedded non-volatile memory technologies at and below 40 nanometer. Between 2025 and 2027, the percentage of our STM32 revenue coming from this advanced product at 40 nanometer and below will double, reinforcing our leadership in this market segment.\n\n**Jean-Marc Chéry** (President and CEO)\nBased on our design in momentum, we are equipped to grow faster than the market, going back to well above 20% market share. In personal electronics, Q1 was slightly better than expected, while Communication Equipment and Computer Peripherals were in line with our expectations. Here, our engaged customer programs are progressing to the plan. Our high level of innovation and ability to execute with MEMS and optical sensing, as well as with our analog technology portfolio, are a key competitive advantage, enabling us to win and grow our business. Our specialized proprietary technologies also position us for growth in low Earth orbit satellites and data centers. For example, during the quarter, we introduced new technologies to enable higher performance optical interconnect in data centers and AI clusters.\n\n**Jean-Marc Chéry** (President and CEO)\nOur silicon photonics and next-generation BiCMOS proprietary technologies bring better performance to address the ongoing evolution of optical interconnect for customers like Amazon Web Services. Finally, in terms of corporate development activities, during Q1, ST announced the detail of its three-year program to reshape the manufacturing footprint and resize the global cost base. We also confirmed the annual cost savings target in the high triple-digit million-dollar range exiting 2027. The reshaping and modernization of ST's manufacturing operations aim to achieve two main objectives: pre-utilizing planned investment towards future-ready infrastructure such as 300-millimeter silicon and 200-millimeter silicon carbide wafer fabs to enable them to reach a critical scale and maximizing the productivity and efficiency of legacy 150-millimeter capabilities and mature 200-millimeter capabilities. This program is expected to see up to 2,800 people leaving the company globally on a voluntary basis over three years, on top of normal attrition.\n\n**Jean-Marc Chéry** (President and CEO)\nThis is expected to occur mainly in 2026 and 2027. To conclude, for sustainability, we issued our first annual integrated report during the quarter. This report integrates our sustainability statement detailing our performance in 2024. We remain on track for our commitment to becoming carbon neutral by 2027 on scope one and two, and on product transportation, business travel, and employee commuting for scope three. Our carbon neutrality program includes a comprehensive strategy covering the reduction of direct and indirect greenhouse gas emissions and the sourcing of 100% renewable electricity by 2027. Now, over to Lorenzo, who will present our key financial figures.\n\n**Lorenzo Grandi** (President and CFO)\nThank you, Jean-Marc, and good morning, everyone. Before commenting on Q1 results, let me remind you that following ST's reorganization into two product groups and four reportable segments announced in January 2024, we have made further progress in reorganizing our global product portfolio.\n\n**Lorenzo Grandi** (President and CFO)\nThese result in some adjustment to our reportable segments effective starting January 1st, 2025, without modifying subtotals at product group level. Therefore, from Q1 2025, we report revenues and operating income according to those four adjusted reportable segments. For more details, please refer to the appendix of the earnings press release we published today. Now let's start with a detailed review of the first quarter, starting with the revenues on a year-over-year basis. By reportable segments, Analog Products, MEMS and Sensors was down 23.9%, mainly due to a decrease in analog. Power and discrete products decreased 37.1%. Embedded processing EMP revenues declined 29.1%, mainly due to general purpose and automotive MCU. RF and optical communication declined 19.2%. By end market, automotive declined by about 39%, industrial by about 32%, personal electronics by about 11%, and communication equipment and computer peripheral increased by about 1%.\n\n**Lorenzo Grandi** (President and CFO)\nOn a year-over-year, sales to OEMs decreased 25.7% and 31.2% to distribution. On a sequential basis, revenue decreased 20.7% in AMS, 34.1% in power discrete, 26% in AMP, and 16.5% in RF and OC. By end market, automotive declined by about 34%, industrial by about 18%, personal electronics by about 17%, and communication equipment and computer peripheral by about 40%. Turning now to profitability, gross profit in the first quarter was $841 million, decreasing 41.7% on a year-over-year basis. Gross margin was 33.4%, decreasing 830 basis points year-over-year, mainly due to product mix and to a lesser extent to higher unused capacity charges and lower sales price. Total net operating expenses, excluding restructuring, amounted to $830 million in the first quarter. This was better than anticipated, reflecting the continued strict monitoring of our expenses in the current market environment.\n\n**Lorenzo Grandi** (President and CFO)\nIn the second quarter of 2025, we expect net OPEX to stand between $860 million and $870 million, a 6% year-over-year decline. As a reminder, these amounts are net of other income and expenses and exclude restructuring. First quarter operating income was $3 million. Q1 operating margin was 0.1%, with AMS at 7.7%, P&D at -6.9%, EMP at 8.9%, and RF and OC at 13.9%. Q1 2025 net income was $56 million, compared to the $513 million in the year-ago quarter. Earnings per diluted share were $0.06, compared to the $0.54. Net cash from operating activity decreased 33.2% in Q1 to $574 million. First quarter net CapEx was $530 million, compared to the $967 million in Q1 2024. Free cash flow was positive $30 million in the first quarter, compared to a -$134 million in the year-ago quarter.\n\n**Lorenzo Grandi** (President and CFO)\nInventory at the end of this quarter was $3.01 billion, compared to the $2.69 billion in Q1 2024. Days of sales of inventory at the quarter end was 167 days, in line with our expectation, compared to 122 days for both the previous quarter and the year-ago quarter. Cash dividend paid to stakeholders in Q1 2025 totaled $72 million. In addition, ST executed a share buyback of $92 million. ST maintained its financial strength with a net financial position that remained solid at $3.08 billion as of March 29, 2025, reflecting total liquidity of $5.96 billion and total financial debt of $2.88 billion. Now, back to Jean-Marc, who will comment on our outlook.\n\n**Jean-Marc Chéry** (President and CEO)\nThank you, Lorenzo. Now, let's move to our business outlook for Q2 2025. In the first quarter, our book-to-bill ratio improved, with both automotive and industrial above parity. We are expecting Q2 2025 revenues at $2.71 billion, ±350 basis points.\n\n**Jean-Marc Chéry** (President and CEO)\nAt the midpoint, our Q2 2025 net revenues will decrease by 16.2% year-over-year and increase 7.7% sequentially. We expect our gross margin to be about 33.4%, ±200 basis points, impacted by about 420 basis points of unused capacity charges. This business outlook does not include any impact for potential further changes to global trade tariffs compared to the current situation. For the full year 2025, considering the level of uncertainty for the economy globally and for ST and markets specifically, we are not providing an indication for the full year 2025 revenues. We plan to maintain our net CapEx plan for 2025 between $2 billion and $2.3 billion, mainly to execute the reshaping of our manufacturing footprint. To conclude, while we see Q1 2025 at the bottom, in the current uncertain environment, we are focusing on what we can control.\n\n**Jean-Marc Chéry** (President and CEO)\nWe are maintaining strict expense control while protecting R&D, continuously innovating to enhance and accelerate the competitiveness of our product and technology portfolio. We are on track with our company-wide program to reshape our manufacturing footprint, and we confirm that the cost savings target is in the high triple-digit million-dollar range exiting 2027. ST medium-term growth drivers remain solid. Specifically, they will come from MEMS and optical sensing solutions, general purpose microcontrollers, analog, and devices for low Earth orbit satellite communication. While we see a lower and delayed growth in power and discrete, due primarily to the well-known electrification market dynamics. We anticipate additional further growth beyond the medium-term horizon thanks to automotive microcontrollers and AI applications at the edge and for power management and cloud optical interconnect in data centers and AI clusters.\n\n**Jean-Marc Chéry** (President and CEO)\nWe will do so by leveraging our product and technology portfolio and roadmap and our competitive reshaped manufacturing footprint. Thank you, and we are now ready to answer your questions.\n\n**Operator**\nWe will now begin the question and answer session. Anyone who wishes to ask a question or make a comment may press star and one on their touchscreen telephone. You will hear a tone to confirm that you have entered the queue. If you wish to remove yourself from the question queue, you may press star and two. Participants are requested to use only handsets while asking a question. In the interest of time, please limit yourself to one question only. Anyone who has a question or a comment may press star and one at this time. The first question comes from François-Xavier Bouvignies. Please go ahead. Thank you very much.\n\n**François-Xavier Bouvignies** (Head of Europe Tech Hardware and Semiconductor)\nThe first question that is in everybody's mind, and you saw it with TI yesterday, is how much your Q2 is driven by tariff pulling. Effectively, you are +7% quarter on quarter guiding on the revenue side. I was wondering if you saw any strange behavior or unusual behavior as maybe the industry is trying to get some inventories ahead of a tariff. I just wanted to have your view on that. If you could provide any data that you have seen during the quarter that would support any pulling or not would be helpful. That's my first question.\n\n**Jean-Marc Chéry** (President and CEO)\nNo, we have not seen a specific pulling related to tariff. The Q2 forecast and guidance has been built smoothly in Q1 with our backlog we had entering in the year, plus a booking plan that has been achieved on a very linear and smooth model.\n\n**Jean-Marc Chéry** (President and CEO)\nNo specific pulling, okay, due to tariff for Q2. Thank you, François Xavier.\n\n**François-Xavier Bouvignies** (Head of Europe Tech Hardware and Semiconductor)\nThank you, Jean-Marc. Maybe, yeah, the second question is on your inventories. I mean, if I look at your inventory on the balance sheet, it is back to all-time high from when I look at my model, both on the absolute side on the days of inventories. I was wondering, what does it mean for the gross margin? Because it looks like it will take some time to clear these inventories and with the uncertain environment on the top line. I was just wondering, the consensus having gross margin increasing significantly in H2, is it really realistic, I mean, to have a significant improvement in gross margin given where the inventories are?\n\n**Lorenzo Grandi** (President and CFO)\nI take this question about the inventory.\n\n**Lorenzo Grandi** (President and CFO)\nYes, it's true that our inventory in ending Q1 is, let's say, 167 days, is actually, let's say, on the high side. This was expected. As you know, let's say the revenue in Q1, also due to the particularly unfavorable calendar, the length of the quarter was a little bit, let's say, was lower than our normal trend. At the end, we do expect to start already in this quarter to reduce the level of our inventory. We expect to go slightly down in terms of days, more in the range of 160 days, considering that during this quarter, we are also preparing the ramp-up for the personal electronic for Q3. Yes, clearly, let's say we have a path for reduction of this inventory, let's say, over the year. I would say that, yes, clearly, this is something that we are monitoring strictly.\n\n**Lorenzo Grandi** (President and CFO)\nIndeed, also during this quarter, we will have in one of our sites still one week of closure in order to keep under control this level of inventory.\n\n**François-Xavier Bouvignies** (Head of Europe Tech Hardware and Semiconductor)\nWhat does it mean for gross margin for H2? I mean, if inventory is coming down, does it mean that gross margin will, can it go up as well?\n\n**Lorenzo Grandi** (President and CFO)\nIn Q2, our guidance for the gross margin, as you have seen, is substantially to stay flat in respect to the first quarter. There are a few components of this dynamic of the gross margin. On one side, it is clearly, let's say, the gross margin is impacted negatively by the manufacturing efficiency that we had during Q1. Manufacturing efficiency during Q1 was impacted by the significant number of days of closure that we have done in our fabs and in our backend plant.\n\n**Lorenzo Grandi** (President and CFO)\nYou know that when you have this kind of, let's say, actions to close the sites, not all the efficiency, let's say, not all the negative impact of disclosure is captured by the unloading charges. There are some impacts that are negatively impacting the efficiency, and this is reflected in the dynamic of the second quarter gross margin. On top of that, there is an unfavorable impact on the euro dollars moving from 1.06 to 1.08. This is offset on the other side by the improvement in the product mix. Product mix is improving as personal electronic is declining, automotive is improving in the second quarter, is improving also industrial. This is offsetting, let's say, the negative impact that we have related to the manufacturing that rightly you say is coming substantially from our inventory.\n\n**Lorenzo Grandi** (President and CFO)\nWhy I would say that in terms of pricing, we do not see any significant high pressure in terms of pricing. It is the normal trend that usually we experience quarter after quarter.\n\n**François-Xavier Bouvignies** (Head of Europe Tech Hardware and Semiconductor)\nThank you very much.\n\n**Jean-Marc Chéry** (President and CEO)\nThank you, François Xavier. Moira, can we move to the next question, please?\n\n**Operator**\nYes, sir. The next question is from Janardan Menon from Jefferies. Please go ahead.\n\n**Janardan Menon** (Managing Director)\nYeah, hi. Good morning. Thanks for taking the question. Yesterday, going back to Texas Instruments, they were sounding quite bullish about their industrial business. They said that they are seeing a broad recovery across segments and geographies, and all their customers are at low levels of inventory. Those comments seem a little bit more bullish than the comments you have just made today on industrial. I am just wondering why there would be a difference between the two.\n\n**Janardan Menon** (Managing Director)\nIs it that they have a more direct sales model and will see the improvement earlier than through the distribution channel where you are selling some more? When we talk about second half, would the level of recovery of industrial microcontrollers be a key factor, the level in terms of your gross margin outlook into the second half?\n\n**Jean-Marc Chéry** (President and CEO)\nI'll take the question for the revenue. It is clear that for industrial, we see some positive trend. I repeat that our Q1 book-to-bill was above one. In terms of orders, dollar, we were also up. Clearly, we have seen some inventory down in smart industrial and to a lesser extent in Power & Energy. Also, we see some positive dynamic by region, especially in Asia, but still no improvement in Europe, particularly, and in America.\n\n**Jean-Marc Chéry** (President and CEO)\nIt is a point number one. Point number two, you know that our industrial market, let's say, go-to market is mainly related to general purpose microcontrollers. And there is still a situation of over-inventory on general purpose, going in the right direction, but at a slower pace than what we expected, okay, a few months ago. About H2, as I have said, we will not provide any indication about H2. Why? Because of the uncertainty of the environment, the low visibility we have. However, okay, we already communicated that we are pretty confident about our engaged customer program in personal electronics and in communication equipment and computer peripheral. Definitely, this increase in H2 versus H1 related to this engaged customer program will not represent the full H2 growth versus H1.\n\n**Jean-Marc Chéry** (President and CEO)\nOn the other part, okay, it should be related to industrial market definitely, but it's too early to confirm this indication. It is something that probably will happen.\n\n**Janardan Menon** (Managing Director)\nYou are confirming that Q1 is the bottom in industrial, so it should be higher than Q1 at least.\n\n**Jean-Marc Chéry** (President and CEO)\nWe confirm Q1 is the bottom in industrial here. Thank you. Any follow-up, Janardan?\n\n**Janardan Menon** (Managing Director)\nIf the second half is on the personal electronics where you have an engaged customer ramp into the second half, I'm just going back to the gross margin issue where your personal electronics has lower gross margins than industrial automotive. Just from that perspective, would the level of improvement, all things being equal, just assuming that there is no big tariff impact in the second half, would your gross margin improvement be somewhat more muted?\n\n**Lorenzo Grandi** (President and CFO)\nThe second part of the year, clearly, at this stage, it's a little bit difficult to give any precise indication in terms of gross margin where we will land. Clearly, we have some elements that we can share with you. Clearly, the impact of the growing in terms of personal electronic and with the significant content in terms of silicon will definitely help significantly our, let's say, reduction in terms of unloading charges and also improving in our manufacturing efficiency. This is clearly a positive benefit that we will have in the second part of the year. Clearly, in the second part of the year, as we were mentioning before, there will be improvement, expected improvement in the industrial that is very creative for us in terms of gross margin.\n\n**Lorenzo Grandi** (President and CFO)\nI would say that these elements that are supporting for us some, let's say, expected improvement moving from the first half to the second half. Clearly, let's say there are also some headwinds that we have to take into consideration. One may be the dynamic of FX that clearly, let's say, in this environment is not, let's say, helping us. The other element that we have to take into consideration is the fact that, as we have said many times, the capacity reservation fees will progressively go down, also moving from the first half to the second half. Anyway, I have to say that it's fair to say that, let's say, the level of gross margin that we have seen in Q1 and in Q2 will be the bottom for our gross margin. Gross margin will improve moving Q3 and Q4.\n\n**Jean-Marc Chéry** (President and CEO)\nFinishing on industrial revenue, what I can confirm to you is that company will grow revenue at the midpoint of our guidance, 7.7%. Industrial will do as well. Very similar to the average of the company in terms of growth. The main detractor of the growth of Q2 versus Q1 is the usual seasonality for ST on personal electronics. It is a good sign that for the first time since many quarters now, that sequentially the industrial market we address will grow about 8% sequentially.\n\n**Janardan Menon** (Managing Director)\nThat is very clear. Thank you so much.\n\n**Lorenzo Grandi** (President and CFO)\nThank you, Jonathan. Moira, we can move to the next question, please.\n\n**Operator**\nThe next question is from Joshua Buchalter from TD Cowen. Please go ahead.\n\n**Joshua Buchalter** (Director of Semiconductors Equity Research)\nHey, guys. Thank you for taking my question. I appreciate all the color on the inventory on the balance sheet.\n\n**Joshua Buchalter** (Director of Semiconductors Equity Research)\nI was wondering if you could maybe provide additional details on how you're viewing downstream inventory in the channel. I think you had mentioned entering the year, you were sort of at two months more than you were hoping. Was there any progress on that front in aggregate, getting channel inventory lower during the quarter and sort of where you see things now? Thank you.\n\n**Lorenzo Grandi** (President and CFO)\nYeah. Yes, I take this question about the inventory. This time inventory that you are mentioning is the inventory in the channel. During the last quarter in Q1, we have seen substantially one dynamic, very clear reduction of inventory in the channel, mainly in Asia. This was, let's say, evident while for what concerns EMEA and America, we have not yet seen any significant reduction of our inventory in the channel.\n\n**Lorenzo Grandi** (President and CFO)\nLet's say that today, even if we have seen, let's say, some improvement in the course of last quarter, still we have some excessive inventory in the channel. This is clear. We do expect, let's say, that in Q2, with this dynamic in terms of industrial and expectation of our, let's say, POS, so the sales of our distributor to our final market to have a significant step down in terms of inventory. For the time being, what I can say is that yes, there is still some excess of inventory. This inventory should progressively go down. Let's say this excess of inventory should progressively go down to a normal, let's say, situation already starting in the current quarter.\n\n**Joshua Buchalter** (Director of Semiconductors Equity Research)\nOkay. Thank you for the color there.\n\n**Joshua Buchalter** (Director of Semiconductors Equity Research)\nMaybe, Jean-Marc, I was hoping you could comment bigger picture on how you feel ST's position to sort of handle the backdrop where the global trade environment is different than it has been in the past, in particular from a manufacturing standpoint. Have your conversations with your customers changed much over the last few weeks? I know you're not guiding any changes, but I'd be curious to hear how your customers are viewing you guys, given your significant manufacturing footprint internally, but also it being in Europe. Are you viewed as sort of a neutral third party in this? Any details you can give us on the flexibility of your manufacturing footprint across your locations would be helpful as well. Thank you.\n\n**Jean-Marc Chéry** (President and CEO)\nWe have engaged since many quarters now adjustment of our manufacturing footprint. Basically, there are two legs.\n\n**Jean-Marc Chéry** (President and CEO)\nOne is the most visible one, clearly, is our China for China strategy, where now we have with our joint venture with Sanan, a wafer fab that will be ready by end of the year for mass production for silicon carbide. We have this strategic agreement with Innoscience for GaN. Okay, we have a long-term agreement with HHGrace, both for microcontroller, analog technology, and other power. Clearly, first, we have worked since many quarters to have a China for China manufacturing infrastructure and ecosystem. With our customer, we've already anticipated the reverse dynamic, which means we move already in our wafer fab, either in Europe or in Singapore, and respectively from our assembly plant and test out of China or out of Taiwan, thanks to our infrastructure in the Philippines, in Malaysia, in Malta, and in Morocco.\n\n**Jean-Marc Chéry** (President and CEO)\nHonestly and transparently, what happened early April did not change drastically anything. We have not seen any panic about customer or immediate reaction. I think, okay, it is urgent to wait and see because, okay, adaptation of the supply chain or decision to modify or structuralize the supply chain is very heavy, sorry, in terms of qualification, in terms of transfer of product, and so on and so forth. We have not seen immediate reaction or very, let's say, classified emotional reaction about that. I repeat, we have engaged a modification of our footprint structurally since many, many quarters. That is the reason why, okay, of course, we are waiting what will happen moving forward, but we do believe that the company is well equipped to face, okay, this situation.\n\n**Joshua Buchalter** (Director of Semiconductors Equity Research)\nThank you. Thank you. Appreciate all the color.\n\n**Lorenzo Grandi** (President and CFO)\nThank you, Josh.\n\n**Lorenzo Grandi** (President and CFO)\nMoira, we can move to the next question, please.\n\n**Operator**\nThe next question comes from Stéphane Houri from ODDO BHF. Please go ahead.\n\n**Stéphane Houri** (Head of Equity Research)\nYes. Good morning. I have a question about your comments on the automotive market. Could you maybe clarify what's your vision about your own revenues on the automotive side this year versus the market? And also, you made a difference between electrification and, let's say, the bulk of the market. Could you clarify this for us? Thank you very much.\n\n**Jean-Marc Chéry** (President and CEO)\nIndeed, in Q1, we have seen lower revenues in all geographies for automotive, including a mild downward revision for the forecast of the year because you know that automotive industry drivers with a frame order backlog. Clearly, this behavior is more pronounced on electrical vehicles.\n\n**Jean-Marc Chéry** (President and CEO)\nThe positive point is that at the same moment in Q1, our book-to-bill ratio was above one for specifically automotive. In terms of dollar terms, the booking were also up quarter on quarter. The other positive point for 2025 is we believe that one risk factor has been alleviated, so the one in Europe, because now the European Union is proposing some smooth approach, okay, on a three-year flexibility for the car maker to comply with the CO2 standard. Of course, we will wait for the vote, but this is good news. However, we believe that the current situation on trade and tariff is creating uncertainty on the level of car production, clearly, and there is still some other risk factor. Taking into account, okay, all this situation, we believe that Q1 is a low point for automotive.\n\n**Jean-Marc Chéry** (President and CEO)\nExcluding the capacity reservation fees, we expect our auto revenue will decline, unfortunately, in 2025 versus 2024. You know that the capacity reservation fee will decline substantially in 2025 versus 2024 by almost $300 million. Yeah. Takeaway is Q1 is the bottom. Full-year revenue should decline versus 2024. We have the indication for that. There is still some risk around the production of car. We know that some analysts provide a forecast at 92.4 million of car produced in 2025, so a slight increase. Here, we prefer to remain cautious and wait what will happen in the next few weeks, especially related to the tariffs.\n\n**Stéphane Houri** (Head of Equity Research)\nOkay. Just a quick follow-up. I know you're not guiding for 2025, obviously, but you haven't changed your CapEx budget, which in general means that basically the outlook, according to you, hasn't really changed.\n\n**Stéphane Houri** (Head of Equity Research)\nWhen you look at the consensus, you see a very strong increase in H2 versus H1, 20%-25%. Does it mean that this kind of evolution in the second half is still possible?\n\n**Jean-Marc Chéry** (President and CEO)\nThere are two points in your question. First of all, I would like to clearly repeat that the main purpose of the CapEx this year is to enable our reshaping plan. We will disengage from 150-millimeter fab, and we will disengage from 200-millimeter fabs. That's the reason why, okay, we need to increase our capacity on 300-millimeter fab silicon, respectively 200-millimeter fab silicon carbide. It's point number one. To have them at the right scale because it will be a booster for our gross margin. Respectively, a 300-millimeter fab silicon is much more efficient than a 200-millimeter one, and the same for a 200-millimeter silicon carbide.\n\n**Jean-Marc Chéry** (President and CEO)\nThe first objective of our capital expenditures this year is to enable our reshaping plan. Definitely, some part of the CapEx has been dedicated to, as an example, NIC change. The device, okay, that will be introduced as one of the main engaged customer programs for H2 in personal electronics, which is an increasing dollar and silicon content in the application, has requested some CapEx to be spent in Q1. One part of the CapEx, of course, is mix adaptation. It is also valid in test and finishing as well. I repeat, for 2025, the CapEx is mainly sub-mix adaptation, which are, let's say, awarded to us and ensured. The main part of the CapEx is to prepare our plan to grow in 2026-2027 in a different reshaped manufacturing footprint. This is the release objective of the CapEx.\n\n**Jean-Marc Chéry** (President and CEO)\nThat is the reason why, okay, we still give this $2 billion to 2.3 billion range. You see that in Q1, we are basically slightly above a $2 billion run rate. About H2, again, we do not give any indication. We have some visibility. We have a backlog. But you know now our backlog, except the normal terms and conditions of our sales contract, the backlog is not particularly protected, so it could be canceled in case, okay, something happens at the economy, okay, for end of the year or 2026. That is the reason why, okay, we have been cautious. However, what we can say, we can say that taking into account our engaged customer program, taking into account what I say on automotive, that Q1 is the bottom.\n\n**Jean-Marc Chéry** (President and CEO)\nEven if the full year will not show a growth, taking into account the trend of the inventory on industrial, we should expect to have H2 better than H1.\n\n**Stéphane Houri** (Head of Equity Research)\nThank you. Thank you. Thank you very much.\n\n**Lorenzo Grandi** (President and CFO)\nMoira, can we move to the next question, please?\n\n**Operator**\nThe next question comes from Sandeep Deshpande from JPMorgan. Please go ahead.\n\n**Sandeep Deshpande** (Stock Analyst)\nYeah. Hi. Thanks for letting me on. My first question is about tariffs. There have been some retaliatory tariffs from China on US products as such. Has ST had any impact because of these retaliatory tariffs on their demand for your product from China at all, and whether there have been any changes in the environment because of this? I have a quick follow-up.\n\n**Jean-Marc Chéry** (President and CEO)\nThis is a question.\n\n**Lorenzo Grandi** (President and CFO)\nSandeep, can you repeat the question, please? Yeah.\n\n**Sandeep Deshpande** (Stock Analyst)\nMy question is about the Chinese retaliatory tariffs on products from the U.S. as such, really. Given that the retaliatory tariffs, there could be potential for tariffs on U.S. semiconductor companies shipping into China. Does this have any potential impacts on STMicroelectronics?\n\n**Jean-Marc Chéry** (President and CEO)\nAs I told you, it is clear that with the current situation on tariffs, our peers that have fabs in the U.S., for sure, will be or could be penalized with some customers. Again, our American peers, generally speaking, are supplying to Chinese customers products with value and with some stickiness. I repeat what I have said a few minutes ago. We do not see an immediate panic reaction or emotional reaction versus the situation. Why? Because indeed, the situation is frozen for some days now. I do believe that customers and partners are waiting on the situation; we will move forward.\n\n**Jean-Marc Chéry** (President and CEO)\nDefinitely, let's remain pragmatic. If some customers came to us and have taken decisions in the past to allocate socket to our competitor for various reasons, and if today our product complies with the specification and complies in terms of performance and price and so on, yes, certainly, we will acknowledge some trend that ST could be a new vendor solution taking into account this tariff increase for American peers in China.\n\n**Sandeep Deshpande** (Stock Analyst)\nThank you. My quick follow-up is on, again, on your auto business. Can you talk about how your share has evolved at your major silicon carbide customer in the first quarter? And if we can assume that any share loss that has occurred has already been factored into numbers, or whether we will see further share loss at that customer through the rest of this year?\n\n**Lorenzo Grandi** (President and CFO)\nI will comment, and Marco Cassis will complement.\n\n**Lorenzo Grandi** (President and CFO)\nWhat we say, we have repeated since a few quarters. The way we have established, okay, the business relation with our main customer for silicon carbide was a warranty about some share. Okay? It is automotive industry. For automotive industry, it is a normal, let's say, process to have multi-source, to have at least two sources. For us, it was super well-known that at a certain moment, okay, when the second source will be qualified and efficient, okay, our main customer will manage his manufacturing and supply chain with two sources. We are in this situation. We have absolutely not lost market share because of any reason. Okay? We are simply coming back on a normal share consistently with what we contractually signed, okay, with our customer.\n\n**Lorenzo Grandi** (President and CFO)\nAfter, okay, where we pay attention is more about the volume of cars sold by our main customer, production, inventory, and so on and so forth. Here, okay, you know we cannot comment. Marco, you want to add something?\n\n**Marco Cassis** (President of Analog, Power and Discrete, Mems and Sensors Group)\nNo, I just confirm what you just said. We moved towards the contractual market share that we have with our major customers, and there will be no erosion of market share going forward. On the longer trend, we confirm that we will be present in the silicon carbide market at least with a 30% or above market share overall.\n\n**Sandeep Deshpande** (Stock Analyst)\nThank you.\n\n**Lorenzo Grandi** (President and CFO)\nThank you, Sandeep. Unfortunately, we do not have any time for more questions, so this is ending our call for this quarter. Thank you very much, all of you, for being there, and we remain here at your disposal should you need any follow-up questions.\n\n**Lorenzo Grandi** (President and CFO)\nSorry for the ones that didn't have time to ask the questions there. Thank you very much.\n\n**Lorenzo Grandi** (President and CFO)\n[crosstalk]",
      "fetched_at": "2026-02-04T15:45:15.708Z"
    }
  ]
}