{
  "ticker": "TSLA",
  "last_updated": "2026-02-04T15:39:25.265Z",
  "total_transcripts": 4,
  "transcripts": [
    {
      "ticker": "TSLA",
      "title": "Tesla, Inc. (TSLA) Q4 FY2025 earnings call transcript",
      "published_date": "Jan 28, 2026, 5:30 PM EST",
      "fiscal_year": "2025",
      "quarter": "Q4",
      "url": "https://finance.yahoo.com/quote/TSLA/earnings/TSLA-Q4-2025-earnings_call-393464.html",
      "content": "**Travis Axelrod** (Head of Investor Relations)\nGood afternoon, everyone, and welcome to Tesla's fourth quarter 2025 Q&A webcast. My name is Travis Axelrod, Head of Investor Relations, and I'm joined today by Elon Musk, Vaibhav Taneja, and a number of other executives. Our Q4 results were announced at about 3 P.M. Central Time in the update deck we published at the same link as this webcast. During this call, we will discuss our business outlook and make forward-looking statements. These comments are based on our predictions and expectations as of today. Actual events or results could differ materially due to a number of risks and uncertainties, including those mentioned in our most recent filings with the SEC. During the question and answer portion of today's call, please limit yourself to one question and one follow-up. Please use the Raise Hand button to join the question queue.\n\n**Travis Axelrod** (Head of Investor Relations)\nBefore we jump into Q&A, Elon has some opening remarks. Elon?\n\n**Elon Musk** (Co-Founder and CEO)\nThanks, Travis. So, we've updated the Tesla mission to amazing abundance, and this is intended to send a message of optimism about the future. I think we're most likely headed to an exciting, amazing era of abundance. And I think with the advent or with the continued growth of AI and robotics, I think we actually are headed to a future of universal high income. Not universal basic income, but universal high income. I mean, there's gonna be a lot of change along the way, but that is what I see as the most likely outcome. So I think that it makes sense to update Tesla's mission to reflect that goal.\n\n**Elon Musk** (Co-Founder and CEO)\nAnd obviously, along that way, we're going to keep improving safety, driving down the cost of goods, and getting people access to anything they need, without compromise. And still making sure that the environment is great, nature is great, and people can have whatever they want, which seems like probably the best future. So, I'm open to other ideas, but that sounds like it sounds like the best future you could possibly imagine. I guess it would be that everyone can have whatever they want, including amazing medical care, and but we still keep, you know, the beauty of nature and Earth. I think that's probably the best outcome.\n\n**Elon Musk** (Co-Founder and CEO)\nAnd we're seeing obviously the first steps along that way this year for Tesla, first major steps, as we increase vehicle autonomy and begin to produce Optimus robots at scale. We're making very, very big investments, so this is gonna be a very big CapEx year, as Vaibhav will get into. That is deliberate, because we're making big investments for an epic future. So I think all these investments make a lot of sense. We'll continue to make sure that when we do spend capital, it is spent very efficiently. But it's a lot of things. You know, major investments in batteries and the entire supply chain for batteries.\n\n**Elon Musk** (Co-Founder and CEO)\nSo, we're also gonna be significant manufacturers of solar cells, and we're making massive investments in AI chips. So, but I think these all make a ton of strategic sense. And then I guess I have, like, one... It's not like it's not exactly bad news, but it's a... it's time to basically bring the Model S and X programs to an end with an honorable discharge.\n\n**Elon Musk** (Co-Founder and CEO)\nBecause we're really moving into a future that is based on autonomy and so if you're interested in buying a Model S and X, now would be the time to order it, because we expect to wind down S and X production in next quarter and basically stop production of Model S and X next quarter. We'll obviously continue to support the Model S and X programs for as long as people have the vehicles, but we're gonna take the Model S and X production space in our Fremont factory and convert that into an Optimus factory, which will... with the long-term goal of having 1 million units a year of Optimus robots in the current S/X space in Fremont.\n\n**Elon Musk** (Co-Founder and CEO)\nSo that is slightly sad, but it is time to bring the S/X programs to an end and shift really, it's part of our overall shift to an autonomous future. As my profile picture on X said for a few months there, \"The future is autonomous.\" And so let's say with respect to Full Self-Driving and Robotaxi, people are obviously following with very close attention the progress of FSD, and you can experience it for yourself. If you've got a Tesla, you can notice, really, with every software update, the car gets better and better at autonomy.\n\n**Elon Musk** (Co-Founder and CEO)\nAnd we're, you know, we're able to do our first rides with no safety monitor in the car in Austin. These were paid rides, so these were just sort of randomly selected paid rides with no safety monitor. I think maybe as of maybe yesterday or so, we actually don't even have a chase car or anything like that. So these are just cars with no people in them, and no one's following the car in Austin. So we're obviously being very cautious about this 'cause we wanna have no injuries or serious accidents along the way.\n\n**Elon Musk** (Co-Founder and CEO)\nSo I think it makes sense to be very cautious, but you'll see the amount of autonomy increase dramatically, I think, every month, essentially. So and then there will also be an opportunity, something we've talked about for a long time, for existing owners of Teslas to add or subtract their cars to the fleet. Kinda like how Airbnb works, where you can add or subtract your house to the Airbnb inventory. And I think probably the value of the Tesla, the sort of partial people adding or subtracting their cars to Tesla autonomous fleet is probably a little underweighted by a lot of people 'cause we've got millions of cars with AI4 that can do this.\n\n**Elon Musk** (Co-Founder and CEO)\nSo, it's that, it might potentially provide an opportunity for a lot of customers to earn more by lending their car to the fleet than their lease cost to Tesla. Yeah, which is kind of... It's kinda like you get, in that scenario, you basically get paid to own a Tesla. It's quite a good scenario. And we expect to have fully autonomous vehicles in, you know, probably, I don't know, somewhere between a quarter and half of the United States by the end of the year, pending regulatory approval. You know, a big factor would be if there's some kind of federal preemption for autonomous vehicles.\n\n**Elon Musk** (Co-Founder and CEO)\nIn the absence of that, you kinda have to go on a city-by-city or state-by-state basis. But nonetheless, we even if it is city by city, state by state, we expect to be in, you know, I don't know, dozens of cities, dozens of major cities by the end of the year. With respect to energy, the Tesla energy team has done incredible work, and the growth rate on that work is continuing to be very strong. We're building more manufacturing capacity and expect that energy will have very high growth for really as far into the future as we can imagine. The solar opportunity is underestimated.\n\n**Elon Musk** (Co-Founder and CEO)\nWe think the best way to add significant capability to the grid is, or energy to the grid, let's say it's powering AI data centers, is solar and batteries on Earth and solar in space. So that's why we're gonna work towards getting 100 gigawatts a year of solar cell production, integrating across the entire supply chain, from raw materials all the way to finished solar panels. Maybe a bit more about Optimus. We'll probably unveil Optimus 3 in a few months. And I think it's gonna be quite surprising to people. It's an incredibly capable robot. And as I mentioned, we are replacing the S/X line in Fremont with a 1 million unit per year line of Optimus.\n\n**Elon Musk** (Co-Founder and CEO)\nNow, because it is a completely new supply chain, it's just, it's a... There's really nothing from the existing supply chain that exists in Optimus. Everything is designed from physics first principles. So that means, the normal S-curve of manufacturing ramp will be longer for Optimus than it is for products that have at least some portion of an existing supply chain. Like, when everything's new, the production rate will be proportionate to the least lucky, least confident part of the entire supply chain. And if there's 10,000 things that need to go right, it's, you know, it only takes one to be slow to lag that.\n\n**Elon Musk** (Co-Founder and CEO)\nBut, so it will be sort of a stretched out S-curve, but I'm confident that we'll get to 1 million units a year of, in Fremont, of, Optimus 3. And this Optimus really, really will be a general purpose robot that can learn by observing human behavior. So you can, like, demonstrate a task or literally verbally describe a task or show it a task, even show it a video, and it will be able to do that task. So it's a... It's gonna be a very capable robot. I think long-term, Optimus will have a very significant impact on the U.S. GDP. Like, it will actually move the needle on U.S. GDP significantly. So, in conclusion,...\n\n**Elon Musk** (Co-Founder and CEO)\nYou know, there's still obviously many who doubt our ambitions for creating amazing abundance, but we're confident it can be done, and that we're making the right moves technologically to ensure that it does. And Tesla's obviously not, never, never been a company to shy away from solving some of the hardest problems. You know, that it's, I think that's kind of how you build value in a company is you solve hard problems. It's like I don't know how you create value by solving easy problems. So there's a lot of hard problems that the Tesla team is gonna solve, but it's an incredibly talented, hardworking team. And I'd like to thank actually everyone at Tesla for their incredible hard work.\n\n**Elon Musk** (Co-Founder and CEO)\nIt's an honor to work with such a talented group. Thank you to everyone who is supporting this mission. The future is more exciting than you can imagine.\n\n**Travis Axelrod** (Head of Investor Relations)\nFantastic. Thank you so much, Elon. Next, we have some remarks from Vaibhav. Go ahead.\n\n**Vaibhav Taneja** (CFO)\nThanks, Travis. So Q4 2025 was an interesting quarter in a couple of respects. On the autos front, while in Q3, we saw a surge in U.S. demand before the higher consumer credit cliff, pulling in some demand from Q4. In other parts of the world, we saw increase in demand, leading to record deliveries in smaller countries like Malaysia, Norway, Poland, Saudi Arabia, and Taiwan, while continued strength in the rest of APAC and EMEA. We therefore ended 2025 with a bigger backlog than in recent years. Note that none of these countries have the latest version of FSD Supervised available yet. On the storage front, we had yet another record in terms of deployments. I would like to thank our customers and Tesla in continuing this momentum.\n\n**Vaibhav Taneja** (CFO)\nOn the automotive margins front, automotive margins, excluding credits, improved sequentially from 15.4% to 17.9%. The automotive gross profit was flat sequentially, despite 16% lower deliveries, primarily due to regional mix, as we had proportionately more deliveries in APAC and EMEA. As we look to 2026, with the progress that has been made with autonomy, our focus is on ramping production at all our factories. Our biggest constraint globally continues to be on the battery pack front. While our teams have been creative in trying to resolve the situation by now putting 4680 cells in non-structural packs, we continue to iterate improving things from here on. FSD adoption continued to improve in the quarter, reaching nearly 1.1 million paid customers globally. Of these, nearly 70% were upfront purchases.\n\n**Vaibhav Taneja** (CFO)\nIt is important to note that beginning this quarter, we are transitioning fully to a subscription-based model for FSD. Therefore, net additions to this figure will primarily be via subscription model and in the short term, will impact automotive margins. On the energy front, we achieved yet another record in terms of gross profit for the quarter and ended the year with nearly $12.8 billion in revenue at 26.6% year-over-year growth. This was the result of high deployments in all regions and continued strength and demand for both Megapack and Powerwall. As we look at 2026, our backlog remains strong, well-diversified globally, and we expect increasing deployments with the launch of Megapack 3 and Megablock. However, we expect margin compression from the increased low-cost competition, impacts to market from policy uncertainty, and the cost of tariffs.\n\n**Vaibhav Taneja** (CFO)\nServices and Others margin declined from 10.5% to 8.8%, primarily from higher employee-related costs for service centers as we start preparing for the ramp in activity from the growth in the fleet size. We did see a momentum in margin, we did see an improvement in margin from our Supercharging business, which is included within services and other. Additionally, note that our Robotaxi business-related costs, while not material, are also included within this. Given that this, we're still in the early phase of our fleet deployment and are still doing a lot of validation testing, the revenue and cost per mile metrics are not meaningful to discuss at the moment. Then on total gross margin front, you know, we ended the quarter with over 20.1%, something which we haven't achieved for over the last two years.\n\n**Vaibhav Taneja** (CFO)\nThis improvement came despite the impact of lower fixed cost absorption and the impact of tariffs, which were in excess of $500 million in Q4. Operating expenses increased sequentially, primarily from increased stock-based compensation for employees, and as we started recording charges on for one operational milestone under our 2025 CEO Performance Award, that was deemed to be probable over the award term. Additionally, our spend on AI-related initiatives and new products like Cybercab, Semi, Optimus, and Megapack, etc., continues to be on elevated levels, and we expect this trend to continue for the full year 2026. Net income was negatively impacted from mark-to-market charges on a Bitcoin holding, which depreciated 23% as compared to the last quarter, and, the impact of unfavorable impact of FX, primarily from our large intercompany borrowings.\n\n**Vaibhav Taneja** (CFO)\nOn the free cash flow front, we ended up at $1.4 billion. You know, we did end up CapEx being slightly below our previous guidance of $9 billion. But like, as Elon already mentioned, this year is going to be a huge investment year from a CapEx perspective. And at the moment, we are expecting that CapEx will be in excess of $20 billion. You know, we'll be paying for 6 factories, namely the refinery, LFP factory, Cybercab, Semi, a new Megafactory, the Optimus factory. On top of it, we'll also be spending money for building our AI compute infrastructure, and we'll continue investing in our existing factories to build more capacity, and then, you know, also the related infrastructure along with it. And we'll also further expand our fleet of Robotaxi and Optimus.\n\n**Vaibhav Taneja** (CFO)\nWhile this may seem a lot, we believe this is the right strategy to position the company for the next era, and we'll make such investments, as Elon mentioned, in a very capital-efficient manner. Note that this does not include potential investments in solar cell manufacturing or our Terafab, as we're still in early phase, and we plan to provide an update in future quarters. We're starting not the next chapter, but a new book on the progression of this company. 2026 year would be when all of this began. While at times it feels daunting, it is going to be the most exciting change in Tesla's history, and we could not have even dreamed of embarking on this journey without the support of our customers and our investors. Thanks for again showing the confidence in us, and let's get ready for a future of amazing abundance. Thanks.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Thank you very much, Vaibhav. Now we're going to head over to investor questions. As always, we will start with questions from Say.com. The first question is, \"Today, today, there are approximately 90 million cars sold globally each year. Does Tesla have a view, based on its Robotaxi ambition, what this number will be in 5 or 10 years, and how does this impact Tesla's EV strategy to have more models?\n\n**Lars Moravy** (VP of Vehicle Engineering)\nYeah. Thanks, Travis. As Elon said, the future is autonomous, and obviously, autonomy and Cybercab are going to change the global market size and mix quite significantly. I think that's quite obvious. You know, general transportation is gonna be better served by autonomy, as it will be safer and cheaper, and over 90% of vehicle miles traveled are with two or less passengers now, which is why we designed Cybercab that way. In this new autonomous market, we at Tesla have the advantage of efficiency, cost, and manufacturing at scale that really no one else has, and we've built that over the last decades, and we believe that that segment that we are creating will grow millions year-over-year.\n\n**Elon Musk** (Co-Founder and CEO)\nYeah. Just to add to what Lars said there, it's worth the point that Lars made, which is that 90% of miles driven are with one or two passengers, or one or two occupants, essentially, is a very important one. Because that implies that the Cybercab, which is a dedicated, you know, two-seater or dedicated Robotaxi. It's a little confusing with the terms Robotaxi and Cybercab. Sorry about the confusion, but... And in fact, in some states, we're not allowed to use the word cab or taxi, so it's gonna get even more strange. It's gonna be like Cyber vehicle or something, Cybercar.\n\n**Elon Musk** (Co-Founder and CEO)\nBut the Cybercab, which is a specific vehicle model that we're making, does not have a steering wheel or pedals. So this is clearly, you know, there's no fallback mechanism here. It's like this car either drives itself or it does not drive. And we expect to start production in April. As always, it's an S-curve of... The production rate is an S-curve, so starts off very slowly and then grows exponentially, then you hit the linear, and then ultimately, you know, it asymptotes at whatever your target volume is. So, but we would expect over time to make a far more Cybercabs than all of our other vehicles combined, given that 90% of distance driven or distance being-\n\n**Vaibhav Taneja** (CFO)\nTraveled.\n\n**Elon Musk** (Co-Founder and CEO)\n-distance traveled, exactly, no longer driving, is one or two people. I think it's like 80% is just one. So it would mean that long-term, Cybercab, we would make several times more Cybercabs per year than all of our other vehicles combined.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Thank you so much. The next question, a bit related, \"Are there still plans to launch new models to address different price segments and vehicle types which could materially expand the TAM for Tesla?\n\n**Lars Moravy** (VP of Vehicle Engineering)\nYeah. To further on what we were just talking about, we've launched our least expensive models ever over the last few months and are continuing to expand that, those models globally. And over the last decade, we have continually brought down the cost of our vehicles without sacrificing range, performance, or premiumness, and we'll continue to do that, as Vaibhav said, investing in our factories, but these are all trade-offs of where we spend our time or money. And to Elon's point, just now, with Cybercab coming, we are aiming to bring that Tesla premium ride experience to our largest market yet. That could be 5 or 10 times our current levels of production. This new autonomous market, you have to start thinking about us as moving to providing transportation as a service more than the total-\n\n**Elon Musk** (Co-Founder and CEO)\nYes\n\n**Lars Moravy** (VP of Vehicle Engineering)\n... addressable market, for the purchased vehicles alone. Of course, we do have plans to have Robotaxis in various shapes and sizes, but obviously, Cybercab will be the grand majority of that volume.\n\n**Elon Musk** (Co-Founder and CEO)\nYeah, the vast majority of miles traveled will be autonomous in the future. You know, I would say probably less than – I'm just guessing, but probably less than 5% of miles driven will be where somebody's actually driving the car themselves in the future. Maybe as low as 1%.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. The next question is, historically, Tesla has spoken about gross margin per model. Are there standalone gross margin targets for the current models, excluding the benefits for FSD sales?\n\n**Vaibhav Taneja** (CFO)\nYou know, we've talked about this with the previous two questions, but transportation, as we know, is changing, and I think we cannot keep applying the same framework from a car sales model to the future, what we are trying to do. So it has to be looked at it more holistically. You know, autonomy software will be the driver for growth from now on. And as we aim to maximize the global fleet, we've been laser-focused on COGS from our side to make sure, because that is something which we manage. So we will keep focusing on that, but I think we need to look at it from a different dimension.\n\n**Elon Musk** (Co-Founder and CEO)\nYeah, like, this Cybercab, that is, the whole design of Cybercab was, it was to optimize the, the fully considered cost per mile, of autonomous driving. And you, you, you're-- it's a different design problem than if you're trying to design, cars for people who, who will be driving, versus being driven. And, and, and so, so Cybercab is, like, like I said, super optimized for, minimum cost per mile and, and also for a much higher duty cycle. So it, we, we would expect, Cybercab to be used, you know, probably 50 or 60 hours a week, instead of the 10 or 11 hours a week that, a, a driven vehicle is used.\n\n**Elon Musk** (Co-Founder and CEO)\nSo, you know, typically, people will might drive their car for an hour and a half a day on average, so it's like 10 hours per week out of 168. But I think an autonomous vehicle is likely to be used probably five times as often, which means that you need to design the vehicle for much more wear and tear per unit of time and much more resilience. It's more like a commercial truck that's in continuous operation or close to continuous operation. That's how you design an autonomous vehicle. So we will have larger vehicles than the Cybercab in the future that are designed for full autonomy.\n\n**Elon Musk** (Co-Founder and CEO)\nAnd we've actually shown pictures of this, and in fact, have shown prototypes, so this is not exactly a secret. In fact, we've given people rides in them. So, you know, we're not keeping this, hiding this light under a bushel here. You know, it's like, we're literally saying what we're gonna do and have said what we're gonna do for a while. So, you know, I really think long term, we would really, the only vehicles that we'll make will be autonomous vehicles, with the exception of the next generation Roadster, which we're hoping to debut in April. Hopefully. It's gonna be something out of this world.\n\n**Travis Axelrod** (Head of Investor Relations)\nFantastic. The next question we'd unfortunately have to skip because it's not related to Tesla, and we would like to remind folks who use the Say Platform to please focus these questions on Tesla. So, with that in mind, we're gonna move on to the next question, which is: What is the current bottleneck to increase robotaxi deployment and personal use unsupervised FSD? The safety and performance of the most recent models, is it the safety and performance of the most recent models, or is it people to monitor the robotaxis in-car or remotely, or is there some other blocker? I don't know, Ashok, if you wanted to kick off on this one.\n\n**Ashok Elluswamy** (VP of AI Software)\nYeah. We have scaled the robotaxi service that's available to customers over the last year in order to just learn the scaling problems without having to like wait for the unsupervised. Basically, I had two, two goals. One is, like, learn as much as possible from the fleet with the safety monitors, and secondly, be laser focused with the engineering team to solve the unsupervised FSD problem. I think we did both. Like, by the end of last year, we, you know, we had a long tail of issues that we were able to churn through, and then, in the last couple of weeks, we had started our unsupervised robotaxi service to public customers in Austin. I think some customers took rides last week, and also the service continues today without any rear car or something like that.\n\n**Ashok Elluswamy** (VP of AI Software)\nSeparately, we did scale the fleet size in the Bay Area and in Austin, and through that, we learned, you know, issues with charging and other issues that we would have seen once we sort of like scaled the unsupervised fleet. So both are happening in parallel. A variant of the software that's used for the robotaxi service was shipped to customers with V14, and customers saw a huge jump in performance, like a lot of, you know, happy feedback from customers. So, and since then, we have improved the software significantly as well. And customers will continue to see with their own software releases that the software is so good that, you know, they're like screaming to remove the tire monitoring software because they're bored inside the car too much.\n\n**Lars Moravy** (VP of Vehicle Engineering)\nAdding to that a little bit with what Ashok said about learning about our charging and service needs. You know, we're using our vast network of charging and service centers that really only Tesla has in this space to jumpstart our infrastructure build-out needs to get ahead of robotaxi and autonomous vehicle demand. And we expect that because of this network, we are the only company capable of scaling at the rate that is needed for the tsunami of autonomy that is coming.\n\n**Elon Musk** (Co-Founder and CEO)\nYeah.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Moving on to the next question. After the unveil of the Cybertruck, Elon stated that if it didn't sell well, Tesla would build a more conventional-looking pickup. How practical would it be to create this new design on the Cybertruck architecture, and could it be conveniently built on the existing production lines?\n\n**Lars Moravy** (VP of Vehicle Engineering)\nActually, in its segment, Cybertruck continues to be a leader and is selling more than any other electric truck out there, while our competition continues to pull back. But to the question itself, from a line standpoint, we always design our lines to be super flexible. We built 3 and Y on the same line. We built S and X on the same line, still, showing that we can do that. The Cybertruck line was designed in the same way and is one of our most fully ready-for-autonomy platforms.\n\n**Elon Musk** (Co-Founder and CEO)\nYeah. But yeah, we will transition the Cybertruck line to just a fully autonomous line. And there's obviously a market there for cargo delivery, like you say, like localized cargo delivery within a city, within a few hundred miles, something like that. There's a pretty... There's a lot of cargo that needs to move locally within a city and an autonomous Cybertruck could be very useful for that.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Moving on to the next question. Regarding Optimus, could you share the current number of units deployed in Tesla factories and actively performing production tasks? What specific roles or operations are they handling, and how has their integration impacted factory efficiency or output?\n\n**Elon Musk** (Co-Founder and CEO)\nYeah, I mean, we're still very much at the early stages of Optimus. It's an R&D. It's still in the R&D phase. So, we have had Optimus do some basic tasks in the factory, but as we iterate on new versions of Optimus, we deprecate the old versions. And so it's not. I wouldn't say it's like. It's not in usage in our factories in a material way. It's more so that the robot can learn. We wouldn't expect to have, you know, any kind of significant Optimus production volume until probably the end of this year.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat, and-\n\n**Ashok Elluswamy** (VP of AI Software)\nAdding to it, like, Optimus Gen 3 is an awesome robot that-\n\n**Elon Musk** (Co-Founder and CEO)\nIt is awesome.\n\n**Ashok Elluswamy** (VP of AI Software)\nYeah, it's an awesome robot that minimizes any differences. It's basically, it looks like a human. People could be easily confused that it's a human. And this helps our strategy for the AI, too, because you can learn from how humans do these tasks, and it's very easy to teach the robot to do in the same way as opposed to previous robots.\n\n**Elon Musk** (Co-Founder and CEO)\nYeah, I mean, I guess one thing I should say, like, is, you know, there's a lot of news of like, you know, various companies announcing layoffs and whatnot, but, you know, at our Tesla factory in Fremont, we actually expect to increase headcount over time, and to significantly increase output from our factories. So yeah, we don't have any layoff plans. We expect to actually increase headcount.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. The next question, similar to the other, autonomy questions, but slightly different. When is FSD going to be 100% unsupervised?\n\n**Elon Musk** (Co-Founder and CEO)\nWell, it is 100% unsupervised. FSD is 100% unsupervised. I mean, we obviously have cars operating with no one in them and no safety monitor and no follow car or anything like that in Austin right now. For customers, you know, we're being very, just very cautious with the rollout. I mean, with each successive version, as we prove it out and we make sure that there are no sort of unique issues in, you know, in particular cities, 'cause, like, sometimes you get, like, some very, you know, difficult intersection, and it'll be an intersection where a lot of humans have accidents, by the way.\n\n**Elon Musk** (Co-Founder and CEO)\nThere's, like, some pretty nutty intersections where there are a lot of humans make mistakes and have accidents in various cities. So we want to make sure that, you know, FSD can handle those unusual intersections. Like if you take L.A., for example, where Wilshire and Santa Monica combine is like there's about, I don't know, 20 traffic lights, and people are constantly having accidents there. So, you want to make sure that FSD can handle unique things in a particular city, so... And we're also just being paranoid about safety. But with each successful release of FSD, we will reduce the amount of driver monitoring that's needed, proportionate to the safety of the FSD build.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. As it relates to Robotaxi, what has surprised you about the rollout so far? We've talked about what's constrained the fleet expansion to date, but it appears there are 200 vehicles based on public tracking. Is that something that we can confirm?\n\n**Ashok Elluswamy** (VP of AI Software)\nI wouldn't say there's anything that, like, really surprised us, because, because we are a large fleet, we had all the metrics, so there was no sort of, sort of a surprise. It was just continued work to grind down on the long tail of issues, and that's what enabled us to launch the unsupervised service in Austin.\n\n**Elon Musk** (Co-Founder and CEO)\nYeah, and I mean, in terms of Robotaxi vehicles carrying paid customers, I think we're well over 500 at this point between the Bay Area and Austin.\n\n**Ashok Elluswamy** (VP of AI Software)\nYeah, there's yeah, varying amounts of like vehicles, depending on the load, but yeah, you can have like more vehicles during like peak times and then like fewer vehicles in the off hours.\n\n**Elon Musk** (Co-Founder and CEO)\nYeah. This will probably, you know, double every month type of thing. It's gonna, it's on an exponential curve.\n\n**Vaibhav Taneja** (CFO)\nI mean, one other thing, people forget that, you know, we've been deliberate on all this, in the sense that we have the supporting infrastructure already been in place, whether it's service centers, charging. Yes, we'll have to augment as the fleet grows, depending upon the density of where the demand is and whatnot, but it's not something like we just stumbled upon it, and we're starting to... We've been at it for years. Yes, not every city is designed the same way. Same thing, our infrastructure is also not the same in every city, but you have to give us credit that it's been a journey. And like Lars said, if there's some company which can do it, we've already been at it, so we should be able to deliver much better.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. The next question is about chase cars, which we already covered. So moving on to the last question, Elon, you've been spending significant personal time on Tesla's chip design.\n\n**Elon Musk** (Co-Founder and CEO)\nYeah.\n\n**Travis Axelrod** (Head of Investor Relations)\nWhat was the forcing function behind this increased involvement? And do you think external chip sales will represent a significant portion of Tesla's valuation by the end of the decade?\n\n**Elon Musk** (Co-Founder and CEO)\nWell, I mean, I tend to spend time on whatever the most critical issue is for the company, and completing the AI5 chip design and having it be a great chip is arguably the number one most critical thing to get done, which is why I'm spending more time on that than currently anything else at Tesla. Spend pretty much every Saturday on this and a chunk of every Tuesday. So it's like a... You know, if I'm spending my Saturdays on something, it's gonna be something pretty important. I do think AI5 will be a very good chip, and I'm quite confident about the design at this point.\n\n**Elon Musk** (Co-Founder and CEO)\nAnd then AI6, which will follow that, it'll be aspirationally would follow that in under a year, will, will be yet another big leap beyond AI5. So I feel pretty good about our chip strategy right now. But in terms of selling it outside of Tesla, we first need to make sure we have enough chips for all of our vehicle production and all of our Optimus production. And then we will actually use the AI5 chips in our data centers. We already use the AI4 chips in our data centers. So when we do training, it's a combination of the AI4 chips and NVIDIA hardware, primarily that we do training with.\n\n**Elon Musk** (Co-Founder and CEO)\nSo, but you say by the end of the decade, I mean, it's like things are changing so fast that it's hard to imagine, like, what happens at the end of the decade. I mean, we might... I mean, when I look ahead at, say, what's the limiting factor for Tesla growth, if you go, say, three or four years out, I think it actually is chip production. Is there enough AI, okay, enough AI logic and enough AI, and enough memory, enough RAM for our volume?\n\n**Elon Musk** (Co-Founder and CEO)\nAnd right now, I see that as being the thing that probably limits our growth in three or four years, which probably would imply that we're not selling chips outside of Tesla, because we need them. And in fact, I think it's gonna make sense, and this is definitely gonna be a sort of a controversial thing, but I think Tesla needs to build a Terafab.\n\n**Elon Musk** (Co-Founder and CEO)\nYou know, I mentioned this at the shareholder meeting, but even when we look at the best case output of all of our key suppliers, and I'd say even they're beyond suppliers, they're like strategic partners, like Samsung, TSMC, and Micron, and we say, like: \"What's the most you could possibly make?\" Then it's not enough. So I think in order to remove the constraint, the probable constraint in three or four years, we are gonna have to build a Tesla Terafab, a very big fab that includes logic, memory, and packaging, domestically. And that's actually also gonna be very important to ensure that we are protected against any geopolitical risks.\n\n**Elon Musk** (Co-Founder and CEO)\nI think people may be underweighting some of the geopolitical risks that are gonna be a major factor in a few years. So, now, you know, a lot of people are like, \"That's crazy. Fabs are really hard.\" I'm like: \"Yes, I know fabs are really hard. I don't think they're easy.\" But,\n\n**Lars Moravy** (VP of Vehicle Engineering)\nWe do hard things.\n\n**Elon Musk** (Co-Founder and CEO)\nWe do a lot of hard things. You know, we didn't used to have car factories, that we didn't use to have battery cell factories or lithium refineries or, you know, Megapack factories or, you know, all these other things. We figured it out. So I think we-- if we don't do the Tesla Terafab, we're gonna be limited by supplier output of chips. And I think maybe memory is an even bigger limiter than AI logic. So you know, for example, we have chip supply deals with TSMC in Arizona and Samsung in Texas, but currently there are no advanced memory fabs at scale in the United States. There are zero, literally zero.\n\n**Elon Musk** (Co-Founder and CEO)\nHopefully, you know, Micron will have something going in a few years, because they're all headquartered in Idaho, you know, where they make a lot of potato chips, but they need to make computer chips, too. So, anyway, we're working with our strategic partners on the chip front, memory and logic, but I think we've got to also try our hand at building a large-scale fab that integrates logic, memory, and packaging. And if we don't do that, we're just gonna be fundamentally limited by supply chain, especially if there's some geo- in a worst-case geopolitical situation, it would be quite a severe situation. So I think -- quite frankly, it'd be crazy not to try the Terafab.\n\n**Elon Musk** (Co-Founder and CEO)\nYeah.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat.\n\n**Elon Musk** (Co-Founder and CEO)\nWe'll have a bigger announcement on this in the future.\n\n**Travis Axelrod** (Head of Investor Relations)\nAwesome. With that, we're gonna move on to analyst questions. The first analyst is Emmanuel from Wolfe Research. Emmanuel, please feel free to unmute yourself.\n\n**Emmanuel Rosner** (Managing Director and Senior Autos and Auto Tech Analyst)\nGreat. Thank you so much. It's Emmanuel Rosner from Wolfe Research. My first question is on the CapEx. You signal a pretty large increase to over $20 billion for this year. Was hoping to better understand where the investments are going. Any way of two-dimension for us, which of the product line or technologies account for the bulk of the increase? And also, do you view this as, like, one-time in nature, 2026, or I guess, how much of this is an ongoing level of high spending for a number of years? And then just finally, still on that, with that level of spending, you're going to be burning cash. How, what should we think about your cash balance or any other way to finance this?\n\n**Vaibhav Taneja** (CFO)\nYeah. So, yeah, Emmanuel, I tried to put this in my opening remarks, too, but I'll try and go a little bit deeper. There's about six factories which we are starting production in this year, so there's a lot of cash CapEx, which is going into that. Then, as we are trying to scale Optimus, we need a lot more compute, so we're putting more money towards compute as well.\n\n**Elon Musk** (Co-Founder and CEO)\nFor training.\n\n**Vaibhav Taneja** (CFO)\nFor training.\n\n**Elon Musk** (Co-Founder and CEO)\nYeah.\n\n**Vaibhav Taneja** (CFO)\nThen we're also gonna be spending money to expand the capacity at, you know, at existing factories. On top of it, you know, just keep in mind that we're not-- none of these numbers, which I shared of $20 billion factor in anything to do with the solar fab or the semiconductor chip fab. Those would be, as Elon mentioned, would come later on. And you think your second part of your question was, is this one-off or would we expect more? I think we're getting into this investment phase because we have big aspirations. And when you look at it, some of these aspirations are, I call them as infrastructure play, especially if you have to do a chip fab and we have to do a solar cell manufacturing fab, those are infrastructure plays.\n\n**Vaibhav Taneja** (CFO)\nAnd that funding takes a little bit longer, and you would be in an investment cycle for a little bit longer. Initially, third part of your question was: How are we gonna fund it? Initially, obviously, we have over $44 billion of cash and investments on the books, so we'll use our internal resources, but there are ways where we can fund it, especially when we look at the robotaxi fleet, because, you know, anytime you have a consistent stream of cash flow, you can go and get money from the banks. And we have had conversations with banks about it, and that is something how we're gonna do it.\n\n**Vaibhav Taneja** (CFO)\nAnd then on the infrastructure play side, yeah, like I said, we don't have a number yet, but given that it's an infrastructure play, it's a longer tail, we will have to look at a little bit more in terms of how we fund it, whether it's through more debt or other means.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Our next question comes from, Andrew, from Morgan Stanley. Andrew, please feel free to unmute yourself.\n\n**Speaker 8** (Analyst)\nGreat. Thanks so much for taking the question. I just wanna start on the xAI investment that you guys announced today. You know, you talked about there being some collaboration, you know, between the companies. So I'm just hoping to get more information or if you're hoping that you could shed more light on what that looks like and maybe how the work xAI is doing can be leveraged at Tesla and vice versa?\n\n**Vaibhav Taneja** (CFO)\nYeah, I mean, if you looked at the disclosure, which we also put in there, we do talk about this is literally a furtherance of our Master Plan Four. And even today, if you look at Tesla vehicles, we are using Grok in there. And as we look at things, whether we can do it ourselves, yes, there are a lot of things which we can do ourselves, but if there are things which xAI can help accelerate our progress, then why should we not do that? And that is the reason why we've gone ahead with such an investment, because this is part of the strategic initiative. 'Cause as it is, if you remember, I talked about how many things which we are doing ourselves.\n\n**Vaibhav Taneja** (CFO)\nIf there are ways and means we can find efficient ways for others to help us, and xAI literally fits into that mold, so that's why we went ahead with it.\n\n**Elon Musk** (Co-Founder and CEO)\nWe just had, like, a lot of investors ask us to do this. There was, like, a lot of, you know, investor Tesla shareholders said, like, we should invest in xAI. So that's like, we're just doing what shareholders, like, asked us to do, pretty much. Grok will be, you know, I think, very helpful in, say, maximizing the efficiency of the management of a large autonomous fleet. So, I mean, if you've got a autonomous fleet that's, you know, in the future, 10 million vehicles or tens of millions of vehicles, then optimizing the efficient use of that fleet, Grok will be, I think, way, way better than any heuristic solution, or sort of manually managed solution.\n\n**Elon Musk** (Co-Founder and CEO)\nAnd if you say you're managing, say, a large team of Optimus robots to build a factory or build a refinery, you know, and, say, hypothetic, like a... This is a hypothetical example, a rare earth ore refinery, which we do desperately need in our, in, America. Then, you'd, you say, \"Well, who like, what's gonna organize, the Optimus robots to build that ore refinery?\" That would. You know, you need, kind of need a, an orchestra conductor. And so then Grok would be, kind of the orchestra conductor for the Optimus robots to build the, hypothetically, an, a rare. It might, it might not be hypothetical in the future. I'm just saying it's not, not currently in our plans.\n\n**Elon Musk** (Co-Founder and CEO)\nBut, you know, we do need a lot more ore refining capacity in the U.S. So then, what, what's gonna manage, let's say, 1,000 Optimus robots, to do-\n\n**Travis Axelrod** (Head of Investor Relations)\nYou're on mute right now, so I'm not sure if you're trying to ask a follow-up question. We're gonna move on to the next question, which is coming from Dan Levy at Barclays.\n\n**Dan Levy** (Senior Equity Research Analyst)\nGreat. Great, thank you. Elon, you talked about some of the constraints on memory. Given the very tight supply, are there any near-term constraints on procuring memory? And if there are, to what extent could you look at modifying the functionality in the vehicles, similar to what you did in 2021 when we saw shortages on MCUs, and maybe how are you thinking about bridging in the next few years?\n\n**Elon Musk** (Co-Founder and CEO)\nWell, the Tesla AI is very compute efficient and very memory efficient. You know, so I think one of the metrics one should consider for any given AI model is the intelligence per gigabyte. Especially when you're constrained on RAM, having an AI that has very high intelligence density per gigabyte. So you can say, like, what—like, for a given number of gigabytes, how much functionality can you get out of it? I actually think Tesla is ahead of the rest of the world in intelligence density of AI by an order of magnitude or more.\n\n**Elon Musk** (Co-Founder and CEO)\nLike, this is gonna sound like a pretty bold statement, but I kind of know what the, you know, what the intelligence efficiency of the, of the big models are like Grok and, like, honestly, and you know, a bunch of the other models. And Tesla's AI is like, in terms of its memory efficiency, I think more than an order of magnitude better. So that puts us in a pretty good position, actually, for scaling. And we do think that there is. We do have a solution for logic and memory, for, let's say, the next roughly three years.\n\n**Elon Musk** (Co-Founder and CEO)\nBut if you start going beyond three years, and we look at the scaling plans, and how many fabs are getting built, and especially if you factor in geopolitical uncertainty, you know, there's always, there's always risk that, maybe the, those chips don't arrive, that people were expecting to arrive. So that's, that's why I think we, we need to have more fab capacity in the U.S., just in case, you know, chips don't stop arriving for any reason. But, you know, this, this is, this is really existential for, for Tesla, because, if... You know, Optimus is completely useless without an AI chip. It's not like- you know, at least the cars, we can put steering wheels and pedals in, or retrofit them if need be.\n\n**Elon Musk** (Co-Founder and CEO)\nBut, but Optimus is just a mannequin without, you know, it's like the Tin Man or whatever from The Wizard of Oz, but, but even worse, at least the Tin Man could walk. Optimus won't even be able to - it would just sit there without an AI chip. So we've got a good solution for a significant scale through, you know, for the next roughly three years. Beyond that, we will be supplier limited, and so we've got to figure out some game plan to not be supplier limited.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Our next question is gonna come from George at Canaccord. George, please feel free to unmute yourself.\n\n**Speaker 7** (Analyst)\nHi, everyone. Thank you for taking my question. So, yeah, there's been a surge of startups, particularly from China, entering the humanoid market, and just wondering what the long-term competitive advantages that keep Tesla ahead are, and how, based on what you've seen, will Optimus fundamentally differ from these competitors? Thank you.\n\n**Elon Musk** (Co-Founder and CEO)\nWell, I do think that by far the biggest competition for humanoid robots will be from China. China is incredibly good at scaling manufacturing. Actually quite good at AI, as you can see from, you know, the open source or not the open source, but the sort of—I guess some of them are open, actually. But basically, the models that China is distributing for free are actually quite good, and they keep getting better. So China is very good at AI, very good at manufacturing, and will definitely be the toughest competition for Tesla. To the best of our knowledge, we don't see any significant competitors outside of China. But China will definitely be tough competition.\n\n**Elon Musk** (Co-Founder and CEO)\nThere's no two ways about it. So, I always think, like, people sort of outside of China kind of underestimate China. China's an ass kicker next level. So, you know, I guess, you know, we're gonna build. We think Optimus will be much more capable than any robot that we are aware of under development in China. So we think we'll be ahead in terms of the real-world intelligence, the electromechanical dexterity, especially the hand design, which is by far the hardest thing in the robot. And in fact, I'd say there's really three hard things about humanoid robots.\n\n**Elon Musk** (Co-Founder and CEO)\nBuilding an incredible hand that has the same degrees of freedom and dexterity as a human hand is an incredibly difficult engineering challenge. Then there's the real-world AI and scaling production. Those are the three hardest problems by far for humanoid robots. I think Tesla is the only company that actually has all three of those components. So yeah.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. And our last question is gonna come from Colin, at Oppenheimer. Colin, please feel free to unmute yourself.\n\n**Speaker 9** (Analyst)\nThanks so much. Guys, you know, you talked a lot about the CapEx spend, but, you know, this is an incredibly ambitious technology development program that you're talking about. Can you talk a little bit about the R&D spend and how you're thinking about the synergies of the different components, you know, particularly on the hardware side? You know, if you think about, you know, batteries into chips into memory, and the efficiency of the system, and what sort of advantages you think you'll end up getting out of, you know, some of these purpose-built devices that you'll end up integrating into multiple end markets?\n\n**Elon Musk** (Co-Founder and CEO)\nWell, really what we're trying to do is make sure that we can scale to very high volume with autonomous vehicles, with humanoid robots, and that we address geopolitical risk. Which I think, you know, there's so many companies out there that are asleep at the switch with regard to geopolitical risk. They're like... or they just have their head in the sand and hope nothing bad will happen. I'm way more paranoid than that. I always think of Andy Grove's famous statement, \"Only the paranoid survive.\" You know, why did he come up with that statement at Intel? Hmm, let's think. So I think there's a lot of wisdom in that statement.\n\n**Elon Musk** (Co-Founder and CEO)\nSo we're gonna be paranoid and make sure that we can continue to build batteries and robots and AI chips no matter what happens. And companies that don't do that, a bunch of them will cease to exist.\n\n**Vaibhav Taneja** (CFO)\nYeah, I mean, remember, all this comes out of necessity. It's not that we want to do it-\n\n**Elon Musk** (Co-Founder and CEO)\nYeah\n\n**Vaibhav Taneja** (CFO)\nit's just we have, we have no choice.\n\n**Elon Musk** (Co-Founder and CEO)\nYeah, I mean, we built the most advanced lithium refinery in the world, by the way. So it's not just... Like, our lithium refinery in Corpus Christi is not just a copy of what others have done. It's an entirely new process that is fundamentally more efficient and more advanced than anything else in the world. The same is true of our cathode refinery here in Austin. And we wish others would build this. Can other people please, for the love of God, -\n\n**Vaibhav Taneja** (CFO)\nHelp\n\n**Elon Musk** (Co-Founder and CEO)\nin the name of all that is holy, can others please build this, build this stuff?\n\n**Lars Moravy** (VP of Vehicle Engineering)\nIt's not the first time you asked.\n\n**Vaibhav Taneja** (CFO)\nExactly. I mean, this is not the first time you've said something like this.\n\n**Elon Musk** (Co-Founder and CEO)\nLike, why do we have to build these things? Why can others not also please, can someone else build these things? Well, I mean, this is a, it's very hard to build these things. And we build them out of desperation, not because nobody else is building lithium refineries and cathode refineries. You know, we're pretty much the largest, not just the largest, but also the only lithium refinery and cathode refinery in America. So, yeah. So we're making moves to make sure that no matter what happens, Tesla will prosper.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Unfortunately, that's all the time we have for Q&A today. We really appreciate everyone's questions, and we look forward to talking to you next quarter. Thank you very much, and goodbye.\n\n**Elon Musk** (Co-Founder and CEO)\nVery cool.",
      "fetched_at": "2026-02-04T15:39:04.997Z"
    },
    {
      "ticker": "TSLA",
      "title": "Tesla, Inc. (TSLA) Q3 FY2025 earnings call transcript",
      "published_date": "Oct 22, 2025, 5:30 PM EDT",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/TSLA/earnings/TSLA-Q3-2025-earnings_call-366307.html",
      "content": "**Travis Axelrod** (Head of Investor Relations)\nGood afternoon, everyone, and welcome to Tesla's third quarter 2025 Q&A webcast. My name is Travis Axelrod, Head of Investor Relations, and I'm joined today by Elon Musk, Vaibhav Taneja, and a number of other executives. Our Q3 results were announced at about 3:00 P.M. Central Time in the update deck we published at the same link as this webcast. During this call, we will discuss our business outlook and make forward-looking statements. These comments are based on our predictions and expectations as of today. Actual events or results could differ materially due to a number of risks and uncertainties, including those mentioned in our most recent filings with the SEC. We urge shareholders to read our definitive proxy statement, which contains important information about the matters to be voted on at the 2025 annual meeting.\n\n**Travis Axelrod** (Head of Investor Relations)\nDuring the question and answer portion of today's call, please limit yourself to one question and one follow-up. Please use the raise hand button to join the question queue. Before we jump into Q&A, Elon has some opening remarks. Elon?\n\n**Elon Musk** (CEO)\nThank you. We're at a critical inflection point for Tesla and our strategy going forward as we bring AI into the real world. I think it's important to emphasize that Tesla really is the leader in real-world AI. No one can do what we can do with real-world AI. I have pretty good insight into AI in general. I think that Tesla has the highest intelligence density of any AI out there in the car, and that is only going to get better. We're really just at the beginning of scaling quite massively Full Self-Driving and robotaxi and fundamentally changing the nature of transport. I think people just don't quite appreciate the degree to which this will take off. Honestly, it's going to be like a shock wave. The cars are all out there.\n\n**Elon Musk** (CEO)\nThere are, you know, we have millions of cars out there that, with a software update, become Full Self-Driving cars. You know, we're making a couple million a year. In fact, with the advent of what we see now as a clarity on achieving Full Self-Driving, unsupervised Full Self-Driving, I should say, I feel confident in expanding Tesla's production. That is our intent to expand as quickly as we can our future production. I was reticent to do that until we had clarity on achieving unsupervised Full Self-Driving. At this point, I feel like we've got clarity and it makes sense to expand production as fast as we reasonably can. We're also making a huge impact on the energy sector with battery storage. With both the Powerwall and especially with the Megapack, we are dramatically improving the ability to generate more energy from the grid.\n\n**Elon Musk** (CEO)\nLet me sort of talk a little bit about that, which is if you look at total U.S. energy capability, for example, there's roughly a terawatt of continuous power available in the U.S. The average usage over a 24-hour cycle is only half a terawatt because of the big difference between day and night usage. If you buffer the energy with batteries, you can effectively double the energy output in the United States just with batteries building no incremental power plants. It's very difficult to build power plants. They take a long time. There's a lot of permitting. It's not an industry that's used to moving fast. We see the potential there for Tesla battery packs to greatly improve the energy output per year for any given grid, U.S. or otherwise.\n\n**Elon Musk** (CEO)\nWe're also on the cusp of something really tremendous with Optimus, which I think is likely to be, or has potential to be, the biggest product of all time. It's a difficult project. It's worth noting that it's not like it's just automatic. I'm unaware of any robot program by Ford or GM or any of our U.S. sort of car companies. People, I think, maybe think of Tesla as a car company. We mostly make cars and battery packs. It's not just like an obvious fall-off-a-log thing to make Optimus. We do have the ingredients of real-world AI and exceptional electrical and mechanical engineering capabilities and the ability to scale production, which I don't think anyone else has all of those ingredients. With version 14 of self-driving, people, you can see the reactions of people online. They're quite amazed. Actually, anyone in the U.S.\n\n**Elon Musk** (CEO)\ncan get version 14 if they just go and select, \"I want the advanced software\" in their car. If you're listening right now and you'd like to try it out, just go in settings and say, \"I want the advanced software,\" and you will get version 14. On the Megapack front, we unveiled Megablock, Megapack 3. We also have exciting plans for Megapack 4. Megapack 4 will incorporate a lot of what is normally in a substation and be able to output at probably 35 kilovolts directly. This greatly improves our ability to deploy Megapack because it's not dependent on building a substation of 335 kV for Megapack 4. That'll be the engineering priority for Megapack. We look forward to unveiling Optimus V3, probably in Q1. I think it'll be ready for it to show off. That, I think, is going to be quite remarkable.\n\n**Elon Musk** (CEO)\nIt won't even seem like a robot. It'll seem like a person in a robot suit, which is kind of how we started off with Optimus. It'll seem so real that you'll need to like poke it, I think, to believe that it's actually a robot. Obviously, the real-world intelligence we've developed for the car, most of that transfers to Optimus. It's a very good starting point. In conclusion, we're excited about the updated mission of Tesla, which is sustainable abundance. Going beyond sustainable energy to say sustainable abundance is the mission, where we believe with Optimus and self-driving that you can actually create a world where there is no poverty, where everyone has access to the finest medical care. Optimus will be an incredible surgeon, for example. I'd imagine if everyone had access to an incredible surgeon.\n\n**Elon Musk** (CEO)\nI think there's, you know, of course, we need to make sure Optimus is safe and everything. I do think we're headed for a world of sustainable abundance. I'm excited to work with the Tesla team to make that happen.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Thank you very much, Elon. Vaibhav also has some opening remarks.\n\n**Vaibhav Taneja** (CFO)\nThanks, Travis. Q3 was a special quarter at multiple levels. We set new records not just for deliveries and deployments, but also around a range of financial metrics from total revenues, energy gross profit, energy margins, to fresh free cash flow. This was the result of continued confidence of our customers in our products and the relentless efforts by the Tesla team. The strength in deliveries was attributed to strong performance across all regions. Greater China and APAC were up sequentially 33% and 29% respectively. North America was up 28%, while EMEA was up 25%. The pace in deliveries was the function of continued excitement around the new Model Y.\n\n**Vaibhav Taneja** (CFO)\nWe had previously talked about 2025 being the year of the Y and have since delivered on that promise with the new Model Y released in Q1, followed by Model Y long-wheelbase and performance, and more recently, Standard Y in North America and EMEA. We're now operating our robotaxi in two markets, Austin and most Bay Area cities. We've already expanded our coverage area in Austin three times since the initial launch and are on pace to continue expanding further. Unlike our competitors, our robotaxi fleet blends in the markets we operate in since they don't have extra sensor sets or peripherals which make them stick out. This is an underappreciated aspect of our current vehicle offerings, which are all designed for autonomous driving. We feel that as people experience the supervised FSD at scale, the demand for our vehicles, like Elon said, would increase significantly.\n\n**Vaibhav Taneja** (CFO)\nOn the FSD adoption front, we've continued to see decent progress. However, note that total paid FSD customer base is still small, around 12% of our current fleet. We're working with regulators in places like China and EMEA to obtain approvals so that we can get FSD in those regions as well. Now, covering a little bit on the financial side, automotive revenues increased 29% sequentially in line with the growth in deliveries. While regulatory credits declined sequentially, we entered into new contracts and continued delivery on previously entered contracts. Our automotive margins, excluding credits, increased marginally from 15% to 15.4%, which was attributed to improvements in material cost and better fixed cost absorption due to higher volumes. The energy storage business continued to deliver with record deployments, gross profit, and margins.\n\n**Vaibhav Taneja** (CFO)\nAs discussed before, this business has a bigger impact from tariffs, as measured by a percentage of COGS, since currently all sales procured are from China, while we're still working on other alternatives. However, as the ramp-up of Mega Factory Shanghai is happening, this is helping us avoid tariffs because we are using this factory to supply the non-U.S. demand. Like Elon said, you know, grid-scale storage, the only way we can get to electricity fastest is by using storage. The other thing to keep in mind is we are seeing headwinds in this business given the increase in competition and tariffs. The total tariff impacts for Q3 for both businesses were in excess of $400 million, generally split evenly between them. Services and other demonstrated a marked improvement sequentially. This was a function of improvements primarily in our insurance and service center businesses.\n\n**Vaibhav Taneja** (CFO)\nNote that while small, our robotaxi costs are included within services and other, along with our other businesses like paid Supercharging, used car, parts and merchandise sales, etc. Our operating expenses increased sequentially. The largest increase included in restructuring and other related to certain actions undertaken to reduce cost and improve efficiency through convergence of our AI chip design efforts. Additionally, we incurred legal expenses related to proceedings in certain legal cases, as well as incremental costs incurred in preparation for our shareholder meeting. Such costs are recorded within SG&A. Further, our employee-related spend is increasing, especially in R&D, as we have recently granted various performance-based equity awards to employees working on AI initiatives, and therefore such spend will continue to increase going forward.\n\n**Vaibhav Taneja** (CFO)\nOur other income decreased sequentially, primarily from mark-to-market adjustments on BTC holdings, which was a much smaller gain of $80 million in Q3 versus $284 million in Q2, with the rest of the movement attributable to FX movements in the quarter. Our free cash flow for the quarter was approximately $4 billion, which was yet another record. Our total cash and investments at the end of the quarter were over $41 billion. On the CapEx front, while we are expecting to be around $9 billion for the current year, we're projecting the numbers to increase substantially in 2026 as we prepare the company for the next phase of growth in terms of not just our existing businesses, but our bets around AI initiatives, including Optimus. In conclusion, note that bringing AI into the real world is hard, but we have never shied away from doing what is hard.\n\n**Vaibhav Taneja** (CFO)\nWe are extremely excited about the future and are laying down the foundation, the benefits of which will be realized over years to come. I would like to end by thanking the Tesla team, our customers, our investors, and supporters for the continued belief in us.\n\n**Travis Axelrod** (Head of Investor Relations)\nThank you very much, Vaibhav. Now let's go to investor questions. From say.com, the first question is, what are the latest robotaxi metrics, fleet size, cumulative miles, rides completed, intervention rates, and when will safety drivers be removed? What are the obstacles still preventing unsupervised FSD from being deployed to customer vehicles?\n\n**Elon Musk** (CEO)\nI'll start off with that, and then Ashok can elaborate. We are expecting to have no safety drivers in at least large parts of Austin by the end of this year. Within a few months, we expect to have no safety drivers at all, at least in parts of Austin. We're obviously being very cautious about the deployment. Our goal is to be actually paranoid about deployment because obviously even one accident will be front-page headline news worldwide. It is better for us to take a cautious approach here. We do expect to have no safety drivers in the car in Austin within a few months. I think that's perhaps the most important data point. We do expect to be operating robotaxi in, I think, about eight to ten metro areas by the end of the year. It depends on various regulatory approvals.\n\n**Elon Musk** (CEO)\nYou can actually, I think, most of our regulatory applications are online. You can kind of see them because they're public information. We expect to be operating in Nevada and Florida and Arizona by the end of the year. Ashok?\n\n**Ashok Elluswamy** (VP of Autopilot and AI Software)\nYeah. We continue to operate our fleet in Austin without anyone in the driver's seat, and we have covered more than a quarter million miles with that. In the Bay Area, where we still have a person in the driver's seat because of the regulations, we cross more than a million miles. We continue to see that the robotaxi fleet works really well. Customers are really happy, and there's no notable issues. On the customer side, customers have used Full Self-Driving supervised for a total of six billion miles as of yesterday. That's a big milestone. Overall, the safety continues to be very good. As Elon mentioned, we are on track to remove the person from inside the car altogether, starting with Austin.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. The next question is, what is the demand and backlog for Megapack, Powerwall, solar, or energy storage systems? With the current AI boom, is Tesla planning to supply power to other hyperscalers?\n\n**Mike Snyder** (VP of Energy and Charging)\nThanks. Demand for Megapack and Powerwall continues to be really strong into next year. We received very strong positive customer feedback on our Megapack product, which will begin shipping next year out of Houston. We're seeing remarkable growth in the demand for AI and data center applications as hyperscalers and utilities have seen the versatility of the Megapack product to increase reliability and relieve grid constraints, as Elon was talking about. We've also seen a surge in residential solar demand in the U.S. due to policy changes, which we expect to continue into the first half of 2026 as we introduce a new solar lease product. We also began production of our Tesla residential solar panel in our Buffalo factory, and we will be shipping that to customers starting Q1. The panel has industry-leading aesthetics and shade performance and demonstrates our continued commitment to U.S. manufacturing.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Thank you, Mike. Unfortunately, the next question is related to future products. This is not the appropriate venue to cover that, so we're going to have to skip it. The question after that is, what are the present challenges in bringing Optimus to market, considering app control software, engineering hardware, training general mobility models, training task-specific models, training voice models, implementing manufacturing, and establishing supply chains?\n\n**Elon Musk** (CEO)\nYeah, I mean, bringing Optimus to market is an incredibly difficult task, to be clear. It's not like some walk in the park at some point. I mean, actually, technically, Optimus can walk in the park right now. We do have Optimus robots that walk around our offices at our engineering headquarters in Palo Alto, California, basically 24 hours a day, seven days a week. Any visitors that come by, you actually can stop one of the Optimus robots and ask it to take you somewhere, and it'll literally take you to that meeting room or that location in the building. I don't want to downplay the difficulty of Optimus. It's an incredibly difficult thing. Especially, it's difficult to create a hand that is as dexterous and capable as the human hand, which is an incredible... The human hand is an incredible thing.\n\n**Elon Musk** (CEO)\nThe more you study the human hand, the more incredible you realize the human hand is and why you need four fingers and the thumb, why the fingers have certain degrees of freedom, why the various muscles are of different strengths, and the fingers are of different lengths. It turns out, actually, that those are all there for a reason. Making the hand and forearm, because most of the actuator, just like the human hand, the muscles that control your hand are actually primarily in your forearm. The Optimus hand and forearm is an incredibly difficult engineering challenge. I'd say it's more difficult than the rest of... From an electromechanical standpoint, the forearm and hand are more difficult than the entire rest of the robot. Really, in order to have a useful generalized robot, you do need an incredible hand. You need the real-world AI.\n\n**Elon Musk** (CEO)\nYou need to be able to scale up that production to have it be relevant, because it's not relevant if it's just a few hundred robots. You need to be able to make Optimus robots at volumes comparable to vehicles, if not significantly higher. If you're trying to make a million or something per year, trying to make a million Optimus robots per year, that manufacturing challenge is immense, considering that the supply chain doesn't exist. With cars, you've got an existing supply chain. With computers, you've got an existing supply chain. With a humanoid robot, there is no supply chain. In order to manufacture that, Tesla actually has to be very vertically integrated and manufacture very deep into the supply chain, manufacture the parts internally, because there just is no supply chain.\n\n**Elon Musk** (CEO)\nThis is the kind of thing where I'm like, if I put myself in the position of a startup trying to make a humanoid robot, I'm like, I don't know how to do it without an immense amount of manufacturing technology. That's why I think Tesla is in almost a unique, I think, unique position when you consider manufacturing technology, scaling, real-world AI, and a truly dexterous hand. Those are generally the things that are missing when you read about other robots that just don't have those three things. I think we can achieve all those things, those three things, with an immense amount of work. That is the game plan. My fundamental concern with regard to how much voting control I have at Tesla is, if I go ahead and build this enormous robot army, can I just be ousted at some point in the future?\n\n**Elon Musk** (CEO)\nThat's my biggest concern. That is really the only thing I'm trying to address with this. It's called compensation, but it's not like I'm going to go spend the money. It's just, if we build this robot army, do I have at least a strong influence over that robot army? Not control, but a strong influence. That's what it comes down to in a nutshell. I don't feel comfortable building that robot army if I don't have at least a strong influence.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Thank you. We've already covered robotaxi expansion. Unfortunately, the question after that is another future product question, so we're going to have to skip that. The next one, though, is, can you update us on the $16.5 billion Samsung chip deal in Taylor? Given the importance of semiconductors to autonomy in Tesla's AI-driven future, what gives you confidence Samsung can fulfill AI5 at Tesla's timelines and achieve relatively better yields and cost versus TSMC?\n\n**Elon Musk** (CEO)\nOkay, so I'm going to give quite a long answer to this question because I have to unpack this question and then answer the unpacked version. First of all, I have nothing but great things to say about Samsung. They're an amazing company. Samsung, it is worth noting, does manufacture our AI4 computer and does a great job doing that. Now with the AI5, I need to make a point of clarification relative to some comments I've made publicly before, which is we're actually going to focus both TSMC and Samsung initially on AI5. The AI5 chip design by Tesla is, I think it's an amazing design. I've spent almost every weekend for the last few months with the chip design team working on AI5. I don't hand out praise easily, but I have to say that I think the Tesla chip team is really designing an incredible chip here.\n\n**Elon Musk** (CEO)\nBy some metrics, the AI5 chip will be 40 times better than the AI4 chip. Not 40%, 40 times. Because we have a detailed understanding of the entire software and hardware stack, we're designing the hardware to address all of the pain points in software. I don't think there really is anyone that's doing this, the entire stack, all the way through real world, calibrating against the real world where you've got cars and robots in real world. We know what the chip needs to do, and just as importantly, we know what the chip doesn't need to do. To give you some examples here, with the AI5, we deleted the legacy GPU or the traditional GPU, which is in AI4. AI5 does not have, we just deleted the legacy GPU because it basically is a GPU. We also deleted the image signal processor.\n\n**Elon Musk** (CEO)\nThere's a long list of deletions that are very important. As a result of these deletions, we can actually fit AI5 in a half radical and with good margin for the traces from the memory to the chip, the Tesla chip accelerators, the ARM CPU cores, and the PCI blocks. This is a beautiful chip. I've poured so much life energy into this chip personally. I'm confident this is going to be a winner, next level. It makes sense to have both Samsung and TSMC focus on AI5. Technically, the Samsung fab has slightly more advanced equipment than the TSMC fab. These will both be made in the U.S., one TSMC in Arizona, Samsung in Texas. We're going to make, starting off, just to be confident of having our goal, explicit goal is to have an oversupply of AI5 chips.\n\n**Elon Musk** (CEO)\nBecause if we have too many AI5 chips for the cars and robots, we can always put them in the data center. We already use AI4 for training in our data center. We use a combination of AI4 and NVIDIA hardware. We're not about to replace NVIDIA, to be clear, but we do use both in combination, AI4 and NVIDIA hardware. The AI5 excess production, we can always put in our data centers. NVIDIA keeps improving. The challenge that they have is that they've got to satisfy a large range or a lot of requirements from a lot of customers. Tesla only has to satisfy requirements from one customer. That's Tesla. That makes the design job radically easier and means we can delete a lot of complexity from the chip. I can't emphasize how important this is.\n\n**Elon Musk** (CEO)\nWhen you look at the various logic blocks in the chip, as you increase the number of logic blocks, you also increase the interconnections between the logic blocks. You can think of it like just highways, like how many highways do you need to connect the various parts of the chip? Especially if you're not sure how much data is going to go between each logic block on the chip, you kind of end up having giant highways going all over the place. It becomes an almost impossibly difficult design problem. NVIDIA has done an amazing job of dealing with almost an impossibly difficult set of requirements. In our case, we're going for radical simplicity.\n\n**Elon Musk** (CEO)\nThe net effect is that I think AI5 will be the best performance per watt, maybe by a factor of two or three, and the best performance per dollar for AI, maybe by a factor of 10. The proof's in the pudding. Obviously, we need to actually get this chip made and made at scale. That's what it looks like.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Thank you, Elon. We've already covered unsupervised FSD. The next question is, instead of trying to replace hardware three with hardware four, why not give an equal incentive to trade in for a new vehicle?\n\n**Vaibhav Taneja** (CFO)\nYeah, we've not completely given up on Hardware 3. However, over the last year, we've offered the customers the option to transfer Full Self-Driving to their new vehicle, which at times we've been running some promotions. If they got Full Self-Driving, they can get better preferential rates. We've been definitely taking care of this, but we do want to solve autonomy first. We will come back with a way to take care of these customers. These customers are very important. They were the early adopters. For what it's worth, my daily commuter is a Hardware 3 car, which I use Full Self-Driving on a daily basis. We will definitely take care of you guys.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Thank you.\n\n**Ashok Elluswamy** (VP of Autopilot and AI Software)\nOnce the V14 release series is fully done, we are planning on working on a V14 Lite version for Hardware 3, probably expected in Q2 next year.\n\n**Travis Axelrod** (Head of Investor Relations)\nAwesome. Thanks, Ashok. All righty. Our final question from Say is, how long until we see self-driving Tesla semi-trucks? Could you see this technology replacing trains?\n\n**Travis Axelrod** (Head of Investor Relations)\nYeah, I guess I'll start with that in terms of the semi-production plan and schedule. The factory is going on schedule. We've completed the building and are installing the equipment now. We've got our fleet of validation trucks driving on the road. We'll have larger builds towards the end of this year and then our first online builds in the first part of next year, ramping into the Q2 timing with real volume coming in the back half of the year. That's going quite well. That's the first step to obviously getting autonomous trucks on the road. In terms of trains, you know they're really great for long point-to-point deliveries. They're super efficient, but you know that last mile, the load unload, can be better served for shorter distances with autonomous semis, and that would be great.\n\n**Travis Axelrod** (Head of Investor Relations)\nWe do expect that to probably shift as we, you know really, as Elon said, change the way transportation is considered. We're looking forward to that timeline. Ashok, I know you can take the Full Self-Driving part.\n\n**Ashok Elluswamy** (VP of Autopilot and AI Software)\nCurrently, the team is like super focused on solving for passenger vehicle autonomy. That said, the same technology will extend quite easily to the semi-truck once we have a little bit of data from the semi-trucks.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. We will move over to analyst questions. The first question comes from Emmanuel at Wolfe. Emmanuel, please go ahead and unmute yourself.\n\n**Emmanuel Rosner** (Managing Director and Senior Autos and Auto Tech Analyst)\nGreat. Thanks so much. Hi, everybody. Elon, you talked about expanding production of vehicles as fast as possible now that you have confidence in the unsupervised autonomy. How should we think about that in the context of your existing capacity of 3 million units? Is that where you're hoping to get volume to? What sort of timeline are we talking about? Would this require some level of boosting or incentivizing demand? Would this basically be prioritizing volume over near-term profitability given the longer-term opportunity?\n\n**Elon Musk** (CEO)\nOur capacity isn't quite 3 million, but it will be 3 million at some point. Aspirationally, it could be 3 million within... We could probably hit an annualized rate of 3 million within 24 months, I think. Maybe less than 24 months. Bearing in mind, there is an entire supply chain, like a vast supply chain that's got to also move in tandem with that. We are going to expand production as fast as we can and as fast as our suppliers can sort of keep up with it. We've got to think about where we build incremental factories beyond that. The single biggest expansion in production will be the Cybercab, which starts production in Q2 next year. That's really a vehicle that's optimized for full autonomy.\n\n**Elon Musk** (CEO)\nIt, in fact, does not have a steering wheel or pedals and is really an engineering optimization on minimizing cost per mile, fully considered cost per mile of operation. For our other vehicles, they still have a little bit of the horseless carriage thing going on where, obviously, if you've got steering wheels and pedals and you're designing a car that people might want to go very fast acceleration and tight cornering, like high-performance cars, then you're going to design a different car than one that is optimized for a comfortable ride, but doesn't expect to go past sort of 85 or 90 miles an hour. It is just aiming for a gentle ride the whole time. That's what Cybercab is. Do I think we'll sacrifice margins? I don't think so. I think the demand will be pretty nutty.\n\n**Elon Musk** (CEO)\nHere's the killer app, really, what it comes down to is can you text while you're in the car? If you tell someone, yes, the car is now so good, you can be on your phone and text the entire time while you're in the car. Anyone who can buy the car will buy the car, end of story. That's what everybody wants to do. In fact, not everyone wants to do it. They do do that. The reason you've seen that there's been an uptick in accidents pretty much worldwide is because people are texting and driving. Autopilot actually dramatically improves the safety here because if somebody's looking down at their phone, they're not driving very well. That's really the game changer.\n\n**Elon Musk** (CEO)\nYou know, we do see, at this point, I feel, essentially 100% confident, I say not essentially, 100% confident that we can solve unsupervised Full Self-Driving at a safety level much greater than human. We've released 14.1. We've got a technology roadmap that's, I think, pretty amazing. We'll be adding reasoning to the car. Our world simulator for reinforcement learning is pretty incredible. When you see the Tesla reality simulator, you can't tell the difference between the video that's generated by the Tesla reality simulator and the actual video. It looks exactly the same. That allows us to have a very powerful reinforcement learning loop to further improve the Tesla AI. We're going to be increasing the parameter count by an order of magnitude. That's not in 14.1. There are also a number of other improvements to the AI that are quite radical.\n\n**Elon Musk** (CEO)\nThis car will feel like it is a living creature. That's how good the AI will get with the AI4 computer. This is before AI5. AI5, like I said, is by some metrics 40 times better. Let's just say safely it's a 10x improvement. It might almost be too much intelligence for a car. I do wonder how much intelligence should you have in a car. It might get bored. Actually, one of the things I thought, if we've got all these cars that maybe are bored, while they're sort of, if they are bored, we could actually have a giant distributed inference fleet and say, if they're not actively driving, let's just have a giant distributed inference fleet.\n\n**Elon Musk** (CEO)\nAt some point, if you've got tens of millions of cars in the fleet, or maybe at some point 100 million cars in the fleet, and let's say they had at that point, I don't know, a kilowatt of inference capability, of high-performance inference capability, that's 100 gigawatts of inference distributed with power and cooling taken, with cooling and power conversion taken care of. That seems like a pretty significant asset.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Thanks, Elon. The next question comes from Adam from Morgan Stanley. Adam, please feel free to unmute yourself. Adam, go ahead and ask your question. Seems like we might be having some audio issues with Adam. We'll come back to you. The next question will then come from Dan from Barclays.\n\n**Dan Levy** (Senior Equity Research Analyst)\nHi, good evening. Thank you for taking the question. Elon, I know that Tesla's really focused on with Master Plan 4 bringing AI into the physical world. I think we've seen over the past, you know, this willingness for Tesla to engage and go into new markets, new TAMs. When you think about the growth prospects, how do we define the areas that are really within Tesla's core competency versus where do you draw the line for markets or AI applications that are outside of Tesla's core competency?\n\n**Elon Musk** (CEO)\nActually, I'm not sure what you mean by AI applications outside of Tesla's core competency. I mean, we kind of, we didn't have any of these core competencies when we started, you know. It's like we had zero core competencies, total competency of zero, actually. You can think of Tesla as like, I don't know, a dozen startups in one company. I've initiated every one of those startups. We didn't used to make battery packs, stationary battery packs, but now we do. We make them for the home, make them for, you know, utility scale with Powerwall, Megapack. We've created the Supercharging network globally. No one else has created a global Supercharging network. In fact, that North American Supercharging network is so good that basically every other manufacturer in North America has converted to our standard and uses the Tesla Supercharging network.\n\n**Elon Musk** (CEO)\nIf it was so easy, why don't they just do it? The chip design team, we started that from scratch. The Tesla AI software team, we started from scratch. I literally just say, \"Hey, we're going to start this thing.\" I post it on Twitter, now X, and then, you know, join us if you'd like to build it. In fact, Ashok was, I believe, the first person I interviewed for the Tesla Autopilot team, which we now call the Tesla AI Software Team, because it is the AI Software Team. It's core competencies created while you wait. Optimus at scale is the infinite money glitch. It's like this is a, it's difficult to express the magnitude of, like if you've got something that, like if Optimus, I think, could probably achieve 5x the productivity of a person per year because it can operate 24/7.\n\n**Elon Musk** (CEO)\nIt doesn't even need to charge. It can operate at tethered. It's plugged in the whole time. That's why I call it like if you're true of sustainable abundance, where working will be optional. There's a limit to how much AI can do in terms of enhancing the productivity of humans. There is not really a limit to AI that is embodied. That's why I call it the infinite money glitch.\n\n**Vaibhav Taneja** (CFO)\nOne thing which I'll further add is, people forget, like our first iteration of Autopilot was 10 years back. Elon had started this way back in the day.\n\n**Elon Musk** (CEO)\nWe've got the trees to prove it.\n\n**Vaibhav Taneja** (CFO)\nExactly. Even on the Optimus side, as much as people think, \"Okay, this is a new thing,\" I still remember, was it four plus years back, we were in a finance meeting with Elon and Elon said, \"Hey, our car is a robot on wheels.\" That's where we started developing. In fact, most of the engineering team, which is working on Optimus, has come from the vehicle side. That's why, you know, when we talk about manufacturing progress, we have the wherewithal because the same engineers who worked back in the day on drive units are working on actuators now. If there is any company which can do it at scale, that is going to be us.\n\n**Elon Musk** (CEO)\nWe have actually added a lot of new engineers as well to the team. There's actually a lot of the credit for the Optimus engineering that is also new engineers, many of them that are just out of college, actually. The Optimus engineering team is a very talented engineering team. I'd say like, \"Wow.\" The Optimus reviews at this point are that there's the engineering review, and then there's the manufacturing review being done simultaneously with an iterative loop between engineering design and manufacturing. We design something and we see like, \"Oh man, that's really difficult to make. We need to change that design to make it easier to manufacture.\" We have made radical improvements to the design of Optimus while increasing the functionality, but making it actually possible to manufacture. I'd say Optimus 2 is almost impossible to manufacture, frankly.\n\n**Elon Musk** (CEO)\nMy two bypass points, we've gone from a person in a robot outfit to what people have seen with Optimus 2.5 where it's doing Kung Fu. Optimus was at the Tron premiere doing Kung Fu, just out in the open, like with Jared Leto. Nobody was controlling it. It was just doing Kung Fu with Jared Leto at the Tron premiere. You can see the videos online. The funny thing is a lot of people walked past it thinking it was just a person. Even though with Optimus 2.5, you can see that it has a waist that's three inches wide that's obviously not a human. The movements were so human-like that a lot of people didn't realize they were looking at a robot. What I'm saying is Optimus 3 will be a giant improvement on that and made at scale. A very difficult thing.\n\n**Elon Musk** (CEO)\nThe Optimus engineering and manufacturing reviews, and there's the Friday night meeting with Optimus, which sometimes goes till midnight. My Saturday meeting is with the Saturday afternoons with the AI5 chip design team. Those two things are crucial to the future of the company.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Dan, did you have a follow-up?\n\n**Dan Levy** (Senior Equity Research Analyst)\nYeah, just as a related, maybe you could just talk about to what extent are the AI efforts at Tesla and xAI complimentary, or are they just different forms of AI? Maybe you can just help distinguish for the audience. Thank you.\n\n**Elon Musk** (CEO)\nYeah, there are different forms of AI. The xAI, so Grok is like a giant model that you could not possibly squeeze Grok onto a car. That's for sure. It is a giant beast of a model. With Grok, it's trying to solve for artificial general intelligence with a massive amount of AI training, compute, and inference compute. For example, Grok 5 will actually only run effectively on a GV300. That's how much of a beast that Grok 5 is. Whereas Tesla's models are, I don't know, maybe about less than 10% the size, maybe closer to 5% the size of Grok. They're really coming at the problem from very different angles. xAI and Grok, you know, they're competing with Google Gemini and OpenAI ChatGPT and that kind of thing. Some of it is complementary.\n\n**Elon Musk** (CEO)\nFor example, for Grok voice, being able to interact with Grok in the car is cool. Grok for Optimus voice recognition and voice generation is Grok. That's helpful there. They are coming at it from kind of opposite ends of the spectrum.\n\n**Travis Axelrod** (Head of Investor Relations)\nAll righty. Adam, let's give it another try. When you're ready, please unmute yourself for the next question. All righty. Unfortunately, still having audio issues. We're going to move on to Walt from Lightshed. Walt, please go ahead and unmute yourself.\n\n**Walt Piecyk** (General Partner)\nCan you hear me now?\n\n**Travis Axelrod** (Head of Investor Relations)\nYes.\n\n**Walt Piecyk** (General Partner)\nPerfect. Thank you. Just getting back to Austin, if you can remove the safety driver at your end, is the limitation in the Bay Area just regulatory, or is it kind of the market-by-market learning process? I guess similarly in the 8 to 10 markets that you mentioned to get added, is the decision there to put a safety attendant in the passenger seat or the safety driver in, is that like your step-by-step process to opening up a market, or is it really just the regulation in the individual market?\n\n**Elon Musk** (CEO)\nI think even if the regulators weren't making us do it, we'd still do that as the sort of right sort of cautious approach to a new market.\n\n**Elon Musk** (CEO)\nJust to make sure that we're being paranoid about safety, I think it makes sense to have a sort of either safety driver or safety occupant in the car when we first go to new markets to just confirm that there's not something we're missing. Because all it takes is like one in 10,000 trips to go wrong, and you've got an issue. It's just to make sure, like is there some peculiarity about a city, like a very difficult intersection or, I don't know, something that's an unexpected challenge in a city for that one in 10,000 situation? I think we probably could just let it loose in these cities, but we just don't want to take a chance.\n\n**Elon Musk** (CEO)\nWhat we're talking about here is, you know, maybe three months of safety driver in a new metro to confirm that it's good, and then we take the safety driver out, that kind of thing.\n\n**Walt Piecyk** (General Partner)\nOkay. On Full Self-Driving 14, it has a different feel than 13, and it's also, I think, a little different than what it feels like in Austin. Is it basically a different development path that you're doing in terms of the robotaxi stuff versus what you're dropping to the early adopters? When you push these new builds, is it that you're looking for notable improvements in intervention rates, or is that largely solved and it's more about adding the functionality, like the parking, the drive modes, or just the overall comfort?\n\n**Elon Musk** (CEO)\nThe first priority when we release a major new software architecture for Autopilot is safety. It starts off with safety, obviously safety prioritized, and then we solve comfort thereafter, which is why I don't recommend people take the initial version. That's why I say, like, most people should wait until 14.2 before they actually download version 14. Because by 14.2, we will have addressed many of the comfort issues. The priority is very much safety first, and then thereafter the comfort issues. That's why most people are like, yeah, I probably it'll be a little, like, it'll be safe, but jerky. We just need time to kind of smooth the rough edges and solve for comfort in addition to safety with a major new Autopilot architecture change. It really is, I mean, I know what the roadmap is for the Tesla real-world AI and at very granular detail.\n\n**Elon Musk** (CEO)\nObviously, Ashok is leading that. I mean, I spent a lot of time with the team going, you know, in excruciating detail here on what we're doing to improve the real-world AI. Like I said, this car is going to feel like it is a living creature. That's with AI4 before even AI5.\n\n**Ashok Elluswamy** (VP of Autopilot and AI Software)\nYeah, that roadmap is super exhilarating. We're waiting so much to release all the stuff we are working on. In terms of what we ship to customers versus robotaxi, it's mostly the same. Obviously, customers have somewhat features like, you know, they can choose whether the car wants to park in a spot or in a driveway or something like that, which is not super relevant for robotaxi. There's only a few minor changes like those ones. The majority of the algorithms and architecture, everything is the same between those two platforms.\n\n**Elon Musk** (CEO)\nYeah, as I mentioned earlier, we'll be adding reasoning to, I don't know, Ashok, is that like reasoning in 14.3, maybe 14.4, something like that?\n\n**Ashok Elluswamy** (VP of Autopilot and AI Software)\nYeah, AI4 or AI5, by the end of this year for sure.\n\n**Elon Musk** (CEO)\nYeah. With reasoning, it's literally going to think about which parking spot to pick. It's going to say, this is the entrance, but actually, probably there's not a parking spot right at the entrance if it's full, you know, if the parking lot is fairly full, the probability of an open parking spot right at the entrance is very low. What it'll simply do is drop you off at the entrance of the store and then go find a parking spot. It's going to get very smart about figuring out a parking spot. It's going to spot, figure out, it's going to spot empty spots much better than a human. It's got 360-degree vision. Like I said, it's going to use reasoning to solve things.\n\n**Ashok Elluswamy** (VP of Autopilot and AI Software)\nFitting that all inside the computer that has the AI4 is the actual challenge. That is what the team is working on, because obviously, you can do reasoning on the server that takes forever, but in the car, you need to make real-time decisions. Fitting all that into the computer that's in the car is the challenge.\n\n**Elon Musk** (CEO)\nYeah, that's why I say, like, I have a pretty good understanding of like AI, you know, the sort of the giant model level with Grok and with Tesla. I'm confident in saying that Tesla AI has the highest intelligence density. When you look at the intelligence per gigabyte, I think like Tesla AI is probably an order of magnitude better than anyone else. It doesn't have any choice because that AI has got to fit in the AI4 computer. The discipline of having that level of AI intelligence density will pay great dividends when you go to something that has an order of magnitude more capability like AI5. Now you have that same intelligence density, but you've got 10 times more capability in the computer.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. The next question will come from Colin at Oppenheimer. Colin, please unmute yourself when you're ready. Colin, go ahead and unmute yourself, please.\n\n**Colin Rusch** (Managing Director and Head of Sustainable Growth and Resource Optimization Research)\nThanks so much, guys. I appreciate you bringing up the challenges of hand dexterity and humanoids, along with the complexity of the supply chain and the vertical integration you guys are pursuing. I'm just trying to harmonize the timeline for the start of production next year with the current state of the supply chain and what sounds like a fair amount of work remaining on the dexterity before you can really freeze the hardware design and start to scale up production.\n\n**Elon Musk** (CEO)\nThe hardware design will not actually be frozen even through startup production. There will be continued iteration because a bunch of the things that you discover are very difficult to make. You only find that pretty late in the game. We will be doing rolling changes for the Optimus design even after startup production. I do think that the new hand is an incredible piece of engineering.\n\n**Elon Musk** (CEO)\nLike I said, we'll have a production intent prototype ready to show off in Q1, probably February or March. We're going to be building a million-unit Optimus production line, hopefully with a production start towards the end of next year. That production ramp will take a while to get to an annualized rate of a million because it's going to move as fast as the slowest, dumbest, least lucky thing out of 10,000 unique items. It will get to a million units. Ultimately, we'll do Optimus 4. That will be 10 million units. Optimus 5, maybe 50 to 100 million units. I mean, it's really pretty nutty.\n\n**Travis Axelrod** (Head of Investor Relations)\nAll righty. That is unfortunately all the time we have for Q&A today. Before we conclude, though, Vaibhav has some closing remarks.\n\n**Vaibhav Taneja** (CFO)\nThanks, Travis. I want to take the time to talk about an extremely important vote, which is being held on November 6. The meeting will shape the future of Tesla. We are asking you, as our shareholders, to support Elon's leadership through the two compensation proposals and the reelection of Ira, Kathleen, and Joe to the board. It is a team sport. Here at Tesla, the board is an integral part of the winning team. Shareholders are at the center of everything we do at Tesla. A special committee has laid out a compensation package. Like Elon said, we don't even want to call it a compensation package.\n\n**Elon Musk** (CEO)\nYeah, the point is that I just, like, there needs to be enough voting control to give a strong influence, but not so much that I can't be fired if I go insane. I think that sort of number is in the mid-20s, approximately. As a company that has already gone public, we've investigated every possible way to achieve increased voting control. Is there some way to have a super voting stock? There really isn't. There is no way to have a super voting stock after you've gone public. For example, Google, Meta, many other companies have this, but they had it before they went public, and it sort of gets, I guess, grandfathered in. Tesla does not have that.\n\n**Elon Musk** (CEO)\nLike I said, I just don't feel comfortable building a robot army here and then being ousted because of some asinine recommendations from ISS and Glass Lewis, who have no frigging clue. I mean, those guys are corporate terrorists. Let me explain the core problem here. So many of the index funds, the passive funds, vote along the lines of whatever Glass Lewis and ISS recommend. They've made many terrible recommendations in the past that, if those recommendations had been followed, would have been extremely destructive to the future of the company. If you've got passive funds that essentially defer responsibility for the vote to Glass Lewis and ISS, then you can have extremely disastrous consequences for a publicly traded company.\n\n**Elon Musk** (CEO)\nToo much of the publicly traded company is controlled by index funds, it's de facto controlled by Glass Lewis and ISS. This is a fundamental problem for corporate governance because they're not voting along lines that are actually good for shareholders. That's the big issue. I mean, that's what it comes down to: ISS, Glass Lewis, corporate terrorism.\n\n**Vaibhav Taneja** (CFO)\nYeah, I would say the special committee did an amazing job in constructing this plan for the benefit of the shareholders. There's nothing which gets passed on till the time shareholders make substantial returns. That's why, in the end, I would say I would urge you to not only vote on the plan, but also vote on all the three directors because of their exceptional knowledge and experience. Literally, we at Tesla work with these directors day in, day out. There's not even a single day that one of the directors I haven't spoken to or one of my colleagues hasn't spoken to. Even the directors out here are not just reading out of PowerPoint presentations. They're actually working with us day in, day out. I just urge you guys as shareholders to vote along the board's recommendation. Thank you, guys.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Thank you, Vaibhav. We appreciate everyone's questions today. We look forward to talking to you next quarter. Thank you very much and goodbye.",
      "fetched_at": "2026-02-04T15:39:08.886Z"
    },
    {
      "ticker": "TSLA",
      "title": "Tesla, Inc. (TSLA) Q2 FY2025 earnings call transcript",
      "published_date": "Jul 23, 2025, 5:30 PM EDT",
      "fiscal_year": "2025",
      "quarter": "Q2",
      "url": "https://finance.yahoo.com/quote/TSLA/earnings/TSLA-Q2-2025-earnings_call-337623.html",
      "content": "**Travis Axelrod** (Head of Investor Realtions)\nGood afternoon, everyone, and welcome to Tesla's second quarter twenty twenty five q and a webcast. My name is Travis Axelrod, head of investor relations, and I'm joined today by Elon Musk, Bev Abtaneja and a number of other executives. Our Q2 results were announced at about three p. M. Central Time in the update deck to be published at the same link as this webcast.\n\n**Travis Axelrod** (Head of Investor Realtions)\nDuring this call, we will discuss our business outlook and make forward looking statements. These comments are based on our predictions and expectations as of today. Actual events or results could differ materially due to a number of risks and uncertainties, including those mentioned in our most recent filings with the SEC. During the question and answer portion of today's call, please limit yourself to one question and one follow-up. Please use the raise hand button to join the question queue.\n\n**Travis Axelrod** (Head of Investor Realtions)\nBefore we jump to q and a, Elon has some opening remarks. Elon?\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nThanks, Travis.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nSo we've had a very exciting quarter. The we're able to successfully launch robo taxi, so providing our first drives with no one in privacy, both paying customers in Austin. And as some may have noted, we've already expanded our service area in Austin. It's bigger and longer, and and it's and it's gonna get even bigger and longer. We were expecting to really greatly increase the Austin service area to well in excess of what competitors are doing.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nAnd that's hopefully in a week or so, two weeks?\n\n**Ashok Elluswamy** (VP - AI Software)\nYeah. Couple of weeks.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nCouple of weeks or so. And and and and then we're we're we're getting the regulatory permission to launch in the Bay Area, Nevada, Arizona, and a number of and Florida and a number of other places. So as as we get the approvals and we prove out safety, then we'll be launching autonomous ride hailing in in most of the country. And I think we'll probably have autonomous ride hailing in probably half half the population of The US by the end of the year. That's that's at least our goal subject to regulatory approvals.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nI I I think we'll technically be able to do it. So assuming we have regulatory approvals, it's probably addressing half the population of The US by the end of the year. But we we we are being very cautious. We don't wanna take any chances. And so we're good.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nWe're gonna, yeah, go go cautiously. But but it's it's the service areas and the number of vehicles in in operation will increase at at a hyperexponential rate. So, you know, some other notable things. Model y in June became the best selling car in Turkey, Netherlands, Switzerland, and Austria. It is, I believe, the best selling car of any kind in the world still.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nAnd autonomy is a is a big factor there. So even without even even without supervised even even with just supervised self self driving, it's it's a huge selling point. And it's worth noting that we do not actually yet have approval for supervised FSD in in Europe. So our sales in Europe, we think, will improve significantly once we are able to give customers the same experience that they have in The US. This is my this is, I think, a very important point to convey.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nAnd we've been working with main country regulator, which is The Netherlands. And I think we're close to getting approval with Netherlands, then it's gonna go to the EU. It's quite a, you know, In fact, had no idea that something like EU could exist. Beyond challenges with bureaucracy, but it will we will get the approvals. And I I think we'll get, you know, some people in Europe will have experience similar to how The US in most of Europe, you know, this year, hopefully, at least partly in this quarter.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nAnd then we also have some regular regulatory challenges in China, which we're hoping to unblock shortly where we because we we also cannot provide to advise FST in China currently. We're able to unblock that suit, and that's also those that's another major. It's really is the single biggest demand drive. And then within The US, as as we are get confident about safety in in different geographic areas, the we will loosen up on how much somebody has to be laser focused have their eyes laser focused on the road. You know?\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nBecause that's that's been a common complaint. In fact, it it does create odd odd safety issue where people will sometimes disengage Autopilot, then then do something, change the radio or maybe look at the phone, drive with their knee, and then reengage Autopilot, which obviously is not is less safe than simply keeping Autopilot on. So, anyway, we're get that that that experience will will improve in in the next several weeks. The the because of our focus on Boston with that one in the privacy, the production release of autopilot is actually several months behind what people experienced on a robo text in Austin. So now we have the robo text that Austin launched.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nWe'll be provide adding back those elements so that there will be a step change improvement in the the autopilot experience for people outside of Austin. This this is really, as you can tell, this is very much sort of autonomy is is the story. Like, we need to we need the physical product without which you cannot have autonomy. But once you have a physical product, need the the autonomy is what amplifies the value to stratospheric levels. We also launched the Tesla Dyna, which has been a huge hit.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nIt actually got worldwide attention, which is unusual for a Dyna. Diners don't typically get, you know, headline news around Earth. But this is a pretty special diner. And if you're in the LA area, it's worth visiting. It's sort of a shining beacon of hope in in an otherwise sort of bleak urban landscape, frankly.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nSo really quite quite a lovely experience. Great job by the team there. On the full self driving front, continue to worry about that. We have we're continuing to make significant improvements just with the software. So the we're we're expecting to increase the parameter count.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nActually, at this point, I think we think we can probably 10 x the almost 10 x the parameter. Yeah. Roughly. Roughly 10 x the parameter count. So this is this is actually a very tricky thing to do because you if you as you increase the parameter count, you get you get choked on memory bandwidth.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nBut we currently think we can 10 x the parameter account from what people are currently experiencing. That's that's not not not just a four x, actually, x increased in in parameter account. And yeah. So so there's a lot of improvement on the existing hardware to to to happen. Energy is growing really well despite headwinds from tariffs and various supply chain challenges.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nThe the mega pack is expanding capacity quickly, and and we have upgrades to the mega pack that will make it even better. And we had record power deployment gain in q two. So I I I think battery batteries are gonna just gonna be a massive thing The the scale of batteries battery demand is, I think, not that many people appreciate just how gigantic the scale of battery demand is. We the way to think about it is that The US sustained power output for The US grid is around one terawatt, but average usage is less than half a terawatt. If you add batteries to the mix, you can run the power plants twenty four seven at full capacity, thus doubling more than doubling the energy output per year of The United States just with batteries.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nBut that's a good big deal. It's a really big deal. Optimus so we're revolving the opto Optimus design and really getting Optimus to the point where it is a phenomenal design. So an Optimus version two right now, sort of two and a half. Optimus three is is an exquisite design in my opinion and will be an as I've said many times before, predicted it will be the biggest product ever.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nIt's a very hard problem to solve. You have to design every part of it from Physics First Principles. There's nothing that's off the shelf that actually works. So you can design every motor gearbox, power electronics, control electronics, sensors, the the mechanical elements. We also got to train optimist to use its sensors with a neural net, but we'll be applying the same techniques that we applied for a car, which is essentially a four wheeled robot.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nAnd OPTIMIS is a robot with arms and legs. So the the the same principles that apply to optimizing AI inference of the car applied to Optimus because they're both really robots in different forms. And and Tesla, it it is important to note that Tesla is by far the best in the world at real world AI. Like like, a clear proof point with for that would be if you compare it to Tesla to Waymo. Waymo's got you know, the car is best doing with god knows how many sensors.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nAnd yet isn't Google good at AI? Yes. But they're not good at real world AI thus far. They have Tesla is actually much better than Google by far than any much better than anyone at real world AI. And and I and by far, Tesla has the the best inference efficiency.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nLike, I think a key favorite for AI is what is the intelligence per gigabyte? And people talk about parameters, blah blah blah. But but I think we'll talk about stop talking about parameters and talk about gigabytes because with the parameters, you can have four bit parameters, eight bit parameters, 16 bit parameters. But the actual constraints in the hardware are how many gigabytes of RAM and how many gigabytes per second can you transfer from RAM. Therefore, it is not a parameter constraint.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nThere's it is a there's a byte constraint. And Tesla has the highest intelligence density of any AI by far. And I have a lot of insight into this with with xAI. XAI is you know, Grok is the smartest AI overall, but it's a you know, Grok four is a giant beast. They're sort of at the terabyte level.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nAnd so kind of a important to note, Tesla has the best intelligence density. Intelligence density will be a very big deal in the future. It is now. So with with Optimus three, which is really the right design, it's like it doesn't have at this point, there's no no significant flaws with the Optimus three design. But it it it would we are gonna retool a bunch of things.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nSo it's gonna probably be prototypes of Optimus three end of this year and then scale production next year. And I'll try to scale Optimus production as fast as it's humanly possible to to do so and try to get to a million units a year as quickly as possible. You think we can get there in less than five years? That's my sort of, I guess. That that's a reasonable aspiration.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nIt's a million years, a year, five years. It seems like an achievable target. In conclusion, so far, 2025 has been a very exciting year. A lot of major milestones. We've made clear pro demonstrable progress in autonomy that a lot of said we would not achieve.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nIt is worth noting that we have done what we said we're gonna do. I mean, we're always on time, but we get it done. And on the ACRS, I was sitting there with egg on their face. So great great great progress by the Tesla team. Yeah.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nI I I do think if Tesla continues to execute well with big autonomy and and humanoid robot autonomy, it it it will be the most valuable company in the world. So a lot of execution between here and there. It doesn't just happen. But provided we execute very well, I think Tesla has a shot at being the most valuable company in the world. Alright.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nObviously, I'm extremely optimistic about future of the company. Best way to predict the future is to make it happen, and we're we're making it happen here with Tesla team. So I'd just like to say thanks to all of our supporters, and I think we're good to tell you an incredibly exciting future.\n\n**Travis Axelrod** (Head of Investor Realtions)\nGreat. Thank you very much, Elon. And Benloff has prepared remarks as well.\n\n**Vaibhav Taneja** (CFO)\nThanks, Travis. As Elon mentioned, q two was an interesting quarter in a few respects. We started ramping up the production of the new Model y at all our factories. We rolled out our robotaxis service in Austin and delivered a car completely autonomously from directly from the factory to the customer's home. It is a seminal point get to this thing.\n\n**Vaibhav Taneja** (CFO)\nI mean, it took a lot of effort, and I really wanna thank everybody at Tesla to make this happen. It wasn't an easy thing to do, but we did it. It took time, but we've just begun the next phase for the company. The one big bill has a lot of changes that would affect our business in the near term. The first among those changes is the repeal of the IRA EV credit of 7,500 by the end of this quarter.\n\n**Vaibhav Taneja** (CFO)\nGiven the abrupt change, we have limited supply of vehicles in The US this quarter as we have already with the lead times to auto parts to build cars. We've rolled out all our planned incentives already, and we'll start bearing them back as we start to sell. If you are in The US and looking to buy a car, place your order now as we may not be able to guarantee delivery orders placed in the later part of August and beyond. But we'll also make changes to certain emission standards by reducing the amount of penalty to zero. This, in turn, will have an impact on the new sales of regulatory credits to other OEMs and, in turn, will lead to lower revenues.\n\n**Vaibhav Taneja** (CFO)\nWhile we now plan our business around such sales, it will nonetheless impact our total revenues going forward. On the automotive product portfolio, the entire lineup is updated. Globally, we are seeing an increase in the number of test drives. We started the production of the lower cost model as planned in the first half of twenty five. However, given our focus on building and delivering as many vehicles as possible in The US before the EV credit expires and the additional complexity of ramping a new product, the ramp will happen next quarter slower than initially expected.\n\n**Vaibhav Taneja** (CFO)\nOne thing which is grossly under appreciated and need on time to moderate is that all our vehicles in the lineup are capable of a ton. This is by far the biggest differentiator between us and the competition. Our vehicles stop safety standard as is, but with FSD, they are and will continue to set a new standard for safety within vehicular transportation. We published our vehicle safety report earlier today, and you can see a car on FSD is 10x safer than the car not on FSD. We've started seeing an uptick in FSD adoption in North America in recent months, which is a very promising trend.\n\n**Vaibhav Taneja** (CFO)\nAnd just to give you perspective, you know, since the launch of since we've been moved to version 12 of FSD, we've seen the adoption rates really increase. We've started seeing the on the automotive revenue front, despite reduction in regulatory credit revenue and the auto the total automotive revenue increased by 19% sequentially even though total deliveries only improved 14%. This was primarily due to an improved a s ASPs because of the new model y. This helped in improving margin sequentially as well along with improved mix and higher cost fixed cost absorption despite an increase in cost from tariffs. We started seeing the impact of tariffs in our p and l.\n\n**Vaibhav Taneja** (CFO)\nSequentially, the cost of tariffs increased around 300,000,000 with approximately two thirds of that impact in automotive and rest in energy. However, given the latency in manufacturing and sales, the full impacts will come through in the following quarters, and so cost will increase in the near term. While we are doing our best to manage these impacts, we are in an unpredictable environment on the tariff front. The margins for the energy generation and solar businesses improved sequentially while deployment reduced primarily due to the ramp of power deployments at higher margins. We were able to achieve our highest gross profit for the business yet.\n\n**Vaibhav Taneja** (CFO)\nNote that the overall deployments will continue to vary quarter to quarter. Think, you know, covered this that, you know, industrial storage will make a difference in this drive towards AI and data center growth. The energy requirements are increasing at a rapid scale as application as AI applications are very energy hungry. The quickest path to scale up energy is deploying storage. This is something that our customers have started realizing, and despite this business having the largest impacts from tariffs, we're seeing customers willing to accept some of the tariff impacts.\n\n**Vaibhav Taneja** (CFO)\nThe big bill has certain adverse impacts even for the energy business, most notably on the residential storage business due to the early expiration of currency one by the end of this year. The challenges of the storage business, therefore, remain both from the build and from tariffs, and we're doing our best to try and manage through this. But it will we will see shifts in demand and profitability. The margins for our service and other businesses improves sequentially, primarily due to higher profits from supercharging and improvement in insurance and service center profitability. Operating expenses also grew sequentially as we continued our investment in AI projects, including additional expenses related to employee related costs, including higher stock based compensation and depreciation for AI compute.\n\n**Vaibhav Taneja** (CFO)\nOur operating expenses, our r and d related spend, will continue to grow. We believe even in the current environment, it is the right strategy to keep making investments in these areas to position us for the long term. Other income grew sequentially primarily from the mark to market adjustment on Bitcoin Holdings, which was 284,000,000 gain in q two while we got a 125,000,000 loss in q one. Just want to remind people that this would keep creating volatility based on the Bitcoin price. While other while operating cash flows increased sequentially, so did our CapEx, resulting in 146,000,000 of free cash flow.\n\n**Vaibhav Taneja** (CFO)\nWe continue to make investments in various aspects of manufacturing, like cyber cap, semi mines, and other manufacturing spend, and the expansion of our AI initiatives. Our latest expect expectation for the year in terms of CapEx is in excess of 9,000,000,000. To summarize, we have near term challenges in our business due to the negative impacts of the bill and tariffs. However, the investments that we have made for AI, robotics, and our lead in energy sets us up for a bright future. I would like to thank the whole Tesla team, our customers, our investors, and supporters for their continued belief in us.\n\n**Travis Axelrod** (Head of Investor Realtions)\nGreat. Thanks very much, Vethal. So now we're gonna move on to state.com questions. The first question is, can you give us some insight how robo taxis have been performing so far and what rate you expect to expand in terms of vehicles, geofence, cities, and supervisors?\n\n**Ashok Elluswamy** (VP - AI Software)\nMhmm. Yeah.\n\n**Ashok Elluswamy** (VP - AI Software)\nThe robo taxis has been doing great so far in Austin. Customers really love the experience. It was, like, super smooth, very safe, and, like, just a great experience overall. And we already did the first day of expansion in Austin, and we'll continue to expand in Austin to probably more than 10 x our current operating region. We're also testing in a lot of other cities as Elon mentioned.\n\n**Ashok Elluswamy** (VP - AI Software)\nThe next thing to expand would be in the San Francisco Bay Area. We are working with the government to get approval here, and in the meanwhile, launch a service with the person in the driver's seat just to expedite, and while we wait for regulatory approval. We're also testing a lot of other cities in The US, including Florida, Nevada, etcetera.\n\n**Travis Axelrod** (Head of Investor Realtions)\nGreat. Thank you very much, Shuk. The next question is, what are the key technical and regulatory hurdles still remaining for unsupervised FSD to be available for personal use? Can you provide a timeline?\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nForward. First of me getting there, I think it's it it'll be available for its personalized personal use by the end of this year in certain geographies. We're just being very careful about it. So\n\n**Vaibhav Taneja** (CFO)\nThis is not something which we all do rush.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nNo.\n\n**Vaibhav Taneja** (CFO)\nWe wanna make sure that everything is safe before we make it available broadly.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nYeah. We're just being extremely primary.\n\n**Vaibhav Taneja** (CFO)\nYes.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nBut I I'd be I'm I'm confident that by the end of this year within a number of cities in The US, we will will it'll be available to end users. Like yeah.\n\n**Ashok Elluswamy** (VP - AI Software)\nYeah. And for what it's supposed to be the same, AA hardware, in the Austin robotaxi vehicles has some customer vehicles, and we did deliver a car autonomously from the factory to a customer this quarter.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nYes.\n\n**Ashok Elluswamy** (VP - AI Software)\nAnd every Tesla manufacturer in The US and, in Europe, autonomously drives itself from the end of line to the, loading docks. And it so it's just a software upgrade away.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nYeah.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nI I think we'll be in we'll end up delivering cars in the Great Warson area and the Bay Area by default from the factory by the end of this year. Like, a car will deliver itself to your to where you are unless you say you don't want that.\n\n**Ashok Elluswamy** (VP - AI Software)\nThat'd be super cool.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nYeah.\n\n**Travis Axelrod** (Head of Investor Realtions)\nGreat. Thank you, guys. The next question is, what specific factory tasks is Optimus currently performing, and what is the expected timeline for scaling production to enable external sales? How does Tesla envision Optimus contributing to revenue in the next two to three years?\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nYeah. So the Optimus Optimus three design, as I mentioned earlier, is, I think, finally the right design. There'll be further optimizations, but there are no, I think, no fundamental changes to that are needed for the optimist three design. It has all the degrees of freedom that we really want or need. So it's you know, I have prototypes of that in, I don't know, three or three months, and it's sort totally in production.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nWe'll certainly start production on that in the beginning of next year. The production ramp is simple. It's always a good predict Yes. Cover of your production ramp when something has got an entire when everything is new because the rate of production will move as fast as the least lucky and least competent elements of the entire supply chain as well as in in internal processes. So the more new stuff that is in in a product, the slower the the ramp could be because of unexpected supply chain interruptions or mistakes made internally.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nIt's much easier to predict sort of the the the end of the of the s curve or or late in the s curve than the beginning of the s curve. And the beginning of the s curve of of the production ramp is in any case not really material for revenue purposes. The the beginning of the s curve, that you're usually not usually yours, negative gross margin, and you're debugging a lot of issues. So that that's why, like, it's it's I I feel like fairly confident in predicting things or at least medium confident in predicting where we are at five years, but I it's hard to predict where we are in a year or two years. So that's why I think five years I think we could be at the let me put this right.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nI'd be surprised if at the end of five years, you know, sixty months from now, if we are not roughly making a 100,000 Optimus robots in month in sixty months, I would be shocked.\n\n**Travis Axelrod** (Head of Investor Realtions)\nAlright. Thank you very much. Next question is, can you provide an update on the development and production timeline for TESS' more affordable models? How will these models balance cost reduction and profitability, and what impact do you expect on demand in the current economic climate?\n\n**Lars Moravy** (Vice President of Vehicle Engineering)\nWell, I I think Vibod did a good job of answering this question in his opening remarks. As we said, we started production in June, and we're ramping, you know, quality builds and things throughout the quarter. And given that that we started in North America and that, you know, our goal is to maximize production with a higher rate. So if ending q three, we're gonna keep pushing hard on our current models to avoid complexity. Unfortunately, that rolls away.\n\n**Lars Moravy** (Vice President of Vehicle Engineering)\nWe'll be running within more formal models available for everyone in q four. And, you know, the goal of those products was not to negatively impact revenue or or gross margin, but just to make a car that everyone loves and wants at a more affordable price.\n\n**Travis Axelrod** (Head of Investor Realtions)\nGreat. Thank you, Lars. The next question is, can you talk about the benefits of Tesla investing in xAI?\n\n**Vaibhav Taneja** (CFO)\nThis is not the forum to discuss this topic. I mean, if if if there is something which we need to discuss, we'll discuss that separately.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nI I think, obviously, you know, we're a publicly traded company. Shareholders are welcome to put forward any shareholder proposals that they'd like. I recently encouraged that. And and then have shareholders vote, and we'll act in accordance with the shareholder wishes.\n\n**Travis Axelrod** (Head of Investor Realtions)\nGreat.\n\n**Travis Axelrod** (Head of Investor Realtions)\nThank you very much. The next question is, can you tell us a little bit more about what goes on in the Tesla design studio?\n\n**Speaker 5** (Executive)\nDo you want me to take that one?\n\n**Speaker 5** (Executive)\nWe we kinda generally say that what happens in the studio stays in the studio and that, you know, earnings calls are not the place to disclose new product stuff. But we're, you know, we're working to make sure that we have an exciting future for for our Tesla and our in in the product lineup.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nYeah. There's a lot of exciting things happening in the design studio. It's it's not like static. And, really, what's gonna happen over the next several years is a fundamental transformation of the company from a preautonomy world to a postautonomy. And I'm working on a new master plan to articulate that as a team.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nAnd, you know, there there there will there will be there are some teething pains as you as you transition from pre preautonomy to a postautonomy world. But I think the the future vision for Tesla is incredibly exciting and will profoundly change the world in a good way. This may sound like sort of pineapple or whatever, but I I think if well, let's just say if we execute on that plan effectively, which is you have to actually do that, Tesla will be the most valuable company in the world by far.\n\n**Travis Axelrod** (Head of Investor Realtions)\nGreat. Thank you. The next question is actually duplicate on unsupervised SSD for customer vehicles. We'll skip that. After that is, are there any news for hardware three users getting retrofits or upgrades?\n\n**Travis Axelrod** (Head of Investor Realtions)\nWill they get hardware four or some future version of hardware five?\n\n**Vaibhav Taneja** (CFO)\nI mean, what we want to do is we wanna get unsupervised done on hardware four first. Once it's done, then we will go back and look at what we need to do with the hardware three cars. I mean, like I said, the focus is first to get unsupervised out, and then we'll go back and see what more work we need to do.\n\n**Travis Axelrod** (Head of Investor Realtions)\nGreat. Next quest question is, can you give an update on Dojo, and could xAI be a customer for Dojo?\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nDojo two we expect to have Dojo two operating in scale sometime next year with scale being somewhere around a 100 k h 100 equivalents. And and then AI five, which is really it's spectacular too. I I don't use those words lightly. Spectacular too. The AI five will be hope hopefully be in volume production around the end of next year, but that has a lot of potential.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nI think, you know, thinking about Dojo three and the AI six in first chip, It seems like intuitively, we wanna try to find convergence there where it's basically the same chip that is used where we use, say, two of them in a car or an Optimus and and maybe a larger number on a on a board, a kind of five twelve on a board or something like that. If you want high bandwidth communication between the chips at a forced survey doing doing a burn survey. That sort of seems like intuitively the sensible way to go.\n\n**Travis Axelrod** (Head of Investor Realtions)\nGreat. The next set of questions have all actually been covered. So we'll we'll end with, how will the BBB elimination of tax credits for solar projects affect your sales pipeline for Megapack?\n\n**Speaker 5** (Executive)\nYeah. Our our sales pipeline is is quite diversified across customers and market segments, so we aren't heavily weighted in Megapack projects that are paired with solar. And as we talked about in the opening remarks, we're seeing storage quickly being recognized for its ability to unlock grid efficiency and how quickly it can be deployed to help the grid. Additionally, although the recent bill was not favorable toward solar, we we believe solar projects will still get built because the energy is necessary. The projects are well developed, and they're ready for execution, and there's really no alternatives in the near term given gas turbine lead times and pricing.\n\n**Speaker 5** (Executive)\nWe also could continue to see growth in the data center segment and in stand alone storage projects providing capacity to the grid in several markets across The US. Overall, we're forecasting a very strong second half of the year as we increase deployments. And lastly, we we continue to invest heavily in US manufacturing to mitigate policy and tariff impacts, expecting our first LFP cell manufacturing facility to be online by the end of the year and launching our third mega factory near Houston in 2026.\n\n**Travis Axelrod** (Head of Investor Realtions)\nGreat. Thank you, Mike. We will now be moving to analyst questions. The first question comes from Emmanuel Rosner at Wolfe Research. Emmanuel, please feel free to unmute yourself whenever you're ready.\n\n**Emmanuel Rosner** (Managing Director - Senior Autos &amp; Auto Technology Analyst)\nGreat. Thank you so much. Can you hear me?\n\n**Travis Axelrod** (Head of Investor Realtions)\nYep.\n\n**Emmanuel Rosner** (Managing Director - Senior Autos &amp; Auto Technology Analyst)\nThanks.\n\n**Emmanuel Rosner** (Managing Director - Senior Autos &amp; Auto Technology Analyst)\nSo, Elon, are you able to share any KPIs with us in terms of the robotaxi business? How many vehicles are you operating, miles driven autonomously or the number of safety critical intervention? Just curious how the rollout is generally is going and any sort of like targets that you could share more broadly.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nSure. Do you wanna\n\n**Ashok Elluswamy** (VP - AI Software)\nYeah. Have, you know, more than 7,000 miles operating in Austin area. It's you know, just because service is new, we have handful of vehicles, right now, but then we are trying to expand the service, in terms of both the area and also the number of vehicles both in Austin and other locations. So far, you know, the there's, like, no notable safety critical incidents there. You know, sometimes we have our own, restrictions as to, for example, be resting on our speed limit to 40 miles per hour course.\n\n**Ashok Elluswamy** (VP - AI Software)\nAnd if the vehicle wants to go on, like, higher speed course, we can stop the vehicle, but those are lot of convenience opposed to, safety critical nature. So for the service, that will be really good received, and we continue to, expand on it.\n\n**Emmanuel Rosner** (Managing Director - Senior Autos &amp; Auto Technology Analyst)\nGreat. And term from an economics point of view, longer term, you've previously talked about working to drive down the cost per mile on the robotaxis, maybe towards $0.30 or $0.40 per mile over time. Now that your service is live, how should we think about the main milestones to getting there?\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nYeah. Well, the the the cyber cab is which is really optimized for autonomy. That that I think has got probably sub 30¢ per mile potential over time, maybe 25. You know, it's it's really you you like, if you design a car from scratch to to be a cost optimized robotic taxi like CyberCap. You know, you know, you you like, for example, we're we're not trying to make it, you know, corner like a like, incredibly well like a model three would, you know, or model s or even model y. Like, it's got model most the this you know, model all all of our all all of our cars that are driven by people are super fun to drive. They've got incredible acceleration, you know, incredible cornering capability. But I don't we're we're we're confident that very few people in a cyber cap want to be hurdling around.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nSo, you know, so we were we we've reduced the the top end speed, which means we can use more efficient tires. We don't need as much acceleration. We don't need as much, you know, big big breaks to sort of we won't want stopping distance, but we we're we're not expecting it to be heavily used. It's it's it's a gentle ride. Essentially, you you design it for a gentle ride and and then you you have a much more optimized optimized design point.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nSo that that's why it it seems probably we could achieve that, especially if optimist is, you know, so serving cleaning up the car and make doing maintenance and stuff. And it it's, you know, doing order automatic charging. So, yeah, I think it's gonna the actual cost per mile of cyber cap will be be very low. The cost per mile of our existing fleet will be higher, but still very competitive. So, yeah, maybe some number of 50¢.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nI'm just guessing. Yeah. So so this really Tails Road, technically, will go from tiny to gigantic in terms of operations in pretty short period of time. Like, my guess is there's it's it has a material impact on our financials around the end of next year.\n\n**Travis Axelrod** (Head of Investor Realtions)\nGreat. Thank you very much. The next question comes from Adam at Morgan Stanley. Adam, please unmute yourself.\n\n**Adam Jonas** (Head - Global Auto &amp; Shared Mobility Research)\nGreat. Hello, everybody. So, Elon, as Tesla moves into this next phase of physical AI, autonomous humanoids, robotaxis, etcetera, world changing, civilizational species changing technology with dual purpose. Are you comfortable moving Tesla in this direction while only having a 13% stake in the economy sorry, in the company? Is that sustainable, or does do you still insist that something needs to happen, given, you know, your current lack of control and the types of technologies you're getting into?\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nYeah. That that that is a major concern for me as I've mentioned in the past, and I hope that is addressed at the upcoming shareholders meeting. But, yeah, it is a big deal. Like, you know, I wanna find that I've got, like, so little control that I can easily be ousted by activist shareholders after having bought, you know, these these army of humanoid robots. I think that as I mentioned before, I think my control over Tesla should be enough to ensure that it goes in a good direction, but not so much control that I can't be thrown out if I go crazy.\n\n**Adam Jonas** (Head - Global Auto &amp; Shared Mobility Research)\nOkay, Elon. Don, you're not gonna go crazy. We we we we trust you. Well You can stay a little crazy. A a little crazy is okay.\n\n**Adam Jonas** (Head - Global Auto &amp; Shared Mobility Research)\nElon, though, we understand the the board of directors of a major US investment bank recently toured Optimus production. I I I that's I don't know if you wanna confirm that or not. It's just what we heard. That's cool. But when do you think others will be able to get a firsthand view of, optimists like that?\n\n**Adam Jonas** (Head - Global Auto &amp; Shared Mobility Research)\nAnd is the second half of this year too soon to have an AI day? Because it seems like everybody else in the world's doing it, and this talent war is getting freaking crazy. And, I I know I know you mentioned for recruiting purposes, this is a very important thing that you've done. I think people have have you've have copied you on this, and I'm wondering if this is if this year is too early for that. Thanks, Elon.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nYes. It's a bit of a tough thing because, like, when we do an AI day, we find that some of our competitors have literally done a frame by frame examination of our slides, everything we say, and then copy us. So, you know, I'm saying, what's the the trade off? Which which does help with recruiting, but then competitors look very closely and copy us. I mean, that said, we should probably I mean, I I guess we could consider the shareholder meeting to be sort of an can do we can maybe go into depth, some some amount of depth at the Annual Shareholder Meeting with respect to Optimus and AI and sort of the chip chip stuff perhaps.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nYeah. Tesla's also really underrated in terms of AI chip design as well as AI software. So, like, there there's still not a chip that we would that that exists that we would prefer to put in our car that is an AI chip that that we would prefer to put in the car over our own, and even though it's been now out for several years. And we're confident that the AI five chip will be a profound game changer. In fact, it it it's so it's so powerful that we'll we'll have to nerf it for to some degree, for markets outside of The US because it it it flows way past the export restrictions.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nSo unless the export restrictions change, we actually will have to nerf our AI five show, which is kinda weird. Hopefully, those hopefully, we keep, you know, raising the bar on export restrictions. Otherwise, it gets a bit silly. We'll have a bunch of Optimus robots on stage at the shareholder meeting. The Optimus lab is cool to see.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nIt looks like it basically looks like the set of Westworld. You could robots in various stages. Some of them, know, in various stages of prepare. Like, I don't know. Some some combination of, like, the Tatooine Junkyard and the and Westworld is what it looks like.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nIt's very cool. And and Optimus is walking around the office here in Palo Alto. So twenty four seven is just walking around like a small I think I'm so so optimist. Like, know, the Tesla diner, so we pop one. Yeah.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nSo it's we'll go from a world where robots are rare to where they're so common that you don't even look up.\n\n**Travis Axelrod** (Head of Investor Realtions)\nGreat. Thank you so much. The next question comes from Edison at Deutsche Bank. Edison, please unmute yourself. Edison, please go ahead and unmute yourself.\n\n**Travis Axelrod** (Head of Investor Realtions)\nRight. While Edison figures that out, we will go to the next question, which is gonna come from Dan Levi at Barclays. Dan, please go ahead and unmute yourself.\n\n**Dan Levy** (Senior Equity Research Analyst)\nGreat. Thank you. Yuan, you've talked about the opportunity to put non Tesla owned vehicles into the robotaxi network. Just talk about the gating factors to enabling that and what timeline we should expect on personally owned vehicles in the robotaxi network.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nI we haven't really thought hard about that. But we need to make sure it works when the vehicles are fully under our control. And, yeah, it's kinda one step at a time here. We don't wanna jump the gun. As I said, we're being paranoid about safety.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nSo so it's like but I I I guess I guess it would like, next year is I'd say confidently next year. I'm not sure when next year, but confidently next year, people would be able to add or subtract their car to the Tesla fleet.\n\n**Vaibhav Taneja** (CFO)\nI mean, one thing to keep in mind is that we will have some criteria because, like, even when you put your car in a Uber or Lyft fleet, they go through a whole checklist process of making sure things are working.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nIt's like an Airbnb or Yes. Got it.\n\n**Vaibhav Taneja** (CFO)\nYeah. So we will do something like that.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nIt's kind of very impossible.\n\n**Vaibhav Taneja** (CFO)\nYes.\n\n**Vaibhav Taneja** (CFO)\nBecause we want like, Elon said, we wanna be parallel on security. I mean, assets, small things like tread on the tire can have an impact on safety. So that's why we would want to do some proper validation before we let other cars come in.\n\n**Travis Axelrod** (Head of Investor Realtions)\nDan, do have a follow-up?\n\n**Dan Levy** (Senior Equity Research Analyst)\nYes. Thank you. Could you just unpack the different costs associated with scaling the robotaxi business and how you think about funding those costs. Are are the cash flows in the auto business sufficient to fund it? And if not, what other funding sources do you think you'd use?\n\n**Dan Levy** (Senior Equity Research Analyst)\nYou know, would you just fund it off the balance sheet?\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nWell, as soon as there is a clear cash flow stream associated with any any product, you can debt finance it.\n\n**Dan Levy** (Senior Equity Research Analyst)\nAnd in the interim?\n\n**Vaibhav Taneja** (CFO)\nWhen in the interim, we will use our balance sheet. But, like, once we get to a certain scale in terms of recurring revenues, like Elon said, we could get into a easily, kind of transaction to try and get funding.\n\n**Travis Axelrod** (Head of Investor Realtions)\nGreat. Thanks so much. And we will now move on to Mark from Goldman Sachs. Mark, please feel free to unmute yourself.\n\n**Mark Delaney** (US Autos &amp; Industrial Tech)\nYes. Good afternoon. Thank you very much for taking the questions. With the FSD trials that Tesla has been offering to consumers and the attention on self driving more generally, are you able to comment more specifically on what you're seeing with FSD subscription trends and take rates and help us better understand how large FSD revenue may be currently?\n\n**Vaibhav Taneja** (CFO)\nSo we've definitely like, I I mentioned it my in my opening remarks. Since we have launched version 12 of FSD in North America, we've definitely seen a marked improvement in the FSD adaption. And this the other thing which we had also done last year is we did bring down the pricing, and we've made subscription much more affordable. So we have seen, you know, 25% increase since that time. So which is an encouraging trend.\n\n**Vaibhav Taneja** (CFO)\nBut, honestly, we we've just started the story around explaining the benefits of FLD. We like I said before, we released our wake up safety report. Even if you don't believe in this anything else, a car on FSD being 10x safer should be a motivator. Plus, the other thing is people don't realize even at $99 a month, it's like you're getting a personal chauffeur almost $3.33 a day. And this is by far the biggest game changer, which I know we've been talking about it because part of it is we live and breathe it. But\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nI feel like Most people still don't know.\n\n**Vaibhav Taneja** (CFO)\nYeah.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nBut the the vast majority people don't know it exists, and it's still, like, half of Tesla owners who could use it haven't tried it even once. This they don't actually realize. Obviously, this is something we wanna educate them on.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nSo we've gotta when they come in for service, we'll reach out to them, send them, like, videos of how to make it work. And most most it it's so it's such a shocking thing. They don't they don't think a car is capable of this. So you have to have you have to show them and and and get them comfortable with turning it on and off. It's so trivial, but it's yeah.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nIt's like saying you've got a a cat there. Can you sing and dance? But it just looks like an old cat. And you're like, you know, until you see the cat sing and dance and talk, like, you assume it's just a cat. That's that's Tesla FC.\n\n**Vaibhav Taneja** (CFO)\nYes, sir.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nOur car is intelligent.\n\n**Vaibhav Taneja** (CFO)\nAnd so what we are gonna do to Elon's point, like, we've been giving people free time to try and try the SSD, but we'll start giving more prompts to say, okay. This particular drive, try FSD. So that I mean, because it's literally seeing is believing. Like Elon said, it's think of it like a cat. It looks like a normal cat, but this cat can sing in ads.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nYeah.\n\n**Vaibhav Taneja** (CFO)\nSame thing on Intelligence.\n\n**Travis Axelrod** (Head of Investor Realtions)\nGreat. Yeah. And that 25 comment was 25% increase in the penetration rate since we've seen the release of of v 12 and v 13 in North America. Great. Thank you. Mark, did you have a follow-up question?\n\n**Mark Delaney** (US Autos &amp; Industrial Tech)\nYeah. Thanks, Travis. Tesla has historically said it would use pricing as one tool to help drive auto vehicle growth as long as free cash flow stayed positive, given the ability to monetize products like FSD. I'm curious how you're thinking about pricing from here as a potential tool to drive increased volumes, given where you stand with FSD as well as the fact that the IRA purchase tax credits are poised to go away in The U. S.\n\n**Mark Delaney** (US Autos &amp; Industrial Tech)\nStarting in the fourth quarter. So should we expect more meaningful price reductions given that monetization potential? Or do you envision price reductions being more limited compared to cost downs given where free cash flow now stands? Thanks.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nWell, we're we're in this, like, weird transition period where we'll lose a lot of incentives in The US. There's a lot of incentives actually in many other parts of world, but we'll lose them in The US. And but we'll still look at the relatively early stages of autonomy. On the other hand, autonomy is most advanced and most available from a regulatory standpoint in The US. So, I mean, does that mean, like, we could have a few rough quarters?\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nYeah. We probably could have a few rough quarters. I'm not saying we will, but we could. Q, you know, q four, q one, maybe q two. But once you get to autonomy at scale in the second half half of next year, certainly by the end of next year, I think the I'd be surprised if if Tesla's economics, are not, very compelling.\n\n**Travis Axelrod** (Head of Investor Realtions)\nGreat. The next question is gonna come from, Will from Truist. Will, please, feel free to unmute yourself when you're ready.\n\n**William Stein** (MD &amp; Senior Analyst)\nGreat. Thanks so much for taking my questions. First, I'd like to ask for a little bit more detail about the lower cost model that you talked about having, I think, started production in the first half, but you said we'll ramp later. At the last analyst days, I recall, you talked about some aspects of this, like, two two thirds or three quarters reduction in silicon carbide and not using rare earths in the in the motor and perhaps other cost downs. You also had this unboxed architecture that I think you said would not be part of this sort of interim approach.\n\n**William Stein** (MD &amp; Senior Analyst)\nCan you update us on what we should expect this thing to actually look like?\n\n**Vaibhav Taneja** (CFO)\nOh, we won't get into the looks because Yeah.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nYou gotta watch the model work. Yeah.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nThey'll lift the cat out the bag there. Dancing cat that can sing and dance. But it can it talk and sing and dance, though. That's the cool part. Yeah.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nI mean, the the the fundamentally, the biggest obstacle remains that people just don't have enough some people don't the the desire to buy the car is very high. Just people don't have enough money in in the bank account to buy it. Literally, that is the issue. Not not a lack of desire, but a lackability. So the more affordable we can make the car, the better.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nI think it's it's gonna be it won't be a very big deal when people can release their car to the fleet and have it earn money for them, which I like I said, I'm think I feel confident in saying that'll happen next year in The US at least. And and in The US, we're we're legally allowed, you know, appropriate disclaimers. And and that'll make the affordability dramatically greater. Just like, you know, you could you if if you have an Airbnb and you and you rent out your your home when you're not there or rent out a a guest room or guest house or something like that, your the affordability of your home is much greater.\n\n**William Stein** (MD &amp; Senior Analyst)\nOkay. Trying another, another topic then. Can you know, we we see all these wonderful developments at x AI like Grok. And, you know, obviously, Tesla's trying to do quite a bit in AI. Elon, how do you manage the division of efforts and recruiting and talent and capital between these two that that seem like there's a very high potential that they can, in fact, compete?\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nWell well, are doing different things here. So, you know, the XAI is doing, like, you know, terabyte scale models and, multiterabyte scale models. You know, Tesla's a 100 times smaller models. So one's real world AI and one's kind of, I guess, artificial superintelligence type of thing. The I mean, the really kind of the the genesis for XAI was that there there there were certain people who some people would not join Tesla, AI engineers, because they wanted to work on ASI, and they would join Tesla.\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nAnd I was like, well, maybe they'll join a new company. And now I I think the Tesla problem is extremely important, but not everyone agrees with me on that. And so rather than have them join, you know, OpenAI or Google or or some other company, it's like, might as well have them create a company in that regard for it, which is, like, which is like AI. So that's, you know and and, you know, people can make a make a decision. Do they wanna work on, like, super intelligence at data center or real world AIs?\n\n**Elon Musk** (Technoking of Tesla, CEO &amp; Director)\nKinda they're they're both compelling problems, but some people wanna work on one and some wanna work on the other. Yeah.\n\n**Travis Axelrod** (Head of Investor Realtions)\nGreat. And, unfortunately, that is all the time we have today. Thank you everyone so much for your questions, and we will see you next quarter.",
      "fetched_at": "2026-02-04T15:39:13.073Z"
    },
    {
      "ticker": "TSLA",
      "title": "Tesla, Inc. (TSLA) Q1 FY2025 earnings call transcript",
      "published_date": "Apr 22, 2025, 5:30 PM EDT",
      "fiscal_year": "2025",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/TSLA/earnings/TSLA-Q1-2025-earnings_call-310668.html",
      "content": "**Travis Axelrod** (Head of Investor Relations)\nGood afternoon, everyone, and welcome to Tesla's first quarter 2025 Q&A webcast. My name is Travis Axelrod, Head of Investor Relations, and I'm joined today by Elon Musk, Vaibhav Taneja, and a number of other executives. Our Q1 results were announced at about 3:00 P.M. Central Time in the update deck we published at the same link as this webcast. During this call, we will discuss our business outlook and make forward-looking statements. These comments are based on our predictions and expectations as of today. Actual events or results could differ materially due to a number of risks and uncertainties, including those mentioned in our most recent filings with the SEC. During the question-and-answer portion of today's call, please limit yourself to one question and one follow-up. Please use the raise hand button to join the question queue. Before we jump into Q&A, Elon will be providing an update. Elon?\n\n**Elon Musk** (CEO)\nHello, everyone. It's never a dull moment these days. Thanks, for sure. Every day is going to be exciting. As some people know, there's been some blowback for the time that I've been spending in government with the Department of Government Efficiency, or DOGE. I think the work that we're doing there is actually very important for trying to rein in the insane deficit that is leading our country, the United States, to destruction. The DOGE team has made a lot of progress in addressing waste and fraud. The natural blowback from that is those who were receiving the wasteful dollars and the fraudulent dollars will try to attack me and the DOGE team and anything associated with me. I'm really left with two choices.\n\n**Elon Musk** (CEO)\nShould we just let the waste and fraud continue, and always continuing at it to grow at a really unsustainable pace that was bankrupting the country, or to fight the waste and fraud and try to get the country back on the right track? I believe the right thing to do is to just fight the waste and fraud and get the country back on the right track and working together with President Trump and his administration. Because if the ship of America goes down, we all go down with it, including Tesla and everyone else. I think this is critical work. The protesters that you'll see out there, they're very organized. They're paid for.\n\n**Elon Musk** (CEO)\nThey're obviously not going to say, admit that the reason that they're protesting is because they're receiving fraudulent money or that they're the recipients of wasteful largesse, but they're going to come up with some other reason. That is the real reason for the protests. The actual reason is that those receiving the waste and fraud wish to continue receiving it. That is the real thing that's going on here, obviously. Now, that said, I do think there's the large slug of work necessary to get the DOGE team in place and working in the government to get the financial house in order is mostly done. I think starting probably next month, May, my time allocation to DOGE will drop significantly.\n\n**Elon Musk** (CEO)\nI'll have to continue doing it for, I think, probably the remainder of the president's term just to make sure that the waste and fraud that we stop does not come roaring back, which it will do if it has the chance. I think I'll continue to spend a day or two per week on government matters for as long as the president would like me to do so and as long as it is useful. Starting next month, I'll be allocating far more of my time to Tesla now that the major work of establishing the Department of Government Efficiency is done. At Tesla, we've gone through many crises over the years and actually been through many near-death experiences. We probably were on the ragged edge of death at least maybe a dozen times. It's been so many times. This is not one of those times.\n\n**Elon Musk** (CEO)\nWe're not on the ragged edge of death, not even close. There are some challenges, and I expect that this year will be there'll probably be some unexpected bumps this year. I remain extremely optimistic about the future of the company. The future of the company is fundamentally based on large-scale autonomous cars and large-scale, large-volume, vast numbers of autonomous human-like robots. The value of a company that makes truly useful autonomous human-like robots and autonomous useful vehicles at scale, at low cost, which is what Tesla is going to do, is staggering. I continue to believe that Tesla, with excellent execution, will be the most valuable company in the world by far. That's an important if. We must execute well. If we do execute well, I think Tesla will be the most valuable company in the world by far.\n\n**Elon Musk** (CEO)\nIt may be as valuable as the next five companies combined. There will be a few bumps along the road before that happens. I said, I think, on the last earnings call that we'll start to see the prosperity of autonomy take effect in a material way around the middle of next year. We expect to have these be selling fully autonomous rides in June in Austin, as we've been saying for now several months. That has continued. The real question from a financial standpoint is, when does it really become material and affect the bottom line of the company and start to be a fundamental part of the, when does it move the financial needle in a significant way? That is probably around the middle of next year, second half of next year.\n\n**Elon Musk** (CEO)\nOnce it does start to move the financial needle in a significant way, it will really go exponential from there. I'd encourage people to look beyond the sort of bumps and potholes of the road immediately ahead of us, but lift your gaze to the bright, shining citadel on a hill, I don't know, some Reagan-esque imagery. That's where we're headed. In the not too distant future, like I said, end of next year type of thing. Let's see. With respect to supply chain risk, something that Tesla has been working on for several years is to localize supply chains. This actually makes sense from a cost standpoint and from a logistics risk standpoint, to have the supply chains be at least located on the continent in which the car is built.\n\n**Elon Musk** (CEO)\nWe are, I think, the least affected car company with respect to tariffs, at least in most respects. I mean, remains to be seen. Tariffs are still tough on a company when margins are still low. We do have localized supply chains in North America, Europe, and China. That puts us in a stronger position than any of our competitors. Undoubtedly, I'm going to get a lot of questions about tariffs. I just want to emphasize that the tariff decision is entirely up to the President of the United States. I will weigh in with my advice with the President, which he will listen to my advice, but then it's up to him, of course, to make his decision. I've been on the record many times saying that I believe lower tariffs are generally a good idea for prosperity.\n\n**Elon Musk** (CEO)\nThis decision is fundamentally up to the elected representative of the people, being the President of the United States. I'll continue to advocate for lower tariffs rather than higher tariffs, but that's all I can do. Let me walk you through why I'm so excited about the future of Tesla. First of all, autonomy. The team and I are laser-focused on bringing robotaxi to Austin in June. Unsupervised autonomy will first be solved for the Model Y in Austin. Actually, we should parse out the terms robotic taxi or robotaxi and just generally what's the CyberCab, because we've got a product called the CyberCab. Any Tesla, which could be an S, 3, X, or Y that is autonomous, is a robotic taxi or robotaxi. It's a bit confusing.\n\n**Elon Musk** (CEO)\nThe vast majority of the Tesla fleet that we've made is capable of being a robotaxi or a robotic taxi. Once we can make the system work where you can have paid rides fully autonomously with no one in the car in one city, that is a very scalable thing for us to go broadly within whatever jurisdiction allows us to operate. Because what we're solving for is a general solution to autonomy, not a city-specific solution for autonomy, once we make it work in a few cities, we can basically make it work in all cities in that legal jurisdiction. Once we can make it work in a few cities in America, we can make it work anywhere in America.\n\n**Elon Musk** (CEO)\nOnce we can make it work in a few cities in China, we can make it work anywhere in China, likewise in Europe, limited only by regulatory approvals. This is the advantage of having a generalized solution using artificial intelligence and an AI chip that Tesla designed specifically for this purpose, as opposed to very expensive sensors and high-precision maps of a particular neighborhood where that neighborhood may change or often changes, and then the cost stops working. We have a general solution instead of a specific solution. With regards to Optimus, we're making good progress in Optimus. We expect to have thousands of Optimus robots working in Tesla factories by the end of this year, doing useful work. We expect to scale Optimus faster than any product, I think, in history to get to millions of units per year, as soon as possible.\n\n**Elon Musk** (CEO)\nI think I feel confident in getting to a million units per year in less than five years, maybe four years. By 2030, I feel confident in predicting a million Optimus units per year. It might be 2029. Let's see. With respect to energy, our energy business is doing very well. The Megapack enables utility companies to output far more total energy than would otherwise be the case. When you think of the energy capability of a grid, it's much more than the total energy output per year. If the power plants could operate at peak power for all 24 hours as opposed to being at half power or sometimes a quarter power at night, you could double the energy output of existing power plants.\n\n**Elon Musk** (CEO)\nIn order to do that, you need to buffer the energy so that you can charge up something like a battery pack at night and then discharge into the grid during the day. This is a massive unlock on total energy output of any given grid over the course of a year. Utility companies are beginning to realize this and are buying in our Megapacks at scale. At this point, a gigawatt-class battery is quite a common thing. We have many orders in the offer for gigawatt and beyond batteries. We expect the stationary energy storage business to scale ultimately to terawatts per year. Very, very good numbers.\n\n**Elon Musk** (CEO)\nNow, the first quarters of a year are usually pretty tricky because it's usually the worst quarter of the year because people don't want to go buy a car in the middle of winter during a blizzard. We picked Q1 as a good quarter to do a cutover to the new version of the Model Y. We changed production of the world's best-selling cars, remembering the Model Y is the best-selling car of any kind on Earth, with a 1.1 million unit per year output of a single model. We did this changeover at the same time in factories all across the world. Congratulations to the Tesla team on an amazing job in pulling off what is a very difficult transition. It's really very impressive work. Yeah.\n\n**Elon Musk** (CEO)\nIn conclusion, while there are many near-term headwinds for us in the motor industry, the future for Tesla is brighter than ever. The value of the company is delivering sustainable abundance with our affordable AI-powered robots. I like this phrase, sustainable abundance for all. If you say, \"What's the ideal future that you can imagine?\" That's what you'd want. You'd want abundance for all in a way that's sustainable, it's good for the environment. Basically, this is the happy future. If you say, \"What's the happiest future you can imagine?\" One that would be a future where there's sustainable abundance for all. Closest thing to heaven we can get on Earth, basically. Thank you again to the Tesla team for all their efforts at this challenging time. I look forward to continuing to lead the team to great success in the future.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Thank you very much, Elon.\n\n**Travis Axelrod** (Head of Investor Relations)\nBefore we move on, Vaibhav has some opening remarks as well.\n\n**Vaibhav Taneja** (Chief Accounting Officer and CFO)\nThanks, Elon. As Elon mentioned, in Q1, we achieved something which has never been undertaken in the automotive industry of updating all our factories for the best-selling car in the world all at the same time. People don't understand this was not a small feat. We're not aware of anybody else being able to do the best-selling car all at once within a quarter, and that too hitting all the timelines which we had established at the beginning. Big kudos to the team for making this happen. Additionally, we also hit a record gross profit for our energy storage business in the quarter. Now, getting back into the business, there has been a lot of speculation as to the reasons for decline of our vehicle deliveries in the first quarter.\n\n**Vaibhav Taneja** (Chief Accounting Officer and CFO)\nWe had previously guided that we will be updating all factories, and this would lead to several weeks of lost production, which did happen as planned. The ripple effect of the change is not having enough new Model Y available in most markets for people to see and experience till the last few weeks of the quarter. Additionally, the negative impact of vandalism and unwarranted hostility towards our brand and our people had an impact in certain markets. Despite this, we were able to sell out legacy Model Y in the U.S., China, and a few other markets within the quarter. Just so people understand, we were producing the legacy Model Y till middle to end of February. We switched over, and we were able to still sell out within that period. Big achievement by all the people at Tesla to make it happen.\n\n**Vaibhav Taneja** (Chief Accounting Officer and CFO)\nWe have a very extremely competitive vehicle lineup, which with most vehicles going through a recent update. Add to that advances in FSD, you have a personal chauffeur which can take you almost anywhere under supervision. There are numerous stories shared by customers ranging from how it has improved their daily commute to providing mobility to customers with disabilities to giving older customers the ability to travel comfortably and independently. Not only is FSD supervised safer than a human driver, but it is also improving the lives of individuals who experience it. This is something you have to experience, and anybody who has experienced just knows it. We have been doing a lot lately, trying to get those stories out, at least on X, so that people can see how other people have benefited from this.\n\n**Vaibhav Taneja** (Chief Accounting Officer and CFO)\nNow, coming into some of the financial stuff, auto margins declined sequentially, primarily due to the reduction in the total number of deliveries, lower fixed cost absorption due to factory changeovers, and lower regulatory credit revenues offset by a slight increase in pricing due to the launch of new Model Y, despite incentives which we had to sell legacy Model Y. Our energy storage business, like I said before, has achieved yet another milestone of highest gross profit in the quarter. This was despite sequential decline in deployments. The importance of this business, as Elon mentioned, is pretty profound, especially in this environment, because in order for grids to work properly with the demands from AI and all this, you need some more stability. This is by far the simplest and best solution which we are aware of, which can help do this.\n\n**Vaibhav Taneja** (Chief Accounting Officer and CFO)\nWe have also developed certain unique solutions to help our customers to achieve this. Additionally, on the Powerwall side, we have been selling the new Powerwall 3, and it has been received with very good reception from customers and to the extent that we are currently supply constrained. On services and other margins, they were slightly down sequentially, primarily because of the pressure on our used car business and insurance business. Note that we continued our journey to improve profitability in our services and collision business through better labor productivity. As previously discussed, our operating expenses continued to increase sequentially, primarily due to our AI-related initiatives, including Optimus, and also cost of development for vehicle programs, including CyberCab, Semi, and cheaper models. These expenses flow through R&D.\n\n**Vaibhav Taneja** (Chief Accounting Officer and CFO)\nWe believe, even in the current environment, it is the right strategy to keep making investments in these areas to position us for the long term. These increases were offset by decreases in SG&A from changes in our vehicle referral program. Other income reduced significantly on a sequential basis. The primary reason was Bitcoin mark-to-market loss in Q1 versus gain in Q4, resulting in a $472 million drop. The remainder of the change is because of FX remeasurement. With the adoption of the new mark-to-market standard for Bitcoin, we expect increased volatility in other income in addition to the FX liquidity. I know tariffs is the hottest topic which people talk about, and it has various impacts to our business. As Elon mentioned, on the vehicle business, we've been on this journey of regionalization for years.\n\n**Vaibhav Taneja** (Chief Accounting Officer and CFO)\nSpecifically, in the U.S., Model Y has been rated the most American-made car on Cars.com America-Made Index three years in a row. This is part of all the work which the team has been doing over the years. To the extent that today, if you look at our vehicle lineup in the U.S., we're approximately, on a weighted average basis, 85% USMCA compliant. Like Elon said, this definitely gives us a bigger edge as compared to our other OEMs in terms of managing the tariffs. We're not immune because when the Section 232 auto tariffs become effective in May, which includes Canada and Mexico, and Canada and Mexico have been part of our regionalization strategy, they will have an impact on profitability.\n\n**Vaibhav Taneja** (Chief Accounting Officer and CFO)\nI know research modeling on this impact has been about a couple of thousand gigawatts, which is pretty much in line with what we've been forecasting. The impact of tariffs on the energy business will be outsized since we source LFP battery cells from China. We're in the process of commissioning equipment for the local manufacturing of LFP battery cells in the U.S. However, the equipment which we have can only service a fraction of our total installed capacity later on. We've also been working on securing additional supply chain from non-China-based suppliers, but it will take time. Also note that Megafactory, irrespective of all the impact on the U.S. from tariffs on the energy business, we do have Megafactory China, which just started operations in Q1, and that should take care of our business outside of the U.S.\n\n**Vaibhav Taneja** (Chief Accounting Officer and CFO)\nThere's also an important impact of tariffs on our capital investments. I know this is going to sound counterintuitive since in order to onshore manufacturing or expand lines, we have to bring equipment from outside the U.S. because there is not that much capacity in the U.S. In the current trade environment, such equipment being brought in is subject to the\n\n**Elon Musk** (CEO)\nexpenses bringing in from China right now.\n\n**Vaibhav Taneja** (Chief Accounting Officer and CFO)\nExactly. The reality is that China has the basic one which has the most capacity to provide this equipment. Our CapEx guidance, inclusive of model tariffs, even with the optimization we have tried to do, is forecasted to be still in excess of $10 billion this year. We're still evaluating what more to do on this side. To summarize, we have near-term challenges in our business due to tariffs and bad image.\n\n**Vaibhav Taneja** (Chief Accounting Officer and CFO)\nWe think our strategy of providing the best product at a competitive price is going to be a winner. This is the reason we're still focused on bringing cheaper models to market soon. The start of production is still planned for June. Additionally, the advancement in FSD-related features, including pilot Robotaxi launch in Austin later this year, should help create a new era of demand. I would like to thank everyone at Tesla and our customers.\n\n**Travis Axelrod** (Head of Investor Relations)\nFantastic. Thank you very much, Vaibhav. Now we will move on to investor questions. We will start with questions from saytechnologies.com. First question is, what are the highest risk items on the critical path to Robotaxi launch and scaling?\n\n**Elon Musk** (CEO)\nIt is Ashok.\n\n**Travis Axelrod** (Head of Investor Relations)\nYeah, we've got Ashok on the line.\n\n**Elon Musk** (CEO)\nSure. Just to back, we're just stopped by the just to ambiguate the CyberCab from Robotaxi once again.\n\n**Elon Musk** (CEO)\nWhen will the Teslas, because the Teslas that will be fully autonomous in June in Austin will be Model Ys. That is currently on track to be able to do paid rides fully autonomously in Austin in June. Then to be in many other cities in the U.S. by the end of this year. It's difficult to predict the exact ramp sort of week by week and month by month, except that it will ramp up very quickly. It's going to be like basically an S curve where it's very difficult to predict the intermediate slope of the S curve, but you kind of know where the S curve is going to end up, which is the vast majority of the Tesla fleet being autonomous.\n\n**Elon Musk** (CEO)\nThat's why I feel confident in predicting large-scale autonomy around the middle of next year, certainly the second half of next year. Meaning, I predict that there will be millions of Teslas operating fully autonomously in the second half of next year. Yeah. It does seem increasingly likely that there will be a localized parameter set for sort of especially for places that have, say, very snowy weather, like say if you're in the northeast or something. You can think of it, it's kind of like a human. If you can be a very good driver in California, but are you going to be also a good driver in a blizzard in Manhattan? You're not going to be as good. There is actually some value in you can still drive, but your probability of an accident is higher.\n\n**Elon Musk** (CEO)\nIt's increasingly obvious that there's some value to having a localized set of parameters for different regions and localities. That put that in the nice-to-have category. It's not the required category. Again, really, the car is just very much like a human. It's digital neural nets and cameras, and humans operate with biological neural nets and eyes. The same strengths and weaknesses will be present for a digital neural net and cameras versus a biological neural net and eyes. Ashok, if you'd like to elaborate on that.\n\n**Ashok Elluswamy** (VP of AI Software and Director of Auto Pilot Software)\nYeah. Speaking to the location-specific models, we still have a generalized approach. You can see that from our deployment of FSD supervised in China, where with just very minimal data that's China-specific, the models generalize quite well to completely different driving styles.\n\n**Ashok Elluswamy** (VP of AI Software and Director of Auto Pilot Software)\nThat just shows that the AI-based solution that we have is the right one because if you had gone down the previous rule-based solutions or more hardcoded HTML-based solutions, it would have taken many, many years to get China to work. You can see those in the videos that people post online themselves. The generalized solution that we are pursuing is the right one that's going to scale well. You can think of this location-specific parameters that Elon alluded to as a mixture of experts. If you're sort of familiar with the AI models like Grok and others, they all use this mixture of experts to sort of specialize the parameters to specific tasks while still being general. This makes the model use a limited amount of compute to solve for the diversity of tasks that it has to solve.\n\n**Ashok Elluswamy** (VP of AI Software and Director of Auto Pilot Software)\nIn terms of addressing the question that asks for what are the critical things that need to get right, one thing I would like to note is validation. Self-driving is a long-tail problem where there can be a lot of edge cases that only happen very, very rarely. Currently, we are driving around in Austin using our QA fleet, but then it's super rare to get interventions that are critical for Robotaxi operation. You can go many days without getting a single intervention. You can't easily know whether you are improving or regressing in your capacity. We need to build out sophisticated simulations, including neural network-based video generation.\n\n**Ashok Elluswamy** (VP of AI Software and Director of Auto Pilot Software)\nThat's all happening in the background to make sure that we deliver a safe product and we are able to measure our safety, even though we can't just see it by driving around the block or something like that.\n\n**Elon Musk** (CEO)\nI mean, very basic terms. If we're seeing an accident every 10,000 miles, well, then you have to drive 10,000 miles on average before you get an accident or an intervention. It's like, okay. I mean, people must be very worried now by the sheer number of Teslas doing circuits in Austin right now. We're like, it's going to look pretty bizarre. Yeah. Some people are chasing us away. Yeah. There's just always a convoy of Teslas going all over to Austin in circles. I just can't emphasize this enough.\n\n**Elon Musk** (CEO)\nIn order to figure out long-tail things, if it's 1 in 10,000, let's say it's 1 in 20,000 miles or 1 in 30, then the average person drives 10,000 miles in a year. Now try to compress that test cycle into a matter of a few months. That means you need a lot of cars doing a lot of driving in order to compress that or do in a matter of a month what would normally take someone a year.\n\n**Vaibhav Taneja** (Chief Accounting Officer and CFO)\nI would just also add that if you haven't looked at those videos coming out of China, people are really\n\n**Elon Musk** (CEO)\n—oh yeah, those videos are amazing.\n\n**Vaibhav Taneja** (Chief Accounting Officer and CFO)\nThey're putting it to real test. I mean, they're taking the dirt roads.\n\n**Elon Musk** (CEO)\nFrankly, I think the Chinese consumer might be the most demanding consumer. Actually, our customers in China are awesome.\n\n**Elon Musk** (CEO)\nThey have a lot of fun with the cars. I saw one guy take a Tesla autonomously on a narrow dirt road across a mountain. I'm like, \"I'm still a very brave person.\" The Tesla's driving along on a road with no barriers. Wherever he makes a mistake, he's going to plunge to his doom. It worked.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Thank you.\n\n**Speaker 12** (Company Representative 1)\nIf the question was on CyberCab itself, we're in B sample validation now. Yeah, yeah. We should ask that question too. We have our first big builds coming at the end of this quarter in Q2. In the coming months, we start large-scale installation of all the equipment in Giga Texas, still on schedule for production next year.\n\n**Vaibhav Taneja** (Chief Accounting Officer and CFO)\nYeah. I just want to also clarify because I think people do not understand the thing that there is no new building being built. Where is CyberCab going to place? Oh, it is in the same factory.\n\n**Speaker 13** (Company Representative 2)\nYeah, yeah. It is happening. People do not even know it is just happening upstairs and along the lines while we are still building the Model Ys and Cybertrucks every day. Yeah.\n\n**Elon Musk** (CEO)\nYeah. It is worth noting that the Tesla Gigafactory in Austin is three times the size of the Pentagon, including the garden. Yeah. Yeah. Including the Ground Zero garden. I go to the Pentagon, I am like, \"This building used to look big, but then you will not.\"\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Thank you very much. The next question is, when will FSD unsupervised be available for personal use on personally owned cars? Before the end of this year.\n\n**Elon Musk** (CEO)\nNot necessarily every—let's say within the U.S., we do want to test. At Tesla, we're absolutely hardcore about safety. We go to great lengths to make the safest car in the world and have the lowest accidents per mile and fewest lives lost. We want to be very careful. We want autonomy to be definitively safer than manual driving. It's not enough that it just be as safe. It needs to be meaningfully safer than if it's cars manually driven. We want to confirm that. There's not something—we just want to be cautious with the rollout. We don't want to jump in at the deep end with an army. That said, I think people should be able to have it work in several cities later this year for personal use.\n\n**Elon Musk** (CEO)\nThe asset test being, you should be able to—can you go to sleep in your car and wake up at your destination? I'm confident that will be available in many cities in the U.S. by the end of this year.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Thank you very much. The next question is, is Tesla still on track for releasing more affordable models this year, or will you be focusing on simplified versions to enhance affordability similar to the rear-wheel drive Cybertruck?\n\n**Speaker 14** (Company Representative 3)\nYeah. We're still planning to release models this year. As with all launches, we're working through the last-minute issues that pop up. We're knocking them down one by one. At this point, I would say that ramp maybe might be a little slower than we had hoped initially, but there's nothing just kind of given that turmoil that exists in the industry right now.\n\n**Speaker 14** (Company Representative 3)\nThere is nothing that's blocking us from starting production within the timeline we laid out in the opening remarks. I will say it's important to emphasize that, as we've said all along, the full utilization of our factories is the primary goal for these new products. Flexibility of what we can do within the form factor and the design of it is really limited to what we can do on our existing lines rather than building new ones. We've been targeting the low cost of ownership. Monthly payment is the biggest differentiator for our vehicles. That's why we're focused on bringing these new models with the lowest price to the market within the constraints I just highlighted.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Thank you very much. The next question is, does Tesla see Robotaxi as a winner-take-most market?\n\n**Travis Axelrod** (Head of Investor Relations)\nAs you approach the Austin launch, how do you expect to compare against Waymo's offering, especially regarding pricing, geofencing, and regulatory flexibility?\n\n**Elon Musk** (CEO)\nThe issue with Waymo's cars is they cost way more money. That is the issue. Their cars are very expensive, made in low volume. Teslas are, I don't know, probably cost a quarter or 20% of what a Waymo costs and made in very high volume. Ironically, we're the ones that made the bet that a pure AI solution with cameras and audio, the car actually will listen for sirens and that kind of thing, is the right move. Waymo decided that an expensive sensor suite was the way to go, even though Google's very good at AI. Ironically.\n\n**Elon Musk** (CEO)\nIt is worth noting that Tesla's built an incredible AI software team and AI hardware chip design team from scratch, from nothing. We didn't acquire anyone. We just built it. Yeah, it's really—I mean, I don't see anyone being able to compete with Tesla at present. I'm sure that'll change eventually. At least as far as I'm aware, Tesla will have, I don't know, 99% market share or something ridiculous. 90-something percent, at least. I don't know. Some of them might change, but if we have millions of cars deployed next year and unless others have millions of cars deployed, we'll have—unless we're blocked by regulatory situations, it won't be long. I mean, in a few years, we'll have 10 million autonomous cars on the roads and counting.\n\n**Vaibhav Taneja** (Chief Accounting Officer and CFO)\nThe other thing which people forget is we're not just developing the software solution.\n\n**Vaibhav Taneja** (Chief Accounting Officer and CFO)\nWe are also manufacturing the cars. Like what Waymo has, they're taking cars and then trying to put Waymo money. We don't do that. That definitely gives us a big leg up. Like Elon said, we already have a big existing fleet, which hopefully with the software update could become autonomous soon.\n\n**Elon Musk** (CEO)\nWith the software update, it will become autonomous. To be clear, the Model Ys that we're talking about in being autonomous in Austin in June are the Model Ys we make currently. There's no change to it.\n\n**Vaibhav Taneja** (Chief Accounting Officer and CFO)\nI think people don't appreciate that the car which they can buy today—\n\n**Elon Musk** (CEO)\nthe car that they have—\n\n**Vaibhav Taneja** (Chief Accounting Officer and CFO)\nor the car they have is capable of these kinds of things.\n\n**Ashok Elluswamy** (VP of AI Software and Director of Auto Pilot Software)\nIn fact, it does drive autonomously from the factory to the end of line, every car.\n\n**Speaker 13** (Company Representative 2)\nYeah. It's like a truck through the tunnel. The Model Ys, everything.\n\n**Elon Musk** (CEO)\nRight. Yeah. Exactly. It is inputted to use. It's doing useful work fully autonomously at the factories, as Ashok was mentioning. The cars drive themselves from end of line to where they're supposed to be picked up by a truck to be taken to a customer. I'm confident also that later this year, the first Model Y will drive itself all the way to the customer. From our factory in Austin and our one here in Fremont, California, I'm confident that from both factories, we'll be able to drive directly to a customer from the factory. Tool delivery. Yeah. Literally goes from the end of line and drives itself to your house.\n\n**Speaker 13** (Company Representative 2)\nIt's important to note in the factories, we don't have dedicated lanes or anything. People are coming in and out every day, trucks delivering supplies, parts, construction.\n\n**Elon Musk** (CEO)\nPeople can film it. By the way, you can see this from the road. It's uncovered.\n\n**Speaker 13** (Company Representative 2)\nExactly.\n\n**Elon Musk** (CEO)\nThere are videos. People take videos online. Anyone who wants to go see it can just drive past our Fremont factory and see the autonomous cars driving themselves. They drive themselves and they put themselves in the exact right spot to be picked up.\n\n**Speaker 13** (Company Representative 2)\nYeah. The logistics yard is right there in the open.\n\n**Speaker 13** (Company Representative 2)\nYou can see it. We do not move it again to another lane.\n\n**Elon Musk** (CEO)\nThey go to a specific parking spot.\n\n**Speaker 13** (Company Representative 2)\nYeah.\n\n**Elon Musk** (CEO)\nYeah. That is just a routine, everyday thing that is great.\n\n**Travis Axelrod** (Head of Investor Relations)\nThank you very much. The next question is, can you please provide an update on the unboxed method and how that is progressing?\n\n**Speaker 14** (Company Representative 3)\nSure. It is progressing. Absolutely. As I mentioned just a minute ago, it is the basis for our CyberCab manufacturing process.\n\n**Speaker 14** (Company Representative 3)\nIt's really what we changed in order to allow the low cost of production and also get the super high levels of automation. Really, levels of automation that are sort of unheard of in the vehicle manufacturing scale. This is not something that when you see it be produced, you'll think of in terms of, \"Wow, that's how a car has been built for 100 years.\" It's really something we've changed. In the past year, we've been focusing on a lot of key development areas, like marrying these large sub-assemblies together in a precise way, in an accurate way. We've also de-risked things like corrosion of uncoated aluminum structures, the sealing across the seams of the vehicle when you marry assembled components. We've even done early crash testing and proven that it's going to be just as safe as every other car we've built.\n\n**Speaker 14** (Company Representative 3)\nWith all that combined, we kind of go into the builds that we have at the end of this quarter for the CyberCab product. That is the next real big test of full-scale integration of the unboxed process. Yeah, that is kind of where we are. You will see them in test and on the test roads in a couple of months.\n\n**Elon Musk** (CEO)\nYeah. Although the line will not be upset at this rate.\n\n**Speaker 14** (Company Representative 3)\nInitially.\n\n**Elon Musk** (CEO)\nInitially. This is a revolutionary production system. I am not sure what the right word is. Unboxing sounds like something like when you get your phone. Yeah.\n\n**Speaker 14** (Company Representative 3)\nYou open it up.\n\n**Elon Musk** (CEO)\nYeah. You have a pleasant experience when you take your phone out of the box, which, of course, is nice, but this is much more revolutionary than that. This is a profound reimagining of how to make cars in the first place.\n\n**Elon Musk** (CEO)\nNo car is made like this anywhere in the world. The factory is the product as much as the car is the product. It is really just the first principles approach to manufacturing that will ultimately allow us, I think, to—I'm trying to think. I'm confident ultimately it'll allow us to achieve a cycle time, meaning a unit every five seconds or less, or for single line.\n\n**Speaker 13** (Company Representative 2)\nWe want to incorporate some of these for testing into our existing production lines as well to do that with the one Cybertruck already.\n\n**Elon Musk** (CEO)\nI mean, this is something I've been thinking about for a long time. I've sort of been thinking about this for a long time. It is kind of—not a crazy thing. A car every five seconds may sound like it's coming out like bullets, but actually, it's coming out at walking speed.\n\n**Speaker 16**\nIt's like a meter a second.\n\n**Elon Musk** (CEO)\nA meter a second. This is—we're still far away from caring about the aerodynamic drag of the manufacturing line, because you're still at 3 miles an hour type of thing.\n\n**Speaker 16**\nWe live just like us.\n\n**Elon Musk** (CEO)\nYou know, every five seconds sounds crazy, but it's 3 miles an hour that we're talking about. Yeah, you can run away from it, basically. That is still by far the fastest line on earth. I don't know. It's like half hour, half order maintenance, kind of. What's the best thing in line? I don't know if it's like about—\n\n**Speaker 16**\nShanghai phase 2.\n\n**Elon Musk** (CEO)\nAnd that's us?\n\n**Speaker 16**\n33 seconds. Yes.\n\n**Elon Musk** (CEO)\nAnd we're the fastest, right?\n\n**Speaker 16**\nI would think so.\n\n**Elon Musk** (CEO)\nWe think we're the fastest at 33 seconds in our Shanghai factory. This would be six times faster or seven times faster or less.\n\n**Elon Musk** (CEO)\nYeah, I mean, it'll be slower than that at first. The point is that when you fully optimize the design and operation of the next generation factory that we're building right now, a five-second cycle time or less is the design is capable of it. If you—when you go through a radical new architecture, you go from being an A—I mean, I'd say probably Shanghai in particular is an A-plus on a moderately advanced but still traditional car production system. Sort of they're really doing about as good as possible to do within a conventional scenario. Trying to get much below sort of below like 30 seconds is extremely difficult. You start getting into sort of impossible where you have to be faster than a human could possibly move. The autonomous line, it really just needs to be robust, moving really fast.\n\n**Elon Musk** (CEO)\nThat's where you get to sub-five seconds. We'll start off with getting a C instead of an A, getting a C in a new architecture. The potential is there over time to move that up to an A-plus within an A-plus architecture.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Thank you very much. The next question is, how is Tesla positioning itself to flexibly adapt to global economic risks in the form of tariffs, political biases, etc.?\n\n**Ashok Elluswamy** (VP of AI Software and Director of Auto Pilot Software)\nAs Elon said, we've been a supply chain team for a while. We continue to mitigate global economic risks like tariffs and political biases by regionalizing parts supply near its factories in North America, Berlin, and Shanghai. For example, in North America, our high-volume vehicle programs have over 85% North America content, and Shanghai vehicles have over 95% local content.\n\n**Ashok Elluswamy** (VP of AI Software and Director of Auto Pilot Software)\nBerlin has similar levels of regionalization as North America when you exclude the battery, and we are working on regionalizing the battery as well. This is a pre-pandemic strategy that we accelerated post-pandemic through supplier diversification, dual sourcing, vertical integration, advanced analytics, and local partnerships to ensure supply chain resilience and production stability. Having said that, we are not 100% insulated, and these tariff rates are higher on our low-volume platforms than the high-volume ones.\n\n**Elon Musk** (CEO)\nYeah. In fact, there's no more vertically integrated car company than Tesla. I mean, we're the most vertically integrated car company since Henry Ford back in the day when they were doing mining iron and stuff and growing rubber trees. We are not growing rubber trees and mining iron yet. We have built a lithium refinery in South Texas, and it's the biggest lithium refinery outside of China, I think.\n\n**Elon Musk** (CEO)\nIs that right?\n\n**Speaker 16**\nYeah. I think so.\n\n**Speaker 16**\nWhat wasn't selling?\n\n**Elon Musk** (CEO)\nBut its output potential would be the biggest lithium refinery outside. We've got space to expand there if we need to build more. Right. We've got the cathode refinery in Austin next to the Gigafactory. We're going to figure out what to do about the anode. It's an ongoing subject of discussion. The best of all possible worlds would be figuring out how to have no anode. Best part being no part. That's the dream of the lithium batteries, to not have an anode. Either way, we better have the anode, the cathode, the lithium, the electrolytes, and the separator to make a cell. There's no other car company that has built lithium refineries and cathode refineries, ridiculously vertically integrated. That's our best position to protect against supply chain disruptions. Yeah.\n\n**Speaker 16**\nAnyone want to talk about the progress in the front?\n\n**Elon Musk** (CEO)\nYeah. Certainly, for our in-house cells, we've multi-sourced every component. We have every part coming from at least two different countries, large, which is we started this. The supply chain team and the engineering team worked together on this for the last couple of years to put that together. It's not something we did in a couple of months. This is years of work. We are in a good position to take advantage of that. The insourcing of lithium and cathodes, they're the two most critical parts of the battery that's right in our backyard, and we're totally insulated from.\n\n**Elon Musk** (CEO)\nThey need to be in operation.\n\n**Speaker 16**\nThey need to be in operation.\n\n**Speaker 16**\nThat's the right line.\n\n**Elon Musk** (CEO)\nWe also make our own cells, by the way.\n\n**Elon Musk** (CEO)\nCell production, if you look, there's this, you make the anode, the cathode, the lithium, the electrolyte separator, the can, and then you got to put all that together in the cell factory. There are entire companies that all they do is produce cells, but they don't do the other stuff. They don't refine lithium or the cathode or so our cell production is going quite well. I think we're currently sort of the lowest cost per kilowatt hour in the U.S. for all the cells we purchase in North America. Yeah. It's lowest cost to us. Yeah. We have the lowest cost per kilowatt hour, all things considered. The Tesla cell is the most competitive cell. Yeah. For a kilowatt hour put into a car, if it's a Tesla cell, it's lower cost than if it's a supplier cell.\n\n**Elon Musk** (CEO)\nYeah. Yeah. The plan this year is to really build off that base. Getting to lowest cost, it's the hardest challenge for the cell manufacturing. It's relatively easy to build a flashy product that does one thing well. To build something at high volume and low cost is super difficult. We're kind of using that as a base to then build off and add performance in different areas for new products coming out.\n\n**Speaker 15** (Company Representative 4)\nYeah. I mean, to Elon's point, there's a lot of advantages for regionalization. The most important thing is we're not tying up working capital for six to eight weeks on the ocean. If there's a design change, then everything that's in transit basically has to be scrapped. Secondly, port disruptions, as we saw during COVID, can be very expensive because slight disconnects can shut down production. Your only option is costly air expedite.\n\n**Speaker 15** (Company Representative 4)\nIt also gives us resilience in supply chain. If one region is down, we can bridge with others. It's more work to set up in the beginning, but it's critical to have when the need arises. Having said that, it's unrealistic to assume 100% regionalization across the board for specialized areas such as semiconductors. In such cases, our team works very closely with our partners to ensure we have strategic banks in place, and a disruption doesn't impact production while we stand up the regional manufacturing for that particular commodity. I'll say on the rest of the vehicle, like Elon was talking about with cells, we're also heavily vertically integrated. Import ingots, in terms of the castings, we recycle those in melts. There's the same thing with plastics. It doesn't mean we're not exposed.\n\n**Speaker 15** (Company Representative 4)\nWe do have some areas where we use rear-array magnets, and we've been working for years to find alternative sources and bring those up, as well as we have our induction machines. As we've mentioned in the past, we're working on our ferrite numbers for some time. As Karn said, with our heavy regionalization percentages, we're definitely the lowest exposed to this, but we're not completely immune as I've mentioned in so many other words.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Similarly related, on the battery side, does Tesla still have a battery supply constraint, as noted on the Q4 call? Does that change with tariffs?\n\n**Steven Karn** (Specialist Three)\nThis is Karn. We've been working very hard to expand battery cell production in the U.S., both with vendors and what Bonnie mentioned earlier with the 4680 program.\n\n**Steven Karn** (Specialist Three)\nWe're also working on moving the upstream supply chain for battery cells to the United States for several years. That strategy is really starting to pay off now. As it stands right now, we're not constrained on battery cell supply for vehicles. The recent tariffs do pose some challenges to Tesla Energy, like our CFO mentioned earlier. It's something we've been anticipating, and we should be able to resolve in a timely fashion. We actually have a plan in place where we're executing towards it. We also have some other sources coming online to supplement the shortfall. Of course, we have the LFP production that's happening in-house. We have a slight disconnect of aligning the right cells with the right path. That's the little bit of puzzle that we have to solve internally. As far as cells go, there's no shortage.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Thank you very much. The next question is, did Tesla experience any meaningful changes in order inflow rate in Q1 relating to all of the rumors of brand damage?\n\n**Speaker 13** (Company Representative 2)\nIn Q1, as mentioned earlier, we took the best-selling car of the last two years and ramped up all four of our global factories. In less than eight weeks, we've already gone to the rate of our previous Model Ys in the factories. Just kudos again to the team for the great job there. Despite the economic strain and negative articles in California in Q1, Tesla remained the best-selling car, not just EV. Additionally, we had a record number of test drives globally in Q1 as well. Interest remains high. Right now, we continue to see good interest still in the vehicle.\n\n**Elon Musk** (CEO)\nYeah. I mean, Tesla is not immune to sort of the macro-demand for cars. When there is economic uncertainty, people generally want to pause on buying during a major capital purchase like a car. As far as absent macro issues, we do not see any reduction in demand.\n\n**Speaker 13** (Company Representative 2)\nCorrect. That is where we continue to focus on affordability. It is fun to focus there. Yeah.\n\n**Travis Axelrod** (Head of Investor Relations)\nFantastic. Thank you, guys. The next question is, regarding the Tesla Optimus pilot line, could you confirm if it is currently operational? If so, what is the current production rate of Optimus bots per week? Additionally, how might the recent tariffs impact the scalability of this production line moving forward?\n\n**Elon Musk** (CEO)\nI want to just emphasize, Optimus is still very much a development program. It is not a large volume production that is quiet. This year, we will make a few.\n\n**Elon Musk** (CEO)\nWe do expect to make thousands of Optimus robots, but most of that production is going to be at the end of the year. Almost everything in Optimus is new. There's not an existing supply chain for the motors, gearboxes, electronics, actuators, really anything in the Optimus, apart from the Tesla AI computer, which is the same as the one in the car. When you have a new complex manufactured product, it'll move as fast as the slowest and least lucky component in the entire thing. As a first-order approximation, there's like 10,000 unique things. That's why anyone who tells you they can predict with precision the production ramp of a truly new product doesn't know what they're talking about. It is literally impossible.\n\n**Elon Musk** (CEO)\nYou go through this series of constraints where it's like this part's the limiting factor, now that part's the limiting factor, now this part's the limiting factor, and multiply that by 1,000, basically. The rate of the production ramp is decided by how quickly you can solve each of those problems. Optimus was affected by the magnet issue from China because the Optimus actuators in the arm do use permanent magnets. Tesla as a whole does not need to use permanent magnets. When something is volume constrained, like an arm of the robot, you want to try to make the motors as small as possible. We did design in permanent magnets for those motors, and those were affected by the supply chain by basically China requiring an export license to send out any rare earth magnets.\n\n**Elon Musk** (CEO)\nWe're working through that with China. Hopefully, we'll get a license to use the rare earth magnets. China wants some assurances that these are not used for military purposes, which obviously they're not. They're just going into a humanoid robot. It's not a weapon system. That is an example of a challenge there. I'm confident we'll overcome these issues, and we'll, by the end of this year, have thousands of Optimus robots.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Thank you very much. The last question we already covered earlier, whether Robotaxi was still on track for this year. With that, we can move on to analyst questions. The first question is going to come from Pierre at New Street. Pierre, please unmute yourself.\n\n**Pierre Ferragu** (Analyst)\nHey, guys, can you hear me?\n\n**Travis Axelrod** (Head of Investor Relations)\nYeah.\n\n**Pierre Ferragu** (Analyst)\nThat's great. I'm super excited to hear Robotaxi and Optimus becoming the very tangible future for Tesla.\n\n**Pierre Ferragu** (Analyst)\nI have actually a question on the legacy, not the legacy, but the current auto business. When I look back at the ramp of Model 3 a few years ago, I really saw it as being the iPhone of cars, a new product, completely reinvented, very different user experience, vastly superior, impossible to match for traditional competitors. For the iPhone, it resulted in the high end of the smartphone market quadrupling in size and actually Apple taking 60% market share. When you look at the Model 3 and the Model Y today, I think they are still really vastly superior to any other cars. I wonder why they've taken about 15% of their addressable market and not more, actually.\n\n**Pierre Ferragu** (Analyst)\nAnother way to put it is, why are there so many people still buying BMWs and Mercedes knowing that the Model 3 and the Model Y are out there and available? I wonder if you're trying to solve that rather internally, if you understand why, what are these auto buyers who are not buying a Model 3 or a Model Y missing? If you have ideas of things you could do to address that, maybe there is enormous value left on the table there. That's what I'm wondering these days.\n\n**Elon Musk** (CEO)\nThe reality is that in the future, most people are not going to buy cars. It is kind of, one could sort of say, look, if you want to continue with your phone metaphor, I mean, you can remember the days of the flip phones when there were 100 different flip phone designs.\n\n**Elon Musk** (CEO)\nThe mistake that manufacturers made was to try to make many different variants of a flip phone, which was a mistake. They should have made the iPhone. Obviously, everyone's going to want a smartphone. In the beginning of when the iPhone came out, I was like, wow, I can't believe these guys are not reacting as though this is death. They kept making variants of flip phones. Nokia, I think at one point was the most valuable company in the world or close to it. They kept making flip phones, trying to find another market niche. Maybe somebody wants a phone of a different style, maybe this different color or whatever it is. Nope, they just want a super intelligent phone that can do everything. Just one.\n\n**Elon Musk** (CEO)\nI said this many years ago, in the future, in the not too distant future, buying a gasoline car that is not autonomous will be like riding a horse while using a flip phone. Some people still do it, but it's rare.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Thank you. The next question comes from Emmanuel Rosner at Wolfe Research. Emmanuel, please unmute yourself.\n\n**Emmanuel Rosner** (Managing Director and Senior Autos and Auto Tech Analyst)\nGreat. Thanks for taking my question. Elon, the public version of the FSD software still has a decent amount of, I guess, intermittent human interventions that are required. What's still required for the software on your end to get to a level where it doesn't need to be supervised? I'm asking that in the context of, obviously, the June launch being in the next couple of months. What still needs to happen?\n\n**Ashok Elluswamy** (VP of AI Software and Director of Auto Pilot Software)\nWe are working on a number of items too. Yeah.\n\n**Ashok Elluswamy** (VP of AI Software and Director of Auto Pilot Software)\nI mean, we are aware of the interventions that are happening in the public builds. That is why we are hardcore burning it down. Really speaking, some initial launch city helped us focus on solving all the issues that you'd face here. For example, like we're focusing on Austin, we're not solving all the issues that customers in Boston or somewhere else might face. Here, we just have a big list of all the issues, just burn it down. That is what the team is working on, along with other sort of redundancy issues. For example, if one of the computers goes down, right down the customer fleet, it would throw the red hands and ask you to take over. We do not want that kind of situation.\n\n**Ashok Elluswamy** (VP of AI Software and Director of Auto Pilot Software)\nWe're solving both the reliability issues of the autonomy software and also the reliability issues of the system software together for Austin.\n\n**Elon Musk** (CEO)\nYeah. We just worked through a long tail of unusual interventions. These are really very rare. As I was saying earlier, intervention every 10,000 miles. I mean, that's a lot of driving you've got to do to even find one case within Austin's.\n\n**Ashok Elluswamy** (VP of AI Software and Director of Auto Pilot Software)\nYeah. Some interventions are systematic missing functionality, for example, for handling emergency vehicles correctly. You don't need to consume audio as an input. The customer-facing versions don't have audio input. The version that's going to be in Austin will have audio input and so on.\n\n**Emmanuel Rosner** (Managing Director and Senior Autos and Auto Tech Analyst)\nOkay. Would you have remote operators, for example?\n\n**Ashok Elluswamy** (VP of AI Software and Director of Auto Pilot Software)\nI mean, every now and then, if a car gets stuck or something, someone will unblock it.\n\n**Ashok Elluswamy** (VP of AI Software and Director of Auto Pilot Software)\nIt is just because we are a bit conservative and tend towards more safety than even if it gets stuck every now and then, we do have remote support. It is not going to be required for safe operation. If anything, it is just required for more availability.\n\n**Elon Musk** (CEO)\nAnyway, it is only a couple of months away. You can just see for yourself in a couple of months in Austin.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Our next question comes from Edison at Deutsche Bank. Edison, please unmute yourself.\n\n**Edison Yu** (Analyst)\nHi. Thank you very much for the question. I want to ask about the Optimus supply chain going forward. You mentioned very fast ramp-up. What do you envision that supply chain looking like? Is it going to require many more suppliers to be in the U.S. now because of the tariffs? How does one kind of think about what needs to happen there?\n\n**Elon Musk** (CEO)\nWe have to see how things settle out. I don't know yet. I mean, some things we're doing, as we've already talked about, which is that we've already taken command steps to localize our supply chain. We're more localized than any other manufacturer. We have a lot of things underway to increase the localization to reduce supply chain risk associated with geopolitical uncertainty.\n\n**Travis Axelrod** (Head of Investor Relations)\nDid you have a follow-up, Edison?\n\n**Edison Yu** (Analyst)\nYeah. I wanted to come back actually to the Robotaxi then. Do you have a sense on how many cars or how big the scale will be initially and how that might ramp up? I know you're targeting millions of vehicles in the second half kind of of next year. Initially, at launch, how many vehicles would be reasonable?\n\n**Edison Yu** (Analyst)\nIs it going to be as simple as if one goes to Austin, let's say, in late June or July, you'd be able to request?\n\n**Elon Musk** (CEO)\nYeah. We're still debating the exact number to start off on day one. It's, I don't know, maybe 10 or 20 vehicles on day one. We watch it carefully. They scale it up rapidly after that. We want to make sure that we're paying very close attention the first time this happens. Yeah, you'll be able to end of June or July, just go to Austin and order a Tesla or autonomous drive.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. The next question comes from George at Canaccord.\n\n**George Gianarikas** (Analyst)\nHi. Thank you for taking my question. It has to do with FSD pricing.\n\n**George Gianarikas** (Analyst)\nCould we envision when you launch unsupervised FSD that there could be sort of a multi-tiered pricing approach to unsupervised versus supervised similar to what you did with Autopilot versus FSD in the past? Thank you.\n\n**Ashok Elluswamy** (VP of AI Software and Director of Auto Pilot Software)\nI mean, this is something which we've been thinking about. I mean, just so you know, for people who have been trying FSD and who've been using FSD, they think given the current pricing is too cheap because for $99, you're basically getting a personal show.\n\n**Elon Musk** (CEO)\nYeah. I mean, we do need to give people more time to if they want to look at a key breakpoint is, can you read your text messages or not? Can you write a text message or not? Because obviously, people are doing this, by the way, with un-autonomous drivers all the time.\n\n**Elon Musk** (CEO)\nIf you just go for a drive down the highway, you'll see people texting while driving, doing 80 miles an hour, and putting on makeup at the same time. Yeah, putting on makeup, doing their hair with the mirror down, and texting and driving at 80 miles an hour. This is a common occurrence. Eating lunch, you name it. Shaving. Anyway, right now, the car is very insistent that you pay attention to the road, which reduces the value somewhat because it's very rigorous about you paying attention to the road. We'll gradually lighten up on that every few weeks or every month. We'll relax that a little bit, make it so you can be more and more able to do things you want to do and not have the car demand your rigid attention.\n\n**Elon Musk** (CEO)\nThat value, it'll really be profound when you can basically do whatever you want, including sleep. And then that $99 is going to seem like the best $99 you've ever spent in your life.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. George, did you have a follow-up?\n\n**George Gianarikas** (Analyst)\nMy follow-up is about geographic expansion. Just maybe discuss additional markets. There's been some news around India recently that you could launch this year and next. Thank you.\n\n**Ashok Elluswamy** (VP of AI Software and Director of Auto Pilot Software)\nYeah, I mean, we've been working on getting into India. India is a very hot market. Especially the current, and I don't want to talk just about tariffs, but the current tariff structure with India is that any car which we send in is subject to 70% tariff. It's also like a 30% luxury tax on it. So the same car which we're sending is like 100% more expensive than what it is.\n\n**Ashok Elluswamy** (VP of AI Software and Director of Auto Pilot Software)\nThat creates a lot of anxiety as people feel, okay, they're paying too much for the car. By the way, we're not getting the money. The local government is getting the money. That is why we've been very careful trying to figure out when is the right time. Like I said, we are working on it. It would be a great market to enter because India has a big middle class, which we would want to tap in. That is the market which we want to be in. Again, these kinds of things create a little bit of tension, which we're trying to work around.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. Thank you so much. The next question comes from Adam Jonas at Morgan Stanley. Go ahead, Adam. We can't hear you, Adam.\n\n**Travis Axelrod** (Head of Investor Relations)\nMaybe we'll put you back in the queue, and we'll move to Colin Langen from Wells Fargo while Adam figures out his audio. Colin, please unmute yourself.\n\n**Colin Langan** (Analyst)\nOh, great. Do you hear me? Yes. Oh, great. You're still sticking with the vision-only approach. A lot of autonomous people still have a lot of concerns about sun glare, fog, and dust. Any color on how you anticipate on getting around those issues? Because my understanding, it kind of blinds the camera when you get glare and stuff.\n\n**Elon Musk** (CEO)\nActually, it does not blind the camera. We use an approach which is direct photon count. When you see a processed image, so the image that goes from the sort of photon counter, the silicon photon counter, that then goes through a digital signal processor or image signal processor, that's normally what happens.\n\n**Elon Musk** (CEO)\nThe image that you see looks all washed out because if you point the camera at the sun, the post-processing of the photon counting washes things out. It actually adds noise. Quite a big breakthrough that we made some time ago was to go with direct photon counting and bypass the image signal processor. You can drive pretty much straight at the sun. You can also see in what appears to be the blackest of night. Here in fog, we can see as well as people can. Probably better, but I'd say probably slightly better than people, than the average person anyway.\n\n**Colin Langan** (Analyst)\nThe camera is able to see when there's direct glare on it. I'm not surprised by that. Okay. There were obviously media reports the other day that the affordable model was delayed.\n\n**Colin Langan** (Analyst)\nDoesn't sound like that's correct. Those reports also talked about it being more of a cheaper version of the Model Y. Any color on what we should expect? Is it a cheaper version of the Model Y, or is it actually going to be a design change with it?\n\n**Vaibhav Taneja** (Chief Accounting Officer and CFO)\nI think Lars already covered it in answering one of the saytechnologies.com questions. The real thing which we are trying to focus on is affordability. Using our existing lines, there's always limitations when you're using existing lines as to how many different form factors you can bring through. That's the way I would say you should think about it. I don't know if Lars had anything more to add.\n\n**Lars Moravy** (VP of Vihicle Engineering)\nYeah. I think I said this before in other calls.\n\n**Lars Moravy** (VP of Vihicle Engineering)\nWith the recent upgrades to the Model 3 and the Model Y platforms, we made some pretty great cars at pretty great prices. We added a bunch of features and things like that. I think it's easy to consider that moving forward, Tesla doesn't make bad cars. We always make our intent is not to make a car that is any worse than any car we've ever produced in the past. The models that come out in the next months will be built on our lines, and will resemble in form and shape the cars we currently make. The key is that they'll be affordable, and you'll be able to buy one.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. We might have time for one last question. Adam, we'll try your audio again. Do you want to try to unmute yourself, Adam? All right. Unfortunately, still not working.\n\n**Travis Axelrod** (Head of Investor Relations)\nOh,\n\n**Adam Jonas** (Analyst)\nsorry.\n\n**Travis Axelrod** (Head of Investor Relations)\nThere you go.\n\n**Adam Jonas** (Analyst)\nSorry, guys. Technology.\n\n**Travis Axelrod** (Head of Investor Relations)\nGo ahead, Adam.\n\n**Adam Jonas** (Analyst)\nYeah. Hi. Yeah. In the February 28th Joe Rogan interview, Elon, you advocated for a ramp in tariffs to give people time to adjust. Otherwise, you said the system would break and bad things would happen. Are things breaking yet? If the tariffs as announced remain in place, when would things start breaking?\n\n**Elon Musk** (CEO)\nAt the risk of stating the obvious, I'm not. I mean, I'm one of many advisors to the president. I'm not the president. I've made my opinion clear to the president. Other people made their opinion clear to the president. He talks to many people, and he makes his decision. I'm hopeful that the president will observe whether my predictions are more accurate than the predictions of others and perhaps weigh my advice differently in the future. We shall see.\n\n**Elon Musk** (CEO)\nI'm an advocate of predictable tariff structures. Generally, I'm an advocate for free trade and lower tariffs. Now, one does need to take a look at where if some country is doing something predatory with tariffs or is providing extreme support for, if a government is providing extreme financial support for a particular industry, then you have to do something to counteract that. I think that that's on a case-by-case basis strategically. The president is the elected representative of the people, and it's fully within his rights to do what he would like to do.\n\n**Adam Jonas** (Analyst)\nOkay, Elon. I respect that. Just as a follow-up, and thanks again. Between China and the United States, who in your opinion is further ahead on the development of physical AI, specifically on humanoids and also drones? I'd be interested. Is it even close in kind of how? Yeah. Serious.\n\n**Elon Musk** (CEO)\nI think you know the answer for drones.\n\n**Elon Musk** (CEO)\nI mean, a friend of mine involved made this posted on X. I reposted it. I think a prophetic statement, which is, \"Any country that cannot manufacture its own drones is doomed to be the vassal state of any country that can.\" America cannot currently manufacture its own drones. That is it, again. Unfortunately. China, I believe, manufactures about 70% of all drones. If you look at the total supply chain, China is almost 100% of drones have a supply chain dependency on China. China is in a very strong position. Here in America, we need to shift more of our people and resources to manufacturing because this is I have a lot of respect for China because I think China is amazing, actually.\n\n**Elon Musk** (CEO)\nThe United States should not have such a severe dependency on China for drones and be unable to make them unless China gives us the parts, which is currently the situation. With respect to humanoid robots, I don't think there's any company in any country that can match Tesla. Tesla and SpaceX are number one. Now, I'm a little concerned that on the leaderboard, ranks 2 through 10 will be Chinese companies. I'm confident that rank one will be Tesla.\n\n**Travis Axelrod** (Head of Investor Relations)\nGreat. I think that's, unfortunately, all the time we have for today. We appreciate all your questions and look forward to talking to you next quarter. Thank you very much, and goodbye.",
      "fetched_at": "2026-02-04T15:39:16.984Z"
    }
  ]
}