{
  "ticker": "TSM",
  "last_updated": "2026-02-04T15:39:51.739Z",
  "total_transcripts": 4,
  "transcripts": [
    {
      "ticker": "TSM",
      "title": "Taiwan Semiconductor Manufactur (TSM) Q4 FY2025 earnings call transcript",
      "published_date": "Jan 15, 2026, 1:00 AM EST",
      "fiscal_year": "2025",
      "quarter": "Q4",
      "url": "https://finance.yahoo.com/quote/TSM/earnings/TSM-Q4-2025-earnings_call-399056.html",
      "content": "**Jeff Su** (Director of Investor Relations)\nGood afternoon, everyone, and welcome to TSMC's fourth quarter 2025 earnings conference and conference call. My name is Jeff Hsu, TSMC's Director of Investor Relations and your host for today. Today's event is being webcast live through TSMC's website at www.tsmc.com, where you can also download the earnings release materials. If you are joining us through the conference call, your dial-in lines are in listen-only mode. The format for today's event will be as follows. First, TSMC's Senior Vice President and CFO, Mr. Wendell Huang, will summarize our operations in the fourth quarter 2025, followed by our guidance for the first quarter 2026. Afterwards, Mr. Huang and TSMC's Chairman and CEO, Dr. C.C. Wei, will jointly provide the company's key messages. Then we will open both the floor and the line for the question-and-answer session as usual.\n\n**Jeff Su** (Director of Investor Relations)\nI would like to remind everybody that today's discussions may contain forward looking statements that are subject to significant risks and uncertainties which would cause actual results to differ materially from those contained in the forward looking statements. Please refer to the safe harbor notice that appears in our press release.\n\n**Jeff Su** (Director of Investor Relations)\nAnd now I would like to turn the microphone over to TSMC CFO Mr. Wendell Huang for the summary of operations and the current quarter guidance.\n\n**Wendell Huang** (CFO)\nThank you, Jeff. Good afternoon, everyone. Thank you for joining us today. My presentation will start with financial highlights for the fourth quarter of 2025 and a recap of full year 2025 after that. I will provide the guidance for the first quarter of 2026. Fourth quarter revenue increased 5.7% sequentially in NT$ supported by strong demand for our leading-edge process technologies. In U.S. dollar terms, revenue increased 1.9% sequentially to $33.7 billion, slightly ahead of our fourth quarter guidance. Gross margin increased by 2.8 percentage points sequentially to 62.3%, primarily due to cost improvement efforts, favorable foreign exchange rate, and the high capacity utilization rate. The operating expenses accounted for 8.4% of net revenue compared to 8.9% in third quarter of 2025 due to operating leverage. Thus, operating margin increased sequentially by 3.4 percentage points to 54% overall.\n\n**Wendell Huang** (CFO)\nOur fourth quarter EPS was TWD 19.5 and ROE was 38.8%. Now let's move on to revenue by technology. 3 nm process technology contributed 28% of wafer revenue in the fourth quarter while 5 nm and 7 nm accounted for 35% and 14% respectively. Advanced technologies defined as 7 nm and below accounted for 77% of wafer revenue on a full year basis. 3 nm revenue contribution came in at 24% of 2025 wafer revenue, 5 nm 36% and 7 nm 14%. Advanced technologies accounted for 74% of total wafer revenue up from 69% in 2024. Moving on to revenue contribution by platform, HPC increased 4% quarter over quarter to account for 55% of our fourth quarter revenue.\n\n**Wendell Huang** (CFO)\nSmartphone increased 11% to account for 32%, IoT increased 3% to account for 5%, Automotive decreased 1% to account for 5% while DCE decreased 22% to account for 1% on a full year basis. HPC increased 48% year over year. Smartphone, IoT, and Automotive increased by 11%, 15%, and 34% respectively in 2025 while DCE remains flat. Overall, HPC accounted for 58% of our 2025 revenue, Smartphone accounted for 29%, IoT accounted for 5%, Automotive accounted for 5%, and DCE accounted for 1%. Moving on to the balance sheet, we ended the fourth quarter with cash and marketable securities of TWD 3.1 trillion or $98 billion. On the liabilities side, current liabilities increased by TWD 182 billion quarter over quarter mainly due to the increase of TWD 95 billion in accrued liabilities and others and the increase of TWD 61 billion from the reclassification of bonds payable to current portion.\n\n**Wendell Huang** (CFO)\nIn terms of financial ratios, accounts receivable days increased by one day to 26 days. Inventory days remain steady at 74 days. Regarding cash flow and CapEx, during the fourth quarter we generated about TWD 726 billion in cash from operations, spent TWD 357 billion in CapEx and distributed TWD 130 billion for first quarter 25 cash dividend. Overall, our cash balance increased TWD 297 billion to TWD 2.8 trillion at the end of the quarter. In US dollar terms, our fourth quarter capital expenditures total $11.5 billion. Now let's look at the recap of our performance in 2025. Thanks to the strong demand for our leading edge process technologies, we continue to outperform the foundry industry. In 2025 our revenue increased 35.9% in US dollar terms to $1 billion or increased 31.6% in NT dollar terms to TWD 3.8 trillion.\n\n**Wendell Huang** (CFO)\nGross margin increased 3.8 percentage points to 59.9% mainly reflecting a higher capacity utilization rate and cost improvement efforts partially offset by an unfavorable foreign exchange rate and margin dilution from our overseas fabs. With operating leverage, our operating margin increased 5.1 percentage point to 50.8%. Overall full year EPS increased 46.4% to 66.25 NT and ROE increased 5.1 percentage point to 35.4%. In 2025 we generated 2.3 trillion NT in operating cash flow, spent 1.3 trillion NT or $40.9 billion on capital expenditures. As a result, free cash flow amounted to 1 trillion NT, up 15.2% from 2024. Meanwhile, we paid 467 billion NT in cash dividends in 2025, up 28.6% year over year as we continue to increase our cash dividend per share.\n\n**Wendell Huang** (CFO)\nTSMC shareholders receive a total of TWD 18 cash dividend per share in 2025 up from TWD 14 in 2024 and they will receive at least TWD 23 per share in 2026. I have finished my financial summary. Now let's turn to our current quarter guidance. We expect our business to be supported by continued strong demand for our leading edge process technologies. Based on the current business outlook, we expect our first quarter revenue to be between $34.6 billion and $35.8 billion which represents a 4% sequential increase or a 38% year-over-year increase. At the midpoint. Based on the exchange rate assumption of $1 to TWD 31.6, gross margin is expected to be between 63% and 65%. Operating margin between 54% and 56%. Lastly, our effective tax rate was 16% in 2025. For 2026 we expect our effective tax rate to be between 17% and 18%.\n\n**Wendell Huang** (CFO)\nThis concludes my financial presentation. Now let me turn to our key messages. I will start by talking about our fourth quarter 2025 and first quarter 2026 profitability. Compared to third quarter, our fourth quarter gross margin increased by 280 basis points sequentially to 62.3% primarily due to cost improvement efforts, a more favorable foreign exchange rate and a higher overall capacity utilization rate. Compared to our fourth quarter guidance, our actual gross margin exceeded the high end of the range provided three months ago by 130 basis points mainly as we delivered better than expected cost improvement efforts. In addition, the actual fourth quarter exchange rate was $1 to TWD 31.01 as compared to our guidance of $1 to TWD 30.6.\n\n**Wendell Huang** (CFO)\nWe have just guided our first quarter gross margin to increase by 170 basis points to 64% at the midpoint primarily driven by continued cost improvement effort including productivity gains and a higher overall capacity utilization rate partially offset by continued dilution from our overseas fabs. Looking at full year 2026, given the six factors, there are a few puts and takes I would like to share. On the one hand, we expect our overall utilization rate to moderately increase in 2026. N3 gross margin is expected to cross over to the corporate average sometime in 2026 and we continue to work hard to earn our value. In addition, we are leveraging our manufacturing excellence to drive greater productivity in our fabs to generate more wafer output. We are also increasing across node capacity optimization which includes flexible capacity support among N7, N5 and N3 nodes to support our profitability.\n\n**Wendell Huang** (CFO)\nOn the other hand, as the scale of our overseas expansion grows, we continue to forecast the gross margin dilution from the ramp up of overseas fabs in the next several years to be between 2%-3% in the early stages and widen to 3%-4% in the latter stages. Furthermore, the initial ramp up of our 2 nanometer technology will start to dilute our gross margin in the second half of the year and we expect between 2%-3% dilution for the full year of 2026. Finally, we have no control over the foreign exchange rate, but that may be another factor in 2026. Next, let me talk about our 2026 capital budget and depreciation at TSMC. A higher level of capital expenditures is always correlated to the high growth opportunities in the following years.\n\n**Wendell Huang** (CFO)\nWith our strong technology, leadership and differentiation, we are well positioned to capture the multi year structure demand from the industry megatrends of 5G, AI and HPC. In 2025 we spent $40.9 billion as compared to $29.8 billion in 2024 as we began to raise our level of capital spending in anticipation of the growth that will follow in the future years. In 2026 we expect our capital budget to be between $52 billion-$56 billion as we continue to invest to support our customers growth. About 70%-80% of the 2026 capital budget will be allocated to advanced process technologies, about 10% will be spent for specialty technologies and about 10%-20% will be spent for advanced packaging, testing, mask making and others.\n\n**Wendell Huang** (CFO)\nOur depreciation expense is expected to increase by high-teens % year over year in 2026 mainly as we ramp our 2-nanometer technologies. Even as we invest in the future growth with this level of CapEx spending in 2026, we remain committed to delivering profitable growth to our shareholders. Finally, let me talk about TSMC's long-term profitability outlook. As a foundry, our biggest responsibility is to support our customers' growth and we always view them as partners. Having said that, we are in a very capital-intensive business. In the last five years alone our CapEx totaled $167 billion. Our R&D investments totaled $30 billion. Therefore, it is important for TSMC to earn a sustainable and healthy return as we continue to invest in leading-edge specialty and advanced packaging technologies to support our customers' growth.\n\n**Wendell Huang** (CFO)\nToday we face increasing manufacturing cost challenges due to the rising cost of leading nodes. For example, the cost of tools are becoming more expensive and process complexity is increasing. As a result, the CapEx dollar required to build 1K wafers per month capacity of N2 is substantially higher than 1K wafers per month capacity. For N3, the CapEx per K cost for A14 will be even higher. We also face additional cost challenges from expansion of our global manufacturing footprint, new investments in specialty technologies and inflationary costs. These all lead to a higher level of CapEx spending. As a result, in the last three years our CapEx dollars amounted to $101 billion but is expected to be significantly higher in the next three years.\n\n**Wendell Huang** (CFO)\nHaving said that, we continue to work closely with our customers to plan our capacity while sticking to our disciplines to ensure a healthy overall capacity utilization rate through the cycle. Our pricing will remain strategic, not opportunistic. To earn our value, we will work diligently with our suppliers to drive greater cost improvements. We will also leverage our manufacturing excellence to generate more wafer output and drive greater across node capacity optimization in our FAB operations to support our profitability. By taking such actions, we believe a long term gross margins of 56% and higher through the cycle is achievable and we can earn an ROE of high 20s% through the cycle by earning a sustainable and healthy return.\n\n**Wendell Huang** (CFO)\nEven as we shoulder a greater burden of CapEx investment for our customers, we can continue to invest in technology and capacity to support their growth while delivering long-term profitable growth to our shareholders. We also remain committed to a sustainable and steadily increasing cash dividends per share on both an annual and quarterly basis.\n\n**Wendell Huang** (CFO)\nNow let me turn the microphone over to C.C. Wei.\n\n**C.C. Wei** (Chairman and CEO)\nThank you, Wendell. Good afternoon everybody. First let me start with our 2026 outlook. In 2025 we observed robust AI related demand throughout the whole year while non AI end market segment bottomed out and saw a mild recovery. Concluding 2025, the Foundry 2.0 industry which we define as all logic, wafer manufacturing, packaging, testing, mask making and others increased 16% year over year supported by our strong technology differentiation and broader customer base. TSMC's revenue increased 35.9% year over year in U.S. dollar terms outperforming the Foundry 2.0 industry growth entering 2026. We understand there are uncertainties and risk from the potential impact of tariff policies and rising component prices, especially in consumer related and price sensitive other bucket segment. As such, we will be prudent in our business planning while focusing on the fundamentals of our business to further strengthen our competitive position.\n\n**C.C. Wei** (Chairman and CEO)\nWe forecast the Foundry 2.0 industry to grow 14% year-over-year in 2026 supported by robust AI-related demand underpinned by strong demand for our leading-edge specialty and advanced packaging technologies. We are confident we can continue to outperform the industry growth. We expect 2026 to be another strong growth year for TSMC and forecast our full-year revenue to increase by close to 30% in U.S. dollar terms. Next, let me talk about AI demand and TSMC's long-term growth outlook. Recent development in the AI market continue to be very positive. Revenue from AI accelerator accounted for high-teens % of our total revenue in 2025. Looking ahead, we observe increasing AI model adoption across consumer enterprise and sovereign AI segment. This is driving need for more and more computation which supports the robust demand for leading-edge silicon.\n\n**C.C. Wei** (Chairman and CEO)\nOur customers continue to provide us with their positive outlook. In addition, our customers, and many of the cloud service providers, are also providing strong signals and reaching out directly to request the capacity to support their business. Thus, our conviction in the multi-year AI megatrend remains strong, and we believe the demand for semiconductors will continue to be very fundamental. As a foundry, our first responsibility is to fully support our customers with the most advanced technology and necessary capacity to unleash the AI innovations to address the structural increase in the long-term market demand profile. TSMC works closely with our customers to plan our capacity. This process is continuous and ongoing. In addition, as process technology complexity increases, the engagement time with customers is now at least two to three years in advance.\n\n**C.C. Wei** (Chairman and CEO)\nInternally, as we have said before, TSMC employs a disciplined capacity planning system to assess the market demand from both a top down and bottom up approaches. We focus on the overall addressable megatrend to determine the appropriate capacity to build. Based on our assessment, we are preparing to increase our capacity and stepping up our CapEx investment to support our customers' future growth. We are also putting forward existing fab schedule to the extent possible both in Taiwan and in Arizona. We are also leveraging our manufacturing excellence to drive greater productivity in our fabs to generate more output, convert N5 capacity to support N3 wherever necessary and focus on capacity optimization across nodes to maximize the support to our customers.\n\n**C.C. Wei** (Chairman and CEO)\nBased on our planning framework, we raise our forecast for the revenue growth from AI accelerator to approach a mid to high 50s% CAGR for the five years period from 2024 to 2029. Underpinned by our technology differentiation and broader customer base, we now expect our overall long-term revenue growth to approach 25% CAGR in U.S. dollar terms for the five year period starting from 2024. While we expect AI Accelerators to be the largest contributor in terms of our incremental revenue growth, our overall revenue growth will be fueled by all four of our growth platforms which are smartphone, HPC, IoT and automotive in the next several years. As the world's most reliable and effective capacity provider, we will continue to work closely with our customers to invest in leading-edge specialty and advanced packaging technologies to support their growth.\n\n**C.C. Wei** (Chairman and CEO)\nWe will also remain disciplined in our capacity planning approach to ensure we deliver profitable growth for our shareholders. Now let me talk about TSMC's global manufacturing footprint update. All our overseas decisions are based on our customers' needs as they value some geographic flexibility and a necessary level of government support. This is also to maximize the value for our shareholders. With a strong collaboration and support from our leading U.S. customers and the U.S. federal, state and city government, we are speeding up our capacity expansion in Arizona and executing well to our plan. Our first fab has already successfully entered high volume production in 4Q24. Construction of our second fab is already complete and tool moving and installation is planned in 2026.\n\n**C.C. Wei** (Chairman and CEO)\nDue to the strong demand from our customers, we are also pulling forward the production schedule and now expect to enter high volume manufacturing in the second half of 2027. Construction of our third fab has already started and we are in the process of applying for permits to begin the construction of our fourth fab and fourth advanced packaging fab. Furthermore, we have just completed the purchase of a second large piece of land nearby to support our current expansion plan and provide more flexibility in response to the very strong multi-year AI-related demand. Our plan will enable TSMC to scale up an independent Gigafab cluster in Arizona to support the needs of our leading edge customers in smartphone, AI and HPC applications.\n\n**C.C. Wei** (Chairman and CEO)\nNext in Japan, thanks to the strong support from the Japanese central government and the local government, our first specialty fab in Kumamoto has already started volume production in late 2024 with very good yield. The construction of our second fab has started and the technologies and ramp schedule will be based on our customers need and market conditions in Europe. We have received strong commitment from the European Commission and the German federal, state and city government. Construction of our specialty fab in Dresden, Germany is progressing in our plan. The ramp schedule will be based on our customers need and market conditions in Taiwan. With support from Taiwan government, we are preparing multiple phases of 2nm fabs in both Hsinchu and Kaohsiung Science Park.\n\n**C.C. Wei** (Chairman and CEO)\nWe will continue to invest in leading edge and advanced packaging facilities in Taiwan over the next few years. By expanding our global footprint while continuing to invest in Taiwan, TSMC can continue to be better to be the trusted technology and capacity provider of the global large industry for years to come. Last, let me talk about N2 and A16 status. Our 2 nanometer and A16 technologies lead the industry in addressing the insatiable demand for energy efficient computing. Yet almost all the innovators are working with TSMC. N2 successfully enter high volume manufacturing in 4Q 2025 at both our Hsinchu and Kaohsiung site with good yield. We are seeing strong demand from smartphone and HPC AI applications and expect a fast ramp in 2026. With our strategy of continuous enhancement, we also introduced N2P as an extension of N2 family.\n\n**C.C. Wei** (Chairman and CEO)\nN2P features further performance and power benefit on top of N2, and volume production is scheduled for the second half of this year. We also introduced A16 featuring our best in class Super Power Rail or SPR. A16 is best suitable for specific HPC products with complex signal route and the dense power delivery network. Volume production is on track for second half 2026. We believe N2, N2P, A16 and its derivatives will prepare our N2 family to be another large and long lasting node for TSMC while further extending our technology leadership position well into the future.\n\n**C.C. Wei** (Chairman and CEO)\nThis concludes our key message, and thank you for your attention.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, Wendell. Thank you, C.C. This does conclude our prepared statements, so before we begin the Q&A session, I would like to remind everybody to please limit your question to two at a time to allow all the participants an opportunity to ask their questions. Questions will be taken both from the floor and from the call. Should you wish to raise your question in Chinese, I will translate it to English before our management answers your question. For those of you on the call, if you'd like to ask a question, please press the star then one on your telephone keypad. Now questions will be taken in the order they were received. If at any time you'd like to remove yourself from the questioning queue, please press star two. So now let's begin the question and answer session.\n\n**Jeff Su** (Director of Investor Relations)\nI think we'll take the first few questions from the floor here. So why don't we start over here with Gokul Hariharan from J.P. Morgan. Thank you.\n\n**Gokul Hariharan** (Analyst)\nThank you and Happy New Year. So, C.C., it definitely feels like you've heard what your customers have said to you over the last three, four months. Could you give us a little bit more color on what you're hearing from your customers, customers on demand? Because this is a very big step up in the capacity commitment. There is definitely a lot of concern in the financial market, especially about whether we are in a bit of a bubble. And obviously you are the one who is putting up all the capital in this industry, so you've definitely considered this very carefully as well. So give us a little bit more detail in terms of what you're hearing from the customers and your views on this cycle.\n\n**Gokul Hariharan** (Analyst)\nGiven if we think about typical semiconductor cycle, we've already probably lasted a little bit longer than usual cycles, but this definitely doesn't feel like a typical semiconductor cycle.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, Gokul, let me summarize your question for the benefit of those online and those in person. So again, Gokul's question is really he would like to hear CC's views about the overall AI related demand and the semiconductor cycle. So again he Gokul notes that as Wendell and Yu said, we are substantially stepping up our CapEx to support the customers. But he does say, you know, there is concerns about an AI bubble and risk. So part of Gokul's question is how, what is the feedback? Any color we can share about what type of discussions and feedback we're getting from both customers and the customers customers that CC mentioned and how long do we think this cycle can last?\n\n**C.C. Wei** (Chairman and CEO)\nOkay, Gokul, you essentially try to ask whether the AI demand is real or not. I'm also very nervous about it. You bet. Because we have to invest about $52 billion-$56 billion for the CapEx, right? If we didn't do it carefully and that would be a big disaster to TSMC for sure. So of course I spend a lot of time in the last three or four months talking to my customer and then customers. Customer. I want to make sure that my customers demand are real. So I talk to those cloud service providers, all of them. Their answer is. I'm quite satisfied with their answer. Actually they show me the evidence that the AI really help their business. So they grow their business successfully and he or she in their financial return. So I also double check their financial status. They are very rich.\n\n**C.C. Wei** (Chairman and CEO)\nThat sounds much better than TSMC. No doubt. I also asked specifically that what's the application? Right? I mean that's for one of the hyperscaler. They told me that that helped their social media software and so the customer continue to increase. I believe that and with our own experience in the AI application, we also help to our own fab to improve the productivity. As I mentioned one time say that 1% or 2% productivity improvement that is free to TSMC. That's why also our gross margin is a little bit satisfied, you know, even in this very high cost period of time. All in all, I believe in my point of view the AI is real. Not only real, is starting to grow into our daily life. We believe that is kind of. We call it AI Megatrend.\n\n**C.C. Wei** (Chairman and CEO)\nWe certainly would believe that. So another question is, can the semiconductor industry to be good for three, four, five years in a row? I'll tell you the truth, I don't know. But I look at the AI looks like it is going to be like endless. I mean that's for many years to come. No matter what. TSMC stick on the fundamental technology, leadership, manufacturing excellence. And we work with customers to get their trust. And I think that fundamental thing why position TSMC to be very good future growth? Let me say that 25% CAGR as we projected. And we used to be conservative, you know that.\n\n**Gokul Hariharan** (Analyst)\nThanks. Thanks, C.C. My second question is on the U.S. expansion. You're pulling in some of the capacity in response to customers. You're already starting plans for the phase four. There's a lot of media reports about TSMC. You might have to build more fabs in the U.S. How should we think about U.S. expansion in principle over the next few years? I think previously you had talked about reaching 20% or even 30% of 2 nanometer capacity in the U.S. eventually the total capacity could be in the U.S. Could you give us a little bit more detail about how that is progressing and when could we get there in terms of the 30% or even 20% capacity?\n\n**Jeff Su** (Director of Investor Relations)\nOkay, so Gokul's second question is about our overseas expansion, particularly in the U.S. He notes that C.C. said we are pulling in the schedule for the Fab 2 earlier. You know, we're starting the application for the fourth Fab. And so his question is partly around recent reports that we intend to build more fabs in Arizona. So his question is how should we or how is TSMC thinking about the future expansion in Arizona? And we have said in the past that, you know, around 30% of our nanometer and more advanced capacity would be based in Arizona once we complete scaling out to this independent Gigafab cluster. So what is the time frame or timetable for that? How quickly can we get there?\n\n**C.C. Wei** (Chairman and CEO)\nThat's a long question. We build a fab in Arizona and we work hard. So today everything, even the yield or defect density is almost equal to Taiwan. And due to the strong demand, as I just answered from the AI stronger, that's a megatrend. All my AI customers are in the U.S. So they ask a lot of support from the U.S. So because of that we have to speed up our fab expansion in Arizona in Taiwan also. Actually we increase most of the capacity in Taiwan. No doubt about it, because this is most advanced one. We can progress very well in the U.S. We try to speed it up and progress is very good. We got the help from the government. Still we have to meet all the requirements for the permits or for those kind of things.\n\n**C.C. Wei** (Chairman and CEO)\nBoth in Taiwan and in Arizona we speeded up our capacity expansion to meet the AI demand. I can always say one word, the capacity is very tight. We work very hard to narrow the gap so far probably this year, next year we have to work extremely hard to narrow the gap. We just bought a second land in Arizona. Let's give you a hint. That's what we plan to do because we need it. We are going to expand many fabs over there and this Gigafab cluster can help us to improve the productivity, to drive down the cost and to serve our customer in the U.S. better. Okay.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, thank you Gokul. Let's move over here next to Laura Chen from Citibank please.\n\n**Laura Chen** (Analyst)\nThank you. Thank you CC and Wendell for very comprehensive outlook briefing and also congratulate for the great result. Of course we see that the AI semiconductor growth has seen very strong growth and I believe all of your customer and customers customers very desperate to ask more capacity support from TSMC. But I'm just wondering how does TSMC evaluate the potential power electricity supply for data center? So other than that the chips we can discuss with our customers. I think for the overall infrastructure buildup for data center a lot of factor also very important. Just want to understand more how does TSMC evaluate those key factors for the AI infrastructure buildup? And my first question.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, so Laura's. First question is around the AI demand. She notes again, as we said, AI megatrend and the growth is very strong and customers and ourselves are strong believers. But when we do our planning, how do we balance this against the other considerations? Do we look at things. For example, I think Laura's question is power electricity grid availability to basically assess is this part of our included as part of our planning process. Do we factor such things in?\n\n**C.C. Wei** (Chairman and CEO)\nLora, let me tell you first I worry about the electricity in Taiwan first. I need to have a lot of enough electricity so I can start to expand the capacity without any limitation. But talking about build a lot of AI data center all over the world, I use one of my customers. I answer because I asked the same question. They told me that they planned this one five, six years ago already. So as I said, those cloud service provider are smart, very smart. If I knew that I would anyway. So they say that they work on the power supply five, six years ago. So today their message to me is silicon from TSMC is a bottleneck and asked me not to pay attention to all others because they have to solve the silicon bottleneck first.\n\n**C.C. Wei** (Chairman and CEO)\nBut indeed we look at the power supply, you know, all over the world, especially in the U.S. Not only that, we also look at who support those kind of power supply like a turbine, like nuclear power plant, the plant, all those kind of things. We also look at the supply of the rack. We also look at the supply of the cooling system. Everything so far so good. So we have to work hard to narrow the gap between the demand and supply from TSMC. Did that answer your question?\n\n**Laura Chen** (Analyst)\nThat's great to know that it would not be the constraints for the further AI developments. Yeah, thank you. And my second question is on the leading edge advanced packaging, when can you remind us that what would be the revenue contribution last year for the advanced packaging overall? First of all, we see that I recall that in the past the CapEx for leading edge advanced packaging, roughly about 10%. Yeah. But now it could be up to like a 20%. So I'm just wondering that for the expansion, can you give us more detail about what kind of the plans you are looking for? Will you focus more on like 3DIC, SoIC or you also start to work on more advanced like a panel base in the longer term?\n\n**Laura Chen** (Analyst)\nI also think before we talk about that, we'll work more closely with OSAT's partner on the leading edge advanced packaging. So just wondering what kind of the process will be the key expansion plan in the space. Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, so Laura's second question is more related to advanced packaging. What was the revenue contribution of what we call the back end, which is advanced packaging testing as a whole in 2025? And then she notes the CapEx, actually this year I believe window, we guided 10%-20% of CapEx, which is the same as last year. But anyways, she wants to know what is the focus of this CapEx? Is, is it on 3DIC, is it on SoIC Packaging Solutions on panel level? Sort of. What is the key areas we're focusing on relative to the CapEx?\n\n**Wendell Huang** (CFO)\nOkay, Laura, the revenue contribution last year from advanced packaging is close to 10%. It's about 8% for this year. We expect it to be slightly over 10%. We expect it to grow in the next five years higher or faster than the corporate and the CapEx. Yes, you're right. In the past is about 10% lower than 10%. Now we're saying advanced packaging together with mask making and others accounted for between 10% to 20%. So you can see that the investment amount is higher and we're investing in areas in advanced packaging where our customers need. So the areas that you mentioned, basically we continue to invest.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, Wendell. Okay, let's move on to Charlie Chan from Morgan Stanley here.\n\n**Charlie Chan** (Managing Director)\nThanks Jeff. Happy New Year, C.C. and Wendell. So first of all, amazing results and guidance. Congratulations to the management team. So my first question is about outside of AI, what do you see for those end markets? Right? You talk about the memory cost, etc. So can you give us some kind of your underlying assumption for PC shipments, smartphone shipments, etc. And also in your HPC there are some other pieces like networking and general service. Can you comment about the growth potential for those segments? Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, Charlie's first question is very specific. Well, generally he wants to know about how do we see the non AI demand, especially in the context where the, you know, certain component costs, such as memory costs are rising. So he wants to know what do we see the impact on the PC and smartphone markets in terms of shipments. He's also asking very specifically what about networking, what about general server? Each these different segments.\n\n**C.C. Wei** (Chairman and CEO)\nCharlie, those also we say is called non AI, but actually that related to AI. You know that, right? Because of networking processor, you still need to have AI data to scale up or scale out. Those are the networking switches, all those kind of things. It still grow very strong. As for PC or the smartphone, to tell the truth, we expect higher memory supplies. So we expect the unit cores would be very minimal. But for TSMC, we did not feel our customers change their behavior and we look at it and then we find out that we supply most of the high end smartphones. The high end smartphone is less sensitive to the memory supplies so the demand is still strong. Using one sentence I'd like to say we still try very hard to narrow the gap.\n\n**C.C. Wei** (Chairman and CEO)\nWe have to supply a lot of wafers to them also.\n\n**Charlie Chan** (Managing Director)\nThanks, C.C. I think that's very consistent with your five-year CAGR outlook for all the four segments. And my second question is about Intel's foundry competition. I think U.S. President seems to be very happy with Intel's recent progress and even mentioned two of your key customers. Right. NVIDIA Apple may have some partnership with Intel Foundry. Should we be concerned about this so-called competition and what TSMC can really do to mitigate or avoid potential market share loss as those are key U.S. customers not limited to the two customers I just mentioned. Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, so Charlie's second question is on the Foundry competition and, you know, competition from a U.S. IDM. He knows the U.S. President is very happy with the progress. A couple two of our key customers he also was mentioned. So his question is fundamentally, is there a concern or risk going forward of market share loss for TSMC to our Foundry competition?\n\n**C.C. Wei** (Chairman and CEO)\nKind of a simple question, I should say. No, let me explain a little bit because in these days, you know, it's not money to help you to compete, right? I also like whoever you just mentioned to invest on Intel. I like them to invest on TSMC also. But the most fundamental thing is. Let me share with you. Today's technology is so complicated. So once you want to design a very complete or advanced technology, it takes two to three years to fully utilize that technology. That's the situation, and so up to two to three years of preparation you can design your product. Once you get your product being approved, it takes another one to two years to ramp it up, so we have a competitor, no doubt about it, that's formidable competitor, but first it takes time. We don't underestimate their progress, but are we afraid of it? For 30-some years we always in a competition with our competitor, so no we have a confidence to keep our business grow as we estimated.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, C.C. All right, let's take the next two questions online in the interest of time. Operator, can we take the first call from the line, please?\n\n**Operator**\nFirst question. Arthur Lai, Macquarie, go ahead please.\n\n**Arthur Lai** (Analyst)\nHi, first, congratulations. Very strong performance. Thank you, C.C. Wei and Jeff Hsu, for taking my question. My first question is about the global capacity plan. Recently, Taiwan local news report that TSMC could exit the 8-inch business and mature node 12-inch to convert into the advanced packaging, and the investors keen to know if this is true, and the decision is based on what kinds of key factor that is C.C. just mentioned about the power density or if you know power. Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, so Arthur Lai's first question is about basically mature nodes, our strategy on mature nodes. He knows a lot of local news has been reporting that TSMC is exiting 8-inch and 12-inch basic businesses and converting the capacity to advanced packaging. So he wants to know if this is true and, if so, what are the reasons behind the power constraints, ROI, etc.\n\n**C.C. Wei** (Chairman and CEO)\nGood question indeed. We reduce our 8-inch wafers, the capacity and 6-inch but let me assure you that we support all our customers, we discuss with our customers and to do this kind of resources more flexible and more. What is the word we say? Optimize. Optimize the resources to support our customers. But let me assure you also to my customers that we continue to support them. We will not let them down if they have a good business. We continue to support that even in the 8-inch wafers of business.\n\n**Jeff Su** (Director of Investor Relations)\nOkay Arthur, do you have a second question?\n\n**Arthur Lai** (Analyst)\nYes, thank you. My second question is regarding the consumer and demand outlook. So C.C. also mentioned that the NAND price actually inflation and you also pushing up the cost of the consumer electronics. So investors actually are concerned about the further demand softness in this year and next year or particularly next year. So can management comment about what your client or your client's client how to resolve this memory tightness or we call a memory urgency issue. Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, so Arthur's second question is on the impact from the memory price increase and the demand softness. I believe his question really, because CC already shared the impact this year. He wants to know what is the impact for 2027.\n\n**C.C. Wei** (Chairman and CEO)\nFor TSMC? No impact. As I just mentioned, most of my customers now focus on high-end smartphone or PCs, so those kind of demand has less sensitive to the components of price, so they continue to give us a very healthy forecast this year and next year.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, thank you, C.C. All right, operator, let's move on to the next participant from the line, please.\n\n**Operator**\nBrett Simpson, Arete, go ahead please.\n\n**Brett Simpson** (Co-Founder)\nYeah, thanks very much. My question is really on AI. I mean TSMC has been supply constrained for your AI customers I think since 2024 and it sounds like 2026 is another year where we're going to see challenges. Do you think the CapEx you've laid out for this year $52-$56 billion could that mean that we start to see supply and demand more in balance in 2027? Any thought there just in terms of how you're thinking about that capacity plan and does it alleviate this supply bottlenecks that we see today? And as part of this from a supply perspective, we hear TSMC is finding it quite challenging to develop enough engineering talent quick enough both in the U.S. and in Taiwan.\n\n**Brett Simpson** (Co-Founder)\nCan you talk more about this trend and what's the scale of the labor shortage of foundry engineers at the moment? Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, so Brett's first question is related around AI and our capacity. So he notes the supply looks to continue to be tight in 2026. But with these significant step up in our CapEx to support the customers $52-$56 billion, do we expect the supply demand or the gap so to speak to be more balanced in 2027? And then is engineering resources fab engineers a constraint or a bottleneck for us in making these expansions whether in Taiwan or the U.S.?\n\n**C.C. Wei** (Chairman and CEO)\nOkay, let me answer this question first. You know, if you build a new fab, it takes two and three years, two to three years to build a new fab. So even we start to spend $52-$56 billion. The contribution to this year almost none. And to 2027 a little bit. So we actually were looking for 2028, 2029 supply. And we hope it's a time that the gap will be narrow. For 2026 and 2027 we are focused on the short term, more output. Actually our productivity continue to increase. Our people has an incentive because of one of the TSMC's incentive is to satisfy customer. It's not because of our financial result are good, but we want to let customer feel that TSMC is trusted. That whenever they have a good opportunity to grow, we will support it.\n\n**C.C. Wei** (Chairman and CEO)\nSo, in 2026-2027, for the short term, we focus on the productivity improvement which we've done quite a good result because Wendell just mentioned that we can have a good financial result is because of that. But that's not our incentive. That's our incentive. But that's not our purpose. Our purpose is to support our customer. So, 2026-2027, for the short term, we are looking to improve our productivity. 2028-2029, yes, we start to increase our CapEx significantly and we continue this wave of the AI demand megatrend as we expected.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, Brett, thank you, C.C. Brett, do you have a second question?\n\n**Brett Simpson** (Co-Founder)\nYeah, I do, and thanks. That was very clear. I guess my second question is about pricing. If I look at 2025, this was the second consecutive year where TSMC's wafer ASPs were up around 20%. As leading edge becomes a bigger portion of the mix and also you feed through price increases. When we factor in the ramp of more expensive overseas fabs, is 20% wafer ASP increases the new normal for TSMC. Typically you have an annual price negotiation about this time of the year. I'm trying to understand how you project ASPs in 26. Is your March quarter guidance factoring in price increases at leading edge. Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, so Brad's question is on pricing. He notes that you know which he's looking at. The blended wafer price is increasing close to 20% according to his estimates. Of course that's blended both on price and mix but you know, it's a leading edge. And also we have mentioned earning our value. So he wants to know is this the new normal going forward?\n\n**C.C. Wei** (Chairman and CEO)\nThis is a tough question. I need the CFO to answer.\n\n**Wendell Huang** (CFO)\nOkay, every new node we have a price, the price will increase, the blended ASP will increase. I think they continue this way in the past and will continue the way in going forward but Brett, I think you're asking about the contribution from pricing to the profitability. Now as we mentioned before, the profitability. There are six factors affecting the profitability and price is just one of them and of course we continue trying to earn our value but in fact in the last few years the pricing benefits to the profitability was just enough to cover the inflation cost from tools, equipment, materials, labor, etc. There are other factors contributing to the higher profitability. The first one will be a high utilization rate as the demand is so high and as our disciplined approach to capacity planning. The utilization rate supports our high profitability.\n\n**Wendell Huang** (CFO)\nThe other one will be our manufacturing excellence. As C.C. Wei said, we continue to drive increasing productivity to generate more wafer output. Also, we continue to drive optimization capacity among nodes, which includes converting part of the N5 to N3. It also involves cross supports from different nodes from the mature nodes to the more advanced nodes. That is a very important advantage of TSMC, so with all these efforts we're able to maintain a good healthy sustainable return profitability so that we can continue to invest to support our customers' growth.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, thank you Wendell. In the interest of time, we'll take two more questions from the floor and one more from the line. So we'll go here. Sunny Lin, UBS and then.\n\n**Sunny Lin** (Semiconductor Analyst)\nThank you. Good afternoon. Very strong results. Congratulations. So number one, if we look at the company very different versus in the past from many angles. But if we look at the ramp from N3 now, you can generate actually higher revenue from N3 in year four, even year five of mass production versus in the past, you know, like peak revenue in the second or even third year of mass production. And so could you help us understand with this new trend, what's the financial implications? And then what does that imply for you to operate or even compete differently versus in the past?\n\n**Jeff Su** (Director of Investor Relations)\nSo Sunny's first question I think maybe is related well to our technology differentiation. But she knows that when we ramp a new, you know, in the past, when we have a new node after a few years, sort of, you know, the revenue or you know, comes down a bit. But she notes that nowadays we can still enjoy very high revenue from a node even after, in its fourth or fifth year. So her question is, what are the financial implications from this? And also from a, I believe, competitive dynamics.\n\n**C.C. Wei** (Chairman and CEO)\nIf I can answer, say we are lucky. Actually if you look at the semiconductors product right now, the trend is you need to have a lower power consumption always and then high speed performance. And for TSMC our technology differentiation become more and more clear. We have both benefit. We have a high speed and we have a low power consumption. And so our leading edge customer, the first wave, the second wave, the third wave continue to come. And so that sustain the demand for a long, long time. That's a difference. Of course this one you need to have technology leadership and which the technology leadership much easier to say. But every year you have to improve. As we said, we have N2 N2P and then you won't be surprised. And the third one will be N2 something and continuously.\n\n**C.C. Wei** (Chairman and CEO)\nAnd so that one give us the benefit and to support our customers' continuous innovation. And so they continue to stay with TSMC and so their product can be very competitive in the market. So that answer the question, say that you know, once we got the peak revenue and did not decrease, it continues because second wave, third wave customer continue to join.\n\n**Sunny Lin** (Semiconductor Analyst)\nThank you very much, CC. And then maybe a question on 2-nanometer, which is, CC, a meaningful revenue coming through in 2026. And so in the past you guide like how much a new node will contribute to sales for the year. And so any expectations on the revenue contribution from 2-nanometer in 2026. And then I recall in terms of process migration, few years ago there were lots of concerns on increasing cost per transistor. And that obviously is not declining from 5-nanometer but then now looking at 2-nanometer I think process migration seems to be re-accelerating even for smartphone and PC and then with larger demand coming from high-performance computing. And so maybe based on your feedback from clients, maybe for smartphone and PC clients, why are they re-accelerating process migration into 2-nanometer?\n\n**Jeff Su** (Director of Investor Relations)\nOkay, so Sunny's second question very quickly in two parts, 2 nanometer as we said is a fast ramp in 2020, very strong customer interest and demand, so what do we have any revenue percentage to guide for in 2026?\n\n**Wendell Huang** (CFO)\nYeah, Sunny, the 2-nanometer will be a bigger node than 3-nanometer from the start. Okay. But it's less meaningful nowadays to talk about the percentage of revenue contribution when the new node starts because the company as a whole the revenue has become much bigger than before. So yeah, revenue dollar it's a bigger node but percentage wise less meaningful.\n\n**Jeff Su** (Director of Investor Relations)\nAnd then the second part of Sunny's question from a technology perspective, as you know she noted increasing cost per transistor as we said CapEx per K going higher. So her question very simply, what's the value? What's driving smartphone HPC customers actually to see we're seeing a widening out of the adoption of N2. So what is the value that it's providing that the customers are willing to adopt N2?\n\n**C.C. Wei** (Chairman and CEO)\nI already answered the question right because now the whole product is looking for low power consumption and high speed performance and our technology can provide that value. I also say that every year we improve. So every year they adopt the same, even the same name of the same node their product continue to improve. So that provides a value. If you say that the cost per transistor is increased, I saw the cost per transistor, the performance compared that called the CP value is increased, is much better. So that customer stick with the TSMC. Our headache right now, if I can call it headache is a demand and supply gap. We need to work hard to narrow the gap.\n\n**Sunny Lin** (Semiconductor Analyst)\nVery clear, thank you.\n\n**Jeff Su** (Director of Investor Relations)\nThank you. Operator, can we take the last call from the line and we'll take one last one from the floor?\n\n**Operator**\nNext one. Krish Sankar, TD Cowen. Go ahead, please.\n\n**Jeff Su** (Director of Investor Relations)\nHello? Okay Chris, are you there? I guess not. Then let's just take the last call. Sorry, the last question from Bruce Lu from Goldman Sachs. Thank you.\n\n**Bruce Lu** (Analyst)\nThank you for joining. Thank you for letting me ask the last question. Hopefully it's not that difficult. So I think one of the key. I understand that TSM is trying very hard to increase the capacity, you know. AI wafer fab is growing like 15% a year. 15% plus a year. But token consumption for last few quarters is 15x a quarter. So the gap is still there, right? That's why Elon Musk was talking about the chip shortage. So, C.C., can you share with us that in your assumption when you provide 50% plus AI revenue growth, what kind of token consumption you can support and how many gigawatts power in terms of the chips you can support in your assumption when you provide this kind of five-year revenue guidance for AI.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, so Bruce's first question is on our AI CAGR. Actually to be correct we have guided for the AI CAGR to grow mid- to high 50s CAGR in the five-year period from 2024 to 2029. So that is the official guidance we have provided just today. Bruce's question is in this guidance what is our assumption basically assuming about the token growth behind this type of CAGR, what is our assumption in terms of translating to how much gigawatts of data center can we support? And other specific assumptions behind our guidance?\n\n**C.C. Wei** (Chairman and CEO)\nBruce, you got me. I mean that's, I, I also try to understand what is the tokens growth but my customers their product improvement continue to increase. So from, it's a well known from Hopper to Blackwell to Rubin that almost double triple their performance. So the one they can support the tokens growth or the one they can continue to support the compute power is enormous and so I lost track to be frank with you. For gigawatt I want to see that how much of TSMC can make the money from the gigawatt rather than say that you know how much we can support today. From my point of view still the bottleneck is TSMC's wafer supply, not power consumption. Not yet.\n\n**C.C. Wei** (Chairman and CEO)\nWe also look at carefully to answer your question, say that TSMC's wafer can support how much of the gigawatt. Still not enough. They still have an abundant power supply in the U.S.\n\n**Bruce Lu** (Analyst)\nOkay, my next question is for the CapEx, right? I want to double-check with what I just heard that CC was talking about like 2027. The CapEx will be more for the productivity improvement when 2028-29 may be meaningfully higher. So I do recall that in 2021 TSMC provided three years for $100 billion CapEx to support our structural growth. Now the demand is even stronger. Based on that, can we do three years? $200 billion for CapEx for next three years. You know the math sounds doable.\n\n**Jeff Su** (Director of Investor Relations)\nFirst, a slight clarification because CC was talking about this year we have substantially, you know, stepping up our CapEx investment. But CC also mentioned it takes two to three years to build capacity. In terms of Bruce's question, is do we say 2027 significant step up in CapEx? I think we're saying it takes time for that capacity to come out. That is the first part.\n\n**Wendell Huang** (CFO)\nYeah, I think Bruce, what CC said was the productivity was our main focus in 2026 and 2027 because when we start to invest the fab, the volume production will not come out until 2028 and 2029. So the dollar amount invested today is for 2 years or even in the future. And CapEx dollar amount, as I said in the last 3 years, $101 billion in the next 3 years, significantly higher. I'm not going to share with you the number, but significantly higher.\n\n**Jeff Su** (Director of Investor Relations)\nYeah, so I think Wendell has addressed at least both parts of Bruce's question. Okay, so again, thank you. So again, thank you everyone. This does conclude our Q and A session. Before we conclude today's conference, please be advised that the replay of the conference will be accessible within 30 minutes from now. The transcript will become available 24 hours from now and both are available or will be available throughout TSMC's website at www.tsmc.com. So again, thank you everyone for taking the time to join us today. We certainly would like to wish everyone a happy New Year. We hope everyone continues to stay well and you will join us again next quarter. Thank you. Goodbye and have a good day.",
      "fetched_at": "2026-02-04T15:39:31.132Z"
    },
    {
      "ticker": "TSM",
      "title": "Taiwan Semiconductor Manufactur (TSM) Q3 FY2025 earnings call transcript",
      "published_date": "Oct 16, 2025, 2:00 AM EDT",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/TSM/earnings/TSM-Q3-2025-earnings_call-363980.html",
      "content": "**Jeff Su** (Director of Investor Relations)\nGood afternoon, everyone, and welcome to TSMC's Third Quarter 2025 Earnings Conference call. This is Jeff Su, TSMC's Director of Investor Relations and your host for today. TSMC is hosting our earnings conference call via live audio webcast through the company's website at www.tsmc.com, where you can also download the earnings release materials. If you are joining us through the conference call, your dial-in lines are in listen-only mode. The format for today's event will be as follows. First, TSMC's Senior Vice President and CFO, Mr. Wendell Huang, will summarize our operations in the third quarter 2025, followed by our guidance for the fourth quarter 2025. Afterwards, Mr. Huang and TSMC's Chairman and CEO, Dr. C.C. Wei, will jointly provide the company's key messages. We will open the line for Q&A.\n\n**Jeff Su** (Director of Investor Relations)\nAs usual, I would like to remind everybody that today's discussions may contain forward-looking statements that are subject to significant risks and uncertainties, which could cause actual results to differ materially from those contained in the forward-looking statements. Please refer to the safe harbor notice that appears in our press release. I would like to turn the call over to TSMC CFO, Mr. Wendell Huang, for the summary of operations and the current quarter guidance.\n\n**Wendell Huang** (CFO and SVP)\nThank you, Jeff. Good afternoon, everyone. Thank you for joining us today. My presentation will start with financial highlights for the third quarter 2025. After that, I will provide the guidance for the fourth quarter 2025. Third quarter revenue increased 6% sequentially in NT, as our business was supported by a strong demand for our leading-edge process technologies. In U.S. dollar terms, revenue increased 10.1% sequentially to $33.1 billion, slightly ahead of our third quarter guidance. Gross margin increased 0.9% percentage point sequentially to 59.5%, primarily due to cost improvement efforts and a higher capacity utilization rate, partially offset by an unfavorable foreign exchange rate and dilution from our overseas fabs. Accordingly, operating margin increased 1.0 percentage point sequentially to 50.6%. Overall, our third quarter EPS was TWD 17.44, up 39% year-over-year, and ROE was 37.8%. Now, let's move on to revenue by technology.\n\n**Wendell Huang** (CFO and SVP)\n3 nm process technology contributed 23% of wafer revenue in the third quarter, while 5 nm and 7 nm accounted for 37% and 14% respectively. Advanced Technologies defined as 7 nm and below accounted for 74% of wafer revenue. Moving on to revenue contribution by platform, HPC remained flat quarter-over-quarter to account for 57% of our third quarter revenue. Smartphone increased 19% to account for 30%. IoT increased 20% to account for 5%. Automotive increased 18% to account for 5%. DCE decreased 20% to account for 1%. Moving on to the balance sheet, we ended the third quarter with cash and marketable securities of TWD 2.8 trillion, or $90 billion. On the liability side, current liability decreased by TWD 101 billion, quarter-over-quarter, mainly due to the decrease of TWD 112 billion in accrued liabilities and others, as we paid out 2025 provisional tax of TWD 136 billion.\n\n**Wendell Huang** (CFO and SVP)\nIn terms of financial ratios, accounts receivable turnover days increased two days to 25 days. Days of inventory decreased two days to 74 days due to strong shipment in N3 and N5. Regarding cash flow and CapEx, during the third quarter, we generated about TWD 427 billion in cash from operations, spent TWD 287 billion in CapEx, and distributed TWD 117 billion for Q2 2024 cash dividend. Overall, our cash balance increased TWD 106 billion to TWD 2.5 trillion at the end of the quarter. In U.S. dollar terms, our third quarter capital expenditures totaled $9.7 billion. I have finished my financial summary. Now, let's turn to our current quarter guidance. Based on the current business outlook, we expect our fourth quarter revenue to be between $32.2 billion and $33.4 billion, which represents a 1% sequential decrease or a 22% year-over-year increase at the midpoint.\n\n**Wendell Huang** (CFO and SVP)\nBased on the exchange rate assumption of $1 to TWD 30.6, gross margin is expected to be between 59% and 61%. Operating margin between 49% and 51%. This concludes my financial presentation. Now, let me turn to our key messages. I will start by talking about our third quarter 2025 and fourth quarter 2025 profitability. Compared to the second quarter, our third quarter gross margin increased by 90 basis points sequentially to 59.5%, primarily due to cost improvement efforts and a higher overall capacity utilization rate, partially offset by margin dilution from our overseas fabs and an unfavorable foreign exchange rate. Compared to our third quarter guidance, our actual gross margin exceeded the high end of the range provided three months ago by 200 basis points, mainly as the actual third quarter exchange rate was $1 to TWD 29.91, compared to our guidance of $1 to TWD 29.\n\n**Wendell Huang** (CFO and SVP)\nIn addition, we also delivered better than expected cost improvement efforts. We have just guided our fourth quarter gross margin to increase by 50 basis points to 60% at the midpoint, primarily driven by a more favorable foreign exchange rate, partially offset by continued dilution from our overseas fabs. While the cost of overseas fabs remains higher, thanks to the company's overall larger scale, we now expect the gross margin dilution from the ramp-up of our overseas fabs to be closer to 2% in the second half of 2025. For the full year 2025, we now expect it to be between 1%-2% as compared to 2%-3% previously.\n\n**Wendell Huang** (CFO and SVP)\nLooking ahead, we continue to forecast the gross margin dilution from the ramp-up of our overseas fabs in the next several years to be 2%-3% in the early stages and widen to 3%-4% in the latter stages. We will leverage our increasing size in Arizona and work on our operations to improve the cost structure. We will also continue to work closely with our customers and suppliers to manage the impact. Overall, with our fundamental competitive advantages of manufacturing technology leadership and large-scale production base, we expect TSMC to be the most efficient and cost-effective manufacturer in every region that we operate. Now, let me make some comments on our 2025 CapEx. As the structured AI-related demand continues to be very strong, we continue to invest to support our customers' growth.\n\n**Wendell Huang** (CFO and SVP)\nWe are narrowing the range of our 2025 CapEx to be between $40 billion and $42 billion, as compared to $38 billion-$42 billion previously. About 70% of the capital budget will be allocated for advanced process technologies. About 10%-20% will be spent for specialty technologies. About 10%-20% will be spent for advanced packaging, testing, mask making, and others. At TSMC, a higher level of capital expenditures is always correlated with higher growth opportunities in the following years. Even as we invest for the future growth with this higher level of CapEx spending in 2025, we remain committed to delivering profitable growth to our shareholders. We also remain committed to a sustainable and steadily increasing cash dividend per share on both an annual and quarterly basis. Now, let me turn the microphone over to C.C.\n\n**Che-Chia Wei** (CEO and Chairman)\nThank you, Wendell. Good afternoon, everyone. First, let me start with our near-term demand outlook. We concluded our third quarter with revenue of $33.1 billion, slightly above our guidance in U.S. dollar terms, mainly due to the strong demand for our leading-edge process technologies. Moving into the fourth quarter 2025, we expect our business to be supported by continued strong demand for our leading-edge process technologies. We continue to observe robust AI-related demand throughout 2025, while the non-AI end market segment has patterned out and is seeing a mild recovery. Supported by our strong technology differentiation and broad customer base, we now expect our full-year 2025 revenue to increase by close to mid-30% year-over-year in U.S. dollar terms.\n\n**Che-Chia Wei** (CEO and Chairman)\nWhile we have not observed any change in our customers' behavior so far, we understand there are uncertainties and risks from the potential impact of tariff policies, especially in the consumer-related and price-sensitive end market segments. As such, we will remain mindful of the potential impact and be prudent in our business planning going into 2026 while continuing to invest for the future megatrend. Amidst the uncertainty, we will also continue to focus on the fundamentals of our business, that is technology leadership, manufacturing excellence, and customer trust, to further strengthen our competitive position. Next, let me talk about the AI demand outlook and TSMC's capacity planning process disciplines. Recent developments in the AI market continue to be very positive. The explosive growth in token volume demonstrates increasing consumer AI model adoption, which means more and more computation is needed, leading to more leading-edge silicon demand.\n\n**Che-Chia Wei** (CEO and Chairman)\nCompanies such as TSMC are leveraging AI internally to drive greater productivity and efficiency to create more value. As such, enterprise AI is another source of demand. In addition, we continue to observe the rising emergence of sovereign AI. We are also happy to see continued strong outlook from our customers. In addition, we directly receive very strong signals from our customers' customers, requesting the capacity to support their business. Thus, our conviction in the AI megatrend is strengthening, and we believe the demand for semiconductors will continue to be very fundamental. As a key enabler of AI applications, TSMC's biggest responsibility is to prepare the most advanced technologies and necessary capacity to support our customers' growth. To address the structural increase in the long-term market demand profile, TSMC employs a disciplined and robust capacity planning system.\n\n**Che-Chia Wei** (CEO and Chairman)\nExternally, we work closely with our customers and our customers' customers to plan our capacity. We have more than 500 different customers across all the end market segments. In addition, as process technology complexity increases, the engagement lead time with customers is now at least two to three years in advance. Therefore, we probably get the deepest and widest loop possible in the industry. Internally, our planning system involves multiple teams across several functions to assess and evaluate the market demand from both top-down and bottom-up approaches to determine the appropriate capacity to build. This is especially important when we have such high forecasted demand from AI-related businesses. As the world's most reliable and effective capacity provider, we will continue to work closely with our customers to invest in leading-edge specialty and advanced packaging technologies to support their growth.\n\n**Che-Chia Wei** (CEO and Chairman)\nWe will also remain disciplined and robust in our capacity planning approach to ensure we deliver profitable growth for our shareholders. Now, let me talk about TSMC's global manufacturing footprint update. All our overseas decisions are based on our customers' needs, as they value some geographic flexibility and the necessary level of government support. This is also to maximize the value for our shareholders. With a strong collaboration and support from our leading U.S. customers and the U.S. federal, state, and city governments, we continue to speed up our capacity expansion in Arizona. We are making tangible progress and executing well to our plan. In addition, we are preparing to upgrade our technologies faster to end-to-end and more advanced process technologies in Arizona, given the strong AI-related demand from our customers.\n\n**Che-Chia Wei** (CEO and Chairman)\nFurthermore, we are close to securing a second large piece of land nearby to support our current expansion plans and provide more flexibility in response to the very strong multi-year AI-related demand. Our plan will enable TSMC to scale up to an independent gigafab cluster in Arizona to support the needs of our leading-edge customers in smartphone, AI, and HPC applications. Next, in Japan, thanks to the strong support from the Japan Central, Prefectural, and Local Government, our first specialty fab in Kumamoto has already started volume production in late 2024 with very good yield. The construction of our second fab has begun, and the ramp schedule will be based on our customers' needs and market conditions. In Europe, we have received strong commitment from the European Commission and the German federal, state, and city governments.\n\n**Che-Chia Wei** (CEO and Chairman)\nConstruction of our specialty fab in Dresden, Germany, has also started, and we are progressing smoothly with our plans. The ramp schedule will be based on our customers' needs and market conditions. In Taiwan, with support from the Taiwan government, we are preparing for multiple phases of 2 nm fab in both Xinchu and Kaohsiung Science Parks. We will continue to invest in leading-edge and advanced packaging facilities in Taiwan over the next several years. By expanding our global footprint while continuing to invest in Taiwan, TSMC can continue to be the trusted technology and capacity provider of the global logic IC industry for years to come. Finally, let me talk about our N2 and S16 status. Our 2 nm and S16 technologies lead the industry in addressing insatiable demand for energy-efficient computing, and almost all innovators are working with TSMC. N2 is well on track for volume production later this quarter.\n\n**Che-Chia Wei** (CEO and Chairman)\nWith good yield, we expect a faster ramp in 2026, fueled by both smartphone and HPC AI applications. With our strategy of continuous enhancement, we also introduce N2P as an extension of our N2 family. N2P features further performance and power benefits on top of N2 and volume production scheduled for the second half of 2026. We also introduced A16 featuring our best-in-class superpower rail, or SPR. A16 is best suited for a specific HPC product with a complex signal route and dense power delivery networks. Volume production is on track for the second half of 2026. We believe N2, N2P, A16, and its derivatives will propel our N2 family to be another large and long-lasting node for TSMC. This concludes our key message, and thank you for your attention.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, C.C. This concludes our prepared statements. Before we begin the Q&A session, I would like to remind everybody to please limit your questions to two at a time to allow all the participants an opportunity to ask their questions. Should you wish to raise your question in Chinese, I will translate it to English before our management answers your question. For those of you on the call, if you would like to ask a question, please press the star, then one on the telephone keypad now. If at any time you'd like to remove yourself from the questioning queue, please press star, then two. Now, let's begin the Q&A session. Operator, can we please proceed with the first caller on the line? Thank you.\n\n**Operator**\nYes. First one, Gokul Hariharan, JPMorgan. Go ahead, please.\n\n**Gokul Hariharan** (Analyst)\nYeah, thanks. Good afternoon, C.C., Wendell, and Jeff. Great result again. On the AI front, C.C., I think you have met with pretty much everybody who is driving the Gen AI revolution over the last couple of months. As you said, everybody seems to be a lot more positive. I think we gave a guidance of mid-40% data center AI growth CAGR earlier this year until 2029. Anything that you see which should kind of change that number? It definitely feels like the growth today seems to be much stronger. Related to that, you did talk about the very detailed capacity expansion planning that TSMC does. In past technology cycles, TSMC CapEx has gone up significantly to prepare for the next upgrade or next leading-edge node. In this cycle, TSMC revenues have grown 50% from the previous peak in 2022. CapEx has only grown about 10%.\n\n**Gokul Hariharan** (Analyst)\nHow should we think about the CapEx over the next couple of years? I know that you're not giving numerical guidance yet, but I just wanted to understand, like are we looking at much higher CapEx in the next couple of years given all these conversations you've had? I had a follow-up after that. Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Gokul, first question. Sorry, Gokul. Let me summarize for everyone's benefit. Again, he wants to know firstly related to the AI-related demand that TSMC works with many, if not everyone, who is doing AI, and many of the customers seem to be even more positive today. I guess he would like to ask C.C., sort of what are we seeing or hearing from our customers? We had previously said that the next five years from 2024 to 2029, we expect AI accelerator to grow at a mid-40% CAGR. Is there any update to this? I think this is the first part. I'll get to the second part on CapEx.\n\n**Che-Chia Wei** (CEO and Chairman)\nWow. That's a long question, isn't it? Gokul, the AI demand actually continues to be very strong. It's more strong than we thought three months ago. In today's situation, we have talked to customers, and then we talk to customers' customers. The CAGR we previously announced is about the mid-40%, but it's still a little bit better than that. We will update you probably in the beginning of next year. We have a more clear picture. Today, the numbers are incentive.\n\n**Jeff Su** (Director of Investor Relations)\nThe second part of Gokul's question related to CapEx, he notes that in the past, when TSMC sees opportunities for higher growth, past cycles or past instances, we would step up the CapEx significantly to prepare to drive the future growth. He notes this cycle, actually, though while CapEx is increasing, the revenue is increasing even faster. His question really, I think, is how do we see this playing out over the next few years, both in terms of the CapEx spend and the growth relative to the revenue growth?\n\n**Wendell Huang** (CFO and SVP)\nOkay. Gokul, every year we spend the CapEx based on the business opportunity in the following few years. As long as we believe there are business opportunities, we will not hesitate to invest. If we do our job right, the growth of our business or of our revenue should outpace the growth of the CapEX. That is what we have been delivering in the past few years. Now, going forward, assuming we're still doing a very good job, we will continue to see that happening again. A company of our size, the CapEx number, it's unlikely to suddenly drop significantly in any given year. When we continue to invest and our growth is outpacing our CapEx growth, you'll see the growth like what we have done in the past few years.\n\n**Gokul Hariharan** (Analyst)\nUnderstood. I know that it is unlikely to drop, but it is also likely to grow quite a bit given what C.C. Wei mentioned in terms of every customer asking you and every customer's customer requesting you for capacity addition, right?\n\n**Wendell Huang** (CFO and SVP)\nYeah, as I said, a higher level of CapEx is always going to be correlated with a higher growth opportunity. As C.C. said, next year looks to be a healthy year and that we are confident on the megatrend, then we'll continue to invest.\n\n**Gokul Hariharan** (Analyst)\nOkay, got it. Yeah.\n\n**Gokul Hariharan** (Analyst)\nYeah, maybe one more follow-up question from me, C.C. I think last year also you gave us an indication of how much CoWoS capacity you would be building. I think you talked about 2x of doubling the CoWoS capacity. It clearly feels like even that is not enough. Could you give us some idea about how much capacity you would be building next year just to get some idea about what you are seeing in terms of AI demand? Also, just to get some understanding of TSMC's data center AI exposure, I think last year we talked about mid-teens revenues. Where do we end up this year? Do we end up close to like 30% of revenues coming from AI?\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Gokul, your second question really, he wants to understand, can we provide any detail or colors on the CoWoS capacity plan for 2026 in terms of year-on-year increase? Also, in terms of our definition of AI accelerator revenue, the narrow definition, how much will it contribute for 2025 revenue? Is it 30%?\n\n**Che-Chia Wei** (CEO and Chairman)\nGokul, this is C.C. Wei again. Talking about the CoWoS capacity, all I can say is continuing the three months ago, we are working very hard to narrow the gap between the demand and supply. We are still working to increase the capacity in 2026. The real number, we probably update you next year. Today, all I want to say about the AI, everything related, like the front-end and back-end capacity, is very tight. We are working very hard to make sure that the gap will be narrow, but all I can say is we are working very hard.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Thank you, Gokul. I think we need to move on in the interest of time. Operator, can we move to the next participant, please?\n\n**Operator**\nYes. Next one, Charlie Chan, Morgan Stanley. Go ahead, please.\n\n**Charlie Chan** (Analyst)\nThanks for taking my question. Again, congratulations for very strong results, C.C., Wendell, and Jeff. My first question is really about your leading-edge demand. As C.C. just mentioned, your front-end demand is also very strong into next year. One of your major customers just said that more so is that. I think his point is that by doing maybe system-level innovation in the thermal, etc., can boost up more kind of performers. Just a kind of dumb question. How do we reconcile your very, very strong leading-edge demand and that customer continue to migrate to your most advanced nodes and also you continue to reflect value, whereas the customer continues to think that more so is that? Can we get some clarification from TSMC?\n\n**Jeff Su** (Director of Investor Relations)\nAll right. Charlie's question is very specific, although he wants us to comment on a customer saying more so is that. How do we reconcile this with a very strong leading-edge demand into 2026 and also with system-level innovations?\n\n**Che-Chia Wei** (CEO and Chairman)\nOkay. Charlie, this is C.C. Wei. Yeah, one of my customers, very important customer, say more so is that. What he means is it's not only relying on the chip technology anymore. Now we have to focus on the whole system's performance. He wants to emphasize the whole system's performance rather than just talking about the more so, which is not enough to meet his requirement. We work very closely with his people to design our technology, both in front-end and back-end, and also in all the packagings to meet his requirement. That's all I can say.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Thank you, C.C.\n\n**Che-Chia Wei** (CEO and Chairman)\nSure.\n\n**Charlie Chan** (Analyst)\nThanks, CC.\n\n**Jeff Su** (Director of Investor Relations)\nDo you have a second question, Charlie?\n\n**Charlie Chan** (Analyst)\nYes, I do. Thanks, Jeff. I would interpret that as Foundry 2.0, that your co-COO, Mr. Cliff, also kind of shared during the SEMICON Taiwan. Thanks, C.C., for your commentary. My second question is actually a follow-up from last quarter's same question. Back then, I consulted you about the China AI GPU demand, right? Whether you can seize the market opportunity because China says VDL is setting their AI infrastructure very rapidly. Given the recent kind of back and forth between the U.S. and China, whether China can really impose this NVIDIA GPU, would that kind of discount your potential long-term growth of the AI CAGR? Is that something that TSMC would worry about?\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Charlie's second question is related around AI demand and specific to China. With the sort of the export control and restriction, his question is, does that impact our ability to address the market opportunity? Will this impact our AI CAGR growth if we're not allowed to fully serve China?\n\n**Charlie Chan** (Analyst)\nI think there will be both sides, meaning restriction from the U.S., but also China government's kind of discouragement to procure a U.S. chip. Sorry for the interruption.\n\n**Che-Chia Wei** (CEO and Chairman)\nCharlie, to speak the truth, I have a confidence in my customers. Both are in GPU or in ASIC. They all perform very well. If the China market is not available, I still think the AI's growth will be very dramatic and, as I said, very positive. I have confidence that our customers' performance and they will continue to grow, and we will support them.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, C.C.\n\n**Charlie Chan** (Analyst)\nEven with a limited opportunity from China for the time being, you are still confident that a 40% CAGR or even higher can be achieved in the coming years?\n\n**Che-Chia Wei** (CEO and Chairman)\nYou are right.\n\n**Charlie Chan** (Analyst)\nOkay, great. Thank you.\n\n**Charlie Chan** (Analyst)\nOkay.\n\n**Charlie Chan** (Analyst)\nThanks, gentlemen.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, Charlie. Operator, can we move on to the next participant, please?\n\n**Operator**\nYes. Next one, Sunny Lin, UBS. Go ahead, please.\n\n**Sunny Lin** (Analyst)\nThank you very much. Good afternoon. Congrats on the very strong gross margin. My first question is, how should we think about 2026? I understand we should get better color maybe into January, but just want to get some directional major puts and takes for gross margin trending going into 2026. Especially, how should we think about the gross margin impact from 2 nm ramp for 2026?\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Sonya's first question is regarding gross margin. She would like to know directionally how do we see the gross margin for next year, 2026, in terms of certain puts and takes, and also if Wendell is able to comment specifically. Sunni, sorry if I heard you right, on the N2 dilution impact, correct?\n\n**Sunny Lin** (Analyst)\nYeah, that's right. Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. That's her first question.\n\n**Wendell Huang** (CFO and SVP)\nOkay, Sunni. Yeah, it's too early to talk about 2026. You already mentioned about the N2 dilution. As all the new nodes, when they just come out, the N2 will have dilution in our gross margin in 2026. At the same time, the N3 dilution is gradually coming down. We expect the N3 to catch up to the corporate average sometime in 2026. The other factors include overseas fabs dilution, which will continue, and which we said that it will be about 2%-3% dilution in the early stage of the next several years. That will also be there. We all saw the dramatic foreign exchange rate movement in the earlier part of this year. There's no control. We don't know where that will be. Every percentage move of dollar against TWD will affect our gross margin by 40 basis points. That just gives you some rough idea.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, thank you.\n\n**Sunny Lin** (Analyst)\nGot it. Sunni, if I may, a very quick follow-up. On 2 nm, would the typical 2%-3% dilution by new node for the first seven to eight quarters of mass production be a good reference for two-nanometer as well for 2026?\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Sunni, a quick follow-up. She wants to know for the 2 nm dilution if we're able to provide any detail. Can she still think about it in terms of seven to eight quarters or six to eight quarters dilution to reach the time, sorry, to reach the corporate average?\n\n**Wendell Huang** (CFO and SVP)\nYeah, Sunni, let me share with you. N2 structure profitability is better than N3. Now, secondly, it's less meaningful nowadays to talk about how long it will take for a new node to reach the corporate average in terms of profitability. That's because the corporate profitability, the corporate gross margin moves, and generally, it has been moving upwards. Less meaningful to talk about that.\n\n**Sunny Lin** (Analyst)\nGot it. No problem. That's very helpful. My second question is maybe for C.C. Thanks a lot for sharing with us the details on how you think about the capacity expansions and planning. My question is, now Cloud AI is ramping a lot faster than the prior opportunities like smartphones and PCs. I think the demand for Cloud AI is also maybe harder to forecast. I just want to maybe get a bit more color from you. Compared to the prior rounds of capacity expansions, what is TSMC doing differently versus before? How do you ensure that while you are ramping up the capacities more quickly, you are still having a good risk control? Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, Sunni. Sonia's second question is regarding capacity planning and expansion in a capital-intensive business. She notes this is very important. In the past, smartphone and PC megatrends, today it's AI and Cloud AI. She's wondering, does that make this planning process more difficult to forecast? What are we doing differently? How do we forecast this to make sure that we are investing appropriately?\n\n**Che-Chia Wei** (CEO and Chairman)\nSunni, indeed, right now, because I believe we are just in the early stage of the AI application, it is very hard to make a right forecast at this moment. What do we do differently? There's a big difference because right now we pay a lot of attention to our customers' customers. We talk to and then discuss with them and look at their applications, be it in the search engine or in social media applications. We talk with them and see how they view the AI application to those functions. Then we make a judgment about what the AI is going to grow. This is quite different as compared with before. We only talked to our customers and had an internal study. This is different. Did I answer your question?\n\n**Sunny Lin** (Analyst)\nGot it. Thank you very much, C.C. Yeah, and looking forward to the [KPAC sky] in January. Thank you.\n\n**Che-Chia Wei** (CEO and Chairman)\nYou're welcome.\n\n**Jeff Su** (Director of Investor Relations)\nAll right. Thank you, Sunni. Operator, can we move on to the next participant, please?\n\n**Operator**\nNext one, Bruce Lu, Goldman Sachs. Go ahead, please.\n\n**Bruce Lu** (Analyst)\nHello. Thank you for taking my question. I think Jensen talked about like $3 trillion-$4 trillion AI infrastructure opportunities by 2030, right? This compared to like $600 billion CapEx recent of this year implies for about 40% CAGR. This is similar to TSMC guidance for the AI growth, right? For me, first of all, what I want to know is what's the TSMC view for the AI infrastructure growth for the next five years? What's TSMC's forecast for the token growth rate in the next few years? TSMC used to provide the same industry growth, foundry growth, and how much TSMC can outperform the industry, right? Given the context, can we assume like TSMC AI-related revenue can track or will track with the CapEx growth of AI or the major cloud service provider?\n\n**Bruce Lu** (Analyst)\nShould we expect an even higher growth rate for TSMC, considering you're potentially getting more value out of it?\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Let me try to summarize your question, Bruce. He notes that one of our customers has highlighted a $3 trillion-$4 trillion infrastructure opportunity over the next few years compared to $600 billion current CapEx, implying a 40-something % CAGR growth rate, which is similar to ours. Bruce's question is he wants to know what is TSMC's forecast or view for AI infrastructure growth. He would also like to know what is TSMC's forecast or view for the token growth? What is TSMC's AI-related revenue growth? Can it track that of the cloud service providers? His question is, should it be even higher? Shouldn't it be even higher given the value that we capture? That's actually several questions, but is that correct, Bruce?\n\n**Bruce Lu** (Analyst)\nThat's right. Thank you.\n\n**Che-Chia Wei** (CEO and Chairman)\nBruce, essentially just want to know how accurate that we can predict that the AI is in demand. We give you a number, roughly 40% in the mid-40s is a CAGR, not including all the infrastructures built up and also aligned with our major customers' forecasts or their view. More than that, I think if we are talking about the tokens, the number of tokens increase, it's exponential. I believe that almost every three months, it will be exponentially increased. That's why we are still very comfortable that the demand on leading-edge semiconductors is real. As I continue to say, we look at all the demand and look at our capacity expansion, we need TSMC to work very hard to narrow the gap. That's what we are doing right now.\n\n**Che-Chia Wei** (CEO and Chairman)\nExactly the number that we probably will share with you in next year so that when we have a very better clear picture.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, C.C.\n\n**Bruce Lu** (Analyst)\nI think the question is that the token growth seems to be substantially higher than the AI-related revenue guidance from TSMC, right? The gap is actually enlarging if you compound in the outer years, right? That's why that's the difference between what we see for the current TSMC outlook and the potential token consumptions, right? The gap is continuing to see an enlarging. How do we solve this? Do we really see that as a major issue as well?\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Bruce's second question, which is a follow-on from his first, is that the token growth is growing at a much higher rate or exponentially than TSMC's AI revenue growth. This gap will only widen in the next few years. He wants to know, Bruce, basically, what's the implication to TSMC or how do we see this? Is that correct?\n\n**Che-Chia Wei** (CEO and Chairman)\nOkay. Okay, Bruce. You are right. You are right. The tokens and the number of tokens that increase exponentially is much, much higher than TSMC's CAGR as we forecasted. Let me tell you that first, our technology continues to improve. Our customer is moving from one node to the next node so that they can handle much more tokens' number in their basic fundamental calculation. That's one thing. You know we progress very well from one node to the other node. Our customer is working with TSMC to continuously improve their performance. That's why when we say that we have about 40%, 45% CAGR, the token number exponentially increases because of our customer and TSMC's technology combined that can handle much more or much efficiently than before. Did I answer your question?\n\n**Bruce Lu** (Analyst)\nI see.\n\n**Bruce Lu** (Analyst)\nYou believe your node migration plus your customer design change can fulfill or can meet the exponential growth for the token consumption?\n\n**Che-Chia Wei** (CEO and Chairman)\nExactly.\n\n**Bruce Lu** (Analyst)\nIs that the conclusion?\n\n**Che-Chia Wei** (CEO and Chairman)\nYes.\n\n**Bruce Lu** (Analyst)\nI understand.\n\n**Bruce Lu** (Analyst)\nOkay. Quick follow-up for the market.\n\n**Jeff Su** (Director of Investor Relations)\nBruce, that was your second question. Operator, we need to move on. Thank you, Bruce.\n\n**Operator**\nYes. Next one, Laura Chen, Citi. Go ahead, please.\n\n**Laura Chen** (Analyst)\nYeah. Thank you very much for taking my questions. I appreciate C.C. sharing your view on TSMC's strategy on the AI capacity planning. I think along with the very strong advanced node demand, I believe that advanced packaging like CoWoS is also one of the focuses for your AI clients they are now looking for. I recall that TSMC previously also planned to expand advanced packaging in Arizona. Can you give us updates here? Also, for the time being, the very stretched demands at the moment, would TSMC work more closely with your OSAT partner to fulfill the strong demand at the same time? That's my first question. Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, Lora. Her first question is on capacity planning. We have talked earlier on the call about the planning for leading nodes. She wants to understand also on the cohort capacity, and specifically, I guess, advanced packaging in Arizona. How do we work with our all-set partners?\n\n**Che-Chia Wei** (CEO and Chairman)\nOkay. We have announced our plan to build two advanced packaging fabs in Arizona to support our customers. At the same time, right now we are working with one all-set big company and our good partner, and they are going to build their fab in Arizona. We are working with them because they are already breaking ground, and the schedule is earlier than TSMC's two advanced packaging fabs. We are working with them. Our main purpose is to support our customers, so we can marry in the U.S.\n\n**Jeff Su** (Director of Investor Relations)\nLaura, do you have a second question?\n\n**Laura Chen** (Analyst)\nYes, yes, certainly. I mean, obviously, we see that the advanced node, advanced packaging is quite strong. Also, at the same time, we are also seeing that the migration is also happening for N2 and N3. Just wondering, from the revenue growth perspective, I know it's still early to predict next year based on your guidance. I'm just wondering, will it be more driven by the ASP increase because of the technology migration? TSMC will be able to sell in your value or more that will be driven by the capacity or volume growth on both N2 ramp-up? Also, C.C, you mentioned some of the mild silico recovery. That may also drive some of the volume growth into next year. Just wondering, if you look at the growth outlook, would that be more driven by the technology upgrade ASP increase or also more like a volume?\n\n**Laura Chen** (Analyst)\nThat's my second question. Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Laura's, again, second question is looking at 2026. She would like to understand what will be the key drivers of the growth. Is it more from the technology mix migration, things like N2? Is it more from ASP upgrade, or is it more from just pure wafer volume growth?\n\n**Che-Chia Wei** (CEO and Chairman)\nLaura, all the above. All right?\n\n**Laura Chen** (Analyst)\nOkay. Okay.\n\n**Che-Chia Wei** (CEO and Chairman)\nYou knew it, right? I mean, that's it.\n\n**Che-Chia Wei** (CEO and Chairman)\nIt's growing.\n\n**Laura Chen** (Analyst)\nYeah.\n\n**Laura Chen** (Analyst)\nThere are also follow-ups because we see that actually N3 is very tight. At the same time, we are also kind of expanding on N2. C.C., you previously mentioned that you will migrate some of the even N7, N6, and also N5 to like N3. Specifically on N3, do we also need to add more capacity into next year for newly added capacity?\n\n**Jeff Su** (Director of Investor Relations)\nLaura, if I understand correctly, will we need to add new capacity? Will we continue to do conversion? What will we do to support the very strong demand we see at leading edge next year?\n\n**Laura Chen** (Analyst)\nYes, thank you.\n\n**Wendell Huang** (CFO and SVP)\nLet me answer that question. We continue to optimize the N5, N3 capacity to support our customer. For the new building for the N3 capacity to expand, we put the new building for the N2 technology. That's today's plan.\n\n**Laura Chen** (Analyst)\nOkay.\n\n**Wendell Huang** (CFO and SVP)\nOkay?\n\n**Laura Chen** (Analyst)\nOkay. Thank you. Thank you. Very clear.\n\n**Wendell Huang** (CFO and SVP)\nThank you.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, Laura. Operator, in the interest of time, we'll take the questions from the last two participants, please. Thank you.\n\n**Operator**\nYes. Next one, Krish Sankar, TD Cowen. Go ahead, please.\n\n**Krish Sankar** (Analyst)\nYeah, hi. Thanks for taking my question. My first one is C.C. About 10 years ago, back in the smartphone days, TSMC would talk about the revenue opportunity for TSMC per phone. I was wondering, in today's world, can you talk about how much one gigawatt of AI data center capacity could translate in terms of wafer demand or revenue for TSMC? I have a follow-up.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Krish's first question, you noted in the past in the smartphone megatrend, we talked about the content per phone opportunity for TSMC. Now with AI, is there a way to frame or quantify one gigawatt of data center capacity? What is the revenue opportunity for TSMC?\n\n**Che-Chia Wei** (CEO and Chairman)\nRecently, as I said, the AI demand continues to increase. My customers say that 1 GW, they need to invest about $50 billion. How much of TSMC is a wafer inside? We are not ready to share with you yet because of different approaches. Okay?\n\n**Krish Sankar** (Analyst)\nNo worries. A quick follow-up.\n\n**Che-Chia Wei** (CEO and Chairman)\nExcuse me. I just want to say that you know right now it's not only one chip. Actually, it's many chips together to form a system. All right?\n\n**Krish Sankar** (Analyst)\nGot it. Very helpful for that. A little quick follow-up. You know, obviously, you folks forecast long-term trends and then build capacity towards that. I'm kind of curious, when you look at the AI demand over the next several years, from a TSMC angle, does it matter whether that demand is coming through a GPU or an ASIC? Does it have an impact on your revenue or gross margin mix?\n\n**Jeff Su** (Director of Investor Relations)\nThank you, Krish. His second question is, again, with our business outlook. We forecast the long-term trends. We plan our capacity, as C.C. said, in a thorough and disciplined manner. His question is, what are the implications, for example, of, I believe you said GPU versus ASIC in terms of the AI market? Do we have a preference or is there a difference for TSMC? Is that correct, Krish?\n\n**Krish Sankar** (Analyst)\nThat's right. The impact to revenue and gross margin, whether it's a GPU or an ASIC.\n\n**Jeff Su** (Director of Investor Relations)\nRight. Okay.\n\n**Che-Chia Wei** (CEO and Chairman)\nKrish, no matter if it's a GPU or it's an ASIC, it's all using our leading-edge technologies. From our perspective, we are working with our customer, and we all know that they are going to grow strongly in the next several years. There is no differentiation in front of TSMC. We support all kinds of types.\n\n**Krish Sankar** (Analyst)\nThank you very much.\n\n**Jeff Su** (Director of Investor Relations)\nThank you. Operator, can we take?\n\n**Krish Sankar** (Analyst)\nThank you.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, Krish. We'll take the question from the final participant, please.\n\n**Operator**\nYes. Last one off the line, Macquarie. Go ahead, please.\n\n**Arthur Lai** (Analyst)\nHi, C.C., Wendell, and Jeff. Congrats on a strong outlook. Asalai from Macquarie. My question is about competition. C.C., you define the Foundry 2.0 market. I wonder what's the strategic initiative that TSMC is undertaking to further strengthen your competitive landscape and also in this broader ecosystem? For some context, I got the question from the U.S. investor as your clients announced they invest in Intel. Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Arthur's question is around competition. In the Foundry 2.0 landscape, what strategic initiatives, what things are TSMC focusing on to further strengthen our competitive advantage? I think the last part, Arthur, you're asking in the environment where one of our competitors in the U.S., how do we focus on the competition? Is that correct?\n\n**Arthur Lai** (Analyst)\nYes. Thank you, Jeff.\n\n**Che-Chia Wei** (CEO and Chairman)\nOkay. Let me answer that one. When we introduce Foundry 2.0, we set the purpose that, as I said, one of my customers said that the system performance is very important in these days, not only a single chip. Also, let me share with you that our advanced packaging revenue is approaching close to 10%. It's significant in our revenue, and it's important for our customer. That's why we introduce Foundry 2.0 to categorize this foundry business, not as usual. Previously, we only looked at the front-end portion. Now it's the whole thing, the front-end, the back-end, and also important for our customer. That's why we introduce 2.0. Talking about our competition in the U.S., that competitor happens to be our customer, a very good customer. In fact, we are working with them for their most advanced product. Other than that, I don't want to make any more comments.\n\n**Arthur Lai** (Analyst)\nYeah. Thank you, C.C. Can I ask one more question?\n\n**Jeff Su** (Director of Investor Relations)\nYes, you have two. Your second question, sure.\n\n**Arthur Lai** (Analyst)\nYeah. My second question is very quick on the end demand. Recall, C.C., you last time mentioned that we should also monitor and worry about the prebuilt, especially in the consumer electronics. This quarter, our numbers suggest that there's a QoQ 19% growth in the smartphone. My question is, do you still worry about the prebuilt? Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Arthur, the second question is on smartphone. Are we concerned about prebuilt or sort of, I guess, pulling prebuilt from customers in that regard?\n\n**Che-Chia Wei** (CEO and Chairman)\nNo. We don't worry about the prebuilt because when you have a prebuilt, you have an inventory. These days, the inventory already goes to the very seasonal level and very healthy. So no prebuilt.\n\n**Arthur Lai** (Analyst)\nThank you very much.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Thank you, C.C. Thank you, Arthur. Thank you, everyone. This concludes our Q&A session. Before we conclude today's conference, please be advised that the replay of the conference will be accessible within 30 minutes from now. The transcript will become available 24 hours from now. Both are going to be available through TSMC's website at www.tsmc.com. Thank you, everyone, for joining us today. We hope you all continue to stay well, and we hope you will join us again next quarter in early 2026. Thank you and have a good day.",
      "fetched_at": "2026-02-04T15:39:34.952Z"
    },
    {
      "ticker": "TSM",
      "title": "Taiwan Semiconductor Manufactur (TSM) Q2 FY2025 earnings call transcript",
      "published_date": "Jul 17, 2025, 2:00 AM EDT",
      "fiscal_year": "2025",
      "quarter": "Q2",
      "url": "https://finance.yahoo.com/quote/TSM/earnings/TSM-Q2-2025-earnings_call-336686.html",
      "content": "**Jeff Su** (Director of Investor Relations)\nGood afternoon, everyone, and welcome to TSMC's Second Quarter twenty twenty five Earnings Conference and Conference Call. This is Jeff Su, TSMC's Director of Investor Relations and your host for today. Today's event is being webcast live through TSMC's website at www.psmc.com, where you can also download the earnings release materials if you are joining us through the conference call. Your dial in lines are in listen only mode. The format for today's event will be as follows.\n\n**Jeff Su** (Director of Investor Relations)\nFirst, TSMC's Senior Vice President and CFO, Mr. Wendell Huang, will summarize our operations in the second quarter twenty twenty five, followed by our guidance for the third quarter twenty twenty five. Afterwards, Mr. Huang and TSMC's Chairman and CEO, Doctor. C.\n\n**Jeff Su** (Director of Investor Relations)\nC. Wei, will jointly provide the company's key messages. Then we will open both the floor and the line for the question and answer session. As usual, I would like to remind everybody that today's discussions may contain forward looking statements that are subject to significant risks and uncertainties, which could cause actual results to differ materially from those contained in the forward looking statements. Please refer to the Safe Harbor notice that appears on our press release.\n\n**Jeff Su** (Director of Investor Relations)\nAnd now I would like to turn the microphone over to TSMC's CFO, Mr. Wendell Huang, for the summary of operations and the current quarter guidance.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nThank you, Jeff. Good afternoon, everyone. Thank you for joining us today. My presentation will start with financial highlights for the second quarter twenty twenty five. After that, I will provide the guidance for the third quarter of twenty twenty five.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nSecond quarter revenue increased 11.3% sequentially in '20 as our business was supported by strong demand for our industry leading three nanometer and five nanometer technologies, partially offset by an unfavorable foreign exchange rate. In U. S. Dollar term, revenue increased 17.8% sequentially to billion and exceeded our second quarter guidance. Gross margin decreased 0.2 percentage points sequentially to 58.6%, primarily due to an unfavorable foreign exchange rate and margin dilution from our overseas fab, partially balanced by higher capacity utilization and cost improvement efforts.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nDue to operating leverage, operating margin increased 1.1 percentage points sequentially to 49.6%. Overall, our second quarter EPS was dollars up 60.7% year over year and ROE was 34.8%. Now let's move on to revenue by technology. Three nanometer process technology contributed to 24% of wafer revenue in the second quarter, while five nanometer and seven nanometer accounted for 3614% respectively. Advanced technologies defined as seven nanometer and below accounted for 74% of wafer revenue.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nMoving on to revenue contribution by platform. HPC increased 14% quarter over quarter to account for 60% of our second quarter revenue. Smartphone increased 7% to account for 27%. IoT increased 14% to account for 5%. Automotive stayed flat and accounted for 5% and DCE increased 30% to account for 1%.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nMoving on to the balance sheet. We ended the second quarter with cash and marketable securities of NT2.6 trillion or US90 billion dollars On the liability side, current liabilities decreased by billion dollars quarter over quarter, mainly due to the decrease of NT38 billion dollars in accrued liabilities and others. The decrease in accrued liabilities and others was mainly due to the payment of income tax. Our financial ratios, accounts receivable turnover days decreased five days to twenty three days. The decrease in accounts receivable was mainly due to anti dollar appreciation as almost all of our accounts receivables are in U.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nS. Dollars. Days of inventory decreased seven days to seventy six days, primarily due to higher N3 and N5 wafer shipments. Regarding cash flow and CapEx, during the second quarter, we generated about $497,000,000,000 in cash from operations, spent TWD $297,000,000,000 in CapEx and distributed TWD 117,000,000,000 for third quarter twenty twenty four cash dividend. Taking the unfavorable exchange rate into consideration, our cash balance decreased billion dollars to NT2.36 trillion dollars at the end of the quarter.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nIn U. S. Dollar terms, our second quarter capital expenditures totaled CNY 9,600,000,000.0. I finished my financial summary. Now let's turn to our current quarter guidance.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nBased on the current business outlook, we expect our third quarter revenue to be between US31.8 billion dollars and US33 billion dollars which represents an 8% sequential increase or a 38% year over year increase at the midpoint. Based on the exchange rate assumption of NT1 to NT29 dollars gross margin is expected to be between 55.557.5%. Operating margin between 45.547.5%. In addition, we maintain our 2025 capital budget to be between US38 billion dollars and US42 billion dollars This concludes my financial presentation. Now let me turn to our key messages.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nI will start by talking about our second quarter twenty twenty five and third quarter twenty twenty five profitability. Compared to first quarter, our second quarter gross margin slightly decreased by 20 basis points sequentially to 58.6. This was primarily due to an unfavorable foreign exchange rate and margin dilution from our overseas fab, partially offset by higher than expected overall capacity utilization and cost improvement efforts. Compared to the first quarter, foreign exchange rate of $1 to dollars The actual second quarter exchange rate was $1 to NT31.05 dollars This created about two twenty basis points margin headwind to our actual second quarter gross margin. We also experienced slightly more than 100 basis points impact from the ramp up of our overseas fabs, mainly as the margin dilution from our Arizona fabs started to kick in.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nWe have just guided our third quarter gross margin to decrease by two ten basis points to 56.5% at the midpoint, primarily due to the continued unfavorable foreign exchange rate and more pronounced dilution from overseas fabs as we ramp up further in Kuevamoto and Arizona. We continue to forecast the gross margin dilution from the ramp up of our overseas fabs in the next five years, starting from 2025 to be between 2% to 3% every year in the early stages and widen to three percent to 4% in the latter stages. Despite the higher cost of overseas fabs, we will leverage our increasing size in Arizona and work on our operations to improve the cost structure. We will also continue to work closely with our customers and suppliers to manage the impact. Overall, with our fundamental competitive advantages of manufacturing technology leadership and large scale production base, we expect TSMC to be the most efficient and cost effective manufacturer in every region that we operate.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nNow let me make some comments on the impact of foreign exchange rate on TSMC's revenue and profitability. NT dollar is the reporting currency of our financial statements. Nearly all of our revenue is in U. S. Dollars, while about 75% of cost of goods sold is in NT.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nTherefore, fluctuations in the exchange rate between U. S. Dollar and NT will have a sizable impact to our reported revenue and gross profit margin. The sensitivity of the revenue to dollar NT exchange rate is nearly 100%. That is every 1% appreciation of NT against U.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nS. Dollars will reduce our reported NT revenue by 1%. The sensitivity of our gross margin to the same 1% exchange rate change is about 40 basis points. That is if NT appreciate 1% against the dollar, our gross margin will come down by about 40 basis points. Compared with our second quarter exchange rate guidance of dollars to NT32.5 dollars provided on April 17, the NT dollar has appreciated by an average of about 4.4% sequentially, which negatively impacted our second quarter revenue by about 4.4% in NT and our gross margin by about 180 basis points.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nFor third quarter of twenty twenty five, based on the current exchange rate of NT1 dollars to NT29 dollars the average NT dollar will appreciate by another 6.6% sequentially, which will negatively impact our third quarter revenue by 6.6% in NT and reduce our gross margin by about two sixty basis points. As a reminder, six factors determining TSMC's profitability, leadership technology development and ramp up, pricing, capacity utilization, cost reduction, technology mix and foreign exchange rate which is not in our control. When the foreign exchange rate is unfavorable as it is currently, we will focus on the fundamentals of our business and being on the other five factors to manage through it and we have successfully done in the past. Thus, even with the unfavorable foreign exchange rate, we believe our long term gross margin of 53% and higher remains well achievable. Now let me turn the microphone over to Cici.\n\n**C.C. Wei** (Chairman &amp; CEO)\nThank you, Wendell. Good afternoon, everyone. First, let me start with our near term demand outlook. We concluded our second quarter with revenue of US30.1 billion dollars above our guidance in US dollar term mainly due to continue the robust AI and HPC related demand. Moving into the third quarter twenty twenty five, we expect our business in the third quarter to be driven by strong demand for our leading edge process technologies.\n\n**C.C. Wei** (Chairman &amp; CEO)\nLooking into second half of twenty twenty five, we have not seen any change in our customers' behavior so far. However, we understand there are uncertainties and risk from the potential impact of tariff policies, especially on consumer related and the price sensitive end market segment. While we observe rebate program in China are stimulating some near term demand upside, We believe this is a short term in nature and continue to expect a mild recovery in overall non AIM market segment in 2025. Having said that, we believe that demand for semiconductor is very fundamental and will continue to be robust. Recent developments are also positive to AI's long term demand outlook.\n\n**C.C. Wei** (Chairman &amp; CEO)\nThe explosive growth in token volume demonstrate increasing AI model usage and adoption, which means more and more computation is needed, leading to more leading and silicon demand. We also see AI demand continuing to be strong, including the rising demand from sovereign AI. Therefore, we now expect our full year 2025 revenue to increase by around 30% in US dollar term, supported by strong demand for our industry leading three nanometer and five nanometer technologies underpinned by working our HPC platform. Amidst the uncertainties, we want to remain mindful of the potential tariff related impact and be prudent in our business planning going into second half twenty twenty five and 2026, while continuing to invest for the future makeup trend. We are also focused on the fundamentals of our business, technology leadership, manufacturing excellence and customer trust to further strengthen our competitive position.\n\n**C.C. Wei** (Chairman &amp; CEO)\nNext, let me talk about TSMC's global manufacturing footprint update. All our overseas decision are based on customers' need, the value some traffic flexibility and the necessary level of government support. This is also to maximize the value of our shareholders. With a strong collaboration and support from our leading U. S.\n\n**C.C. Wei** (Chairman &amp; CEO)\nCustomers and The U. S. Federal State And City Government, we announced our intention to invest a total of U. S. US165 billion dollars in advanced semiconductor manufacturing in The United States.\n\n**C.C. Wei** (Chairman &amp; CEO)\nThis expansion includes plans for six advanced wafer manufacturing fab in Arizona, two advanced packaging fabs and a major R and D center to support the stronger multiyear demand from our customers. Our first fab in Arizona has already successfully entered into high volume production in 4Q twenty twenty four, utilizing the N4 process technology with a yield comparable to our fab in Taiwan. The construction of our second fab, which will utilize three nanometer process technology, is already complete. We are seeing strong interest from our leading U. S.\n\n**C.C. Wei** (Chairman &amp; CEO)\nCustomers and are working on speeding up the volume production schedule by several quarters to support their needs. Construction of our server, which will utilize two nanometer and the eight sixteen process technologies has already begun and we want to get to speeding up the production schedule as well based on the strong AI related demand from our customers. Our fourth wave will utilize Gen2 and A16 process technology and our fifth and sixth wave will use even more advanced technologies. The construction and ramp schedule for those fabs will be based on our customers' need. Our expansion plan will enable TSMC to scale up to a detailed fab faster in Arizona to support the needs of our leading edge customers in smartphone, AI and HPC applications.\n\n**C.C. Wei** (Chairman &amp; CEO)\nWe also plan to build two new advanced packaging facilities and establish an R and D center to complete the AI supply chain. After completion, around 30% of our two nanometer and more advanced capacity will be located in Arizona, creating an independent leading edge semiconductor manufacturing cluster in The US. Thus, TSMC continued to play a critical and integral role in enabling our customers' success. We also maintained a key partner and enabler of The U. S. Semiconductor industry. Next, in Japan, thanks to the strong support from the Japan Central Prefecture and Noble Government, our first specialty technology fab in Komodo has already started rolling production in late twenty twenty four with very good yield. The construction of our second specialty fab is scheduled to start later this year subject to the readiness of the local infrastructure. The ramp schedule will be based on our customers' need and market conditions. In Europe, we have received strong commitment from the European Commission and the German Federal, State and City Government and are progressing smoothly with our plans to build a specialty technology fab in Dresden, Germany. The ramp schedule was also based upon customers' need and market conditions.\n\n**C.C. Wei** (Chairman &amp; CEO)\nIn Taiwan, we support from the Taiwan government. We plan to build 11 wafer manufacturing fab and four advanced packaging facility over the next several years. We are preparing for multiple phases of two nanometer fab in both Q2 and Gaucho sized cars to support the strong structural demand from our customers. By expanding our global footprint while continuing to invest in Taiwan, TSMC can continue to be the trusted technology and capacity provider of the global IC industry for years to come while delivering profitable growth for our shareholders. Now let me talk about our N2 and N16 status.\n\n**C.C. Wei** (Chairman &amp; CEO)\nOur N2 and N16 technologies lead the industry in addressing the infeasible demand for energy efficient computing, and almost all the innovators are working with TSMC. We expect the number of new take outs for two nanometer technology in the first two years to be higher than both three nanometer and five nanometer in the first two years, fueled by both smartphone and HPC applications. N2W deliver four node performance and power benefit with 10 to 15 speed improvement at the same power or 20 to 30% power improvement at the same speed and more than 15% chip density increase as compared with N3E. N2 is well on track for volume production in the 2025 as scheduled with a ramp profile similar to N3. With our strategy of continuous enhancement, we also introduced N2P as an extension of our N2 family.\n\n**C.C. Wei** (Chairman &amp; CEO)\nN2P features a further performance and power benefits on top of the N2, then volume production is scheduled for second half twenty twenty six. We also introduced A16 featuring our best in class superpower rail or SPR. Compared with the N2P, A16 provides a four zero eight to 10% speed improvement at the same power or 15 to 20 power improvement at the same speed and additional seven to 10% chip density band. A16 is best suitable suited for specific HPC products with complex signal route and dense power delivery network. Volume production is on track for second half twenty twenty six. We believe N2, N2P eight sixteen and its derivatives will fuel our N2 family to be another large and long lasting node for TSMC. Finally, let me talk about our A14 status.\n\n**C.C. Wei** (Chairman &amp; CEO)\nFeaturing our second generation DarioSphere transistor structure, A14W delivers another four node stride from M2 with performance and power benefits to address the increasing structural demand for high performance and energy efficient computing. Compared with the M2, A16 will provide 10 to 15 speed improvement at the same power or 20 to 30% power improvement at the same speed and about 20% chip density gain. Our A14 technology development is on track and progressing well with device performance and year improvement on or ahead of schedule. Volume production is scheduled for 2028. We will continue our strategy of continuously enhancement with A14, including a superpower rail offering planned for 2029.\n\n**C.C. Wei** (Chairman &amp; CEO)\nWe believe A14 and its derivative will further extend our technology leadership position and enable TSMC to capture the growth opportunities way into the future. This concludes our key message and thank you for your attention.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, Cici. This does conclude our prepared statements. So before we begin the question and answer session, I would like to remind everybody to please limit your questions to two at a time so that we can allow all the participants an opportunity to ask their questions.\n\n**Jeff Su** (Director of Investor Relations)\nQuestions will be taken both from the floor and from the call. Should you wish to raise your question in Chinese, I will translate it to English before our management answers your question. For those of you on the call, if you'd like to ask a question, please press the star then one on your telephone keypad now. If at any time you'd like to remove yourself from the question queue, please press star then 2. So now let's begin question and answer session.\n\n**Jeff Su** (Director of Investor Relations)\nWe'll take the first few questions from the floor, then we'll flip and alternate to those on the line. Maybe we'll go left, center, and then right, sort of a sequence. And we'll start here with go call Harry Haran from JPMorgan.\n\n**Gokul Hariharan** (Managing Director)\nThanks, Jeff, and good afternoon, Siti and Vindal. First question on demand. I think T. V, you mentioned data center AI demand certainly looks better than maybe three months back. Last quarter, you also mentioned cohort capacity will probably come into balance by 2026.\n\n**Gokul Hariharan** (Managing Director)\nIs that still our view? Or you think that the capacity now starts to look tighter? Second, I think you talked about on device AI as a potential future driver. Are you seeing more development on the on device AI part? Is it better compared to the three, six months back?\n\n**Gokul Hariharan** (Managing Director)\nAnd lastly, near term, your 4Q looks like you're expecting revenue to decline. Is that based on what your customers are telling, especially on the consumer side? Or is it just TSMC being cautious and conservative in terms of the guidance?\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Gokul, thank you. Again, for the benefit of those, of course, here in person on the line, please allow me to summarize your questions. So maybe we'll take them one by one. His first question is on the demand, particularly data center and AI related demand.\n\n**Jeff Su** (Director of Investor Relations)\nAs Fiji said in his remarks, it is certainly still even stronger. So his question is about the advanced packaging and cobots demand into 2026. How do we see the supply demand gap narrowing or becoming more balanced for cobots specifically?\n\n**C.C. Wei** (Chairman &amp; CEO)\nKoku, the demand from the AI getting stronger and stronger if you pay attention to what for treating companies as CEO say. And so the makeup trend for the AI is continued to be strong and so is the cohort.\n\n**C.C. Wei** (Chairman &amp; CEO)\nAnd so now we are again, we are in a a mode trying to narrow the gap. I don't want to use the balance. The last time you guys misunderstood what I said, you saw the bad wording. So I wanna say, we try to narrow the gap.\n\n**Jeff Su** (Director of Investor Relations)\nAlright.\n\n**C.C. Wei** (Chairman &amp; CEO)\nSo momentum is still there and very healthy.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. And then the second question or second part is on on device or edge AI. Gokul wants to know how is the development of customers to work on on device AI compared to maybe three to six months ago. What is the interest or activity level and how do we see this?\n\n**C.C. Wei** (Chairman &amp; CEO)\nThe last time I say it, I say that it takes one to two years for my customer to complete the new design and the product. The momentum is still going. They are still continuing to, as time goes by, as I said, the increase on the edge device, the number of the units is actually mild. But then the die size increased. We continue to see that.\n\n**C.C. Wei** (Chairman &amp; CEO)\nAnd the die size increased by about 5% to 10% and that kind of trend continued. You have to wait another probably six months or to one year to see a explosion.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. And then go with the second question on the final part on the near term. I think, Gokul, your question is with our third quarter guidance implies fourth quarter, is there any particular reason or any comment that we want to make about the implied fourth quarter business momentum?\n\n**C.C. Wei** (Chairman &amp; CEO)\nI think you did not mention Gokul's company and said or you are become conservative. That company is more real. We are are a company that but we say that you are achieved and achieved the high target. So your calculation, I think, also is nothing. But a lot of you is calculating our reported numbers so that you can easily see that our fourth quarter is decreasing.\n\n**C.C. Wei** (Chairman &amp; CEO)\nWe take into the consideration of the possible impact of tariff and a lot of other uncertainties. So we become more conservative. That's our current attitude. But I guarantee you with our technology leadership position and excellent manufacturing, if there are any opportunities we want to catch and be expected that we achieve our high end target.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, C.\n\n**Jeff Su** (Director of Investor Relations)\nC. Thank you, Gokul. Sorry, let's go one by one. The second question that may be Charlie Chan from Morgan Stanley.\n\n**Charlie Chen** (VP - Investment Banking)\nThanks for taking my question. Good afternoon, Cici and Jeff. So first of all, congrats for very strong results and especially on the gross margin side, a very good execution indeed. So my first question is really also on the gross margin because the accumulated effect in pay is almost like 4.4 percentage points, right? So too big to ignore.\n\n**Charlie Chen** (VP - Investment Banking)\nSo when TSMC consider your 2,026, the wafer pricing, so called the impacting your value, would you consider this effective impact? And it's company confident to keep your margin similar to this year's label. Feel like a 53% is low bar. So just want to admit a little bit high and see about that effect that can be considered to reflect to your value. Thank you.\n\n**C.C. Wei** (Chairman &amp; CEO)\nOkay. So Charlie's first question is on margin and I guess pricing. He knows obviously as Wendell said the big move in the exchange rate and therefore, a big impact to our profitability and gross margin. So his question is, looking ahead to 2026, can we reflect or earn our value from the including the FX impact into the pricing? And therefore, what is our confidence level on the gross margin for next year?\n\n**C.C. Wei** (Chairman &amp; CEO)\nCan it keep a similar level as this year? Well, let me assure you that, yes, the impact from the exchange rate is huge. But you try to imply that whether we are still our value. Let me answer that. We are working on it and we have confidence that the 53% gross margin and higher, I still want you guys to take more attention to and higher. Thank you.\n\n**Charlie Chen** (VP - Investment Banking)\nOkay. Thanks. Hopefully, it will work out well. My second question is also a very hot topic recently about the H20 chip shipping to China. I remember a few months ago, there was another question on this matter, right?\n\n**Charlie Chen** (VP - Investment Banking)\nMeaning that back then, I believe that chip was a suspend, but you're still very confident about your mid-forty percent CAGR for cloud saving growth in the coming five years. Right now China becomes your addressable market again. Do you think that mid-forty percent CAGR target can be revised up?\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Thank you, Charlie. So Charlie, second question is around the AI accelerator demand. He knows, of course, our customers' product, H20 recently is now seems to be able to ship to China versus three months ago, it was not. So his question really is our long term AI accelerator growth CAGR to grow close to mid-40s.\n\n**Jeff Su** (Director of Investor Relations)\nCan it be higher? Do we think it will be higher? Is there upside to this?\n\n**C.C. Wei** (Chairman &amp; CEO)\nCharlie, the S20 now is again according to local trading companies and CEO. We did not receive the signal yet, so it's too early to give you an estimate, but certainly this is a good news, right?\n\n**C.C. Wei** (Chairman &amp; CEO)\nI mean that's a China is a big market and my customer can still continue to supply the chip to the big market and it's a very positive news for them and in return is a very positive news for TSMC. We know we are ready to increase our forecast, not yet, another quarter probably will be more appropriate to answer your question.\n\n**Charlie Chen** (VP - Investment Banking)\nThanks for your comments, very helpful.\n\n**C.C. Wei** (Chairman &amp; CEO)\nThanks.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, Charlie. Okay, then we'll move on to the right side of the room for us, Bruce Lu from Goldman Sachs.\n\n**Bruce Lu** (VP Asia Technology)\nThank you for taking my question.\n\n**Bruce Lu** (VP Asia Technology)\nI think Charlie already asked the profitability question already. So I just move on to your end to mid rent. So what's the revenue contribution can make for the N2 RED for next year? I'm not a bit surprised to hear that N2 RED is similar rated with N3 with N2, you have both HPC and smartphone customer ramping on the same stage or in the first year one or year two, right? Can we expect like 15% revenue contribution coming from N2 for next year or similar level compared to N2 which is around 10%, 11% for the year two.\n\n**C.C. Wei** (Chairman &amp; CEO)\nBruce's first question is around the N2 ramp. His question is about the ramp and the ramp profile because we said the N2 ramp profile is the N3. So what does that mean? And then also, of course, what revenue contribution do we expect or can we share for N2 in 2026? Bruce, do you have a good argument?\n\n**C.C. Wei** (Chairman &amp; CEO)\nUsually, we ramp up a new node using the smartphone. If you that, everybody knew it. Now it's not only a smartphone but also HPC product. However, the ranking profile I just reported say similar to three nanometer. It's limited by our capability to build a new fab to ramp it up and also a little bit it's straightforward.\n\n**C.C. Wei** (Chairman &amp; CEO)\nIt's constrained by the capacity. So we say the ramp profile is similar to m three, but the revenue contribution certainly will be bigger because you don't expect our m two is the same price as the m three. Right?\n\n**Bruce Lu** (VP Asia Technology)\nOf course.\n\n**C.C. Wei** (Chairman &amp; CEO)\nGood. Thank you.\n\n**Bruce Lu** (VP Asia Technology)\nIf that is the case, we should assume that in '27, the N2 ramp up will be faster, right? Because it twelve, eighteen months for you to build new fab, you should be able to achieve the even higher growth in '27.\n\n**C.C. Wei** (Chairman &amp; CEO)\nSo Bruce is asking if the revenue contribution is much higher than '26 then should it be even greater than '27? Who do I answer that question in '26? Thank you.\n\n**Bruce Lu** (VP Asia Technology)\nOkay. The next question is for M5 and M3, right? So I want to understand the supply demand for M5 N3 in the coming two years. Most of the AI will migrate to N3 next year. But it seems to me that the N5 conversion is mostly done, N5, N3 conversion is mostly done.\n\n**Bruce Lu** (VP Asia Technology)\nAnd we don't really see like going to your capacity expansion N3. So it becomes like super like tightness for the N3 for the coming years. Does that mean that N5 will be low in terms or we try to build more N3 in the future or what kind of or we should see we can fill out more value for N3, N5 next year?\n\n**C.C. Wei** (Chairman &amp; CEO)\nOkay. Bruce's second question is around N5 and N3. He wants to know what is the outlook for the supply demand at these two advanced nodes in the coming two years. His observation, AI products will migrate to N3 and the N5, N3 conversion is mostly done. So his question is, will three nanometer supply be very tight the next three years?\n\n**C.C. Wei** (Chairman &amp; CEO)\nI think the last part, therefore, can we earn our value or price for that tightness? And then on the flip side, what about five nanometer? Will it become lower utilization? I like your comment, we had to share our value because of very tight in N3 capacity. It will be continued for couple of years, very tight in fact, N5 also very tight.\n\n**C.C. Wei** (Chairman &amp; CEO)\nThe demand is high because of a lot of AI product still in the four nanometer technology node. They are transitioning to three nanometer probably in the next two years. In the meanwhile, n five are still very tight in capacity. N three even tighter. And so we are working hard.\n\n**C.C. Wei** (Chairman &amp; CEO)\nOne of the TSMC's advantage is that we have peak of that cluster. And so we have between n seven, n five, n three, even the future n two, we have almost for each node, have about 85 to 90% common tools. So it's it's not free, but it's much easier for TSMC to adjust or convert the capacity between those node. And today, let me share with you, we are using the n seven capacity to support n five because the n five is too tight. And then we are converting n five to n three as you just pointed out.\n\n**C.C. Wei** (Chairman &amp; CEO)\nWe'll continue to do that. And so today, we are our leading edge technology is a capacity. We define n seven and below are all very tight. Same time, we are working very hard to, again, my my sentence and narrow the gap between the demand and the capacity.\n\n**Jeff Su** (Director of Investor Relations)\nOkay.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, Bruce. Let's go to the participants online. We'll maybe we'll take two questions from the online and then we'll come back to the floor. Thank you. Operator?\n\n**Operator**\nYes. Now asking question, Brett Simpson, Arete.\n\n**Brett Simpson** (Senior Analyst)\nThanks very much. I had a question for Wendell on gross margins. And it's always helpful you've laid out a framework for some of the puts and takes to TSMC's gross margins. But my question is really some of these headwinds like FX and the dilution from overseas fabs are more structural cost increases. And to what extent can TSMC adjust wafer pricing higher to neutralize these cost increases in your business?\n\n**Brett Simpson** (Senior Analyst)\nAnd I guess, secondly, on this point, how much economic benefits are you seeing from applying AI across the fabs? I think NVIDIA has mentioned that they're working with TSMC closely strategically in areas like computational lithography to try to drive further fab efficiencies. So can you maybe just give us some examples where you're seeing real gains in your cost structure? And are we at a point where you're starting to see several points of gross margin benefit from AI efficiencies? Thanks.\n\n**Jeff Su** (Director of Investor Relations)\nAlright, Brett. So Brett, first question is little bit involved, but looking at our gross margin and profitability. He knows that the unfavorable exchange rate and the dilution from the overseas due to the higher cost, these are structural headwinds. So his question is, can we how can we or can we earn our value or adjust our wafer price to help offset some of these? And also how much we've talked about before about using AI ourselves in our operations, how much economic benefit are we deriving from things such as the legal with our customers such as and other other examples of using AI where it's helping our cost structure and can we quantify that quantify the benefit, sorry. That's your question. Right? Right?\n\n**Brett Simpson** (Senior Analyst)\nThat's right. Thanks, Jeff.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nOkay, Brad. The first question, gross margin. That's the reason why we've been talking about the six factors affecting our profitability. I don't think I need to repeat those six factors but whenever, for example, using foreign exchange rate example, a few years ago there were also periods of time that foreign exchange rates were against us. So we are able to lean on the other factors to help us mitigate the negative impact from certain factors and therefore still achieve our gross margin targets.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nAnd you specifically asked about ASP, raising the price, but the price is just one of the factors. And I believe C. C. Just elaborate a lot on earning our value. And at the same time, there are other factors that we can leverage on.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nSo all in all, that's why we're saying 53% and higher and higher gross margin is still achievable. Your second question on AI benefits. I think we also talked about that before. We use that in operation, in manufacturing. We also use that in R and Ds.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nAnd just think about if we are able to produce 1% of productivity gains in a company of our size that equals to US1 billion dollars So that's the number we can share with you without going into too much other details.\n\n**Jeff Su** (Director of Investor Relations)\nDoes that answer your question, Frank?\n\n**Brett Simpson** (Senior Analyst)\nYes.\n\n**Brett Simpson** (Senior Analyst)\nYes, that's great. Thanks very much, Wendell. I guess my follow-up question, I guess just digesting your prepared remarks, Sisi, you mentioned 11 fabs in Taiwan. I think that counts eight fabs for overseas that you're planning that aren't commercially online yet. You maybe just talk a bit about I mean, I've never seen that type of constructing that type of roadmap before from TSMC.\n\n**Brett Simpson** (Senior Analyst)\nIt's quite big. Can you maybe share with us if you're planning a bigger expansion of new capacity next year? And I say this because, you know, in the last few months, we've seen so many gigawatts data center announcements. I think this week, we had one from Meta that was significant. So are you the demand looks very strong and I'm just wondering whether you have enough capacity to satisfy demand next year and whether you plan to convert further five nanometer to three nanometer And how you see the M2 capacity planned for 2026? Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Brett's second question, he notes that we are building many fabs both in Taiwan and also overseas. He's never seen this size or scale of capacity expansion from TSMC before. So it's very and he also knows that the demand from data centers continues to be very strong. So his question is basically very simply, do we have enough capacity to support the strong demand specific to next year and also very specifically to two nanometer and will we further also convert more five nanometer to three? That's I think all of his question.\n\n**C.C. Wei** (Chairman &amp; CEO)\nThank you. Greg, your observation is right. Recently we saw a lot of announcement of the AI data center around the world and the demand on three nanometer, actually on five nanometer, three nanometer and the future of two nanometer are very high. We did not see this kind of a strong demand for a long time, but what be enough to support them, I still want to use my word, say that we try very hard to narrow the gap between the demand and the supply. We're working very hard.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Thank you, Brett. Let's go to the next participant on the call.\n\n**Operator**\nNow it's Arthur Lai from Macquarie. Your line is open now.\n\n**Arthur Lai** (Asia Equity Research - Technology)\nHi, thank you, C. C, Wendell and Jeff. Arthur Lai from Macquarie. Again, congrats on strong results. I would like to follow-up on the M2.\n\n**Arthur Lai** (Asia Equity Research - Technology)\nI think as Sisi highlight, this is a very exciting note we are all heard. And then I want to follow on the return on investment. Can you compare to the N2 and N3, the return on investment and then give us some more color? Second one is the reason we ask this question is because the CapEx per day we actually until it's higher, right? And then we also heard from industry like the companies yield on the end to is also pretty good.\n\n**Arthur Lai** (Asia Equity Research - Technology)\nSo can you give us some put and take on how we think of the N2's future development? Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. So Arthur's question, both questions I think are around N2. N2, as you said, is a very exciting note. He wonder if we would like to know, understand what is the return or the return on investment that we see from N2 compared to N3? And also, can we talk a little bit into the CapEx is higher, but the yield is still very good.\n\n**Jeff Su** (Director of Investor Relations)\nWhat is the developments that we're seeing for two nanometer? I think that's is that your question, Arthur?\n\n**Arthur Lai** (Asia Equity Research - Technology)\nYes, yes. Yeah, exactly.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nHey, Arthur. N2 return, as we said before, N2 profitability is better than N3. Now there were questions asking how many quarters to catch up with the corporate before and N3 was it took N3 longer. But for N2, we think it will be back to the old days. Having said that, I need to remind everyone that in the old days, we're talking about corporate average of, say, 50% gross margin.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nNowadays, we're talking about 53% gross margin. So it becomes less meaningful to talk about how much time it takes to catch up with corporate nowadays. But having said that, structurally M2 does have a better profitability than M3. Okay. And N2 development is right on track.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nWe're ramping it in the second half of this year. We expect the revenue to come up in the first half of next year.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Thank you, Wendell. Thank you, Arthur. Let's come back to the floor. We'll go left, middle, right. So maybe Sunny Lin from UBS.\n\n**Sunny Lin** (Analyst)\nGood afternoon. Thank you for taking my question. Very good results and congrats. So my first question is a follow-up on CapEx. So obviously, full year sales guidance is stronger.\n\n**Sunny Lin** (Analyst)\nYou are turning more constructive on high performance compute and AI. Yet you are keeping your CapEx guidance. So is it fair to assume that you are considering some conservatism for CapEx for this year, given the ongoing macro uncertainty? Or is it because in the short term, your capacity expansion is somewhat constrained by the ability that you can ramp up more capacity? And therefore, maybe in 2026 and 2027, we should expect some acceleration of your CapEx spending.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. So Sunny's first question is around CapEx. She notes, of course, that we raised our 2025 revenue guidance this year and we certainly still see a very robust demand from AI, yet we kept CapEx guidance in the same range of 30 to 42. So she wants to understand why. Is it because of macro uncertainty?\n\n**Jeff Su** (Director of Investor Relations)\nIs it because of constraints in the construction? And her other part of this question is what is the CapEx outlook for 2026 and 2027, I guess?\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nSami, the CapEx, as we said before, the CapEx invested in the given year is for the business opportunities in the following years. And as long as the business opportunities, we will not hesitate to invest. Having said that, nowadays, as Cici also said, with all these macro uncertainties, we are mindful of these uncertainties. So we also take that into considerations in our capacity and CapEx plan. Going forward, it's too early to talk about future years CapEx, but I can share with you a company of our size.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nIt's unlikely that you see CapEx dollar amount suddenly drop a lot in any given years. That's all I can share with you.\n\n**Sunny Lin** (Analyst)\nGot it. Sounds like CapEx could be going higher in the coming years. My second question is on Cloud AI. And so you are things like earlier achieved you most of the sales upside for 2025 to Cloud AI. And therefore, I wonder if you have an update on the Cloud AI growth in 2025.\n\n**Sunny Lin** (Analyst)\nWould you guide it before to be about 100% for 2025? And the implication to your co op capacity expansion, would you be are you able to maybe expect a bit more co op capacity for Fisher to support a stronger call AI growth for Fisher? And any other early insights that you could share with us for your co op capacity expansion for 2026? Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. So Sunny's second question is asking about our AI, well, she said cloud AI, basically our AI accelerated growth in 2025 and related the co ops capacity. So her question is, what is the AI accelerator revenue growth we expect in 2025? And then what is our co ops capacity expansion plan for 2025? And she asked a similar question to Charlie or someone earlier. What is the plan for COWAS capacity in 2026?\n\n**C.C. Wei** (Chairman &amp; CEO)\nWell, my answer stays the same. We are trying very hard to narrow the gap. For now and for 2026. The demand, the momentum of our ATRC and we shrunk and so we we are building many new facilities in the back end to increase the AI increase the cobwebs capacity to support our customer.\n\n**C.C. Wei** (Chairman &amp; CEO)\nAI demand is very strong and so this cobwebs capacity, the demand is very strong.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Thank you, Sonny. Then we'll move on to Laura Chen from Citi.\n\n**Laura Chen** (Research Analyst)\nYou for taking my question and congrats for the good result and outlook. My question is also about the AI chip. You mentioned that AI chip is getting bigger and bigger and also the power consumption is getting much more. So I'm just wondering that among like your advanced technology, including like the advanced node, we also noted that during the symposium, TSMC also announced some of the new technology in advanced packaging as well. So I'm just wondering how do you kind of prioritize your leading edge advanced packaging?\n\n**Laura Chen** (Research Analyst)\nDuring the symposium, we see that system now wait for that kind of a new design. Do you have any like plan or like timeline for the new technology? And should we think about that, that should be kind of aligned with our most of the business know process like N2 or X16 going forward?\n\n**Jeff Su** (Director of Investor Relations)\nOkay. So Laura's first question is on advanced packaging. She notes AI, the die sizes are increasing, the need for power consumption or energy efficiency is rising. So she wants to understand how our strategy for advanced packaging along with the advanced node development. Are there any specific packaging solutions that we're prioritizing?\n\n**Jeff Su** (Director of Investor Relations)\nWhat about the timeline and roadmap? How does that match up with our advanced node roadmap?\n\n**C.C. Wei** (Chairman &amp; CEO)\nI think TSMC's philosophy to develop a technology is working with customer. The customer has such demand. We develop the technology, we increase the capacity for JET.\n\n**C.C. Wei** (Chairman &amp; CEO)\nSo priorities, every customer is important to TSMC. So and in the advanced packaging side, a lot of customers use the different approaches. So we are developing a variety of different back end packaging, advanced technology for all the customers. Further is related to the advanced DTS technology. The answer is yes.\n\n**C.C. Wei** (Chairman &amp; CEO)\nOkay. So we have a system integration. We have a code words error. That's a terminology. We have a lot of different name that I cannot even remember, but it's a lot of varieties and we work with our customer to meet their demand. Now I can answer you.\n\n**Laura Chen** (Research Analyst)\nIs that easy to kind of leverage or transfer different kind of technologies from your perspective?\n\n**Jeff Su** (Director of Investor Relations)\nSo Laura is asking how fungible are these different packaging technologies? How interchangeable or easy to transfer the technology between different packaging solutions?\n\n**C.C. Wei** (Chairman &amp; CEO)\nOf course. There are some similarities in between. Otherwise, we are going take too much of the effort and did not get the return.\n\n**C.C. Wei** (Chairman &amp; CEO)\nYes, there's a lot of similarities but a lot of varieties also. Okay.\n\n**Laura Chen** (Research Analyst)\nThank you. And my second question is, we know that obviously the AI demand and advanced nodes and advanced leading edge packaging is very tight. And but I'm just wondering that industry wise, still see probably overcapacity in mature nodes. TSMC also has like more mature 16 nanometer or more above that kind of process. So can we kind of consolidate our mature nodes to kind of make better efficiency and probabilities to enhance the like those capacity to fulfill the demands across the board?\n\n**Jeff Su** (Director of Investor Relations)\nOkay. So Nora's second question is on mature nodes. She notes there is overcapacity on the industry wide in older nodes. So she wants to understand for TSMC specifically, if we take, for example, 16 nanometer and older nodes, what is our strategy, can we consolidate amongst the different nodes, how do we protect our profitability?\n\n**C.C. Wei** (Chairman &amp; CEO)\nGood question.\n\n**C.C. Wei** (Chairman &amp; CEO)\nIf you read the newspaper, there are so much of mature node capacity. At TSMC's strategy actually is on the mature node technologies, we give it up kind of specialties. For example, that RF technology or CMOS image sensor or the high voltage. So we develop the technology at the request of our customer. So we don't worry too much about it, what you say, the overcapacity.\n\n**C.C. Wei** (Chairman &amp; CEO)\nIf it is really overcapacity, we will not build a fab in Japan, We will not build a fab in Germany. So this is not overcapacity. It's all related to customers that need customers that demand and those are all specialty technologies. Did I answer your question?\n\n**Jeff Su** (Director of Investor Relations)\nThank Okay.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, Laura. I think in the interest time, we'll go to Brad Lin from Bank of America. Then we'll take one more from the line and then if there's one more from the floor.\n\n**Brad Lin** (Director)\nThank you for taking my question.\n\n**Brad Lin** (Director)\nI have two questions. My first one is on the human robot. So we have learned that human robot started to contribute to TSMC and it is gaining momentum as the next frontier of the AI hardware. How does TSMC evaluate the market size of humanoid robot in the semiconductor and in terms of potential market cap, compute and also sensor requirements? Thank you.\n\n**Brad Lin** (Director)\nAnd do you think that might be another driver potentially for mature nodes too? Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Thank you, Brad. So Brad, first question is around humanoid robot. We're starting to see some contribution. He wants to understand how do we evaluate the market size, what is the addressable opportunities for TSMC in the long term at the leading edge and also on the mature nodes with certain type of specialty.\n\n**C.C. Wei** (Chairman &amp; CEO)\nBrett, it's too early. Actually, it's too early to say that he will know the robot will play a role in this year. Next year, probably still too early because of it's so complicated. You know that human know it's a robot. Well, most of the time what we use, I think the first one will be used in in medical industry to take care of the people getting older like me.\n\n**C.C. Wei** (Chairman &amp; CEO)\nProbably some days I needed some human knowledge robot to help me, But, you know, it's very complicated because it's not we are talking about a brain only. Actually, you're talking about a lot of sensor sensor technology. That's the image sensor, the pressure sensor, the temperature sensor, and all the feedback to the CPU and so it's very complicated and since it's dealing with human being directly, I should be very very careful. But then once you start to fly, you are a big big class. I talked to one of my customer and he said that the EV car is nothing.\n\n**C.C. Wei** (Chairman &amp; CEO)\nIt's it's a robot what the 10 times of that. I'm waiting for that. Okay. Did I answer your question?\n\n**Brad Lin** (Director)\nYes. Yes. I believe the client definitely owns EV cars and robots too, so he knows it well. So my second question will be on the potential point ahead of the so called recycling of value into 2026. So we know well, normally, we continue to recycle value into our pricing.\n\n**Brad Lin** (Director)\nSo even the potentially higher pricing in 2026, are you observing any signs of demand pulling from their customers in the second half of the year and potentially, well, given the tight pipeline of M3 and M5, which we see a continuous trend into 4Q, even though we already guided potential decline, but yes, any point potentially.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Brad, second question very specifically, he's asking as we C. C. Talked about that we will continue to earn our value. Do we see any customers trying to pull in their demand ahead of 2026 into the second half of this year?\n\n**Jeff Su** (Director of Investor Relations)\nAnd do we have any additional comments to offer on the fourth quarter besides what we have already shared?\n\n**C.C. Wei** (Chairman &amp; CEO)\nWell, the answer is no. We did not see any different customers of the heaviest so far. Okay. But let me share with you, I add more color.\n\n**C.C. Wei** (Chairman &amp; CEO)\nIf you are talking about the three millimeters demand, for example, the cycle time is here, what takes about the four months. So there's no way you can pull in anything. I mean, that's a yeah. And we have a as I said, our capacities are very, very tight. So we already have all the schedules and so we'll review room for for you.\n\n**C.C. Wei** (Chairman &amp; CEO)\nLet me say that. Even they want it. No. The answer is no. So 2026 is 2026. We will share with you.\n\n**Brad Lin** (Director)\nThank you very much.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, Siti. Thank you, Brad. All right. Operator, let's go to the we'll take questions from the last participant on the line.\n\n**Operator**\nYes.\n\n**Operator**\nThe last one to ask question, Matiji Husseini from SIG.\n\n**Mehdi Hosseini** (Senior Equity Research Analyst)\nYes, sir. Thanks for taking my question. The first one has to do with capital intensity. When I look at the past five years when you were ramping N3 and N5, the capital intensity was at or above 40%. And you also highlighted how N3 tape out is tracking better than n three and n five combined.\n\n**Mehdi Hosseini** (Senior Equity Research Analyst)\nDoes that imply that the capital intensity would need to go back up to 40? And in other words, an initial investment for MT to accommodate these flip outs? Is that the level of thinking about how investments are going to play out and have fun?\n\n**Jeff Su** (Director of Investor Relations)\nOkay, Mehdi. Sorry. We couldn't hear you exactly clearly. Let me try to summarize your question, all right, which is some of these questions around capital intensity. He knows that in the past when we invest in new nodes or structural, the megatrends like we have with N3 and N5, our capital intensity has jumped up to greater than 40%.\n\n**Jeff Su** (Director of Investor Relations)\nSo if I heard you correctly, Madi, your question is this time we talked about the strong demand for two nanometer multiyear upcoming. What is our expectation on capital intensity? Is that correct, Nadeep?\n\n**Mehdi Hosseini** (Senior Equity Research Analyst)\nYes, that's correct.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nNadeep, let me answer this question. As we just said, the capital expenditure invested in any year is the future growth opportunities. So if we do our job right, the growth in the next few years is likely to exceed the growth in CapEx dollars, even though as I said, if CapEx dollars is unlikely to drop significantly in any given year. So you'll see a higher growth in revenue than the growth in capital expenditure, then you don't have it such a high capital intensity. We actually demonstrated that in the past few years.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nAnd also let me just share with you that because of this, we're not operating setting a capital intensity as a goal. It's the dollar amount invested is really on the structure demand growth in the following years. So talking about capital intensity is also less meaningful than before.\n\n**Mehdi Hosseini** (Senior Equity Research Analyst)\nOkay. Thank you. And a follow-up for me. You highlighted NTP I'm I'm sorry. You highlighted a 16, which will be very applicable for hyperthermal compute.\n\n**Mehdi Hosseini** (Senior Equity Research Analyst)\nIs that is that the node where AI and HPC would actually be at power with a smartphone as an end market that would drive demand for the most mini range node?\n\n**Jeff Su** (Director of Investor Relations)\nSorry, Madhee. Again, I apologize. We apologize. I could not hear you clearly, but I think his question is about on a 16, where we said it's more for specific HPC related offerings. So his question is, I think, maybe your question is, is that where the AI demand also comes in for the two nanometer family?\n\n**Mehdi Hosseini** (Senior Equity Research Analyst)\nYes. I don't know.\n\n**Mehdi Hosseini** (Senior Equity Research Analyst)\nAnswer because so far, AI has been n plus one, n plus two. Is that node a 16 the first node where AI would move to the leading edge?\n\n**Jeff Su** (Director of Investor Relations)\nOkay. His question okay. Maybe let me rephrase it. I think I understand better. His question is really about AI adoption of the leading edge node, the end node.\n\n**Jeff Su** (Director of Investor Relations)\nYou know, we see smartphone, we see HPC. This question very specifically, how do we see the AI adoption of the most leading node for TSMC? He observed in the past, it is generally been one node behind. So how do we see that going forward with things such as a 16?\n\n**C.C. Wei** (Chairman &amp; CEO)\nWell, you're right.\n\n**C.C. Wei** (Chairman &amp; CEO)\nUsually, the HPC's customer always one step behind using m plus one or m plus two technologies. Now because of our AI demand is so strong, that's one thing, but the most important thing is we need some kind of performance but the power consumption is very, very important. When we talk about A16, we have another power efficiency improvement across to 20%. That's a big value for all the AI data centers applications. So that help my customer moving faster because of every time when we talk about AI data center, if you notice that, the first thing they talk about is power supply, electricity, right?\n\n**C.C. Wei** (Chairman &amp; CEO)\nSo they did not tell you say the power efficiency is very important, but they tell you that we have to build a very big electricity power plant to support the AI data center. So that tell you how important it is. And TSMC is the technology, by the way, on 08/16, it's a further improvement of the N2 node. So it's not a surprise for TSMC to expect for those people in AI data centers industry. They want to use in a 16.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, Cici. Thanks, We'll take the last question from the floor. We have one participant here, Felix Chan from KGI.\n\n**Felix Pan** (EVP, Head of Semiconductor)\nHi. Thanks, Jeff. Good afternoon, Sisi and Wendell. I only have one question about the overseas expansion. I think Sisi earlier mentioned that the second fab for the M3, there's a strong demand.\n\n**Felix Pan** (EVP, Head of Semiconductor)\nSo you guys need to speed up several quarters for that. Together with, I think, the U. S. Government also raised the investment tax credit cap for next year. So I wonder how this shape or how this speed up your ramping schedule for the second fab?\n\n**Felix Pan** (EVP, Head of Semiconductor)\nAnd how this impact to the overseas fab dilution for the guidance windows given earlier? Okay. I'm sorry. Know that I think the follow-up question will be, if you guys speed up The U. S.\n\n**Felix Pan** (EVP, Head of Semiconductor)\nInvestment, how is that impact to other regional investment like Japan and Germany as well? And lastly, is that possible to break down the overseas CapEx and domestic CapEx going forward? That's all my questions.\n\n**Jeff Su** (Director of Investor Relations)\nYes, that's pretty much two questions. But okay. Felix's question on our overseas expansion plans, he notes that yes, he said we're speeding up the schedule for the second fab in The U. S. So how and he also notes the recent passage of The U.\n\n**Jeff Su** (Director of Investor Relations)\nS. ITC bill. So how does this impact or affect our rent schedules in our US expansion and what is the implication or impact to the overseas dilution? That's number one.\n\n**C.C. Wei** (Chairman &amp; CEO)\nWow.\n\n**C.C. Wei** (Chairman &amp; CEO)\nThat's two questions. Okay. Let me share with you about our ramp up schedule. It's totally because of our customers' demand. And we appreciate the US government in create the ITC from 25% to 35%.\n\n**C.C. Wei** (Chairman &amp; CEO)\nWe appreciate that. It help, but the real schedule is because of our customers' demand. So we have to prepare the capacity to meet their demand. That's the number one consideration.\n\n**Wendell Huang** (SVP - Finance &amp; CFO)\nYes. The margin impact, it is positive, although not that significant in the five year period. Think about this, the ITC is used to offset the asset value and the benefit comes when depreciation starts. So it gets amortized.\n\n**C.C. Wei** (Chairman &amp; CEO)\nThen, David, to the second question is how does the ramp and speed up of The U. S. Expansion, how is this impacting our expansion plans in Japan and Europe, if it does at all? Well, you think about TSMC expansion, the oversea fab. In The US it's a leading edge.\n\n**C.C. Wei** (Chairman &amp; CEO)\nIn Japan it's specialty technology. To be specific, most of the time, it's for the CMOS image sensor. For Germany, it's automotive industry. So they are all not in the same field. So actually it's not affect the investment in The U.\n\n**C.C. Wei** (Chairman &amp; CEO)\nS. Or investment on the leading edge does not affect the investment in Japan or in Germany.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, Cece. Thank you, Felix. Okay, everyone.\n\n**Jeff Su** (Director of Investor Relations)\nSo this concludes our question and answer session. Before we conclude today's conference, please be advised that the replay of the conference will be accessible within thirty minutes from now. The transcript will become available twenty four hours from now and both are going to be available through TSMC's website at www.ksmg.com. So thank you very much for joining us today. We hope everyone continues to stay well and we hope you will join us again next quarter. Goodbye and have a good day. Thank you.",
      "fetched_at": "2026-02-04T15:39:39.467Z"
    },
    {
      "ticker": "TSM",
      "title": "Taiwan Semiconductor Manufactur (TSM) Q1 FY2025 earnings call transcript",
      "published_date": "Apr 17, 2025, 2:00 AM EDT",
      "fiscal_year": "2025",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/TSM/earnings/TSM-Q1-2025-earnings_call-306364.html",
      "content": "**Jeff Su** (Director of Investor Relations)\nGood afternoon, everyone, and welcome to TSMC's First Quarter 2025 Earnings Conference Call. This is Jeff Su, TSMC's Director of Investor Relations and your host for today. TSMC is holding our Earnings Conference Call via live audio webcast through the company's website at www.tsmc.com, where you can also download the earnings release materials. If you are joining us through the conference call, your dial-in lines are in listen-only mode. The format for today's event will be as follows. First, TSMC's Senior Vice President and CFO, Mr. Wendell Huang, will summarize our operations in the first quarter 2025, followed by our guidance for the second quarter 2025. Afterwards, Mr. Huang and TSMC's Chairman and CEO, Dr. C.C. Wei, will jointly provide the company's key messages. We will open the line for questions-and-answers.\n\n**Jeff Su** (Director of Investor Relations)\nAs usual, I would like to remind everybody that today's discussions may contain forward-looking statements that are subject to significant risk and uncertainties, which could cause actual results to differ materially from those contained in the forward-looking statements. Please refer to the safe harbor notice that appears in our press release. I would like to turn the call over to TSMC's CFO, Mr. Wendell Huang, for the summary of operations and the current quarter guidance.\n\n**Wendell Huang** (Senior VP and CFO)\nThank you, Jeff. Good afternoon, everyone. Thank you for joining us today. My presentation will start with financial highlights for the first quarter 2025. After that, I will provide the guidance for the second quarter of 2025. First quarter revenue decreased 3.4% sequentially in NT dollar, or 5.1% in U.S. dollars, as our business was impacted by smartphone seasonality, partially offset by continued growth in AI-related demand. In spite of the January 21 earthquake and several aftershocks, we worked diligently to recover much of the lost production. Thus, our revenue in the first quarter was slightly above the midpoint of our guidance. Gross margin decreased 0.2 percentage points sequentially to 58.8%, primarily due to the earthquake impact as well as the start of overseas dilution, partially offset by the cost improvement efforts. Total operating expenses accounted for 10.2% of net revenue. Operating margin decreased 0.5 percentage points sequentially to 48.5%.\n\n**Wendell Huang** (Senior VP and CFO)\nOverall, our first quarter EPS was NT 13.94, and ROE was 32.7%. Now, let's move on to revenue by technology. Three-nanometer process technology contributed 22% of wafer revenue in the first quarter, while five-nanometer and seven-nanometer accounted for 36% and 15% respectively. Advanced technologies, defined as seven-nanometer and below, accounted for 73% of wafer revenue. Moving on to revenue contribution by platform. HPC increased 7% quarter-over-quarter to account for 59% of our first quarter revenue. Smartphone decreased 22% to account for 28%. IoT decreased 9% to account for 5%. Automotive increased 14% and accounted for 5%. DCE increased 8% to account for 1%. Moving on to the balance sheet, we ended the first quarter with cash and marketable securities of NT 2.7 trillion, or $81 billion.\n\n**Wendell Huang** (Senior VP and CFO)\nOn the liabilities side, current liabilities increased by TWD 135 billion quarter-over-quarter, mainly due to the increase of TWD 111 billion in accrued liabilities and others. The increase in accrued liabilities and others was mainly due to the accrual of income tax payables. On financial ratios, accounts receivable turnover days increased one day to 28 days. Days of inventory increased three days to 83 days, primarily due to the ramping of new overseas fabs. Regarding cash flow and CAPEX, during the first quarter, we generated about TWD 626 billion in cash from operations, spent TWD 331 billion in CAPEX, and distributed TWD 104 billion for second quarter 2024 cash dividend. In addition, we raised TWD 16 billion in cash from bond issuances. Overall, our cash balance increased TWD 267 billion-TWD 2.4 trillion at the end of the quarter. In U.S. dollar terms, our first quarter capital expenditures totaled $10.06 billion.\n\n**Wendell Huang** (Senior VP and CFO)\nI've finished my financial summary. Now, let's turn to our current quarter guidance. Based on the current business outlook, we expect our second quarter revenue to be between $28.4 billion and $29.2 billion, which represents a 13% sequential increase or a 38% year-over-year increase at the midpoint. Based on the exchange rate assumption of $1 -NT 32.5, gross margin is expected to be between 57-59%. Operating margin between 47-49%. Also, in the second quarter, we will need to accrue the tax on the undistributed retained earnings. As a result, our second quarter tax rate will be around 20%. The tax rate will then fall back to the 14-15% level in the third and fourth quarter, and the full year tax rate will be between 16% and 17%. This concludes my financial presentation. Now, let me turn to our key messages.\n\n**Wendell Huang** (Senior VP and CFO)\nI will start by talking about our first quarter 2025 and second quarter of 2025 profitability. Compared to fourth quarter, our first quarter gross margin slightly decreased by 20 basis points sequentially to 58.8%. This was primarily due to 60 basis points impact from the January 21 earthquake and its aftershocks, as well as the start of dilution from our Kumamoto fab, partially offset by cost improvement efforts. We have just guided our second quarter gross margin to decrease by 80 basis points to 58% at the midpoint, primarily as the margin dilution impact from our Arizona fab starts to kick in. We expect the impact from overseas fab to grow more pronounced throughout the year as we ramp up further in Kumamoto and Arizona and forecast 2-3% margin dilution impact for the full year 2025.\n\n**Wendell Huang** (Senior VP and CFO)\nAs we have said before, under today's fragmented globalization environment, overseas fabs' costs are higher for everyone, including TSMC and all other semiconductor manufacturers. With our additional $100 billion investment planned in Arizona, we forecast the gross margin dilution from the ramp-up of our overseas fabs in the next five years to start from 2-3% every year in the early stages and widen to 3-4% in the latter stages. We will leverage our increasing size in Arizona and work on our operations to improve the cost structure. We will also continue to work closely with our customers and suppliers to manage the impact. Overall, with our fundamental competitive advantages of manufacturing technology leadership and large-scale production base, we expect TSMC to be the most efficient and cost-effective manufacturer in the region that we operate.\n\n**Wendell Huang** (Senior VP and CFO)\nThus, even considering our global manufacturing expansion plans, we believe a long-term gross margin of 53% and higher is achievable. Next, let me talk about our 2025 capital budget. At TSMC, a higher level of capital expenditures is always correlated with higher growth opportunities in the following years. We reiterate our 2025 capital budget is expected to be between $38 billion and $42 billion as we continue to invest to support customers' growth. About 70% of the capital budget will be allocated for advanced process technologies. About 10%-20% will be spent for specialty technologies, and about 10%-20% will be spent for advanced packaging, testing, mask making, and others. Our 2025 CAPEX also includes a small amount related to our recently announced additional $100 billion investment plan to expand our capacity in Arizona.\n\n**Wendell Huang** (Senior VP and CFO)\nEven as we invest for the future growth with this level of CAPEX spending in 2025, we remain committed to delivering profitable growth to our shareholders. We also remain committed to a sustainable and steadily increasing cash dividend per share on both an annual and quarterly basis. Now, let me turn the microphone over to C.C. Wei.\n\n**Che-Chia Wei** (Chairman and CEO)\nThank you, Wendell. Good afternoon, everyone. First, let me start with our near-term demand outlook. Before that, I would like to mention the earthquake during Lunar New Year. On January 21, Taiwan experienced a 6.4 magnitude earthquake on the Richter scale, followed by several significant aftershocks. Although a certain number of wafers in process were impacted and had to be scrapped, we worked tirelessly and were able to recover much of the lost production, demonstrating the resilience of our operation in Taiwan. I want to recognize and deeply thank all of our employees and our suppliers for their dedication and hard effort over the Lunar New Year holidays. I would also like to extend our great appreciation to our customers for their understanding and support during this time. Now, let me talk about the first quarter's result. We concluded our first quarter with revenue of $25.5 billion.\n\n**Che-Chia Wei** (Chairman and CEO)\nOur business in the fourth quarter was impacted by smartphone seasonality, partially offset by continued growth in AI-related demand. Moving into second quarter 2025, we expect our business to be supported by strong growth of our 3-nanometer and 5-nanometer technologies. Looking at the full year of 2025, we expect Foundry 2.0 industry growth to be supported by robust AI-related demand and a mild recovery in other market segments. In January, we had forecast the Foundry 2.0 industry to grow 10 percentage points year-over-year in 2025, which is consistent with IDC's forecast of 11% year-over-year growth for Foundry 2.0. Now, let me talk about the recent tariffs. We understand there are uncertainties and risks from the potential impact of tariff policies. However, we have not seen any change in our customers' behavior so far.\n\n**Che-Chia Wei** (Chairman and CEO)\nTherefore, we continue to expect our full year 2025 revenue to increase by close to mid-20% in U.S. dollar terms. We might get a better picture in the next few months, and we will continue to closely monitor the potential impact to the end market demand and manage our business prudently. Amidst the uncertainties, we continue to focus on fundamentals of our business, which are technology leadership, manufacturing excellence, and customer trust, to further strengthen our competitive position. As such, we are confident TSMC can continue to outperform the Foundry 2.0 industry growth in 2025. Now, I will talk about our AI demand outlook. We continue to observe robust AI-related demand from our customers throughout 2025. We reaffirm our revenue from AI accelerators to double in 2025. The AI accelerators we define as AI GPU, AI ASIC, and HBM controllers for AI training and inference in the data center.\n\n**Che-Chia Wei** (Chairman and CEO)\nBased on our customers' strong demand, we are also working hard to double our CoWoS capacity in 2025 to support their needs. Recent developments are also positive to AI's long-term demand outlook. In our assessment, the impact from AI reasoning models, including DeepSeek, will drive greater efficiency and help lower the barrier to future AI development. This will lead to wider usage and greater adoption of AI models, which all require use of leading-edge silicon. Thus, these developments only serve to strengthen our conviction in the long-term growth opportunities from the industry mega trend of 5G, AI, and HPC. To address the structural increase in the long-term market demand profile, TSMC employs a disciplined and robust capacity planning system. This is especially important when we have such high forecasted demand from AI-related business. Externally, we work closely with our customers and our customers' customers to plan our capacity.\n\n**Che-Chia Wei** (Chairman and CEO)\nInternally, our planning system involves multiple teams across several functions to assess and evaluate the market demand from both a top-down and bottom-up approach to determine the appropriate capacity to build. Based on our planning framework, we are confident that our revenue growth from AI accelerators will approach a mid-40s-percentage CAGR for the next five years' period starting from 2024. Next, let me talk about TSMC's additional $100 billion investment planned to expand in Arizona. All our overseas decisions are based on our customers' needs. They value some geographic flexibility and necessary level of government support. This is also to maximize the value for our shareholders. With the strong collaboration and support from our leading U.S. customers and the U.S. federal, state, and city governments, we recently announced our intention to invest an additional $100 billion in advanced semiconductor manufacturing in the United States.\n\n**Che-Chia Wei** (Chairman and CEO)\nThis expansion includes plans for three additional wafer manufacturing fabs, two advanced packaging fabs, and a major R&D center. Combined with our previously announced plan to build three advanced semiconductor manufacturing fabs in Arizona, this brings our total investment in the U.S. to $165 billion to support the strong multi-year demand from our customers. Our first fab in Arizona has already successfully entered high-volume production in Q4 2024, utilizing N4 process technology with a yield comparable to our fab in Taiwan. The construction of our second fab, which will utilize a 3-nanometer process technology, is already complete, and we are working on speeding up the volume production schedule based on the strong AI-related demand from our customers. Our third and fourth fab will utilize N2 and A16 process technologies, and with the expectation of receiving all the necessary permits, are scheduled to begin construction later this year.\n\n**Che-Chia Wei** (Chairman and CEO)\nOur fifth and sixth fab will use even more advanced technologies. The construction and ramp schedule for these fabs will be based on our customers' demand. We also plan to build two new advanced packaging facilities and establish an R&D center in Arizona to complete the AI supply chain. Our expansion plan will enable TSMC to scale up to a GIGAFAB cluster to support the needs of our leading-edge customers in smartphone, AI, and HPC applications. With this additional $100 billion investment planned to expand our leading-edge capacity in Arizona, I would also like to mention that TSMC is not engaged in any discussion with other companies regarding any joint venture, technology licensing, or technology transfer and sharing. After completion, around 30% of our two-nanometer and more advanced capacity will be located in Arizona, creating an independent leading-edge semiconductor manufacturing cluster in the U.S.\n\n**Che-Chia Wei** (Chairman and CEO)\nIt will also create greater economies of scale and help foster a more complete semiconductor supply chain ecosystem in the U.S. Thus, TSMC will continue to play a critical and integral role in enabling our customers' success while remaining a key partner and enabling all the strength and leadership of the U.S. semiconductor industry. Next, in Japan, thanks to the strong support from the Japan Central Prefecture and local government, our first specialty technology fab in Kumamoto has already started volume production in late 2024 with very good yield. The construction of our second specialty fab is scheduled to start later this year, subject to the readiness of the local infrastructure. In Europe, we have received strong commitment from the European Commission and the German federal, state, and city governments. We are on track with our plan to build a specialty technology fab in Dresden, Germany.\n\n**Che-Chia Wei** (Chairman and CEO)\nIn Taiwan, with support from the Taiwan government, we plan to build 11 wafer manufacturing fabs and four advanced packaging facilities over the next several years. Volume production of N2 is expected to start in the second half of 2025, and we are preparing for multiple phases of two-nanometer fabs in both Hsinchu and Kaohsiung science parks to support the strong structural demand from our customers. By expanding our global footprint while continuing investment in Taiwan, TSMC can continue to be the trusted technology and capacity provider of the global logic IC industry for years to come while delivering profitable growth for our shareholders. Finally, I will talk about our N2 status and A16 introduction. Our two-nanometer and A16 technology leads the industry in addressing the insatiable need for energy-efficient computing, and almost all the innovators are working with us.\n\n**Che-Chia Wei** (Chairman and CEO)\nWe expect the number of new tape outs for two-nanometer technology in the first two years to be higher than both three-nanometer and five-nanometer in their first two years, fueled by both smartphone and HPC applications. N2 will deliver full-on performance and power benefits, with 10-15% speed improvement at the same power or 20-30% power improvement at the same speed, and more than 15% chip density increase as compared with N3e. N2 is well on track for volume production in the second half of 2025 as scheduled, with a ramp profile similar to N3. With our strategy of continuous enhancement, we also introduce N2P as an extension of N2 family. N2P features further performance and power benefits on top of N2, and volume production is scheduled for the second half of 2026. We also introduce A16 featuring Super Power Rail or SPR as a separate offering.\n\n**Che-Chia Wei** (Chairman and CEO)\nCompared with N2P, A16 provides a further 8-10% speed improvement at the same power, or 15-20% power improvement at the same speed, and additional 7-10% chip density gain. A16 is best suited for specific HPC products with complex signal route and dense power delivery network. Volume production is scheduled for the second half of 2026. We believe N2, N2P, A16, and its derivatives will further extend our technology leadership position and enable TSMC to capture the growth opportunities well into the future. This concludes our key message, and thank you for your attention.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, C.C. This concludes our prepared statements. Before we begin the Q&A session, I would like to remind everybody to please limit your questions to two at a time to allow all the participants an opportunity to ask their questions.\n\n**Jeff Su** (Director of Investor Relations)\nShould you wish to raise your question in Chinese, I will translate it to English before our management answers your question. For those of you on the call, if you would like to ask a question, please press the star then one on your telephone keypad now. If at any time you'd like to remove yourself from the questioning queue, please press star two. Now, let's begin the Q&A session. Operator, can we please proceed with the first caller on the line?\n\n**Operator**\nThe first one to ask a question, Gokul Hariharan from JPMorgan.\n\n**Gokul Hariharan** (Managing Director)\nThank you very much. Good afternoon. First of all, thanks for clearing the air on all those JV-related news reports. I think a lot of people needed that. Thank you. My first question is on AI demand. C.C., there has been a lot of talks about CoWoS order adjustments and some concerns about AI demand.\n\n**Gokul Hariharan** (Managing Director)\nYou did talk about CoWoS capacity doubling. Could you talk a little bit about how you see demand versus supply? I think last time we talked about this, you did indicate CoWoS demand is still well above supply. Could you talk a little bit about how the situation is looking for CoWoS demand versus supply this year? Maybe a little bit of early color on 2026 also as you plan for the capacity?\n\n**Jeff Su** (Director of Investor Relations)\nAll right. Thank you, Gokul. For everyone's benefit, let me try to summarize your first question. Gokul's first question is on the AI-related demand. He notes there's been a lot of noise around CoWoS and order cuts and such. He would like to ask C.C., what is the thinking or strategy for TSMC? CoWoS still doubling this year? Is the demand still exceeding the supply?\n\n**Jeff Su** (Director of Investor Relations)\nHow is the CoWoS capacity and supply, or supply and demand, I should say, look like going into 2026 if C.C. is able to provide any color?\n\n**Che-Chia Wei** (Chairman and CEO)\nOkay, Gokul. I know there is a lot of rumors about the CoWoS. The last time when we talked about the CoWoS, the demand is almost insane and much, much higher than we can prepare. Now it is a little bit better. I think still we need to build a lot of capacity to meet the demand. As I said, we have to double our CoWoS capacity. Still fully loaded. For 2026, I cannot say the number, but it is still a heresy momentum while we continue. Okay? Did that answer your question?\n\n**Gokul Hariharan** (Managing Director)\nDo you still think 2026 is going to be supply limited still? That demand is still going to be much more than supply even in 2026?\n\n**Gokul Hariharan** (Managing Director)\nIs that your current expectation, C.C.?\n\n**Jeff Su** (Director of Investor Relations)\nGokul is asking, do we still see demand exceeding supply for CoWoS in 2026?\n\n**Che-Chia Wei** (Chairman and CEO)\nWe will work very hard to make sure that we do not have this kind of demand being much, much higher than the capacity. We are working very hard, and I believe that it will be more balanced next year.\n\n**Gokul Hariharan** (Managing Director)\nThank you. My second question is on the U.S. investment and all these persistent rumors about involvement in your competitors' operations, etc. You have interacted with the U.S. government, the new administration for the last several months, and C.C. made the big announcement at the White House as well. I just wanted to understand what is TSMC's impression in terms of what is required now that there is also the semiconductor tariff litigation going on?\n\n**Gokul Hariharan** (Managing Director)\nWhat is TSMC's impression of what is required over the next two, three years in terms of reassuring of capacity, both from a U.S. administration perspective, also from your U.S. customers' perspective? I think Wendell also indicated that the margin dilution may be slightly bigger as we go along. Could you talk a little bit about how much of the value can you pass on to the customers as the expansion becomes a little bit more accelerated? Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Gokul's second question is a bit involved, but he's asking about, again, a lot of talk about our recent announcement for an additional $100 billion expansion in the U.S. Again, talk about this involving the competitors. C.C. has been speaking to the U.S. government. There's still potential semiconductor tariffs.\n\n**Jeff Su** (Director of Investor Relations)\nHis question is really from TSMC's point of view, what do we think is required for more onshoring in the U.S.? Can we share the perspective from the U.S. government, or more directly, what our customers are asking us to do in terms of reshoring? That's the first part. The second part, maybe Wendell can address on the margin.\n\n**Che-Chia Wei** (Chairman and CEO)\nReally? Okay. I saw that's a very long, long question. Let me answer that. Yes, indeed, we have talked with U.S. government officials. The reason we are expanding in Arizona, actually, let me say again, is all because of our customers' request. That's because of their very high, high demands. I announced it in other occasions, said that very strong AI demand from U.S. customers such as Apple, Nvidia, AMD, Qualcomm, and Broadcom.\n\n**Che-Chia Wei** (Chairman and CEO)\nWe need to expand our capacity in the U.S. to support them. We talked with the U.S. government to ask for their help in getting the necessary permits so we can start the fab. As a result, I would expect our two-nanometer capacity, around 30%, will be in Arizona. That will be also an independent leading-edge semiconductor manufacturing cluster. Okay?\n\n**Jeff Su** (Director of Investor Relations)\nGokul, the second part of your question is related to, sorry, Wendell had mentioned that the margin may widen. Gokul's second part of the question, I think, was related to pricing and what is our strategy or approach here as we expand overseas. Is that correct?\n\n**Gokul Hariharan** (Managing Director)\nYeah, that's right. Yeah.\n\n**Wendell Huang** (Senior VP and CFO)\nHey, Gokul. You're asking about the pricing. As we always said, reflecting our value is a continuous and ongoing process for TSMC, as we're in a very capital-intensive business.\n\n**Che-Chia Wei** (Chairman and CEO)\nWe need to have a very high gross margin to earn the sustainable and healthy return. That is why we set up our pricing strategy. Geographic manufacturing flexibility is an important part of our value proposition to the customers. We are already discussing this with our major customers, and the progress is so far so good.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, Gokul?\n\n**Gokul Hariharan** (Managing Director)\nOkay, understood. Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nAll right, thank you. Operator, can we move on to the next participant, please?\n\n**Operator**\nThe next to ask question, Bruce Lu from Goldman Sachs. Please ask a question.\n\n**Bruce Lu** (VP and Equity Analyst)\nOkay, thank you for taking my question. I think the geopolitical micro concerns is one of the major uncertainties nowadays. The last two days, we have H20 being banned in China, blah, blah, blah. How does that impact TSMC's forecast and production planning?\n\n**Bruce Lu** (VP and Equity Analyst)\nDo we have enough other customers and demand to keep our advanced node capacity fully utilized? Or how does that change our long-term production planning moving forward?\n\n**Jeff Su** (Director of Investor Relations)\nOkay, Bruce, thank you. Your first question is related. He's talking about geopolitical risk or, I guess, some of the recent rules and announcements, specifically the ban on H20. So his question is, how does this impact TSMC's business? How does this impact our capacity planning and our strategies?\n\n**Che-Chia Wei** (Chairman and CEO)\nBruce, let me answer this question. Of course, we do not comment on specific customers' products, but let me assure you that we have taken this into consideration when providing our four-year gross outlook. Did I answer the question?\n\n**Bruce Lu** (VP and Equity Analyst)\nYes, but I want a little bit more about, you know, I'm sure you guys did a lot of sensitive analysis, like what kind of impact it's going to be.\n\n**Bruce Lu** (VP and Equity Analyst)\nCan you share with us how much buffer we got that you've assumed, like how comfortable we have to maintain our current capacity planning moving forward or current utilization right now?\n\n**Jeff Su** (Director of Investor Relations)\nBruce is asking for some more color in terms of what type of buffer or what type of room we have in making our decisions for the long-term capacity planning.\n\n**Che-Chia Wei** (Chairman and CEO)\nActually, we know a lot of people right now speculate a lot of things. Again, we certainly are mindful of the potential impact from all the recent tariff announcements, especially the potential impact to the end market demand. We will continue to watch it carefully. Having said that, we have not seen any change in our customers' behavior so far. We stick on our forecast.\n\n**Bruce Lu** (VP and Equity Analyst)\nI see. Thank you. Let me switch gears a little bit for the non-U.S. capacity expansion.\n\n**Bruce Lu** (VP and Equity Analyst)\nI think, as we understand that the current capacity utilization for mature node is underutilized, right? Do we consider to slow down the capacity expansion in Japan or Europe, or just relocate the current equipment from Taiwan to Japan or Europe instead of building the new one? We do not wantwhy do we want to expand the capacity for the mature node, which management already mentioned that it is an oversupply industry, though? If we relocate them, we can squeeze more space, clean room in Taiwan for more advanced nodes.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, so Bruce's second question is around mature node and our expansion into Europe and Japan. His question really is, given that the capacity of mature node and 7-nanometer are underutilized, number one, are we concerned to slow down our expansions in these places?\n\n**Jeff Su** (Director of Investor Relations)\nNumber two, would we consider using current relocate equipment from Taiwan to overseas rather than just the pure new expansion or greenfield expansion?\n\n**Che-Chia Wei** (Chairman and CEO)\nBruce? Let me answer the first part of the question. Are we considering slowing down? The answer is no. We execute our plan as scheduled. The reason is very simple because of this kind of mature node is a specialty technology that demand, which my competitor did not have capacity or capability to support. It is kind of free from, you mentioned, the underloading of the mature node. Again, I would emphasize, no, we are not going to slow down our plan in Japan or in Germany. The second question is how to do it. We have a good idea, but it is TSMC's confidential information. I'll let you know later.\n\n**Bruce Lu** (VP and Equity Analyst)\nThank you.\n\n**Jeff Su** (Director of Investor Relations)\nAll right, thanks, Bruce.\n\n**Jeff Su** (Director of Investor Relations)\nOperator, can we move on to the next participant, please?\n\n**Operator**\nNow the line is open to Charlie Chan, Morgan Stanley.\n\n**Charlie Chan** (Managing Director)\nHi, good afternoon, gentlemen. Thanks for taking my question. My first question is really very specific on the semiconductor tariff on either Taiwan or TSMC's leading edge. I am wondering, first of all, does TSMC get involved in all those tariff negotiations between Taiwan government and the U.S. government? Secondly, do you believe that your commitment of $165 billion U.S. dollars investments can get a spare on this semiconductor tariff? In your previous comment, you seem to only concern about the tariff impact on consumer tech demand. I think global investors are also very concerned about additional tariffs on this semiconductor category. Can you give us some color?Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, let me summarize your question. First question, Charlie.\n\n**Jeff Su** (Director of Investor Relations)\nCharlie's first question is on semiconductor tariffs. He wants to know what is our comment or view on potential tariffs on Taiwan, reciprocal tariffs, or semiconductor-specific tariffs. His question specifically, is TSMC getting involved in the negotiations between the Taiwan government and the U.S. government?\n\n**Che-Chia Wei** (Chairman and CEO)\nCharlie, this kind of tariff discussion is between countries. We are a private company. Certainly, no, we are not getting involved. What is the second question?\n\n**Charlie Chan** (Managing Director)\nYeah, actually, do you have any visibility that semiconductor-specific tariffs can be exempt?\n\n**Jeff Su** (Director of Investor Relations)\nCharlie is saying thatsorry, Charlie, I think your question was with our total investment of $165 billion in Arizona. Do we believe, does TSMC believe semiconductors will be exempt from these tariffs?\n\n**Che-Chia Wei** (Chairman and CEO)\nYes. Yes. Charlie, all policy, especially these tariff decisions, are government's responsibility to decide.\n\n**Che-Chia Wei** (Chairman and CEO)\nAs a private company, we are fully respectful of this, but we are not getting involved.\n\n**Charlie Chan** (Managing Director)\nOkay, got you. I think you're too moderate, but let's move on to my second question. Based on your second quarter guidance, which is very strong at 13% quarter-on-quarter, I can't help to think whether there are customers pulling given tariffs, or is there really demand? Also, based on your full-year guidance, so-called ME 20%, it seems like the second half recovery will be very, very gradual or flat-ish. I'm wondering if you're already baking those kinds of consumer tech demand impacts. If a tariff has some kind of turnaround, meaning some exemption on, for example, major smartphone brands, is there a chance for you to revise your full-year revenue guidance? Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, Charlie's second question is on the revenue outlook.\n\n**Che-Chia Wei** (Chairman and CEO)\nHis first part is on the second quarter. He notes second quarter 13% at the midpoint in U.S. dollar terms, Q on Q is very strong. He wonders, are we seeing already some tariff pulling impact, or is this part of that guidance? I'll stop here first.\n\n**Wendell Huang** (Senior VP and CFO)\nYeah, Charlie, as we said in the prepared remarks, we haven't seen any changes in customers' behavior so far. Our second quarter growth is driven mainly by strong demand for the 3-nanometer and 5-nanometer technologies, underpinned by the growth in our HPC platform. As I said, we haven't observed any changes in customer behavior in terms of pulling or due to tariffs. It's probably better to ask them directly.\n\n**Jeff Su** (Director of Investor Relations)\nThe second part then, Charlie, is asking about what the second quarter guidance implies of limited half-on-half growth.\n\n**Jeff Su** (Director of Investor Relations)\nIs that also because we are assuming something from a tariff impact to consumer demand, or why is that?\n\n**Wendell Huang** (Senior VP and CFO)\nCharlie, as we also said in the prepared remarks, there are uncertainties and potential risks from tariffs exist. So far, what we are able to share with you is we stick to the mid-20% or close to mid-20% year-over-year growth, no different from the previous quarter.\n\n**Charlie Chan** (Managing Director)\nI see. I think that's really what we want. I think your answer to Gokul's previous question on long-term margin dilution was a little bit unclear because we thought that the 2-3% margin dilution from overseas staff should remain to be the case, but it seems like it's widening.\n\n**Charlie Chan** (Managing Director)\nI'm not sure if it is because you are further accelerating your U.S. staff expansion or some cost item or pricing item are not in your expectations versus maybe one or two months ago.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, I think so. Charlie is asking basically how come the dilution in the latter period widens to 3-4%. What are the drivers or reasons behind it?\n\n**Wendell Huang** (Senior VP and CFO)\nYeah, Charlie, the widening of dilution on the gross margin in the later part of the five-year period is mainly from inflation in cost and also potential tariff-related cost increases. Those are the reasons. Okay.\n\n**Charlie Chan** (Managing Director)\nOh, I see. Okay, thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, thank you, Charlie. Okay, Operator, let's move on to the next participant, please.\n\n**Operator**\nNext one, Charles Shi from Needham. Go ahead, please.\n\n**Charles Shi** (Analyst)\nThanks for taking my questions. Maybe I'll ask a relatively higher-level question. It's a two-part question.\n\n**Charles Shi** (Analyst)\nBoth are regarding your expansion plan in the U.S. I think management, another occasion that what TSMC wants the most is really fairness. Nothing monetary, nothing about tariffs, but fairness. Can management kind of elaborate a little bit what fairness means? Give us a little bit more specifics. The other part of the question regarding the U.S. expansion is about the R&D team center you announced. We understand, yes, the TSMC's R&D in the U.S. does need to start from somewhere, right? You said it's more about the production improvements related to R&D on derivative nodes.\n\n**Che-Chia Wei** (Chairman and CEO)\nSince this seems to be something the U.S. really cares about, that the R&D capability on U.S. soil, on the leading edge, is there any longer-term plan to have the U.S. R&D center to be involved, let's say, in the primary R&D, let's say, brand new processes, the major nodes development? That is my two-part question. Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nAll right. Thank you, Charles. Again, to summarize, both questions are related to the expansion in the U.S. The first part of the question is, C.C. has mentioned all we want is fair treatment. What do we mean by fair or fairness?\n\n**Che-Chia Wei** (Chairman and CEO)\nLet me answer this question. What we mean by fair treatment is very simple. If anybody gets the subsidy or gets the incentive, everybody should get the same. Either we get all or we get zero, all right?\n\n**Che-Chia Wei** (Chairman and CEO)\nThat is what we call fair. Again, I would like to assure you that we will be very competitive in either condition.\n\n**Jeff Su** (Director of Investor Relations)\nThe second part of the question is regarding the R&D. Charles is saying he understands the R&D needs to start from somewhere, but with our major R&D center in Arizona, what will be the purpose or the focus, and will it be involved at some point in ramping new technologies?\n\n**Che-Chia Wei** (Chairman and CEO)\nAs I said before, TSMC's fair will never be stagnant. We always continue to improve it. We need to establish a major R&D center in Arizona with about 1,000 engineers. That is a big amount. The focus will be to support our manufacturing cluster, improve its technology, and allow it to operate independently. Did I answer the question?\n\n**Charles Shi** (Analyst)\nMaybe let me just really follow up because there has been a good amount of chatters about the U.S. R&D center more supporting manufacturing rather than doing major R&D on the brand new nodes. It looks like that's not the plan. Over the longer term, is there any thoughts of our management? Maybe they will get involved in brand new nodes development one way or the other. I think that's a question people have been discussed about over the last quarter.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, so Charles is asking, will the R&D center over the mid to long term can it also focus on things like new node development or pathfinding opportunities, long-term research, these types of things?\n\n**Che-Chia Wei** (Chairman and CEO)\nActually, the first purpose is to let Arizona's fab we can operate independently. Of course, we have done and we are doing it right now.\n\n**Che-Chia Wei** (Chairman and CEO)\nWe'll do some kind of pest funding, exploratory work, and cooperate with university, blah, blah, blah. It actually a lot of activities. 1,000 engineers is not a small amount. Of course, it's not comparable to TSMC's right now. It's a 10,000 R&D people, but it's a beginning. Okay, so we do a lot more.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, Charles, do you have a second question?\n\n**Charles Shi** (Analyst)\nNo, I don't. Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, great. Thank you. Operator, the next participant, please.\n\n**Operator**\nNext one to ask questions, Sunny Lin from UBS.\n\n**Sunny Lin** (Analyst)\nGood afternoon. Thank you very much for taking my questions. My first question is to follow up on the Arizona expansions. First part is on the timeline or the pace of your expansions. Now, given the stronger demand for your U.S. capacities, to what extent could you pull in the rep of the original second and third phase?\n\n**Sunny Lin** (Analyst)\nFor your fourth phase, you earlier mentioned that you will be constructing the fascial layer lister. Would that be possible that you start to wrap the fourth phase at the same time as the third phase?\n\n**Jeff Su** (Director of Investor Relations)\nSunny's first question is regarding our GIGAFAB cluster in Arizona. She wants to understand the timeline of expansion, particularly given the strong AI-related demand. Can we pull in the timing for both the second fab and the third fab? Also, can we at the same time start the production of the third and fourth fab simultaneously?\n\n**Che-Chia Wei** (Chairman and CEO)\nSunny, we are working very hard to speed it up of our production in the second fab and the construction on the third fab. All I can say now is customers' demand is strong. We have to really do speed it up.\n\n**Che-Chia Wei** (Chairman and CEO)\nThe following, all the fab definitely will depend on our customers' demand, of course.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, Sunny?\n\n**Sunny Lin** (Analyst)\nSorry, just to clarify. The second phase originally is planning for production in 2028. Now should we assume it to be from maybe mid-2027 or even first of 2027? For the third phase, since you are building the fascial this year, will the production start maybe one year ahead versus the original timeline of 2030?\n\n**Jeff Su** (Director of Investor Relations)\nSunny, specifically, the second one, we said we're speeding up. Can we give some context of a timeframe? For the third fab, will we also speed it up? Could that also be moved forward?\n\n**Che-Chia Wei** (Chairman and CEO)\nYes, we are speeding it up. How fast? The second fab, as you said, it should be pulling.\n\n**Che-Chia Wei** (Chairman and CEO)\nThis one, we are working hard to pull in at least a couple of quarters. That's at least. On the third fab, actually, I did not speak the whole thing. It is also being constrained by the labor shortage over Arizona, and we need to get all the permits, everything, etc. I cannot give you a very definite date yet, but we are going to update you probably in the next quarter or one quarter after that.\n\n**Sunny Lin** (Analyst)\nGot it. No problem. My second question is on the pricing and margin of the overseas expansions. Now with the especially stronger demand for the U.S capacities, would you be able to sell more value given the stronger onshoring requirements?\n\n**Sunny Lin** (Analyst)\nFor margin, earlier you mentioned this 2-3% margin dilution for the coming two to three years, and then expanding to 3-4% maybe into 2029 to 2030. I just wondered what the underlying wafer price assumption for that gross margin dilution estimates is. If you are able to raise the Arizona pricing a bit, would the gross margin dilution be less?\n\n**Jeff Su** (Director of Investor Relations)\nSunny's question is on the overseas expansion in both pricing and margin. Given the strong demand in terms of pricing, can we reflect even greater value to our customers? Also, her question is given that the dilution from overseas will widen to 3-4% in the latter stages of the five-year period. She wants to know what is our underlying wafer price assumption behind this.\n\n**Wendell Huang** (Senior VP and CFO)\nSunny, let me answer that. These two things actually go together.\n\n**Wendell Huang** (Senior VP and CFO)\nAs we said, reflecting our value is a continuous and ongoing process. Because of our business nature, we need very high gross margin to earn a sustainable and healthy return. Now, geographic manufacturing flexibility is an important part of our value proposition to the customers. Therefore, we are already discussing this with our major customers, and the progress is so far so good. At the same time, the margin dilution from the overseas fabs, the additional dilutions come from the cost inflation as well as potential cost increases from the tariff policies. Of course, with that, we also want to reflect the value, and therefore the discussion with the customers are continuous.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, Sunny?\n\n**Sunny Lin** (Analyst)\nGot it.\n\n**Jeff Su** (Director of Investor Relations)\nAll right. Thank you.\n\n**Sunny Lin** (Analyst)\nAll right. Very clear. Thank you very much.\n\n**Jeff Su** (Director of Investor Relations)\nThank you. Operator, can we move on to the next participant, please?\n\n**Operator**\nNext one to ask question, Brett Simpson, Arete Research\n\n**Brett Simpson** (Partner and Co-Founder)\nYes, thanks very much. I have a two-part question on this year's guidance for C.C. First, C.C., you mentioned that AI is still expected to double this year despite the U.S. ban on AI GPUs into China. I guess China was a meaningful portion of accelerator shipments, well over 10% of volumes. Factoring this in, it would imply your AI outlook this year still doubling would mean that the AI orders have improved meaningfully outside of China in the last three months. Is that how we should interpret your comment about you still expect the business to double? Second, we're in a June quarter where tariffs have been paused for 90 days. To what extent does your above-seasonal June quarter guidance reflect customer pullings ahead of potential tariffs being applied in the September quarter? Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, so Brett, his question is on, again, the one part is on the AI demand that although there's a ban in China on certain AI chips or products, that we reiterated our AI accelerator growth will double this year. His assumption is that implies a strong non-China AI-related demand and wondering what is the mechanics or can we comment behind that?\n\n**Che-Chia Wei** (Chairman and CEO)\nBrett, three months ago, now I can tell you that three months ago, we just cannot supply enough wafer to our customer. Now it's a little bit balanced, but still, the demand is very strong. You are right. Other than China, the demand is still very strong, especially in the U.S. We are confident that we are going to double our AI revenue this year.\n\n**Brett Simpson** (Partner and Co-Founder)\nYeah.\n\n**Brett Simpson** (Partner and Co-Founder)\nThen very quickly, he was asking about the second quarter revenue guidance and do we see any tariff-related pulling? I think Wendell answered this earlier.\n\n**Wendell Huang** (Senior VP and CFO)\nYeah, I think that we have, as C.C. Wei said in the prepared remarks, we haven't seen any changes in customer behavior. The growth in second quarter was primarily due to the demand from our 3-nanometer and 5-nanometer technologies underpinned by the demand from the HPC platform.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, do you have a second question, Brett? Sorry.\n\n**Brett Simpson** (Partner and Co-Founder)\nYeah, yeah, thanks, Jeff. My second question was for Wendell, and thanks for clarifying that, Wendell. Follow-up is on shareholder returns. TSMC traditionally has always favored growing the dividends as the main policy. Many shareholders would argue that the dividend payouts are not having that much of an impact on the discounted multiple that TSMC trades at versus some of your U.S. big tech peers.\n\n**Brett Simpson** (Partner and Co-Founder)\nMy question is, why does TSMC management not adopt a buyback framework, particularly with the strength of the cash position on your balance sheet at the moment? Thank you.\n\n**Jeff Su** (Director of Investor Relations)\nThank you, Brett. Brett's second question is circulated on shareholder return. He notes TSMC's policy has always been a stable and steadily increasing cash dividend and focused on cash dividend payout. His question is, why do we consider? Why do we not consider adopting more of a buyback policy, share buyback policy?\n\n**Wendell Huang** (Senior VP and CFO)\nBrett, we've done studies a long time ago, and we continue to revisit that. We also talked to investors. Our conclusion stays the same. The sustainable and steadily increasing dividends is a better way of returning cash to the shareholders. We're maintaining the policy.\n\n**Brett Simpson** (Partner and Co-Founder)\nThank you.\n\n**Jeff Su** (Director of Investor Relations)\nAll right.\n\n**Jeff Su** (Director of Investor Relations)\nOperator, in the interest of time, can we take the questions from the last two participants, please?\n\n**Operator**\nYes. Now the line is open to Laura Chen, Citi.\n\n**Laura Chen** (Research Analyst)\nHello, hi. Thank you very much for taking my question. Can you hear me clearly?\n\n**Jeff Su** (Director of Investor Relations)\nYes.\n\n**Laura Chen** (Research Analyst)\nYeah, thank you. My question is also about the AI and also the U.S. expansion. C.C., you just mentioned that the core supply demand will be more balanced into 2026. Do you see any structural change in the future AI chip design when moving to N3, such as a chip like that kind of a design? Also, in that kind of new trend, what is TSMC's view on the new technology, such as CPO or PLP panel base? Will that still start from Taiwan first, or would you also consider to further invest the new backend technology in Arizona?\n\n**Laura Chen** (Research Analyst)\nSince C.C., you just mentioned that you would also start to build up the fab in advanced packaging in Arizona.\n\n**Che-Chia Wei** (Chairman and CEO)\nOkay, Laura, first question. Thank you. First question is a very broad question, but basically, if I just try to distill, she wants to know, do we see any changes in the chip design, particularly moving to chiplets with N3? Do we see this more and more? What about the role of things like co-package optics and panel-level packaging? I think the essence of her question, will we continue to use our leading or, sorry, advanced packaging technologies like CoWoS or SRIC in Taiwan first, or is this also part of the plan for the expansion in Arizona?\n\n**Che-Chia Wei** (Chairman and CEO)\nThat is a long question. Laura, yes. Our customers, they continue to use TSMC's leading-edge technology, and they also adopt the advanced packaging technologies more and more, and also are more advanced.\n\n**Che-Chia Wei** (Chairman and CEO)\nThis year is probably most of CoWoS S, then next year, CoWoS Europe, etc. We can see that customers start to pick up the SRIC and the more advanced packaging technologies. As for what we call panel-level packaging, we are aggressively developing it. Today it still is a feasibility study stage. Too early to say it will be in Taiwan or in the U.S., but most likely it will be in Taiwan first. We ramp it up and then bring it to the U.S.\n\n**Laura Chen** (Research Analyst)\nThank you very much. That is very clear. Also, my second question is about the capacity allocation between Taiwan and also Arizona. C.C., you just shared with us that about 30% of N2 capacity will be in Arizona. We know it will be starting from when or what kind of a timeframe you are looking for.\n\n**Laura Chen** (Research Analyst)\nCan we also assume that the same scale, like 30% of your Arizona fab for the advanced node in the longer term?\n\n**Jeff Su** (Director of Investor Relations)\nOkay, so Laura's second question is about the capacity allocation between how do we allocate between Taiwan and the U.S.? Maybe is it duplicative or extra capacity? Then very specific, C.C. had mentioned that N2 and more advanced capacity, 30%, around 30% will be in Arizona once we scale up to the cluster. Will that be kind of the percentage for the leading node in the future?\n\n**Che-Chia Wei** (Chairman and CEO)\nWe have right now we plan a six fab in Arizona. And in that six fab, the two nanometer will be a major node. That is what I say, 30% will be there. As time goes by, after the two nanometer will be 1.4 and 1.0. That has not been discussed yet.\n\n**Laura Chen** (Research Analyst)\nOkay, thank you. Thank you very much.\n\n**Laura Chen** (Research Analyst)\nThat's very clear.\n\n**Jeff Su** (Director of Investor Relations)\nAll right, thanks, Laura. Operator, can we take the last questions from the last participant, please?\n\n**Operator**\nThe last one to ask questions, Chris Asankar Cohen. Go ahead, please.\n\n**Krish Sankar** (Managing Director and Senior Research Analyst)\nYeah, thanks for taking my question. My first one is, it's very impressive given uncertainty, you're still maintaining full revenue guidance and also your N2 capacity plan for this year and next year. Kind of curious, what is your visibility on second-half revenues and also N2 demand for wafers into next year? And then I have a follow-up.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, so Chris's first question is sort of in the near term, what is our visibility into the second-half business outlook? And then also, how do we see the demand for N2 progressing this year and also next year?\n\n**Wendell Huang** (Senior VP and CFO)\nOkay, let me talk about the first one. We're only at second quarters.\n\n**Wendell Huang** (Senior VP and CFO)\nI think it's too early to talk about the second half. We did mention that the uncertainties and risks from tariffs exist, and we might get a better picture in the next few months. We can probably update you in the next earnings call.\n\n**Jeff Su** (Director of Investor Relations)\nThe second part of it is on the demand visibility of our two nanometer.\n\n**Che-Chia Wei** (Chairman and CEO)\nSo far, actually, so far is very strong, as we said. All the new tape-out customers, the number of the tape-outs is exceeding what we expected. As we said, the number of the new tape-outs is much higher than the three nanometer and five nanometer in the same period of time.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, did you have a second question, Chris?\n\n**Krish Sankar** (Managing Director and Senior Research Analyst)\nGot it. Very helpful. Yes, Jeff, yeah. Just one quick follow-up. You spoke about the Japan fab. I'm curious, what is the capacity installed in Japan today?\n\n**Krish Sankar** (Managing Director and Senior Research Analyst)\nHow do you think about the revenue contribution this year from Japan?\n\n**Jeff Su** (Director of Investor Relations)\nOkay. Chris's second question is related to our first specialty technology fab in Japan. He wants to know what is the capacity installment for this specialty technology fab and also the revenue contribution from JASM.\n\n**Wendell Huang** (Senior VP and CFO)\nThe capacity for the fab will be 40K when it is ramped up. The revenue for this year compared to the whole company is really not significant at this moment.\n\n**Jeff Su** (Director of Investor Relations)\nOkay, Chris?\n\n**Krish Sankar** (Managing Director and Senior Research Analyst)\nGot it. Thank you, Wendell. Thank you, Jeff.\n\n**Jeff Su** (Director of Investor Relations)\nThank you very much. No problem. Thank you, everyone. This concludes our question and answer session. Before we conclude today's conference, please be advised that the replay of the conference call will be accessible within 30 minutes from now. The transcript will become available 24 hours from now, and both will be available through TSMC's website at www.tsmc.com.\n\n**Jeff Su** (Director of Investor Relations)\nThank you again for joining us today. We hope everyone continues to stay well and hope you will join us again next quarter. Goodbye and have a good day. Take care. Thank you.",
      "fetched_at": "2026-02-04T15:39:43.443Z"
    }
  ]
}