{
  "ticker": "TXN",
  "last_updated": "2026-02-04T15:46:14.758Z",
  "total_transcripts": 4,
  "transcripts": [
    {
      "ticker": "TXN",
      "title": "Texas Instruments Incorporated (TXN) Q4 FY2025 earnings call transcript",
      "published_date": "Jan 27, 2026, 4:30 PM EST",
      "fiscal_year": "2025",
      "quarter": "Q4",
      "url": "https://finance.yahoo.com/quote/TXN/earnings/TXN-Q4-2025-earnings_call-400876.html",
      "content": "**Mike Beckman** (Analyst)\nWelcome to the Texas Instruments Q4 2025 earnings conference call. I'm Mike Beckman, Head of Investor Relations, and I'm joined by our Chairman, President, and Chief Executive Officer Haviv Ilan, and our Chief Financial Officer Rafael Lizardi. For any of you who missed the release, you can find it on our website at ti.com/ir. This call is being broadcast live over the web and can be accessed through our website. In addition, today's call is being recorded and will be available via replay on our website. This call will include forward-looking statements that involve risks and uncertainties that could cause TI's results to differ materially from management's current expectations. We encourage you to review the notice regarding forward-looking statements contained in the earnings release published today, as well as TI's most recent SEC filings for a more complete description.\n\n**Mike Beckman** (Analyst)\nI would like to provide you some information that is important for your calendars. On Tuesday, February 24th, at 10:00 A.M. Central Time, we will have our capital management call. Similar to what we've done in the past, Haviv, Rafael, and I will share our approach to capital allocation and summarize our progress as we prepare for the opportunity ahead. Moving on, today we'll provide the following updates. First, Haviv will start with a quick overview of the quarter. Next, he will provide insight into Q4 revenue results with some details of what we are seeing in our end markets. Haviv will then provide the annual summary of revenue breakout by end market. Lastly, Rafael will cover the financial results and our guidance for Q1 2026. With that, let me turn it over to Haviv.\n\n**Haviv Ilan** (CEO)\nThanks, Mike. Let me start with a quick overview of the Q4. Revenue came in about as expected at $4.4 billion, a decrease of 7% sequentially, and an increase of 10% from the same quarter a year ago. Analog revenue grew 14% year-over-year. Embedded Processing grew 8%, and our Other segment declined from the year-ago quarter. The overall semiconductor market recovery is continuing, and we are well positioned with inventory and capacity to meet immediate customer demand. Before I walk through our results, I'd like to share an update we've made to our end markets. To better reflect the growth opportunities we see for our analog and embedded products, we reorganized our end markets to include data center, which includes sectors related to data center compute, data center networking, and rack power and thermal management.\n\n**Haviv Ilan** (CEO)\nAs such, our end markets are now industrial, automotive, data center, personal electronics, and communications equipment. With that as a backdrop, I'll now provide some insight into our Q4 revenue by end market. First, the industrial market was up high teens year-over-year, with recovery continuing broadly across sectors and was down mid-single digits sequentially. The automotive market increased upper single digits year-over-year and was down low single digits sequentially. Data center grew around 70% year-over-year and mid-single digits sequentially. Personal electronics declined upper teens year-over-year and mid-teens sequentially. Lastly, communications equipment declined low single digits year-over-year and mid-teens sequentially. In addition, as we do at the end of each calendar year, I'll describe our estimated 2025 revenue by end market. Industrial was $5.8 billion, up 12% year-over-year, and was 33% of revenue.\n\n**Haviv Ilan** (CEO)\nAutomotive was $5.8 billion, up 6% year-over-year, and was 33% of revenue. Data center was $1.5 billion, up 64% year-over-year, and was 9% of revenue. Personal electronics was $3.7 billion, up 7% year-over-year, and was 21% of revenue. Communications equipment was about $500 million, up about 20% year-over-year, and was 3% of revenue. In summary, industrial, automotive, and data center combined made up about 75% of TI's revenue in 2025, up from about 43% in 2013. We see good opportunities in all of our markets, but we place additional strategic emphasis on industrial, automotive, and data center. Our customers across all regions are increasingly turning to analog and embedded technology to make their end products more reliable, more affordable, and lower in power.\n\n**Haviv Ilan** (CEO)\nThis drives growing chip content per application or secular content growth, which will likely continue to drive faster growth in these end markets. Rafael will now review profitability, capital management, and our outlook.\n\n**Rafael Lizardi** (CFO)\nThanks, Haviv, and good afternoon, everyone. As Haviv mentioned, Q4 revenue was $4.4 billion. Gross profit in the quarter was $2.5 billion, or 56% of revenue. Sequentially, gross profit margin decreased 150 basis points. Operating expenses in the quarter were $967 million, up 3% from a year ago and about as expected. On a trailing 12-month basis, operating expenses were $3.9 billion, or 22% of revenue. Operating profit was $1.5 billion in the quarter, or 33% of revenue, and was up 7% from the year-ago quarter. Net income in the Q4 was $1.2 billion, or $1.27 per share. Earnings per share included a $0.06 reduction not in our original guidance related to the non-cash impairment of goodwill in our other segment and other tax-related items. Let me now comment on our capital management results, starting with our cash generation.\n\n**Rafael Lizardi** (CFO)\nCash flow from operations was $2.3 billion in the quarter. Capital expenditures were $925 million in the quarter. In the quarter, we paid $1.3 billion in dividends and repurchased $403 million of our stock. We also increased our dividend per share by 4% in the Q4 to $1.42 per share, marking our 22nd consecutive year of dividend increases. In total, we have returned $6.5 billion in the past 12 months to owners. Our balance sheet remained strong with $4.9 billion of cash and short-term investments at the end of the Q4. Total debt outstanding was $14 billion with a weighted average coupon of 4%.\n\n**Rafael Lizardi** (CFO)\nInventory at the end of the quarter was $4.8 billion, down $25 million from the prior quarter, and days were 222, up seven days sequentially. Now let's look at some of these results for the year.\n\n**Rafael Lizardi** (CFO)\nIn 2025, cash flow from operations was $7.2 billion, and capital expenditures were $4.6 billion, as we continue to make progress on our capacity expansions. We're nearing the end of a 6 year elevated CapEx cycle that uniquely positions TI to deliver dependable, low-cost 300-millimeter capacity at scale. Free cash flow for 2025 was $2.9 billion, or 17% of revenue, representing an increase of 96% from 2024. Our free cash flow growth reflects the strength of our business model as well as our decisions to invest in 300-millimeter manufacturing assets and inventory. This supports our overall objective to maximize long-term free cash flow per share growth, which we believe is the primary driver of long-term value. In 2025, we received a $670 million cash benefit related to CHIPS Act incentives.\n\n**Rafael Lizardi** (CFO)\nTurning to our outlook for the Q1, we expect TI revenue in the range of $4.32-$4.68 billion and earnings per share to be in the range of $1.22-$1.48. We continue to expect our effective tax rate for 2026 to be about 13%-14%. In closing, we will stay focused in the areas that add value in the long term. We continue to invest in our competitive advantages, which are manufacturing and technology, a broad product portfolio, reach of our channels, and diverse and long-lived positions. We will continue to strengthen disadvantages through disciplined capital allocation and by focusing on the best opportunities, which we believe will enable us to continue to deliver free cash flow per share growth over the long term. With that, let me turn it back to Mike.\n\n**Mike Beckman** (Analyst)\nThanks, Rafael. Operator, you can now open the lines for questions. In order to provide as many of you as possible an opportunity to ask your questions, please limit yourself to a single question. After our response, we'll provide you with an opportunity for an additional follow-up. Operator?\n\n**Operator**\nThank you. We will now be conducting a question-and-answer session. If you would like to ask a question, please press star one on your telephone keypad. A confirmation tone will indicate your line is in the question queue. You may press star two to remove yourself from the queue. For participants using speaker equipment, it may be necessary to pick up their handset before pressing the star keys. One moment, please, while we pull for questions. Our first question comes from the line of Ross Seymour with Deutsche Bank. Please proceed with your question.\n\n**Ross Seymore** (Managing Director and Senior Equity Analyst)\nHi, guys. Thanks for having me ask a question. I guess my first question is, the Q1 guidance is significantly stronger than seasonal, and if my math is right, it seems like it's the first time you've guided up sequentially since right after the financial crisis 15 years ago, roughly. Is there anything unique going on by either end market or geography that's given you such an optimistic view versus relative or normal seasonality?\n\n**Haviv Ilan** (CEO)\nRoss, thanks for the question. I'll take it, and I'll let Mike add some more color as needed. First, let's start with the Q4. We have seen a typical Q1 revenue came in as expected, but if you look at the year-on-year results, we are seeing recovery continuing in industrial. It grew close to 20%. I think it was 18% year-over-year. And remember that on the industrial market, we still have a lot of room to go when you think about the previous peaks. So if you will, the compare is still easy for industrial to continue to recover.\n\n**Haviv Ilan** (CEO)\nThe other market that I will highlight is the continued strength in data center. We are seeing this market now becoming a little bit more substantial as a percentage of our revenue. I expect this market to continue to grow in Q1.\n\n**Haviv Ilan** (CEO)\nIt's been growing for now Q7 in a row for us, and we left the year at about $450 million a quarter revenue footprint, and I think that continues as we move forward. The last point I would say, we did see orders improving throughout the quarter, and what guides our guidance is just stronger booking. Mike, I don't know if you want to add anything.\n\n**Rafael Lizardi** (CFO)\nYeah, so we did see revenue linearity through the quarter improve. So month one to month two to month three, we did see it continue to build. Same with backlog. We saw that continue to build through the quarter. And also, as we've talked in previous quarters, turns business or when a customer comes in and wants an order shipped right away, we continue to see that run as well at higher levels. So that's factored into the guide. You have a follow-up, Ross?\n\n**Ross Seymore** (Managing Director and Senior Equity Analyst)\nYeah, I do. Just a question on the gross margin implications, given what you guys are talking about with revenue. It seems like you had a nice beat, at least versus what I was expecting in the Q4. Rafael, can you just talk a little bit about the puts and takes on gross margin in your Q1 guide and maybe throughout the year if utilization is changing, if inventory levels are where you want it, or if they need to rise? Anything on that would be helpful. Thank you.\n\n**Haviv Ilan** (CEO)\nYeah, sure. Let me start with Q4. EPS came in a little better than expected once you account for that $0.06 reduction that we talked about in the prepared remarks. And that was a combination of revenue was a little better, mixed end market mix was a little better, loadings was a little better, and OpEx was a little better. So it was a combination of multiple things there. On the Q1, we'll give you the range on EPS and the range on revenue. I would tell you as soon as OpEx is up, low single digits, and you should get into a reasonable number for gross margin. And the loadings will depend on demand, and we'll adjust those as needed. Thank you.\n\n**Mike Beckman** (Analyst)\nThanks for the questions, Ross. We'll move on to our next caller, please.\n\n**Operator**\nThank you. Our next question comes from the line of James Schneider with Goldman Sachs. Please proceed with your question.\n\n**James Schneider** (Senior Equity Research Analyst)\nGood afternoon, and thanks for taking my question. I was wondering if you could maybe, relative to your prior comments, maybe address inventory levels and where you expect those to go. You talked about taking loadings down a little bit to bring inventories down, and you accomplished that in the quarter. Do you think inventories are at a pretty good place, either from a days or dollars basis, or would you expect to want to take them down a little bit further at this point?\n\n**Haviv Ilan** (CEO)\nLet me start, and I'll let Rafael add some more color on this, Jim. So again, I think we said it along the Q4 when we had the chance that we are very pleased with the inventory position we have built. We are very proud of how we got there. It's across all of our technologies at the right level. So from a high level, the inventory we have right now, that's an asset that allows us to serve customers, especially in the current environment when we see a lot of real-time, just-in-time demand that turns business, as Mike mentioned before, is high, and it allows us to support customers at a high level. Rafael, any more color on how you want to manage inventory moving forward? No, that's it.\n\n**Rafael Lizardi** (CFO)\nAll right. Jim, do you have a follow-up?\n\n**James Schneider** (Senior Equity Research Analyst)\nYes. I mean, clearly, industrial and automotive are doing very well right now, and that plus data center are your main focus. Can we maybe talk about sort of the prospects of a return to growth or a turnaround in the personal electronics and communications end markets and maybe some of the product areas like Embedded Processing associated with those? Thank you.\n\n**Haviv Ilan** (CEO)\nYes. So just maybe on the personal electronics market, it did grow for the year, right? The business grew for the full year at around, I think, 7% for PE. And we just saw a little bit of a weak Q4, I would say, below typical seasonality. Maybe, Mike, you can add a little bit more color on what we've seen there in Q4.\n\n**Rafael Lizardi** (CFO)\nYeah. So if you look inside the sectors there, home theater, entertainment, TV declined the most. On the other end of the spectrum, mobile phones actually performed the best out of that group. So it varied within, probably not inconsistent with what you've probably seen around subsidies expiring in China for things like appliances and TV. So it's also, if you think about where personal electronics is and its timing of the cycle and where it is, it was one of the first to correct and also go through its recovery. So there's also a tougher compare than it probably has compared to some of the other end markets. All right. Well, thanks for the question, Jim. We'll move on to the next caller, please.\n\n**Operator**\nThank you. Our next question comes from the line of Harlan Sur with J.P. Morgan. Please proceed with your question.\n\n**Harlan Sur** (Executive Director, Equity Research)\nYeah, good afternoon. Thanks for taking my question. Good to see the strong double digits here of your growth in industrial. Haviv, last quarter, you talked about seeing some hesitation by customers in your industrial business, especially around manufacturing activity, things like factory automation, which is one of the larger segments of your industrial business. Are you still seeing that hesitancy, that sort of wait-and-see posture by customers, or is the order activity there starting to now pick up, especially among your China-based industrial customers?\n\n**Haviv Ilan** (CEO)\nYeah, it's a great question. I think from a high-level perspective, let's remember, industrial, and I look at the quarterly revenue, even if I go back to Q3, which was, I think, the highest industrial quarter for 2025, it was still about 25% from the previous peaks in year 2022, right? So I do believe that secular growth continues in industrial. We are looking at end equipment and generation to generation. We see just more content growth persistence. So I expect industrial to establish new highs in the future.\n\n**Haviv Ilan** (CEO)\nThis is why I talked in the last quarter about maybe a more moderate recovery, especially on the industrial side. And it did behave kind of seasonally in Q4. But as Mike alluded to, we are seeing a little bit of a pickup on orders, including in industrial. And I can't tell you why.\n\n**Haviv Ilan** (CEO)\nWe'll have to see how it plays out. But we have seen some noise in the last several months on some issues regarding a certain supplier, and sometimes we all know about the memory shortages. So I don't know what makes the customers order more. We'll just have to look and see. I do want to remind us all that earlier in 2025, I would say the first half of 2025 is so a pickup of industrial, and then it kind of calmed down. We want to see how sustainable this wake-up in orders is. And Mike, anything to add on the industrial side?\n\n**Rafael Lizardi** (CFO)\nI think you covered it well. I wouldn't add anything to that. Harlan, do you have a follow-up?\n\n**Harlan Sur** (Executive Director, Equity Research)\nYeah, thank you. Thanks for the answer to the last question. You guys have previously mentioned the team is ahead on the Sherman Fab build-outs and on track to complete the build-out of Fab 2 this year. Can you guys just give us an update here? And then on the potential $2 billion-$3 billion of gross CapEx this year, not sure if you guys are willing to articulate what that could be, but what is the size of the potential offsets, right? You've got ITC goes up 35%, and you still have $1.6 billion in direct funding or grants to capture. Just wondering if you can maybe quantify that capture this year?\n\n**Haviv Ilan** (CEO)\nYeah, I'll start regarding the execution on the build-up of the Fab, and I'll let Rafael comment on the rest of the topics, although we want to save something for the February call, Harlan. But first, on the Fab, yeah, we are very pleased about the execution in Sherman. It's actually ramped ahead of schedule, high yields. We also see with the new equipment that we have, really, the factory is more capable than we originally hoped. So a high level of throughput is being planned for this factory. So I'm very pleased with that execution, and that will help us support our customers for the next 5 and 10 years.\n\n**Haviv Ilan** (CEO)\nWe have a clean room in Sherman 1 that already has some production lines running. But remember, we also have the shell in Sherman 2, and we can build into this capacity if demand wants to be very strong.\n\n**Haviv Ilan** (CEO)\nI think we can be in a great position to support it. On the Lehi side, also on schedule, I'm very pleased with the transition or the insourcing progress from our foundry wafers into Lehi. That's mainly an embedded processing comment that tailwind will continue for us in 2026. I think I've mentioned in 2025, we've completed our 65-nanometer transition, and they are yielding at the same level as they used to in the foundries. And now we are busy with our 45-nanometer technology, mainly supporting our automotive radar business. That's also progressing well in Lehi. Rafael, anything on the ITC?\n\n**Rafael Lizardi** (CFO)\nSure. Yeah. No, so Harlan, you asked about five or six questions in one, but let me see if we can have you address a couple. Let me address the next few. First, on CapEx, we continue to expect CapEx for 2026 between $2 billion and $3 billion. So that's consistent with what we said before. On depreciation for 2026, let me give you a new number. We now expect $2.2-$2.4 billion on depreciation in 2026. And for 2027, we expect an upward pressure on that number, but at a slower rate of increase. So if you look at what we've increased the last few years, just it'll increase again, but slower. You asked about ITC and direct funding. Direct funding not changed. We expect up to $1.6 billion in several milestones as we reach those milestones.\n\n**Rafael Lizardi** (CFO)\nOn ITC investment tax credit, it is now 35% as of January 1st of 2026. Anything that we put in place, any CapEx we put in place, both equipment, building, clean room, in 2026, we get back 35% on the ITC credit. Great. Thanks.\n\n**Harlan Sur** (Executive Director, Equity Research)\nNo, thank you.\n\n**Rafael Lizardi** (CFO)\nWe'll move on to our next caller, please.\n\n**Operator**\nThank you. Our next question comes from the line of Vivek Arya with Bank of America Securities. Please proceed with your question.\n\n**Vivek Arya** (Managing Director and Senior Equity Research Analyst)\nThanks for taking my question. For the first one, Haviv, what do you think is driving this above-seasonal Q1? First of all, how much above-seasonal is it? And then what role is pricing playing in that? Because there is some discussion about price increases from some of your peers. So is TI raising prices in Q1? Is that part of what's driving? And how would you characterize this? How much above-seasonal is it, and what's kind of the main driver of that?\n\n**Haviv Ilan** (CEO)\nYeah. Let me just say for the second part of the question, the answer is no. It's not pricing related. Regarding the seasonality, no, it's more or less maybe a little bit above-seasonal, right? We usually see kind of a low single digit to flat quarter. I think we've guided what, 1.5?\n\n**Rafael Lizardi** (CFO)\nYeah, low single digit decline. It's been flat.\n\n**Haviv Ilan** (CEO)\nAnd again, the reason, Vivek, is the orders. We are just seeing growing orders, and it behaved the same through the quarter. I can't speculate on what, but I do know the industrial market, there needs to be a correction. And the second point is data center is now a bigger part of our business, so it starts to move the numbers for us, right? This is a market that is now growing every quarter, and it's not insignificant. So I think that also helps to change the guide compared to previous years. Mike, anything else on seasonality?\n\n**Rafael Lizardi** (CFO)\nNo, I think you called it out on seasonality. So Vivek, do you have a follow-up?\n\n**Vivek Arya** (Managing Director and Senior Equity Research Analyst)\nYes, thank you. For my second question, there's a lot of talk of higher memory pricing impacting demand for consumer electronics, PCs, phones, automotive. Have you seen it already? Have you heard that as a concern from your customers? And how are you thinking about the auto market right now? And just is memory pricing a headwind at all for your businesses that are exposed to consumers? Thank you.\n\n**Haviv Ilan** (CEO)\nHigh level, I would say that we haven't seen any implications, although then that would be a speculation on my side, but it could be that when customers are seeing some issues on the memory side, they want to replenish some of their inventory. That could be always the case. And Mike, I don't know if you've seen any examples or.\n\n**Rafael Lizardi** (CFO)\nYeah. What I would add, though, is, and we've heard about it, obviously, and I think not necessarily specifically that scenario, but it could be that, but also when a customer doesn't necessarily have everything they need to complete their bill of materials, when they finally have those parts they need, sometimes they'll come in very quickly and want to order parts. We did see some of that where customers come in at the last minute, want product shipped right away because they've just completed the bill of materials. It could be related to that or other different things. So with that, thank you, Vivek, for the questions. We will move on to the next caller, please.\n\n**Operator**\nThank you. Our next question comes from the line of Timothy Arcuri with UBS. Please proceed with your question.\n\n**Timothy Arcuri** (Managing Director)\nThanks a lot. Rafael, I wanted to also ask on CapEx and sort of how quickly it's going to fall off. I think you said this year $2 billion-$3 billion, but the math would then say you're going to kind of exit the year run rating something like $1.5 billion. So the question is then, can it go lower than that? Because I seem to recall a comment at our conference in December that it could go lower than 5% of revenue next year. So that would put it down to like $1 billion and that kind of being a floor. So can you kind of talk about that? Could it go that low next year?\n\n**Haviv Ilan** (CEO)\nTim, let me start with the second half, and then I'll let Rafael answer the first part. I made this comment because I was asked about maintenance CapEx. What is maintenance? We always have to spend money to fix equipment, to buy replacement parts, etc. So I characterize it as kind of mid-single digit % of revenue. That's always kind of a run rate you can think about. There is never zero in an IDM like TI. That was my point. This is when you don't have growth, right? Now, I'll let Rafael talk about CapEx beyond the maintenance.\n\n**Rafael Lizardi** (CFO)\nNo. So for this year, for 2026, $2 billion-$3 billion, and there's a range there. So as we go through the year, we'll update you on that number. And then beyond that, what we've said is it's about 1.2 times long-term revenue growth. So you take a number for revenue growth, you do 1.2 times, so 10%, you get to 12% CapEx intensity, but that's a gross number before ITC benefits. So once you get those ITC benefits, you essentially get back to 1-to-1 on that growth rate. So whatever growth rate you assume, you kind of get back to a net CapEx intensity of about the same level.\n\n**Mike Beckman** (Analyst)\nA follow-up, Tim?\n\n**Timothy Arcuri** (Managing Director)\nI do, Mike. Thanks. I also wanted to ask about loadings. It looks like gross margin is up like 50 basis points or something in March. That would kind of suggest that loadings are going up just a smidge. The bigger question is sort of, are you thinking about loadings that you want to keep inventory sort of in this 4.8 range, and you just want to match loadings with demand from here, or do you want to bring inventory down over time versus that 4.8 number? Thanks.\n\n**Rafael Lizardi** (CFO)\nAs I've said earlier, we're very pleased with inventory levels. That's good inventory on a number of fronts on the buffers that we have and the position that we have to support potential revenue growth. The same goes with capacity. We are well-positioned with capacity. So we'll adjust those loadings as needed depending on what we see for demand for the rest of the year.\n\n**Haviv Ilan** (CEO)\nAll right. Tim, thank you so much for the questions. We'll move on to our next caller.\n\n**Operator**\nThank you. Our next question comes from the line of Thomas O'Malley with Barclays. Please proceed with your question.\n\n**Thomas O'Malley** (Equity Research Director)\nHey, guys. Thanks for taking my question. Haviv, in your outlook for March, you talked about strength in data center, recovery in industrial continues, and bookings are improving, turns are good. There was no mention of auto there. You guys have said previously maybe the auto business is a little bit slower off the bottom than industrial. Any update on the auto business and how that trend of through the quarter and kind of your updated view there?\n\n**Haviv Ilan** (CEO)\nYeah. Great question. On the automotive market, I think in Q4 we were slightly down.\n\n**Rafael Lizardi** (CFO)\nDown low single digits.\n\n**Haviv Ilan** (CEO)\nLow single digits. We did see a strength in the automotive in the 2 half of this year, right, in Q3 and Q4. It's back to the level more or less of the peaks somewhere in 2023. This is an automotive peak. Remember, automotive was last into the cycle, right? If you go back all the way back to the COVID cycle, they're the last ones to peak. They peaked in Q3 2023. But I think what's happening in automotive, and it continues to happen, is secular growth continuing. So generation to generation, model to model, we just see more content per vehicle, even if it's an ICE, a combustion engine vehicle rather than EVs. Strength in China continued in Q4.\n\n**Haviv Ilan** (CEO)\nTypically in Q1, if I need to comment about Q1, typically Q1 is a quarter where, at least in China, we see always with Chinese New Year, we always see a seasonally down quarter. I expect that to be the same in Q1. But again, we've seen a single-digit drop versus the peak in automotive back to the same levels. I think secular growth continues into the foreseeable future, at least for the next 5 years.\n\n**Rafael Lizardi** (CFO)\nOkay. You have a follow-up, Tom?\n\n**Thomas O'Malley** (Equity Research Director)\nYeah. I just wanted to clarify a comment earlier. You mentioned that pricing didn't have anything to do with the above-seasonal margin. You talked more about these end market trends. Is that because you've raised pricing previously? You plan to in the future? The reason the question comes from your competitors are talking about an increase in pricing early in 2026 and being very clear about that. Do you guys feel like you don't want to do that, or is it just something you'd rather not comment on? Appreciate it.\n\n**Haviv Ilan** (CEO)\nNo, I think we've been clear along the year, and I'll just repeat it. And Mike, you can add a little bit more color. But we said that we expect the pricing look, we have 80,000 products. Prices always go up and down. But for the company, the overall price effect like for like in 2025, we expected it to be low single digits down. Now we finished 2025. It was exactly there. When you say low single digits, think about 2% or 3% down. That's my assumption for 2026.\n\n**Haviv Ilan** (CEO)\nThat's what we expect the market conditions to be. If anything changes with pricing, if we'll see, of course, TI will respond. But right now, that's our assumption moving forward. That's why I was so convinced that the Q1, I think we have a little sequential growth there. It's not due to pricing.\n\n**Haviv Ilan** (CEO)\nMike, anything to add there on the pricing side?\n\n**Mike Beckman** (Analyst)\nNo, I think you called it out. In that base case assumption of low single digit decline over time, we'll have to see what the market presents to us, but continue to expect.\n\n**Haviv Ilan** (CEO)\nDefinitely no step function planned in Q1. Actually, usually in Q1, pricing usually goes down a little bit because of yearly negotiations. That's usually what we see in Q1. Do you have a follow-up?\n\n**Mike Beckman** (Analyst)\nNo, that was a follow-up.\n\n**Haviv Ilan** (CEO)\nNo, that was a follow-up. Okay. Sorry about that.\n\n**Rafael Lizardi** (CFO)\nThanks, Tom, for the question.\n\n**Haviv Ilan** (CEO)\nThank you, John.\n\n**Rafael Lizardi** (CFO)\nMove on to our next caller.\n\n**Mike Beckman** (Analyst)\nOkay.\n\n**Operator**\nThank you. Our next question comes from the line of Joshua Buchalter with TD Cowen. Please proceed with your question.\n\n**Joshua Buchalter** (Managing Director - Senior Analyst, Semiconductors Equity Research)\nYeah. Thank you for taking my question. I wanted to drill the data center business a little bit more. Any details you can give us on the exposure across power embedded and maybe non-power analog parts? And 70% growth is a pretty big number. Any sort of handicap you're willing to give us on what that business could grow over the medium to long term? Thank you.\n\n**Haviv Ilan** (CEO)\nYes, definitely. I can take that. So again, data center has grown nicely, as you said, in 2025. If CapEx continues to be invested in data centers, we expect that growth to continue. In terms of our position, most of our business is based on the analog side. And there is also between power and signal chain, I would say it's kind of maybe a little bit more power, but both power and signal chain are very strong. In data center, we see a lot of opportunity, a lot of diversity of parts. I know most people like to talk about a specific socket. If you call it VRM or the V-core voltage regulator, that's always a very large socket.\n\n**Haviv Ilan** (CEO)\nBut if you look at the rack and you open it up, there are thousands of different parts, and many of them are analog and embedded parts, and TI plays across the board there. As I mentioned over the years, we have also invested in our technology to be able to support the higher power, call it rails. Think about the V-core. This is where a lot of the current going into an accelerated computer or a CPU comes from. And TI is building the technology in Sherman, Texas. This is where our BCD process is serving us very well there. That product is sampling, and we expect our opportunity in data center to further expand in the coming years.\n\n**Haviv Ilan** (CEO)\nTI plans to play across the different sockets in data center, and I see it as long as CapEx continues into this market. I see the opportunity as an attractive one.\n\n**Rafael Lizardi** (CFO)\nAll right. You have a follow-up, Josh?\n\n**Joshua Buchalter** (Managing Director - Senior Analyst, Semiconductors Equity Research)\nYeah. Thank you for all the color there. This has been picture-perfect and interesting several years for the analog industry. For a while, you've talked about the benefits of your U.S.-based analog and military capacity. Do you feel like we're at the point where the industry and you guys, from a cyclical standpoint, there's been a lot of noise on inventory, but are we at the point where you expect TI can get back into sort of the cash management? Everything's normal enough yet? Thank you.\n\n**Rafael Lizardi** (CFO)\nSo Josh, I think there was a little trouble on the line, but I'm going to repeat what I believe the question was, and then we'll answer it. So I think it was talking about the cycle and how it's been playing out. And with the capacity that we have in place, are we in a position to be able to get back to market share gains? And if you want to start with an answer, I can also answer it as well.\n\n**Haviv Ilan** (CEO)\nWas that the question?\n\n**Rafael Lizardi** (CFO)\nJosh?\n\n**Joshua Buchalter** (Managing Director - Senior Analyst, Semiconductors Equity Research)\nYeah.\n\n**Rafael Lizardi** (CFO)\nOkay.\n\n**Haviv Ilan** (CEO)\nOkay. Yeah. As we said, look, this cycle has recovered slowly. Just forget about TI. Just look at the overall unit trend. You can look at units without memory. You can look at ICs. It's been one of the slowest, if not the slowest recovery ever in our history at a time where I think more semis are used in our life. I mentioned the secular growth in automotive. We see that across many, many end equipments in industrial, across the board, just more content per system. And of course, the investment in data centers that are becoming more and more substantial, even for the analog and embedded portfolio that we have.\n\n**Haviv Ilan** (CEO)\nSo I do believe that there is going to be a point of time where all this capacity we've put in place and the inventory that we've positioned is going to serve us well.\n\n**Haviv Ilan** (CEO)\nWe have seen cases where it served us very well with an immediate response to customer needs, and our customers value that a lot. I believe there is more to do here. Let's see how the market wants to continue and develop. One thing is very clear to me. End equipments are being redesigned with more semis every day. It will continue to be the case in the future. This is why I'm continuing to stay very optimistic and encouraged by the investment we've made in the past several years.\n\n**Rafael Lizardi** (CFO)\nAll right. Thanks, Josh. Move on to our next caller, please.\n\n**Operator**\nThank you. Our next question comes from the line of William Stein with Truist. Please proceed with your question.\n\n**William Stein** (Managing Director and Senior Equity Research Analyst)\nGreat. Thank you for taking my questions. First, I'm hoping you can talk a little bit more about the strong bookings you referred to. Would you be able to disclose the book to bill to us? And maybe even more interesting, has the duration of your backlog changed at all in the quarter?\n\n**Rafael Lizardi** (CFO)\nSo maybe I'll take that one. We did see throughout the quarter, backlog did build. I think, first of all, it's important to remember that we transact most of our revenue direct with our customers, meaning that we don't sell through a channel. We do see things typically pretty real time. That's part of the reason you heard us talk about the fact that we have seen our turns business also exhibit strength over the last several quarters. I don't have a number specifically to provide you for what bookings did, but it is reflected in our guidance. I think going back to what Haviv said about where our end markets are, industrial is going through recovery. We saw that in Q4. You got a data center end market that is growing for, I think, consecutive Q7.\n\n**Rafael Lizardi** (CFO)\nThose are all part of what factor into how we think about our guidance. You have a follow-up, Will?\n\n**William Stein** (Managing Director and Senior Equity Research Analyst)\nYeah. I mean, I'll ask maybe the same question a little bit of a different way. Are you seeing, either based on customer willingness to place the orders or because of your own lead times to customers, have you seen an extension in the orders further out into the future?\n\n**Haviv Ilan** (CEO)\nThe short answer is yes, but again, not because of lead times. Our lead times are very competitive, unchanged. I think on average, below 13 weeks. Many of our parts are six weeks. Part of our ambition and objective as we prepare to the next cycle was to be able to maintain very competitive lead times across the cycle. So far, this cycle has not been very tough to meet, right? As it's been a slow recovery, but our lead times continue to stay very, very competitive.\n\n**Haviv Ilan** (CEO)\nProbably the lowest in the industry. And our inventory position allows us to support customers. So I don't think customers are placing, I mean, they are placing orders a little bit more forward, but they have the ability to change their opinion even within this quarter. This is what Mike mentioned before. Our terms are very friendly, are very customer-friendly.\n\n**Haviv Ilan** (CEO)\nWe want customers to be showing us their demand real time, and we are willing to carry this inventory, especially when it's so diverse and long-lived, to increase customer support. So that would be my high-level comment. Mike, anything else about what we see into the longevity of the inventory?\n\n**Rafael Lizardi** (CFO)\nWell, the inventory that we have in place has incredible longevity.\n\n**Haviv Ilan** (CEO)\nNo, no, but on the orders that was asked.\n\n**Rafael Lizardi** (CFO)\nYeah. I'd say that if you look at, does a customer need to put long-term backlog out in place when lead times are stable? They probably don't feel like they have to necessarily. So nothing to spike out that I would say. But what we have seen is a lot of customers wanting to come in, want product quickly. That has been something we've seen build over the past several quarters. All right. With that, we'll move on to our next caller.\n\n**Haviv Ilan** (CEO)\nOur last one.\n\n**Rafael Lizardi** (CFO)\nOur last one.\n\n**Haviv Ilan** (CEO)\nOur last one. Yeah.\n\n**Operator**\nThank you. Our last question comes from the line of Chris Caso with Wolfe Research. Please proceed with your question.\n\n**Chris Caso** (Managing Director and Senior Equity Research Analyst)\nYes. Thanks. Good evening. I guess the first question is a clarification of some of what you said about factory loadings. You did say that you'd adjust loadings according to what you saw with demand. Taking into consideration that you reduced those loadings more recently, are there any plans in place now to increase those loadings? What would you need to see in order to take those steps?\n\n**Rafael Lizardi** (CFO)\nWhat I would tell you is that if we had something significant changing like we did back in Q3, we would tell you. We are not making any disclosure right now on which way the loadings are going. It's nothing significant versus where we've been running in Q4. I'll just add that part of that is we have the ability to make those adjustments as we see things occur. That's part of the flexibility we have in our manufacturing to be able to do that. All right. Chris, do you have a follow-up?\n\n**Chris Caso** (Managing Director and Senior Equity Research Analyst)\nI do. And it's related to geographic revenue. You made some comments on China. Obviously, you have the New Year holiday that hits in the Q1. But if we look at the different regions, how does that stack up against what you would expect for normal seasonality in each one of those regions in the Q1?\n\n**Haviv Ilan** (CEO)\nYeah. In general, I think we haven't seen anything specific on the only comment I've made, Chris, before was that typically Q1 in China for automotive is lower just because of Chinese New Year. But I think from where the backlog comes from, it's been pretty even, right, across the geographies, Mike?\n\n**Mike Beckman** (Analyst)\nYeah. And then maybe I'll just talk about last quarter what we saw. And we don't have a guidance by regions for the top level. But China came in right about on a sequential basis, pretty much in line with what we saw at the top level, down about 7%. On a year-on-year for Q4, it was up about 16%. So didn't see something on a sequential basis that stood out very differently there compared to the overall top-level results.\n\n**Haviv Ilan** (CEO)\nI want to make maybe before we let Mike finish the call, I want to make one more comment on the orders and everything. I just want to remind us all that TI has invested in capacity and in inventory over the last 3 or 4 years to be exactly ready for this type of environment, right? We've seen a lot of real-time demand coming in in Q4, which we were able to support. We're seeing a little bit of strengthening in the orders right now in Q1. And we'll see how long-lived it will be. The market has been jittery in the last 12 months, sorry. And we'll just have to see how it plays out. This is also related to Rafael's comment about loading.\n\n**Haviv Ilan** (CEO)\nWe have the knobs to turn as needed, and we have the inventory to allow us time to adjust our loading, for example, as we go. So we are in a very good position as we come into 2026. We worked very hard to get here, and I'm very proud of our execution. We'll be ready for any scenario that the market wants to present to us. I'll turn it over to you, Mike.\n\n**Mike Beckman** (Analyst)\nYeah. Thank you, Haviv. And thank you all of you for joining us today. Again, as we mentioned earlier, we look forward to sharing with you our capital management call on Tuesday, February 24th at 10:00 A.M. Central Time. A replay of this call will be available shortly on our website. And with that, have a great evening.\n\n**Operator**\nThank you. This concludes today's conference, and you may disconnect your lines at this time. Thank you for your participation.",
      "fetched_at": "2026-02-04T15:45:53.198Z"
    },
    {
      "ticker": "TXN",
      "title": "Texas Instruments Incorporated (TXN) Q3 FY2025 earnings call transcript",
      "published_date": "Oct 21, 2025, 4:30 PM EDT",
      "fiscal_year": "2025",
      "quarter": "Q3",
      "url": "https://finance.yahoo.com/quote/TXN/earnings/TXN-Q3-2025-earnings_call-365534.html",
      "content": "**Mike Beckman** (Head of Investor Relations)\nWelcome to the Texas Instruments Third Quarter 2025 Earnings Conference call. I'm Mike Beckman, Head of Investor Relations, and I'm joined by our Chief Executive Officer, Haviv Ilan, and our Chief Financial Officer, Rafael Lizardi. For any of you who missed the release, you can find it on our website at ti.com/ir. This call is being broadcast live over the web and can be accessed through our website. In addition, today's call is being recorded and will be available via replay on our website. This call will include forward-looking statements that involve risks and uncertainties that could cause TI's results to differ materially from management's current expectations. We encourage you to review the notice regarding forward-looking statements contained in the earnings release published today, as well as TI's most recent SEC filings for a more complete description.\n\n**Mike Beckman** (Head of Investor Relations)\nYou likely saw last week we announced that the Board of Directors has elected Haviv Ilan Chairman of the Board beginning January 2026. Haviv succeeds Richard Templeton, who will retire as Chairman after a 45-year career with TI. I'm sure you will join me in congratulating them both. Today, we'll provide the following updates. First, Haviv will start with a quick overview of the quarter. Next, he'll provide insight into third quarter revenue results with some details on what we are seeing with respect to our end markets. Lastly, Rafael will cover the financial results, give an update on capital management, as well as share the guidance for fourth quarter 2025. With that, let me turn it over to Haviv.\n\n**Haviv Ilan** (CEO)\nThanks, Mike. I'll start with a quick overview of the third quarter. Revenue came in about as expected at $4.7 billion, an increase of 7% sequentially, and an increase of 14% year over year. Analog and Embedded Processing both grew year over year and sequentially. Analog revenue grew 16% year over year, and Embedded Processing grew 9%. Our other segment grew 11% from the year-ago quarter. Let me provide a few comments about the current market environment. The overall semiconductor market recovery is continuing, though at a slower pace than prior upturns, likely related to the broader macroeconomic dynamics and overall uncertainty. That said, customer inventories remain at low levels, and their inventory depletion appears to be behind us. We are well positioned with capacity and inventory and have flexibility to support a range of scenarios. Now, I'll share some additional insights into third quarter revenue by end market.\n\n**Haviv Ilan** (CEO)\nFirst, the industrial market increased about 25% year over year and was up low single digits sequentially, following a strong result in the second quarter. The automotive market increased upper single digits year over year and around 10% sequentially, with growth across all regions. Personal electronics grew low single digits year over year and grew upper single digits sequentially. Enterprise systems grew about 35% year over year and grew about 20% sequentially. Lastly, communications equipment grew about 45% year over year and was up about 10% sequentially. With that, let me turn it over to Rafael to review profitability and capital management.\n\n**Rafael Lizardi** (Senior VP and CFO)\nThanks, Haviv, and good afternoon, everyone. As Haviv mentioned, third quarter revenue was $4.7 billion. Gross profit in the quarter was $2.7 billion, or 57% of revenue. Sequentially, gross profit margin decreased 50 basis points. Operating expenses in the quarter were $975 million, up 6% from a year ago and about as expected. On a trailing 12-month basis, operating expenses were $3.9 billion, or 23% of revenue. Operating profit was $1.7 billion in the quarter, or 35% of revenue, and was up 7% from the year-ago quarter. Net income in the quarter was $1.4 billion, or $1.48 per share. EPS included a $0.10 reduction not in our original guidance. This includes $0.08 of restructuring charges related to efforts to drive operational efficiencies to support our long-term strategy, including the planned closures of our last 150mm fabs. Let me now comment on our capital management results, starting with our cash generation.\n\n**Rafael Lizardi** (Senior VP and CFO)\nCash flow from operations was $2.2 billion in the quarter and $6.9 billion on a trailing 12-month basis. Capital expenditures were $1.2 billion in the quarter and $4.8 billion over the last 12 months. Free cash flow on a trailing 12-month basis was $2.4 billion. This includes $637 million of CHIPS Act incentives, including a $75 million payment received in the third quarter related to the direct funding agreement. In the quarter, we paid $1.2 billion in dividends and repurchased $119 million of our stock. In September, we announced we would increase our dividend by 4%, marking our 22nd consecutive year of dividend increases. This reflects our continued commitment to return free cash flow to our owners over time. In total, we returned $6.6 billion to our owners in the past 12 months.\n\n**Rafael Lizardi** (Senior VP and CFO)\nOur balance sheet remains strong with $5.2 billion of cash and short-term investments at the end of the third quarter. Total debt outstanding is $14 billion, with a weighted average coupon of 4%. Inventory at the end of the quarter was $4.8 billion, up $17 million from the prior quarter, and days were 215, down 16 days sequentially. We have executed well on building an inventory position, which we believe will allow us to consistently deliver high levels of customer service. Turning to our outlook for the fourth quarter, we expect Texas Instruments' revenue in the range of $4.22-$4.58 billion, and EPS to be in the range of $1.13 to $1.39. Our fourth quarter outlook includes changes related to the new U.S. tax legislation and now assumes an effective tax rate of about 13%.\n\n**Rafael Lizardi** (Senior VP and CFO)\nIn addition, we expect our effective tax rate in 2026 to be about 13%-14%. In closing, we will stay focused in the areas that add value in the long term. We continue to invest in our competitive advantages, which are manufacturing and technology, a broad product portfolio, reach of our channels, and diverse and long-lived positions. We will continue to strengthen these advantages through disciplined capital allocation and by focusing on the best opportunities, which we believe will enable us to continue to deliver free cash flow per share growth over the long term. With that, let me turn it back to Mike.\n\n**Mike Beckman** (Head of Investor Relations)\nThanks, Rafael. Operator, you can now open the line for questions. In order to provide as many of you as possible an opportunity to ask your questions, please limit yourself to a single question.After our response, we'll provide you an opportunity for an additional follow-up. Operator?\n\n**Operator**\nThank you. We will now be conducting a question and answer session. If you would like to ask a question, please press star one on your telephone keypad. A confirmation tone will indicate your line is in the question queue. You may press star two to remove yourself from the queue. For participants using speaker equipment, it may be necessary to pick up the handset before pressing the star keys. One moment, please, while we pull for questions. Our first question comes from the line of Timothy Arcuri with UBS. Please proceed with your question.\n\n**Timothy Arcuri** (Managing Director)\nThanks a lot. Haviv, I'm wondering if you can talk about the linearity of bookings through the quarter. I know in the June quarter things had softened throughout the quarter, but this quarter it seemed like things got a little better as you moved through the quarter. Can you talk about that as you head into, you know, CQ4?\n\n**Haviv Ilan** (CEO)\nYes, I'll give some high-level comments, and Mike, please add anything with more details. This quarter kind of came in as expected, and nothing, not similar to what we saw in Q2. It was a little bit hectic with the tensions related to trade and tariffs. We saw a lot of change through the quarter. This was more of an as-expected quarter through the quarter in July, August, and September. Mike, anything to add on that one?\n\n**Mike Beckman** (Head of Investor Relations)\nWe had talked about the turns portion of the business had kind of started out strong at the beginning of second and had moderated near the end. We did not see that same behavior again in third. It really, that portion kind of followed what you would expect to see in a kind of a cyclical recovery that we saw in third. Do you have a follow-up?\n\n**Timothy Arcuri** (Managing Director)\nI do, yeah. Rafael, I wanted to ask about loadings that are assumed in the fourth quarter. I know you usually come in at the high end, but if we assume the midpoint of the guidance, and I assume that depreciation grows like it has the past few quarters, gross margin, if I exclude the depreciation, so on a cash basis, it is down like sub 67%, so it has not been that low in like 10 years. You are already sitting on a lot of inventory. I do not think you want to build more. What is the path to get cash margins on a better path here? It is below where it was seven to eight quarters ago when revenue was $600 million-$700 million, lower than where it is today. Thanks.\n\n**Haviv Ilan** (CEO)\nLet me try to answer that. There were several questions there, so let me see if I can hit most of them. First, your question is maybe fundamentally on inventory, so let me start there. We're very pleased with our current inventory position. That objective for inventory is to support customers, to keep lead times short, and have just great customer delivery, customer satisfaction. That we are achieving, and we're pleased with where the inventory is. Now, given the midpoint of our revenue, in order to continue to maintain those levels of inventory and where we want to be on inventory, we're adjusting the loadings down into fourth quarter. We did some of that in third quarter, and we're going to do some more into fourth quarter.\n\n**Haviv Ilan** (CEO)\nAs we do that, and as you pointed out, when you look at fourth quarter, you have lower revenue, you have higher depreciation, you have the hit on the lower loadings. That's how you get to the EPS range that we have listed.\n\n**Rafael Lizardi** (Senior VP and CFO)\nAll right, we'll move on to the next caller.\n\n**Operator**\nThank you. Our next question comes from the line of Chris Danley with Citibank. Please proceed with your question.\n\n**Christopher Danely** (Managing Director and Senior Semiconductor Equity Research Analyst)\nThanks, guys, and thanks for pronouncing my last name correctly, Operator. Hey, guys, could you just talk a little bit more about the restructuring? Maybe what was the catalyst for it, and then any benefits to expenses, either gross margins or OpEx going forward?\n\n**Haviv Ilan** (CEO)\nAt a very high level, it's related to actually two things. First, I think we announced several years back that we are winding down our six-inch fabs, our 150mm fabs. We have one in Sherman, the old site, the old fab in the site, and one in Dallas. Both of them have actually started the last wafer this month, and we will see a gradual reduction in cost related to these two factories through, I think, the first half of 2026. We're just taking the hit on the restructuring costs in Q3 as we had predictability, and the amount was clear to us in terms of the size of it. Regarding the other part of it, this is an ongoing work that we're doing. We always look at the efficiency gains.\n\n**Haviv Ilan** (CEO)\nWe had some areas where we felt that our R&D machine is not generating the returns that we would expect on the long term, and we decided to consolidate some sites. That is also going to take place in the next couple of quarters for the company.\n\n**Mike Beckman** (Head of Investor Relations)\nDo you have a follow-up, Chris? Rafael, is there anything that, just on the OpEx side, that you want to mention, Rafael, on this one?\n\n**Rafael Lizardi** (Senior VP and CFO)\nNo, I would just say, tactically, for fourth quarter, expect OpEx to be about flat to third quarter, and that's, as Haviv alluded to, the benefits from the restructuring. They don't all come in immediately, so it just takes a little while for that to happen, and there will be benefits in both COR as well as OpEx.\n\n**Mike Beckman** (Head of Investor Relations)\nDo you have a follow-up, Chris?\n\n**Christopher Danely** (Managing Director and Senior Semiconductor Equity Research Analyst)\nYeah, hey, thanks, Mike. I think you guys said industrial was up low single digits sequentially, and auto was up, I think it was high singles or something like that sequentially. That sounds like a bit of a change from what you said last quarter and intraquarter. Is that true? Why do you think industrial's slowing down and auto's a little better than expected?\n\n**Haviv Ilan** (CEO)\nLet me take a first, Chris, as you remember, we only guide at the company level. We don't guide by market. We did say, I think, on the industrial side that we had a very strong Q2, so kind of indicated that we assume Q3 will taper off, right? Actually, to me, that low single digit growth sequentially was good. I'm pleased with the result. Remember, very strong growth in the second quarter. On the automotive side, I would say, look, automotive was kind of sequentially up and down and up and down, but all in a very similar level, right? The recovery in automotive, at least for TI, was very, the trough was shallow, and now, you know, it's kind of back to where it used to be. I would not read too much into it. You know, it came in more or less as expected, and I think, Mike, it grew across the regions in automotive?\n\n**Mike Beckman** (Head of Investor Relations)\nIt did, yeah. It grew sequentially across all the regions.\n\n**Haviv Ilan** (CEO)\nAll the regions. No surprises there, Chris, from our perspective at least.\n\n**Mike Beckman** (Head of Investor Relations)\nYeah, I'd just add within industrial, a second to third transition usually actually down. If you just look across the averages over history, it's actually down a little bit. Up low single digit is actually not an unusual result if you're in a recovery. All right, I'll move on to the next caller. Thanks, Chris.\n\n**Operator**\nThank you. Our next question comes from the line of Joe Moore with Morgan Stanley. Please proceed with your question.\n\n**Joseph Moore** (Semiconductor Industry Analyst)\nGreat, thank you. I guess I continue to get a lot of questions about pricing for you guys. Anything unusual happening there? I think you alluded to kind of an ongoing learning curve, kind of price declines, but anything happening where any markets are sort of different on the pricing side?\n\n**Haviv Ilan** (CEO)\nShort answer is no. For the year, I think our assumption coming into the year was kind of a low single digit decline, like for like on the pricing side. I think that's how we are trending here today. I expect the year to end at that low single digit price reduction in 2025.\n\n**Mike Beckman** (Head of Investor Relations)\nDo you have a follow-up, Joe?\n\n**Joseph Moore** (Semiconductor Industry Analyst)\nYeah, and just your any comment on lead times? Are you still in the range that you've talked about? Any areas where lead times are getting longer?\n\n**Mike Beckman** (Head of Investor Relations)\nI'd say across the portfolio, very consistent with what it was the quarter prior. Not much of a change in that. Our lead times right now are competitive. We worked very hard to make sure that our inventory position could allow us to do that. We're happy with the lead time position that we have. Not a lot of change on a sequential basis.\n\n**Haviv Ilan** (CEO)\nJoe, just a little bit more color on the lead times. I think, you know, we always talk about inventory part by part, the technology by technology, package type by package type. I think, as Rafael mentioned, the third quarter was a very good quarter for us because we've reached our milestone of, you know, that's where we need to be. We had a few areas where we were still catching up. That's now behind us. We are now prepared for any scenario. As Mike said, we are serving our customers through, you know, a grotesque of meetings with no issues. Very strong support from TI. We are hitting our metrics and exceeding them even. Customer service is continuing to be very high for the company, which explains some of the low visibility we are seeing in terms of turns business, as Mike mentioned before.\n\n**Mike Beckman** (Head of Investor Relations)\nAll right, thanks, Joe.\n\n**Joseph Moore** (Semiconductor Industry Analyst)\nThank you.\n\n**Mike Beckman** (Head of Investor Relations)\nMove on to our next caller, please.\n\n**Operator**\nThank you. Our next question comes from the line of Stacy Rasgon with Bernstein Research. Please proceed with your question.\n\n**Stacy Rasgon** (Managing Director and Senior Analyst)\nHi guys, thanks for taking my questions. For my first one, I just wanted to dial in on the gross margin expectations explicitly for Q4. You talked about loadings and everything else. You talked about the tax rate coming up. It seems to be you're guiding it down, I don't know, maybe 250 basis points, something in the ballpark of 55%. I just want to know, is that the right number to think about? Given that baseline, how much cost should I be expecting comes out of the model due to the 150mm fab closures in the first half?\n\n**Haviv Ilan** (CEO)\nYeah, Stacy, high level, you're in the ballpark. We let the EPS guide speak for itself, but you have lower revenue. You fall that through. You have increases in depreciation. For the year, it's $1.8-$2 billion. It should be an increase second to third, similar to third to fourth, should be similar to second to third. You do that and you have higher levels of depreciation. As Haviv said, we're very pleased with our inventory levels. They're doing what they're supposed to. We are moderating those wafer starts, those loadings. As those come down, we get the impact on gross margins. Let me just also step back and stress that we run the company with a mindset of a long-term owner and the objective to grow free cash flow per share over the long term. That is gaining momentum.\n\n**Haviv Ilan** (CEO)\nOn a trailing 12-month basis, our free cash flow is up 65% from last year. It has the potential to accelerate and grow even faster next year, as we have outlined in our framework back in the capital management.\n\n**Mike Beckman** (Head of Investor Relations)\nDo you have a follow-up, Stacy?\n\n**Stacy Rasgon** (Managing Director and Senior Analyst)\nI do, thanks. Your Q4 guide is down about 7% sequentially off the slightly higher than expected Q3 base. My message is that down 7% or so is pretty much seasonal, like on a pre-COVID basis. I know post-COVID seasonality has been all over the place, all over the place. Pre-COVID, it typically was down, call it like high single digits. You seem to be on a seasonal trend now, and maybe that's consistent with customers no longer draining inventory. How do I think about normal seasonality, like pre-COVID levels for Q1? My feeling is that it's typically down sequentially. What is, I'm not asking you to guide it, but just what is normal for Q1, at least on a pre-COVID basis, if we're running more of a seasonal pattern from here?\n\n**Haviv Ilan** (CEO)\nStacy, before we talk about Q1, let me just add a little bit more color on Q4. As you said, I look at it as a roughly seasonal guide, as you said. The reason is there is a recovery, but it's a very moderate pace, right? That's what guides our, call it, seasonal view into Q4. I also mentioned, that's what we're seeing. This is part of the way we do business these days. More customers are direct, more customers are on consignment. Customer inventories are low, and I think they've gone through this depletion process. That's behind us. We are going to be just seeing it real time as it comes, and hence our guidance. Now, regarding Q1, Mike, you can comment if you want.\n\n**Mike Beckman** (Head of Investor Relations)\nYeah, it's not unusual to see fourth to first, just historically. This is not a guide for what we're going to see, but what historically is done is typically down just slightly sequentially. It's not unusual to see. All right, Stacy, thank you for the questions. Move on to the next caller, please.\n\n**Operator**\nThank you. Our next question comes from the line of Ross Seymour with Deutsche Bank. Please proceed with your question.\n\n**Ross Seymour** (Managing Director and Senior Analyst)\nHi guys, thanks for asking a couple of questions. Haviv, congratulations on the Chairman role as well. I wanted to go back to the gross margin side. Rafael, you talked about all the reasons it was going to drop and the rough range from the prior question. Just wondered, how does that flow through into next year from the perspective of depreciation? Is there any change to the range you gave before? If you're flat to slightly down in the first quarter, does that flow through in the utilization dynamic? Does that have to flow through inventory, etc., in leading to a headwind as we go into the first half of next year as well?\n\n**Haviv Ilan** (CEO)\nYeah, a couple of things. First, on depreciation, no change to our guidance. $1.8 to $2 billion for this year. You come back into the fourth quarter, as I answered to Stacy a second ago. For next year, we've said $2.3-$2.7 billion, but to be on the lower end of that range. That should give you enough to model that. Beyond that, we'll forecast one quarter at a time. It's going to depend on revenue and demand. By lowering the loadings now, it puts us in a good position to have the level of inventory that we think is required. I think that's going to put us in a good position going into 2026.\n\n**Haviv Ilan** (CEO)\nRoss, the only color I'll add, and Rafael touched upon it, we do think, and that's the way we run the place on free cash flow per share, we have made excellent progress on ramping and qualifying our Sherman new site. We are winding down two 150mm fabs. Our investments in Utah, in Lehi 2, are continuing as planned. Our eyes are on free cash flow per share growth, and start with free cash flow, right? When you get to the right level of inventory, when you execute on your expansion plans, I think we are now well prepared for any scenario. As you remember, we have framed 2026 not on free cash flow per share, but on free cash flow. That's where our sight is on. Okay?\n\n**Mike Beckman** (Head of Investor Relations)\nDo you have a follow-up, Ross?\n\n**Ross Seymour** (Managing Director and Senior Analyst)\nYeah, I do. I just wanted to also talk about margins, but on the OpEx side, clarification first, then the question. The clarification for Rafael, you talked about OpEx being flat in the fourth quarter. I assume that's excluding the charge in the third quarter. As you look forward, in the past, you've had years that OpEx is flat year-over-year. You just took some restructuring. You're consolidating R&D sites, you said. How should we think just generally about OpEx, whether it's relative to revenue or absolute levels? Do you plan to grow at low single digits? Is it something higher than that, like this year? Any sort of color about how you're approaching OpEx as you look into next year?\n\n**Rafael Lizardi** (Senior VP and CFO)\nYeah, so a couple of things. First, on the first part of your question, when I think about OpEx, I do not include restructuring in that. That is a separate line. So that $85 million, of course, that's not going to repeat. Put that out. The OpEx, the regular OpEx, I expect it to be about flat third to fourth quarter. Beyond that, on R&D and SG&A strategy, more broadly speaking, we have a disciplined process of allocating R&D and SG&A to the best opportunities and the best investments. That's both primarily on the R&D space, but even in the SG&A strategies such as ti.com to strengthen our competitive advantages. On the R&D side, Ross, today I'd like to talk about, and we are seeing, the data center market becoming a larger opportunity over the last several years, and I think that continues into the future.\n\n**Rafael Lizardi** (Senior VP and CFO)\nWhen I think about industrial, automotive, data center, the amount of opportunity to expand our portfolio is high. We have a lot of good investments to make there, and we plan to continue to grow our portfolio in these three areas. We care about all markets, all five markets, but these three will have a really long-term growth opportunity ahead of them, and Texas Instruments can do more to sell these markets. I expect to see that in 2026 and beyond.\n\n**Mike Beckman** (Head of Investor Relations)\nThank you, Ross. We'll move on to our next caller, please.\n\n**Operator**\nThank you. Our next question comes from the line of James Snyder with Goldman Sachs. Please proceed with your question.\n\n**James Snyder** (Equity Research Analyst)\nGood afternoon. Thanks for taking my question. I was wondering if you could maybe give us a little bit of color in China and what you're seeing there. I think last quarter you called out some pulling activity. I'm curious whether you saw a reversion there in terms of orders or whether orders ended up better than you expected, and sort of what you're seeing on a real-time basis heading into Q4.\n\n**Haviv Ilan** (CEO)\nHigh level in Q3. China came back to normal, and I expect that to continue into Q4. Mike, anything specific on the China business in Q3?\n\n**Mike Beckman** (Head of Investor Relations)\nYeah, maybe add, as we probably talked about last quarter, you know, there was a potential for pull forward in second. If you look at industrial in China, you know, that was one of the only markets that didn't grow sequentially. If you look on a year-over-year, still up about 40%. I think you're looking at where it essentially didn't repeat. We didn't see that same level of pull forward, at least evidence of it. I can't confirm that with certainty, but it doesn't appear that that same pull forward trend repeated itself in third, just based on that. We'll have to see how it plays through. That's the only thing I would add.\n\n**Haviv Ilan** (CEO)\nOkay. Nothing special to report there, James, okay?\n\n**Mike Beckman** (Head of Investor Relations)\nDo you have a follow-up?\n\n**James Snyder** (Equity Research Analyst)\nYes, please. I know when you get to the beginning of next year, you'll give us an update on the Capital Management Day, but I'm just sort of curious, as we sit here today, in light of the slower recovery you seem to be talking about right now, or you're seeing right now, can you maybe give us a sense about whether you expect that your CapEx for next year will be toward the lower end of the range you outlined at the beginning of this year?\n\n**Haviv Ilan** (CEO)\nYeah, we gave you the framework, James, and again, we gave you a $20-$26 billion framework there, but of course, it can be higher or lower. I think the probability of being lower is probably more probable than higher than $26 billion, right? At the end of the day, we'll see what it wants to do. This recovery has been moderate. We haven't seen even the market goes back to trend line, not to mention going above trend line and customers building inventory. We just haven't seen it. It could still happen in this cycle. It could not. The good news from a Texas Instruments perspective is that we are ready for any scenario. If it wants to grow quickly, we will be able to serve it.\n\n**Haviv Ilan** (CEO)\nIf it wants to continue in that moderate recovery, of course, we will be at the lower end of the CapEx and free cash flow will grow, as indicated in our framework that we provided in capital management. As February comes in, we'll have some more information. We'll have Q4 behind us, and we'll provide more color on that, James.\n\n**Rafael Lizardi** (Senior VP and CFO)\nThanks, Jim.\n\n**James Snyder** (Equity Research Analyst)\nThank you.\n\n**Mike Beckman** (Head of Investor Relations)\nMove on to the next caller, please.\n\n**Operator**\nThank you. Our next question comes from the line of Christopher Caso with Wolfe Research. Please proceed with your question.\n\n**Christopher Caso** (Managing Director and Senior Equity Analyst)\nYes, thank you. I guess first question is with regard to general conditions and the recovery. I think the words you said were that the recovery was continuing at a slower pace. Can you talk about what's changed in your mind since the last earnings call? I think earlier in the year, you know, perhaps you were more optimistic that, you know, this would follow lines of a more typical recovery, which would be stronger by now. What sort of changed in the part of your customers and such, as compared to the last earnings call?\n\n**Haviv Ilan** (CEO)\nYeah, it's fair. I think that's related more to the first half of Q2. I think Mike mentioned that, and we acknowledged that in the July call, that it had a very rapid start. We were thinking that we were sitting on a sharp slope. I think time taught us that it is not, I would not say it's just a moderate, okay? We are seeing the market getting back towards trend line, but still below trend line. You know, that's one of the more moderate recoveries that we've seen in the history. I think you have to go back many years to see similar behavior. It could still change.\n\n**Haviv Ilan** (CEO)\nI don't have, I cannot prove it, but I do see when I talk with customers, especially on the industrial side, and if you think about investing, building new factories, putting more CapEx, there is a bit of a wait-and-see mode with our customers. They're just hesitant to have clarity on what exactly are the final rules. Should I put my factory in this country or in another one? Even in our domain, think about it. The rules are still not finalized in terms of the rates of tariffs, for example. Will they be or not? I do see this hesitancy at the customer base, and I see it mainly on the industrial side. On the automotive side, the secular growth is continuing. Just constant growth allows that market to go back to the level it picked before. The outlier is data center.\n\n**Haviv Ilan** (CEO)\nData center, again, not a large part of our revenue, but growing more than 50% for Texas Instruments year to date. That's where we see strong investment. That's the only place where we see a strong growth, where customers are investing and moving fast, and Texas Instruments wants to do more there. We are investing as well, but again, a smaller part of our revenue.\n\n**Mike Beckman** (Head of Investor Relations)\nDo you have a follow-up, Chris?\n\n**Christopher Caso** (Managing Director and Senior Equity Analyst)\nI do. Thank you. As a follow-up, if you could take us through your thought process with regard to the reduction in wafer starts and utilization. Is it a function of what you just said, that typically the recovery was stronger at this point, and it's not there, so you need to moderate a bit? You could take us through the thought process of that, and for how long you would keep the loadings at a lower level, and what would you need to see to start raising those loadings again?\n\n**Haviv Ilan** (CEO)\nYeah, so it is, you can think of it fairly mechanically, frankly. Think of revenue was $4.7 billion and change in third quarter. Now the midpoint is $4.4 billion. If you run the factories the same way you were before with lower revenue, you just grow inventory and keep on growing inventory. We only grew $17 million in third quarter, so it was essentially flat, but at a lower revenue, same loadings, you would grow inventory. You need to moderate that in order to keep inventory either flat or maybe slightly down as we go into fourth quarter. The second part of your question, it's going to depend on revenue, right?\n\n**Haviv Ilan** (CEO)\nThe higher the revenue could be over the next 6, 9, 12 months going into 2026, then the faster we could increase the loadings back up, or we may leave them at that level if the revenue is more moderate. It's just going to depend on how revenue comes in.\n\n**Mike Beckman** (Head of Investor Relations)\nYeah, thanks, Chris. Moving on to the next caller, please.\n\n**Operator**\nThank you. Our next question comes from the line of Blaine Curtis with Jefferies. Please proceed with your question.\n\n**Blaine Curtis** (Managing Director and Senior Equity Research Analyst)\nHey, thanks, guys. I added two questions. I just wanted to follow back up on that loading comment. You said that you would keep it kind of flat in December. I guess, you know, you're not going to guide to March, but I'm just kind of curious. You've been growing, you know, inventory for many, many quarters. Is this now the way to think about it? You'll keep it flat until you see a more robust recovery in the top line?\n\n**Haviv Ilan** (CEO)\nYeah, I think you're referring to flat inventory levels, and I said flat to down. We are comfortable with the $4.8 billion that we have of inventory that has very low obsolescence level. We hardly ever scrap any of our inventory because it lasts a long time, both in finished goods and in chips, in chip form, in die bank, and in finished goods. We feel very comfortable with that level, but it's about sustainability, right? If you just keep on growing, it's just not a good allocation of your cash, of your capital for owners. It's better to moderate the loadings. That way you're flat to down in the current environment, and we feel that we can do that and continue to have very high levels of customer service and metrics supporting our customers.\n\n**Mike Beckman** (Head of Investor Relations)\nDo you have a follow-up?\n\n**Blaine Curtis** (Managing Director and Senior Equity Research Analyst)\nThanks. I guess just a follow-up. In terms of the lower loading in the December quarter, is that all reflected in the gross margin guidance, or does that kind of spill into March? Obviously, like I said, you're not going to guide to March, but just kind of thinking about the moving pieces, is there any kind of part of the December cut that spills into March in addition to whatever March is?\n\n**Haviv Ilan** (CEO)\nYeah, we're not guiding to March, as you pointed out, but the lower loadings that I'm talking about, some of that happened in third quarter. There was a step down in third quarter, second to third, and there's another step down into fourth. That is, of course, embedded in the EPS guidance that we just gave.\n\n**Mike Beckman** (Head of Investor Relations)\nAll right, thanks, Blaine. Move on to our next caller, please.\n\n**Operator**\nThank you. Our next question comes from the line of Torres Vanberg with Stifel. Please proceed with your question.\n\n**Torres Vanberg** (Equity Research Analyst)\nYes, thank you, and congratulations, Haviv. My first question is on the enterprise data and communications business. I get the enterprise data. That's obviously tied to data center, but I'm a little bit surprised to see the communications equipment being that strong. Is that also tied to data center and perhaps, you know, some of these cluster buildouts, or is there anything else going on there?\n\n**Haviv Ilan** (CEO)\nOh, yes, I think it's a great question, and that's the reason I think we indicated before, and we'll provide more color in Q1. We are planning to break out the data center as a market for the company. Right now, our data center sits mainly in enterprise, in that computer and equipment, but also on the comms side. We have there the wire, the switches, and the wired comms in a rack and rack-to-rack. We also have the optical module business there in comms. They are really part of the data center market, if you will. The other part of the data center market for Texas Instruments sits today in industrial. Think about all this high-voltage power delivery, the PSUs, and all that. There is also a lot of architecture change there going to high-voltage DC and all that.\n\n**Haviv Ilan** (CEO)\nI think it's time that Texas Instruments calls out a data center at the top. We'll provide more color in Q1, but just for the year, and we are in the midst of collecting all the bits and pieces. Texas Instruments is running more or less at a $1.2 billion run rate in 2025. That's what we're seeing right now. We'll provide more specifics in Q1. It's also our fastest growing market. It's growing year to date above 50% for the first three quarters. I see customers continuing to invest, as I alluded before. That's the one market that we see capex going into, and I'm not seeing any slowdown there, at least in the foreseeable future, related to our visibility at least. Okay?\n\n**Mike Beckman** (Head of Investor Relations)\nDo you have a follow-up, Tory?\n\n**Torres Vanberg** (Equity Research Analyst)\nYes, that was very helpful. Just a quick follow-up. I know you typically don't guide by markets in Q4, but any sort of outliers one way or the other by your end markets into the December quarter, please? I'd just say there's no specific outliers to call out. As you look across our businesses, some of our end markets have higher sensitivity to seasonality than others, personal electronics being probably the most sensitive to it. Overall, there's nothing specific that I'd call out about fourth quarter's transition. Tory, thank you for the question. I'll hand it back over to Haviv to wrap this up.\n\n**Haviv Ilan** (CEO)\nThank you, Mike. Let me wrap up with what we've said previously. At our core, we're engineers. Our technology is the foundation of our company. Ultimately, our objective is to, and the best metric to measure progress and generate value to our owners is the long-term growth of free cash flow per share. Thank you and have a good evening.",
      "fetched_at": "2026-02-04T15:45:57.623Z"
    },
    {
      "ticker": "TXN",
      "title": "Texas Instruments Incorporated (TXN) Q2 FY2025 earnings call transcript",
      "published_date": "Jul 22, 2025, 4:30 PM EDT",
      "fiscal_year": "2025",
      "quarter": "Q2",
      "url": "https://finance.yahoo.com/quote/TXN/earnings/TXN-Q2-2025-earnings_call-337919.html",
      "content": "**Mike Beckman** (VP &amp; Head - IR)\nWelcome to the Texas Instruments Second Quarter twenty twenty five Earnings Conference Call. I'm Mike Beckman, Head of Investor Relations, and I'm joined by our Chief Executive Officer, Haviv Vilan and our Chief Financial Officer, Rafael Lazardi. For any of you who missed the release, you can find it on our website at ti.com/ir. This call is being broadcast live over the web and can be accessed through our website. In addition, today's call is being recorded and will be available via replay on our website.\n\n**Mike Beckman** (VP &amp; Head - IR)\nThis call will include forward looking statements that involve risks and uncertainties that could cause TI's results to differ materially from management's current expectations. We encourage you to review the notice regarding forward looking statements contained in the earnings release published today as well as TI's most recent SEC filings for a more complete description. Today, we'll provide the following updates. First, Habib will start with a quick overview of the quarter. Next, he will provide insight into second quarter revenue results with some details of what we are seeing with respect to our end markets.\n\n**Mike Beckman** (VP &amp; Head - IR)\nLastly, Rafael will cover financial results, give an update on capital management, as well as share the guidance for third quarter twenty twenty five. With that, let me turn it over to Haviv.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nThanks, Mike. Let me start with a quick overview of the second quarter. Revenue came in about as expected at $4,400,000,000 an increase of 9% sequentially and an increase of 16% year over year. Both Analog and Embedded grew year on year and sequentially. Analog revenue grew 18% year over year and Embedded Processing grew 10%.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nOur Other segment grew 14% from the year ago quarter. Let me provide some comments on the current environment and what we saw in the second quarter. We continue to see two distinct dynamics at play. First, tariffs and geopolitics are disrupting and reshaping global supply chains. As we work closely with our customers, we are leveraging our global manufacturing capabilities to support their needs.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nWe have flexibility and are prepared to navigate as things evolve. Second, the semiconductor cycle is playing out. Cyclical recovery is continuing, while customer inventories remain at low levels. In times like this, it is important to have capacity and inventory, and we are well positioned. Now I'll share some additional insights into second quarter revenue by end market.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nFirst, the industrial market increased upper teens year on year and mid teens sequentially, with recovery across all sectors. The automotive market increased mid single digits year on year and decreased low single digits sequentially. Personal electronics grew around 25% year on year and grew upper single digits sequentially. Enterprise systems grew about 40% year on year and grew about 10% sequentially. And lastly, communications equipment grew more than 50% year on year and was up about 10% sequentially.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nWith that, let me turn it over to Rafael to review profitability and capital management.\n\n**Rafael Lizardi** (SVP &amp; CFO)\nThanks, Aviv, and good afternoon, everyone. As Aviv mentioned, second quarter revenue was $4,400,000,000 Gross profit in the quarter was $2,600,000,000 or 58% of revenue. Sequentially, gross profit margin increased 110 basis points. Operating expenses in the quarter were $1,000,000,000 up 5% from a year ago and about as expected. On a trailing twelve month basis, operating expenses were $3,900,000,000 or 23% of revenue.\n\n**Rafael Lizardi** (SVP &amp; CFO)\nOperating profit was 1,600,000,000 in the quarter or 35% of revenue and was up 25% from the year ago quarter. Net income in the quarter was $1,300,000,000 or $1.41 per share. Earnings per share included a $02 benefit not in our original guidance. Let me now comment on our capital management results starting with our cash generation. Cash flow from operations was $1,900,000,000 in the quarter and $6,400,000,000 on a trailing twelve month basis.\n\n**Rafael Lizardi** (SVP &amp; CFO)\nCapital expenditures were 1,300,000,000 in the quarter and $4,900,000,000 over the last twelve months. Free cash flow on a trailing twelve month basis was $1,800,000,000 In the quarter, we paid $1,200,000,000 in dividends and repurchased $3.00 $2,000,000 of our stock. In total, we returned $6,700,000,000 to our owners in the past twelve months. Our balance sheet remains strong with $5,400,000,000 of cash and short term investments at the end of the second quarter. In the quarter, we issued 1,200,000,000 of debt.\n\n**Rafael Lizardi** (SVP &amp; CFO)\nTotal debt outstanding is $14,150,000,000 with a weighted average coupon of 4%. Inventory at the end of the quarter was $4,800,000,000 up $125,000,000 from the prior quarter and days were two thirty one, down nine days sequentially. Turning to our outlook for the third quarter, we expect TA's revenue in the range of 4,450,000,000.00 to $4,800,000,000 and earnings per share to be in the range of 1.36 to $1.6 Our earnings per share outlook does not include changes related to recently enacted U. S. Tax legislation and assumes an effective tax rate of about 12 to 13% in closing as we transition into the 2025 and going into 2026 we're prepared for a range of scenarios We are and will remain flexible to navigate, especially in the immediate term.\n\n**Rafael Lizardi** (SVP &amp; CFO)\nWe will stay focused in the areas that add value in the long term. We continue to invest in our competitive advantages, which are manufacturing and technology, a broad product portfolio, reach of our channels and diverse and long lived positions. We will continue to strengthen these advantages through disciplined capital allocation and by focusing on the best opportunities, which we believe will enable us to continue to deliver free cash flow per share growth over the long term. With that, let me turn it back to Mike.\n\n**Mike Beckman** (VP &amp; Head - IR)\nThanks, Rafael. Operator, you can now open the line for questions. In order to provide as many of you as possible an opportunity to ask your questions, please limit yourself to a single question. After our response, we'll provide you an opportunity for an additional follow-up. Operator?\n\n**Operator**\nThank you. We will now be conducting a question and answer session. If you would like to ask a question, please press star one on your telephone keypad. Our Our first question comes from the line of Stacy Rasgon with Bernstein Research. Please proceed with your question.\n\n**Stacy Rasgon** (MD &amp; Senior Analyst)\nHi, guys. Thanks for taking my questions. First, if I think how your tone sounded last quarter and frankly even how you sounded kind of mid quarter, you seemed really confident that the cyclical recovery was here and we were kind of off to the races. And now I'm hearing you kind of saying you're staying flexible, like, to to go after a range of scenarios. And, like, even in the quarter, like, was down sequentially.\n\n**Stacy Rasgon** (MD &amp; Senior Analyst)\nI guess, like, what's going on? Like, how is your, I guess, outlook and feeling about where things are? How's that changed, like, over the last three months? Because it you sound, I guess just based on tone and everything else, it doesn't sound maybe quite exuberant as maybe you sounded a few months ago, like what's going on?\n\n**Haviv Ilan** (CEO, President &amp; Director)\nHey Stacy, I'll take this one. So first, as we as I said in my prepared remarks, we are seeing two dynamics at play and one of them is the cyclical recovery. I think we talked through it in the second quarter call back in April. And the discussion was all about industrial is joining the pack. We are now one more quarter in and this is the third quarter that we see a signal of industrial recovering.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nIt's actually accelerated. So I can say we support five markets. We now have it started with PE, then enterprise and comp joined and industrial is already in. So we have four out of five markets recovering in a nice pace. And this is part of the reason we've added commentary on year over year performance to just show the dynamics over there.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nIn terms of automotive to your question, look, automotive, let's just remember that it's kind of a year delayed versus industrial, right? Industrial peaked for us at least in the third quarter of twenty twenty two. Automotive picked one year later in the third quarter of twenty twenty three. So one could expect automotive to be joining last. The automotive recovery has been shallow, meaning we are running single digits versus the peak.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nWe are running year over year. We are actually having some growth in second quarter from a year over year perspective, but at a very low level. So I will say that automotive has not recovered yet. But because of content growth, think the cycle here is going to be less pronounced and more shallow. The second point related to getting ready, look, we had some taste of it in the beginning of the second quarter and we talked through it a lot during the call.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nBut I think all the situation of tariffs and geopolitics disrupting supply chains, I think that's not over, right? It's true that there is pause right now on the semiconductor tariffs, both in The U. S. And in China. But we have to be prepared for what the future may hold.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nSo we want to make sure and this is also the message to our customers that will remain flexible and we'll know how to support our customers whatever the environment is moving forward.\n\n**Mike Beckman** (VP &amp; Head - IR)\nYou have a follow-up, I\n\n**Stacy Rasgon** (MD &amp; Senior Analyst)\ndo. Thanks. Maybe just a follow-up. Actually, think I want to ask about gross margins. We'll go there.\n\n**Stacy Rasgon** (MD &amp; Senior Analyst)\nIf I just back into the guidance for next quarter, it seems like you're guiding gross margins probably down sequentially implicitly on revenue growth. I guess, is that the case? And like, what is that? Is that just depreciation? I know depreciation went up in the quarter.\n\n**Stacy Rasgon** (MD &amp; Senior Analyst)\nIs it just depreciation going up further? Or is something else going on on the gross margin line or what?\n\n**Rafael Lizardi** (SVP &amp; CFO)\nYes, Stacy, I'll take that. So to help you and everyone with their models, where you be landing given our guidance is GPM percent about flat, despite the higher depreciation that we're going to have going into third quarter, OpEx about flat, and then what you're probably missing is the net of other income and expense and interest expense, that's going to be unfavorable about $20,000,000 as we have lower cash levels, interest is lower, while debt interest expense has continued to increase. That's the part that's probably missing to round out your model.\n\n**Mike Beckman** (VP &amp; Head - IR)\nAll right. Thanks Stacy.\n\n**Stacy Rasgon** (MD &amp; Senior Analyst)\nThat's helpful. Thank you.\n\n**Mike Beckman** (VP &amp; Head - IR)\nWe'll move on to our next caller.\n\n**Operator**\nThank you. Our next question comes from the line of Harlan Sur with JPMorgan. Please proceed with your question.\n\n**Harlan Sur** (ED - Equity Research)\nHey, good afternoon. Thanks for taking my question. You know, one of the signs of cyclical recovery is improvement in your turns business. Did the team see turns business grow sequentially in Q2 both in dollars and percent of revenues? And was it broad based across both your industrial and auto businesses?\n\n**Haviv Ilan** (CEO, President &amp; Director)\nYes. Let me start and maybe Mike you can comment right after. So I think, yes, from a turns perspective, we see a continuation of that dynamic. We saw again acceleration in the second quarter. We continue to invest in our inventory, our lead times are at the lowest level, customer inventories are very low.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nSo we've seen that continuing and Mike, maybe you want to provide some more color here?\n\n**Mike Beckman** (VP &amp; Head - IR)\nYeah, I think as we've talked about in previous quarters, that's something that late last year and in the first quarter began to build. We continue to see that into the second quarter as well.\n\n**Harlan Sur** (ED - Equity Research)\nPerfect. And then for my follow-up question, good to see the continued sequential and year over year recovery in the industrial segment. It's quite diverse, right? 10 sub segments, but the largest sub segment industrial automation, which is tied to manufacturing activity is pretty sensitive to trade and tariffs. So just wondering if this segment is relatively weaker due to tariff concerns or are you seeing shipment and order recovery here as well, especially among your China based industrial customers?\n\n**Mike Beckman** (VP &amp; Head - IR)\nYeah, maybe I'll take that one. And what we actually saw in industrial was recovery was broad and it was across all sectors. So I'd say that's continuation of the recovery we saw in first quarter, that's where we are. Bamil, I'll move on to the next caller. Thank you.\n\n**Operator**\nThank you. Our next question comes from the line of Ross Seymore with Deutsche Bank. Please proceed with your question.\n\n**Ross Seymore** (Managing Director)\nHi, Thanks for letting me ask question. Habib, kinda going back to the first question, just on kind of the the tone and seems like a little bit of a tone change on our side, maybe not so much to you, but maybe I'll try to ask it a different way. You highlighted the uncertainties about the tariff side of things, but then endorse the cycle was coming. Last quarter, you guided significantly above normal seasonality. You seem to lean in on the cycle side and didn't really say that tariffs were doing much.\n\n**Ross Seymore** (Managing Director)\nSo did something change on either the strength of the cycle or the uncertainty around the tariff to lead you to guide to more of a typical seasonal quarter for 3Q?\n\n**Haviv Ilan** (CEO, President &amp; Director)\nYes, let me put some more color into it, Rod. I think it's a great question. So remember, when we met here in April, we dealt with reciprocal tariffs on both sides. U. S.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nWas exempting semis, but China had a 125% tariff rate on semis during the call, right? So just a different situation versus where we are now. Now tariffs are put on hold, so a little bit of a different environment. I will say that we and I think I mentioned it also during the last call, when there is a change of dynamics like tariffs are being added and I go back to April, customers are sitting on very low inventories. I think it's a good assumption to make that customers will want to have a little bit more inventory.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nAnd we did see that phenomenon. We did see that in the early part of the quarter, there was an acceleration of demand. And as expected, when customers are sitting on no inventories and there is a lot of noise around tariffs. That has normalized through the quarter and we are kind of back to right now what drives our day to day is just a cyclical recovery. Now as we forecast into Q3 and given the fact that we have a lot of real time turns business that we have to kind of assess for the future, I think it's prudent to have a little bit of or to remember that what we saw in Q2 is probably a combination of customers wanting to have a little bit more inventory because of tariffs and also the cyclical recovery.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nWhen customers make orders, they don't tell us why they want more parts. And I would assume that some of it was for building a little bit of inventory on those shelves to protect themselves from tariffs, if you will. So that is my assumption. Again, I don't know how the third quarter will play out, but that's part of the way we are forecasting Q3.\n\n**Mike Beckman** (VP &amp; Head - IR)\nRoss, do you have a follow-up?\n\n**Ross Seymore** (Managing Director)\nI do. Switching over to Rafael, just kind of on the CapEx side of things, how should we think or is there any update on the CapEx and depreciation framework that you've given us for the annual numbers for this year and next year, especially given where you are in Phase two, maybe going to Phase three on the CapEx side. Just wanted to see if there's any incremental color there.\n\n**Rafael Lizardi** (SVP &amp; CFO)\nYes, no, happy to do that. The bottom line is there's no change, but let me go through those, so that everybody has those. On CapEx for this year 2025, we continue to expect to spend $5,000,000,000 and for 2026 is going to be between $2,000,000,000 and $5,000,000,000 depending on revenue and growth expectations at that time. And we will update you on those narrowing that CapEx window most likely later this year. Okay.\n\n**Rafael Lizardi** (SVP &amp; CFO)\nOn depreciation, switching to depreciation for 2025, we continue to expect 1,800,000,000 to $2,000,000,000 and for 2026, we continue to expect $2,300,000,000 to $2,700,000,000 and likely to be at the lower side of that range.\n\n**Mike Beckman** (VP &amp; Head - IR)\nOkay, we'll move on to our next caller.\n\n**Operator**\nThank you. Our next question comes from the line of Vivek Arya with Bank of America. Please proceed with your question.\n\n**Vivek Arya** (Managing Director)\nThanks for taking my question. Habib, sorry to go back to the stone change, change because it's not just from the last earnings call. It's at the end of a conference at the May, I think you had suggested that every remaining '25 will accelerate from the first half up 13%, but your Q3 sales guide is up only 11%. So my question is that versus that reference point, which end market has softened? Is it that the industrial normalization is done?\n\n**Vivek Arya** (Managing Director)\nIs it that auto right was a little weaker or is that just extra conservatism on TI as part because the tone changes, as I mentioned, not just from earnings, but from the May.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nYeah, and again, I don't control probably tone level, but that's you guys hearing that.\n\n**Vivek Arya** (Managing Director)\nSo you quantified it, Hari. You quantified\n\n**Haviv Ilan** (CEO, President &amp; Director)\nSorry, it, but wasn't that directly to your question, Vivek, I would say that on the in the second quarter, we have seen industrial, in my opinion, running very hot, right? What were the numbers sequentially, Mike? Was up mid teens, I think.\n\n**Mike Beckman** (VP &amp; Head - IR)\nUpper teens, yes.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nAnd it grew significantly year over year in the second quarter close to 20%, right? So in that sense, I do believe it ran a little hot. This is where I want to be a little bit more cautious into Q3. We also saw and I let my comment about geographies. We also saw a little bit of higher pull from China in the second quarter.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nWe will have it in the Q when it comes out. But Mike, maybe you can give a little bit of China by region maybe, not only China behavior in 2Q.\n\n**Mike Beckman** (VP &amp; Head - IR)\nSure. Yeah. So China, it was up about 19% sequentially, grew about 32% year over year. And all end markets grew there with the exception of automotive. And auto was pretty consistent with our overall results there.\n\n**Mike Beckman** (VP &amp; Head - IR)\nAnd industrial did lead the growth there in China. And just as reminder, our China headquarter customers represent about 20% of our overall revenue.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nAnd Vivek, that information gives you a little bit of why I want to be cautious for Q3, right? We have seen China running again a little bit hot in Q2. It was not across all markets, meaning on the automotive side, it behaved very similarly to the rest of the world, but it was not across the board. So we give you the data that it's how to decipher exactly or to decouple what was related to pull ins or what was related to cyclical recovery. I think both are happening and that's what that's the data we have right now and that's what guides our third quarter as we plan for Q3.\n\n**Mike Beckman** (VP &amp; Head - IR)\nDo you have a follow-up Vivek?\n\n**Vivek Arya** (Managing Director)\nYes. Thank you, Mike. For my follow-up, given everything they have heard, Aviv, I know you typically don't guide the quarter out, but how would you advise us to start thinking about Q4 that should we assume a similar conservative tone and assume something that is usually your seasonality is I think down sequentially or flat sequentially, if you could remind us of that in Q4 and given everything we have heard, how should we just conceptually think about the move into Q4? Thank you.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nVivek, as you know, we are a one quarter over the time company on specifically on guidance. So I will just say, let's let the third quarter play out. Mike, do you want to comment about seasonality?\n\n**Mike Beckman** (VP &amp; Head - IR)\nYeah, so historically, and third are typically stronger quarters, fourth and first are typically seasonally lower, but we'll have to let third quarter play out before we're gonna be ready to talk about fourth. Anyway, we'll go on to move on to our next caller. Thanks, Vivek.\n\n**Vivek Arya** (Managing Director)\nThank you, Mike.\n\n**Operator**\nThank you. Our next question comes from the line of CJ Muse with Cantor. Please proceed with your question.\n\n**CJ Muse** (Senior Managing Director)\nYeah. Good afternoon. Thank you for taking the question. I was hoping to revisit gross margins. You indicated flat roughly sequentially.\n\n**CJ Muse** (Senior Managing Director)\nAnd I guess within that, could you speak to your plans for utilization? Are there any sort of changes in mix? And if we were to normalize to kind of your typical, more typical 80% kind of fall through, that would be an incremental maybe $2,527,000,000. So is the kind of the pause in gross margin uplift, 100% due to that increase in depreciation or are there other factors that we should be thinking about?\n\n**Rafael Lizardi** (SVP &amp; CFO)\nYeah, no, just to give you a few more information there, as I said earlier and you restated, we expect third quarter gross margin to be about flat to the second quarter. That is with higher revenue, but also higher depreciation. In terms of loadings and inventory, we expect to run loadings about the same in third quarter as we did in second quarter as we are well positioned with inventory to support a wide range of cyclical recovery scenarios. Inventory expect to grow, but at a slower rate than the growth we just had in second quarter. Hopefully that gives you and then on the fall through, we guide 75% to 85% that's over the long term, that's over a year on year and not any one quarter, but we should be close to that fall through.\n\n**Rafael Lizardi** (SVP &amp; CFO)\nWe'll speak more about that when we have actuals and we'll have a better, you know, information to provide, but you should continue to think of 75% to 85% as a good number to use over the long term.\n\n**Mike Beckman** (VP &amp; Head - IR)\nCJ, do you have a follow-up?\n\n**CJ Muse** (Senior Managing Director)\nI do. Thank you. With the ITC going from 25% to 35%, curious if you can comment on your thoughts on impact to your net CapEx into 2627. And is there any sort of movement or thought process that we should have around the impact of depreciation? Thanks so much.\n\n**Rafael Lizardi** (SVP &amp; CFO)\nOkay, no, thanks for that question. So let's talk about that legislation that just passed. First, we're very pleased with the changes resulting from the passage of the recently enacted U. S. Federal tax law.\n\n**Rafael Lizardi** (SVP &amp; CFO)\nIt includes expensing of U. S. R and D and eligible capital expenditures, an increase to the ITC from 25% to 35% and changes to other tax provisions such as making FDII permanent. The effects of the new reflected in the statement that we just released in the financials that we just released in the passage of that law happened in July. We are currently evaluating the changes on the legislation are going to have on future financial statements.\n\n**Rafael Lizardi** (SVP &amp; CFO)\nThat's why in the guide that we gave, we did not incorporate it. We need additional time to do a full evaluation. However, I would tell you that based on our initial assessment, what we expect, what would likely happen is our GAAP tax rate will increase in third quarter and 2025. However, it will decrease in 2026 and beyond. More importantly, the cash from a cash flow standpoint, we expect significantly lower cash tax rates for the next several years.\n\n**Rafael Lizardi** (SVP &amp; CFO)\nSo again, we're very pleased with that legislation. Let me speak real quickly. You mentioned you asked about CapEx plans specifically. Our CapEx plans remain consistent with what we shared in February and will depend on revenue.\n\n**Mike Beckman** (VP &amp; Head - IR)\nAll right. We'll move on to our next caller.\n\n**Operator**\nThank you. Our next question comes from the line of Jim Schneider with Goldman Sachs. Please proceed with your question.\n\n**Jim Schneider** (Senior Equity Analyst)\nGood afternoon. Thanks for taking my question. Maybe following up on some of the other questions that were asked. Could you maybe comment on some of the end markets, whether it be personal electronics or enterprise systems or otherwise, that you think may have gotten a little bit ahead of themselves or maybe run a little bit hotter into Q2? And which ones do you think are sort of at risk of reverting a little bit in Q3 and Q4? Thank you.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nYes, let take that. Remember that when we talk about the PE market and also enterprise and CE, they're all kind of running at different phases on their cyclical recovery. It started with really PE, then followed by enterprise and comms, and then industrial joined later. As I mentioned before, the automotive market, we again, very shallow cycle, but we haven't seen enough signs of true broad recovery over there. Now regarding the if you go back to second quarter, where we saw a little bit, I would say, market that went higher than expected was on the industrial.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nWe did expect the cyclical recovery in industrial, but it did grow 15% sequentially, which is a little bit unnatural. When you add on top of it the geography footprint, this is where I have a little bit of more cautiousness. I wouldn't mark anything else that behaved differently in second quarter, Mike. Would agree? That's the right assessment.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nYes, that's market where we saw a little bit of I think I wouldn't say anxiety, but customers just preferring to just have more parts. And we did see normalization through the quarter. So think about the front end of the quarter was running faster than the second half of the quarter. We think we left the quarter at a normal rate, but it's very hard to assess right now. So we keep watching it and that's the market where I want to be more cautious when I think about Q3.\n\n**Mike Beckman** (VP &amp; Head - IR)\nDo you have a follow-up?\n\n**Jim Schneider** (Senior Equity Analyst)\nThanks. Yes, do. Thank you. Relative to capital allocation, you mentioned about the cash tax benefits that you expect that will positively impact free cash flow next year and beyond. You reiterated the CapEx guidance, but can you maybe kind of speak to the capital return portion of this?\n\n**Jim Schneider** (Senior Equity Analyst)\nObviously, your free cash flow is better than what might you do differently or more on buybacks or dividends?\n\n**Rafael Lizardi** (SVP &amp; CFO)\nYes. No, it's a good question. It's going to depend and it's going to depend on a number of factors. For instance, right now we're still in the middle of a high CapEx environment and we'll see how long that lasts. As we said, next year we do have a range of two to five.\n\n**Rafael Lizardi** (SVP &amp; CFO)\nSo that's still even at the low end, it's still a meaningful amount of CapEx and we need to be ready for that. And there are other factors, cash on the balance sheet, the price of the stock price, the stock that also plays into our decision. So we'll take that into all into account, but at the end of the day, our objective remains the same when it comes to returning capital to owners and that is to return all free cash flow through dividends and buybacks.\n\n**Mike Beckman** (VP &amp; Head - IR)\nAll right. Thanks, Jim. Let's move on to our next caller.\n\n**Operator**\nThank you. Our next question comes from the line of Chris Caso with Wolfe Research. Please proceed with your question.\n\n**Chris Caso** (Managing Director)\nYes, thank you. Good afternoon. The question is about fab loading and what your intentions are as we go through the back end of the year into next year. Or I guess in light of some of the caution that you expressed, any changes you're making to fab loading and basically where you want your internal inventories to sit as you exit the year?\n\n**Rafael Lizardi** (SVP &amp; CFO)\nYes, I tell you on an ideal in an ideal world, what we would want to do and of course, the world is not ideal, and we'll have to navigate through that. But in an ideal world, what we would do is hold manage the operation so that the loadings are relatively stable, relatively flat over time. And what happens during a cyclical upturn, we actually drain some inventory. And then during a cyclical downturn, we actually build some inventory. And that's how you get the factories to run effectively constant over that time.\n\n**Rafael Lizardi** (SVP &amp; CFO)\nOf course, you know, it's not an ideal environment, you never quite know when you're at peak when you're at trough. So we'll have to add some guardrails to that to make sure that we maximize the opportunity and maintain flexibility. At a high level, that's how we would like to run the company.\n\n**Mike Beckman** (VP &amp; Head - IR)\nAll right, give a follow-up, Chris.\n\n**Chris Caso** (Managing Director)\nI do. Thanks. And my follow-up is I could dig into auto a little bit more deeply. And it sounds like what you're saying there is auto hasn't really changed, but hasn't recovered yet. That's a market where you've got a few customers that you speak to there.\n\n**Chris Caso** (Managing Director)\nWhat's their tone right now, given all the macro uncertainty? What are they doing with inventory levels and preparing now? Is it just sort of in a holding pattern right now with regard to auto?\n\n**Haviv Ilan** (CEO, President &amp; Director)\nYes, I think that's a good description. In a way, the and again, I look at my graph here in front of me. So automotive again, for us in the third quarter of twenty twenty three. And in the last, I would say sixth quarter, a little bit up, little bit down, but hovering around a certain level of high single digit down versus that number. And think about the automotive customers, those who ship into The US, they have tariffs to deal with, so I don't think they want to I think they're being cautious right now, and I think the orders we get is only when they really need it.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nI don't think there is any inventory replenishment there, not only at the OEMs, but also at the Tier one level. So everything is almost real time. And we'll just we have our lead times are so low and most of our automotive customers are on consignment. So we just get it real time. So to your point, we haven't seen yet the recovery.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nBut remember, peaked in the 2022 and we saw the recovery starting in Q4 of twenty twenty four. So you can argue that automotive could be maybe a year later if you just keep the same duration. So, it going to be sometime in the second half of the year? We'll just have to see real time.\n\n**Mike Beckman** (VP &amp; Head - IR)\nOkay, Chris, thanks for the questions. Let's move on to the next caller.\n\n**Operator**\nThank you. Our next question comes from the line of Joshua Buchalter with TD Cowen. Please proceed with your question.\n\n**Joshua Buchalter** (Director - Equity Research)\nHey, guys. Thank you for taking my question. Maybe following up on Chris' previous one. When you spoke about China, it was clear that auto was sort of the outlier there and was down in line with your broader auto business. I mean, seems like China auto trends have been positive year to date, including in 2Q. It doesn't sound like there's destocking going on. Can you maybe explain what's going on specifically in China auto? Is there any element of share loss happening there or do you think it's more inventory dynamics? Thank you.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nYeah, I think it's a good question. I think it's more the latter. Automotive ran very hot last year in China and there was enough news out there that there was a little bit of a caution coming or guidance, they slowed some of the price wars over there. So I think we saw some of the dynamics. I think our automotive business in China is doing well.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nI think from a year over year perspective, grew the automotive business in Q2, but China was ahead of the rest of the market simply because again, first in first out. So we saw the recovery in China starting in 2024. I think it takes a little bit of a breather right now, but I think it's related to inventory correction on their side.\n\n**Mike Beckman** (VP &amp; Head - IR)\nAnd I'll just add, if you look across the major regions for us in auto, U. S, Europe, China, they more or less performed pretty similarly on a sequential basis. They weren't vastly one stuck out differently than the others. Now, when you look on a year on year, that's for China now is going to be leading.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nI would say China and Asia ahead, and then you go to Europe and Japan behind, very coherent with what we've seen in other markets.\n\n**Mike Beckman** (VP &amp; Head - IR)\nDo you have a follow-up Josh?\n\n**Joshua Buchalter** (Director - Equity Research)\nYes, please. Similarly, when you talked about China, it sounds like there was some element of potential pull ins that were impacting 2Q. You guys have talked for a while about having geopolitically dependable supply for the West. Are you seeing that on your customers outside of China at all? Are they changed their behaviors?\n\n**Joshua Buchalter** (Director - Equity Research)\nAnd when should we expect sort of the share gains that you expect because of your U. S.-based manufacturing to start to flow through the model? Thank you.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nYes, so let me start with just you mentioned the pull ins. We don't know. I just want to repeat that point. We just have to make assumptions. Customers don't tell us why they order.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nWe just go through the data and try to decipher it, right? So we just can't rule out the possibility and we say there was likely could have been some. When you see such a strong behavior in Q2 versus Q1, you have to attribute some of it to the tariff environment. Also remember that in China, we have the automotive market is more like what we call a signed account. We talk to the customers, we can explain to them the options.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nWe have many industrial customers, it's just hard to get to everyone at once. And I think it just takes longer to let customers know that TI has a diverse manufacturing footprint and we've got their back. So I think that's part of what we've seen during the second quarter, plus the tariffs that took a breather after after a month or so. Now regarding the overall discussion on tariffs and our U. S.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nManufacturing footprint, I think that's an important point. We've spent a lot of time during the last call talking about the challenges made in China and how we are navigating it. But remember that the environment is dynamic, things are changing regularly and tariffs and geopolitics will continue to evolve. And as I said in the prepared remarks, reshape the supply chain. I think some of it is going to be a little bit more permanent.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nSo our customers are increasingly valuing our geopolitically dependable capacity. In The US, I think TI, I think first let me say, our global manufacturing footprint is optimized to support all of our customers worldwide. But if you go into The US, I do believe that The US will make semis US semis will be increasingly incentivized in The US, and we do have a unique position. These are not investments that were made during the last quarter. We have been working on it for the past five years.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nAgain, not because we foreseeing tariff, we just wanted to control our destiny and the best way for us or the best efficiency for us to build our manufacturing footprint both in The U. S. I think that hasn't played out yet. We do have a few customers, you could probably count them on one hand that are savvy and knowing what the plants how the plants could evolve. And they're already shifting and getting closer to us.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nBut I think there is a lot of confusion at the broad customer base. People don't exactly understand the difference between reciprocal tariffs and sectoral tariffs and what's going to come and when. So there is a little bit of a wait and see. And by the way, we don't know as well how things will evolve in the second half of the year. I will say that I believe our opportunity is greater than our challenge.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nWhile we are well equipped and well the diversity of our supply of our manufacturing footprint and supply chain is high and we've proven it to our customers in Asia and specifically in China in the second quarter. I think TI is unique in the fact that we have a manufacturing footprint in The U. S. And if U. S.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nChips are indeed becoming incentivized in whatever ways they choose to do that, TI a unique answer. Not only that we have the scale and the size of the required capacity, it's also very affordable, it's low cost, very competitive. And again, that opportunity has not played out yet, but we are ready for whatever changes we are going to meet in the second half of the year and beyond.\n\n**Mike Beckman** (VP &amp; Head - IR)\nAll right. Thanks, Josh. We'll move on to our last caller.\n\n**Operator**\nThank you. Our last question comes from the line of William Stein with Truist Securities. Please proceed with your question.\n\n**William Stein** (MD &amp; Senior Analyst)\nGreat. Thanks for taking my question. It's a variation on the theme that we've listened to tonight. I think it was the past call and if not certainly during the quarter, Aviv, I think you characterized the environment as cyclical recovery is the signal and that tariffs and geopolitics are more noise and that the signal to noise ratio is very high. And I think there was an expectation that the momentum that we saw in the first half of the year was going to extend.\n\n**William Stein** (MD &amp; Senior Analyst)\nAnd yet the guidance is sort of confusing in light of that view. Specifically you just delivered a plus 16.5% result year over year and I think you're guiding to plus 11.5. So how do I reconcile this? Is the environment just much more noisy than what you would characterize a quarter ago? Or did something else change?\n\n**William Stein** (MD &amp; Senior Analyst)\nIs there another way to describe what happened in the last quarter?\n\n**Haviv Ilan** (CEO, President &amp; Director)\nNo, I think regarding Bill, what happened, sorry, what happened in Q2, I think we were very open about it. As I said, we did see some dynamics within the quarter. It was more noisy, if you will, in the second half of the quarter. And it's very hard for us to, as I said to Vivek and others to quantify how much And when you make guidance into the third quarter with the data we see right now, we just want to take a responsible approach. That's the data we have right now. That's the way we call it. I think during the last call, everybody was pushing back, how could it be that TI will grow 7% sequentially and I think we've upsided there, right? So I think right now maybe the expectations were higher, but we are just calling the forecast the way we see it.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nWe have to let it play out. I will reiterate that I believe the cyclical recovery is strong. Even if it's masked a little bit by this tariff environment, I think we now have four out of the five markets already in. I expect automotive to join, I just don't see it yet. And once we have all five markets pointing in the right direction, we'll be complete.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nThis recovery is very, very different from any previous one. You can see it also at the slope of the recovery when you look at overall WCS without memory trend, you can see a not very sharp return to trend line. We are still running 12 or 13%, I believe, below trend line. And there is a lot of usually when a cycle establish itself, you first have to get a trend line and then you have to establish the next peak. We are still running double digits percentage wise on units below trend line.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nSo I think that's what we're seeing. We are not different than the rest of the market, I believe. And we'll just have to continue to let it play out. So that would be my answer to your question, Will.\n\n**Mike Beckman** (VP &amp; Head - IR)\nDo you have a follow-up?\n\n**William Stein** (MD &amp; Senior Analyst)\nYes. If I can follow-up one area that I hope might be a little bit more optimistic. In enterprise, I think you had a good quarter. And I'm wondering if you can remind us or update us as to your current and maybe future anticipated exposure to the rapid growth AI markets? Thank you.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nYeah, very well. Our enterprise market is mainly, I think the largest over there for us is data center, data center compute, but it's not only data center. We also have, for example, large printers or enterprise printers over there and also projection devices. So we probably want to clarify that over time. But if I just focus on data center and it's mainly today inside the enterprise market for TI, but also a little bit of the optical communication inside the comms.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nWhen I kind of cut out and I look at our data center story, that's behaving very well this year. It's growing very nicely at a very high level, above that 50% that I've mentioned before. And the future has a large opportunity for TI, because we are seeing ourselves playing in more socket over time. Currently, our footprint on the data center side is more with our general purpose part. We have a large share over there, but we're also working closely with some key customers to expand our positions there to more application specific opportunities.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nThis is based on our new technology that is ramping right now in Sherman, Texas. We already have samples and we are competing to win share over there. That's more of a tailwind, a potential tailwind for us in 2026 and beyond. So that's our data center story and thanks for that question, Will.\n\n**William Stein** (MD &amp; Senior Analyst)\nThank you.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nOkay. So let me wrap up with what we've said previously. At our core, we are engineers and technology is the foundation of our company, but ultimately our objective and best metric to measure progress and generate value to owners is a long term growth of free cash flow per share. With that, thank you and have a good evening.\n\n**Operator**\nThank you. This does conclude today's conference and you may disconnect your lines at this time. Thank you for your participation.",
      "fetched_at": "2026-02-04T15:46:02.449Z"
    },
    {
      "ticker": "TXN",
      "title": "Texas Instruments Incorporated (TXN) Q1 FY2025 earnings call transcript",
      "published_date": "Apr 23, 2025, 4:30 PM EDT",
      "fiscal_year": "2025",
      "quarter": "Q1",
      "url": "https://finance.yahoo.com/quote/TXN/earnings/TXN-Q1-2025-earnings_call-309190.html",
      "content": "**Dave Pahl** (Head of Investor Relations &amp; VP)\nWelcome to the Texas Instruments First Quarter twenty twenty five Earnings Conference Call. I'm Dave Paul, and I'm joined by our Chief Executive Officer, Haviv Lalon and our Chief Financial Officer, Rafael Lazardi. In addition, Mike Beckman has joined us. As you may know, I will be retiring, and Mike will replace me as Vice President of Investor Relations. Mike has worked at TI for nearly two decades and has worked directly with me in Investor Relations for five years.\n\n**Dave Pahl** (Head of Investor Relations &amp; VP)\nMike will moderate today's call. And with that, let me turn it over to Mike.\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nThanks, Dave. I'm looking forward to the opportunity. For any of you who missed the release, you can find it on our website at ti.com/ir. This call is being broadcast live over the web and can be accessed through our website.\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nIn addition, today's call is being recorded and will be available via replay on our website. This call will include forward looking statements that involve risks and uncertainties that could cause TI's results to differ materially from management's current expectations. We encourage you to review the notice regarding forward looking statements contained in the earnings release published today as well as TI's most recent SEC filings for a more complete description. Today, we'll provide the following updates. First, Haviv will start with a quick overview of the quarter, including insight into first quarter revenue results and some details of what we're seeing with respect to our end markets.\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nNext, he'll share how we are approaching the overall market environment and provide guidance for second quarter twenty twenty five. Lastly, Rafael will cover the financial results and give an update on capital management. With that, let me turn it over to Haviv.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nThanks, Mike. Let me start with a quick overview of the first quarter. Revenue came in at $4,100,000,000 an increase of 2% sequentially and an increase of 11% year over year. Analog revenue grew 13% year over year, and embedded processing was about flat, and both segments grew sequentially.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nOur other segment grew 23% from the year ago quarter. Now I'll provide some insight into our first quarter revenue by end market. We continue to see recovery across our end markets, with industrial showing broad recovery across sectors and geographies. We believe customer inventories are at low levels across all end markets. Similar to last quarter, I'll focus on sequential performance, as it is more informative at this time.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nFirst, the industrial market increased upper single digits after seven consecutive quarters of sequential decline. The automotive market increased low single digits. Personal electronics declined mid teens, in line with typical seasonal trends. Enterprise systems grew mid single digits, and communications equipment was up about 10%. Before I go to our second quarter guidance, let me take a minute to frame how we are approaching the current environment.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nIt is a time of high uncertainty in the world, as tariffs and geopolitics are disrupting global supply chains and creating unpredictable economic conditions. Adding to that, semiconductors are highly visible, as it is broadly understood that people and economies are increasingly dependent on chips. To navigate in this environment, we will continue to rely on our three key ambitions: We will act like owners who will own the company for decades. We will adapt and succeed in a world that is ever changing. And we will be a company that we are proud to be part of and would be proud to have as our neighbor.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nThese guiding ambitions are not new they have served us well for decades, and they are enormously valuable in times like these. We look at the current environment in two important categories: one, where we are in the phase of the semiconductor cycle and two, providing geopolitically dependable capacity and navigating in a world that is changing. To help understand where we are in the cycle, we spent some time looking at previous events, including Y2K, the global financial crisis, and the COVID-nineteen pandemic. While no two scenarios are identical, these recent examples help inform our decisions as we prepare for a range of market scenarios. What may be unique right now, is that we are at the bottom of the semiconductor cycle, and customer inventories are at low levels across all end markets.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nSo relative to where we are, history says it is important to have capacity and inventory in times like these, and we are well positioned. In addition, geopolitically dependable capacity will matter more, and it is increasingly critical and valuable to our customers. We have flexibility and are prepared to navigate the evolving supply chain dynamics. Translating all these to second quarter guidance, I would like to make three points. First, we remain cautious, as there are many things still changing and we are working with our customers to understand and support their needs.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nAs such, potential impact on our customers, suppliers and TI is unclear and will likely evolve. Second, at this time, we don't see near term impact to second quarter, and we expect TI's revenue in the range of $4,170,000,000 to $4,530,000,000 and earnings per share to be in the range of $1.21 to 1.47 Finally, we will have to see what happens in second half twenty twenty five and going into 2026, and we are prepared for a range of scenarios. We are, and will remain flexible to navigate, especially in the immediate term. With that, let me turn it over to Rafael to review profitability and capital management.\n\n**Rafael Lizardi** (CFO and Senior VP of Finance &amp; Operations)\nThanks, Aviv, and good afternoon, everyone. As Habib mentioned, first quarter revenue was $4,100,000,000 Gross profit in the quarter was $2,300,000,000 or 57% of revenue. Sequentially, gross profit margin decreased 90 basis points. Operating expenses in the quarter were $989,000,000 up 6% from a year ago and about as expected. On a trailing twelve month basis, operating expenses were $3,800,000,000 or 24% of revenue.\n\n**Rafael Lizardi** (CFO and Senior VP of Finance &amp; Operations)\nOperating profit was $1,300,000,000 in the quarter or 33 of revenue and was up 3% from the year ago quarter. Net income in the quarter was $1,200,000,000 or $1.28 per share. Earnings per share included a $05 benefit not in our original guidance. Let me now comment on our capital management results, starting with our cash generation. Cash flow from operations was $849,000,000 in the quarter and $6,200,000,000 on a trailing twelve month basis.\n\n**Rafael Lizardi** (CFO and Senior VP of Finance &amp; Operations)\nCapital expenditures were $1,100,000,000 in the quarter and 4,700,000,000 over the last twelve months. Free cash flow on a trailing twelve month basis was $1,700,000,000 In the quarter, we paid $1,200,000,000 in dividends and repurchased $653,000,000 of our stock. In total, we returned 6,400,000,000 to our owners in the past twelve months. Our balance sheet remains strong with $5,000,000,000 of cash and short term investments at the end of the first quarter. In the quarter, we repaid $750,000,000 of debt.\n\n**Rafael Lizardi** (CFO and Senior VP of Finance &amp; Operations)\nTotal debt outstanding is 12,950,000,000 with a weighted average coupon of 3.93%. Inventory at the end of the quarter was $4,700,000,000 up $160,000,000 from the prior quarter and days were two forty, down one day sequentially. For second quarter, we now expect our effective tax rate to be about 12 to 13%. In closing, we will stay focused in the areas that add value in the long term. We continue to invest in our competitive advantages, which are manufacturing and technology, a broad product portfolio, reach of our channels and diverse and long lived positions.\n\n**Rafael Lizardi** (CFO and Senior VP of Finance &amp; Operations)\nWe will continue to strengthen these advantages through disciplined capital allocation and by focusing on the best opportunities, which we believe will enable us to continue to deliver free cash flow per share growth over the long term. With that, let me turn it back to Mike.\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nThanks, Rafael. Operator, you can now open the line for questions. In order to provide as many of you as possible an opportunity to ask your questions, please limit yourself to a single question. After our response, we'll provide you an opportunity for an additional follow-up. Operator?\n\n**Operator**\nThank you. Again, we will now be conducting a question and answer session. If you would like to ask a question, please press star one on your telephone keypad. A confirmation tone will indicate your line is in the question queue. You may press star two to remove yourself from the queue.\n\n**Operator**\nFor participants using speaker equipment, it may be necessary to pick up the handset before pressing the star keys. Our first question comes from the line of Timothy Arcuri with UBS. Please proceed with your question.\n\n**Timothy Arcuri** (Managing Director)\nThanks much. So the guidance up 7%, that's even better than normal seasonal. I know this is a hard question to answer, but is there any way for you to know how much of this is pull ins ahead of the tariffs? I mean, is there any way your discussions with customers, any of the tonality that's changed? Thanks.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nTim, thanks for the question. So first, before I talk about our approach into the second quarter, just as I said in my prepared remarks, we are looking at two different categories of change in front of us. One is related to the cycle and the cycle we saw in Q1 a continued recovery. I think we mentioned before, I think it was in the previous call, we have three markets now growing year over year and recovering. It was the PE or personal electronics market, enterprise and comms.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nIt's very obvious to us now that industrial is really joining the pack and it's a large market for us. We've seen some evidence in Q4, but based on what we've seen in Q1, I think this is a real recovery rather than the way I see it right now related to tariffs, at least not for the first quarter, right? And the cycle has hit the bottom because we are seeing more and more evidence from customers that they are really, really short on inventory. They have sometimes a few days of inventory. We've seen that age in phenomena or orders within the quarter, turns as we call it, strengthening in Q4.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nIt continued to do the same in 1Q. So more and more evidence and signals that across all channels, all geographies, a recovery of the industrial market is here, but the automotive market was always correcting a very shallow manner. So you can kind of say that the markets are now well pointing pre the trade challenges all up into the right. Now, you look at the second quarter, I think we have to stay very cautious, as we said about the forecast. So we are seeing that many things are still changing.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nIt's a very, very dynamic environment, and I say sometimes by the day. And there is a potential impact on our customers and our suppliers and also on our revenues. So it is unclear and it will evolve, but as I need to call and we spent a lot of time on it, looking at past examples, understanding where the cycle is, and looking at the data we have in front of us, we don't see an immediate near term impact. Of course, the customers wouldn't tell us why we see the orders coming in, but I would guess that a time like this, when there is a little bit of anxiety and do you want to have a little bit of more inventory on your shelves or less? So my guess is more, and that's maybe why we are seeing kind of, I would call it a seasonal, maybe a little bit Pretty typical seasonal.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nPretty typical seasonal second quarter forecast. And Mike, you've looked at some more data on the second quarter. You can add a little bit more information on what we're seeing specifically for the second quarter.\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nYeah, yeah. So quarter to date, the revenue linearity we've seen has started out about as we'd expect and it shouldn't be too surprising just given the low inventory levels across the customer base. And it also, we see diversity across the end markets and geographies, so consistent with what Habib shared.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nYou have a follow-up, Tim?\n\n**Timothy Arcuri** (Managing Director)\nI do, yeah. Is there a way to handicap sort of what your exposure is in China to these retaliatory tariffs? I know you report 19% as companies into China, but there's probably some added exposure from other companies that are domiciled beyond China that are building product in China. And I guess, can you offset some of that by having product on consignment? Do you have a lot of inventory on consignment in China to sort of offset some of that? Thanks.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nYeah, and again, Tim, as I've said in my prepared remarks, we are providing geopolitically dependable capacity to our customers and we are working every hour with them right now to navigating the changing world. So as you said, we have a lot of capabilities. I think it is important to start and focus first on our China headquartered customers. As you said, it's a little bit maybe it was 19% of our revenue last year, think it was 20% in Q1, aligned with our GDP show, so nothing very special here. And I think we've said many times, it's an important market.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nAnd our customers, we have long term relationship with them, right? They value our product breadth, they value our quality. They also value our scale and service. To your point, part of the service we provide is having inventory on hand, some of it consigned, some of it very close to their manufacturing plants. So all of that is part of the way we serve our customers and have been serving them for years, especially in the last several years where we've taken more customers direct in China and worldwide.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nNow, you also remember saying that these guys, they want to be they are and want to continue to be and even further grow their global play. They are making end equipments that are sold into China, but they're also making end equipments that are sold worldwide. Again, this is where our geopolitically dependable capacity is very, very important and valuable. This is where our immediate focus is right now. And this is where I'm sure we'll have some follow-up questions on that.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nI'll just say at a high level, we do have flexibility and it's a case by case, but we are working with the customers. Everyone has different requirements of how we can support them on an immediate basis, and alleviate some of their concerns on what's going to happen in the second half of 'twenty five or even into 2026.\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nThanks, Tim. Let's move on to the next caller, please.\n\n**Operator**\nThank you. Our next question comes from the line of Vivek Arya with Bank of America Securities. Please proceed with your question.\n\n**Vivek Arya** (Managing Director)\nThanks so much. First, just wanted to say thanks and best wishes to Dave and his next adventures, and and also good wishes to Mike. For my first question, maybe for Rafael, so inventory was up again. And I think on the last call, you suggested that factory loadings would go down, so it seemed like maybe they did not. So, how much was the gross margin benefit from that?\n\n**Vivek Arya** (Managing Director)\nAnd then how are you thinking about the direction of loadings and the pace of gross margins from here?\n\n**Rafael Lizardi** (CFO and Senior VP of Finance &amp; Operations)\nYeah, no, sure. Let me give you a few pieces of information on that. Gross margin did better than expected, most of that was due to higher revenue and the greater mix of industrial in the quarter, but also our load ins that were down versus fourth quarter, but they were higher than originally expected the base case that we originally had. And that was of course revenue did better than the midpoint and what we're seeing as Saviv described the current environment with customers running pretty lean on inventory and demand being pretty strong and aging, etcetera. On a forward looking basis, our base case right now at the midpoint, we expect factory loadings to increase slightly into second quarter and gross margin to be up versus first quarter. So first quarter to second quarter gross margin up.\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nDo you have a follow-up?\n\n**Vivek Arya** (Managing Director)\nYes, thank you. So maybe, Hari, for Q2, I think you mentioned that it is perhaps right in the range of seasonality or perhaps at the upper end. I know it tends to be a stronger quarter for your other, you know, calculator business. But when you look at your core segments, could you help us get a feel for what is going to be better or lower than the 7% or so sequential rate, whether it is by industrial or automotive or consumer markets or whether it's by analog or embedded? Just so we get a better feel for what is driving Q2 to be at kind of the upper end of seasonality despite all these macro and tariff related headwinds? Thank you.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nSure, Vivek. And first, I would say when we are in a normal environment and we are in an up cycle, just to go back to trend line, you need to have some of these quarters running a little bit above seasonality, right? That's the only way to get back to trend line. So I think we've started to see some of it in terms of the demand signals we're seeing. And I think there is nothing I would call specifically versus Q1 other than the continued strength in industrial, I think the industrial signal is now, I would say, probably five months or so.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nI mean, we've seen some above industrial seasonality in Q4. Typically, it goes like mid single digits down in Q4. I think it went down low single, I think, Mike. And then again, an above seasonal and industrial in 1Q, close to that 10% mark. And I don't see right now at least any slowdown there.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nAnd that's also very I think it's also very intuitive. As I said, there is a little bit of anxiety and unknown, I think customers want to have a little bit more inventory than less. So if I have to call the second quarter, I would expect it to behave very similarly to Q1. Remember, the automotive cycle was the last one to join the pack, just kind of a late cover of both on the way up in COVID and down. So I do expect it to come in last, but it was always very, very shallow.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nEven in Q1, think we've seen automotive growing sequentially, and I think even growing year over year. So the automotive cycle has been very, very slow, kind of a mid to high single digit. That was what we've seen on a trailing twelve month basis. So overall, that would be my read into the second quarter.\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nThanks, Vivek. Let's move on to the next caller.\n\n**Operator**\nThank you. Our next question comes from the line of Stacy Rasgon with Bernstein Research. Please proceed with your question.\n\n**Stacy Rasgon** (Analyst)\nGuys. Thanks for taking my questions. Habib, you said at first that you didn't see any pull forward, but then you talked about customers wanting to hold more, which sort of seems like the definition of pull forward, and you seem concerned about the second half. I mean, I guess my question is, if there was pull forward going on, would would you care, or would you just would you just ship? Like, is your typical plan I I always thought it was if if you can fulfill it, you ship it, and it doesn't really matter more than that.\n\n**Stacy Rasgon** (Analyst)\nIs that how we should be thinking about how you're living in this environment right now, given some of the upside that you are seeing or clearly seeing?\n\n**Haviv Ilan** (CEO, President &amp; Director)\nYes, Stacy, thanks for the question. Let me first clarify the first point I've made. Maybe I was a little bit not clear enough. I would guess that what we've seen in the first quarter, okay? The dominant signal I've seen in the first quarter, and we've seen it across channels, across geography was very consistent.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nIt's just a return of industrial. We've seen that in a broad way across the channels, on our online business. It's just been very, very broad, nothing that looked anxious or nothing that looks like huge orders or whatever, an acceleration of the aging trend we saw in Q4. So very consistent with what we've seen in Q4, but accelerated, right? So that's my comment on the first quarter.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nFor the second quarter, we have data only for I mean, it's not even been it's not even a month yet, right? So And our lead times are very short, and the signals we see right now are nothing that signals anxiety or something very, very weird, but kind of a continuation of the cycle. My guess is, again, that's when I think about industrial customers running low volumes, exposed to all these news, I think that you would want to have a little bit more than less. And that's also my anecdotal discussion with customers. They do have a wish to maybe replenish some of their empty shelves.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nSo I think we are seeing now maybe end demand on industrial plus a little bit, okay? And that's what I would say is a typical cycle behavior. Now, when I say we have to prepare to any scenario, that thing can develop both ways. The second half could turn into, I don't know, slowdown and just no end demand, and we will see that in our orders at a certain point of time, we haven't seen it yet. But as anxiety builds, and we've seen sometimes situations like that, think about COVID and COVID, and we looked at that cycle very, very carefully, the economy stopped.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nI mean, people were not building end equipment, we were not showing up to factories, so everything stopped. But then that was this period after that anxiety has built, and we've seen orders, you know, three years worth of orders on our books, and we are not right now there. But we do have to think about what happens if customers get into this anxious mode, then we need to support them. And to your question, specific one, we are not going to just flood them with stuff that we don't think they need. We have a playbook that we have written over the last several years of what happens in an up cycle, And we'll manage customers according to that demand in a very structured and organized way.\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nStacy, do have a follow-up?\n\n**Stacy Rasgon** (Analyst)\nI do, thank you. Maybe to follow-up on that again, I know it's only been less than a month in the quarter, I know we're twenty three days in. I think we're, what, about two weeks or so since our Liberation Day. Just what have you seen on, I guess, any acceleration in the order rate during those kind of two weeks post tariff versus, say, what you saw exiting Q1? Like have orders materially accelerated, the pace of orders materially accelerated over the last couple of weeks? Or is it consistent?\n\n**Haviv Ilan** (CEO, President &amp; Director)\nI'll say a very high level comment and Mike, can give some more color. In general, Stacy, our forecast represents what we're seeing right now. I mean, we of course want to give you the best data when we come to this call and that's our best estimate of what the quarter will do according to what we see right now.\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nYeah, think it's difficult to rule out any specific reason, you know, for a given order. But again, as we mentioned before, what we have seen since the beginning of the quarter, you know, the linearity so far is about what you'd expect to see from a first to second transition and also in an environment where you're having end markets that are in recovery. So not unusual what we've seen so far.\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nAll right, with that, I'll move on to the next caller.\n\n**Stacy Rasgon** (Analyst)\nThank you.\n\n**Operator**\nThank you. Our next question comes from the line of Tore Svanberg with Stifel. Please proceed with your question.\n\n**Tore Svanberg** (Managing Director)\nYes. Thank you and, congratulations to Dave on his retirement, tremendous career and you'll be sorely missed. My question first question is on some of the activity that you've seen here the last few weeks. Is there any regional disparity here? I mean, I'm asking the question because obviously, there's variances on the potential tariffs by region.\n\n**Tore Svanberg** (Managing Director)\nSo is that also very consistent with what you typically would see?\n\n**Haviv Ilan** (CEO, President &amp; Director)\nYeah, I'll take that and maybe provide a little bit more color. I think Tim went there and I can provide a little bit more color what's happening. As we said in the prepared remarks and also in my response to Tim, we are working very closely with our customers, because of course they are reading the situation, they are studying the supply chains, and we are a large supplier of them, very broad supplier, and of course they want to have flexibility. And by the way, the rules are changing every day, and if they could continue to change, they are attacking and thinking about what can they do right now. And of course, if you think about, Tore, about the way our market works, the way cycle times are built for semis, nothing can be fixed immediately, right?\n\n**Haviv Ilan** (CEO, President &amp; Director)\nEverybody is kind of preparing for what the second half of the year could be, and they want to have a very robust and what we like to call a geopolitically dependable capacity supplier on their side. You go in the I'll go a little bit of more specificity why we think and why we can say that our discussions are going well, because we do have flexibility. If you think about the let's just take, for example, our main focus is our China headquartered customers. For the majority of our portfolio, we have already an internal dual flow capability, right? This was put together back in the, actually in the Japan earthquake more than a decade ago, that we want to have a disaster recovery framework when the supply chain gets shut, doing what customers can do.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nAnd that's also a very big requirement for customers who buy high volume from TI. So that is something that we now have to work immediately on some logistics, because now to optimize potential costs for customers, we have to adapt our manufacturing flow and our logistics in order to get the right parts to the right customers. And we have inventory, sometimes we have inventory from both flavors on our shelves right now, but we just have to make sure that the machine, because we have more than 100,000 customers and they are buying sometimes hundreds of different parts per customer, we have to make sure that logistically our machine has to adapt and optimize the right path for the customer. We also have external partners, right? So if you think about, I can give a very easy example from our embedded business.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nOur embedded business is in the process of shifting manufacturing from foundries, in this case in Taiwan to our fab in Lehi. So by definition, the parts double, they have a dual flow, one internal, one external. And we just have to, again, get the right wafers to the right customers. That is something that we are busy doing with the customers who need that. And just a reminder, we are coming from a very deep cycle way below the trend line.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nAnd we have four fabs outside of The US, we have two in Japan, One in China, One in Germany. And we have most of the parts that we have running on in The U. S. Also running there, right? So maybe these are not as cost efficient as our 300 millimeter wafer fab, but they are competitive.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nAnd this is where the control of our technology allows us to shift some of our supply into these fabs where needed. Obviously, fabs are underutilized because at the down cycle, you optimize your capacity, your lower cost rather than to your 200 millimeter wafer fab. So the bottom line, it's a complex execution plan that we have. The teams are engaged, working closely with customers, And we are prepared to navigate the evolving supply chain dynamics into the second quarter, but also into the second half of twenty twenty five into next year.\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nThanks, Tore. Let's move on to the next caller, please.\n\n**Operator**\nThank you. Our next question comes from the line of Tom O'Malley with Barclays. Please proceed with your question.\n\n**Thomas O'Malley** (Director - Equity Research)\nHey, guys. Thanks for letting me ask a question. And again, I want to pass along the thanks to Dave. You will be missed. My first is just on the China for China strategy.\n\n**Thomas O'Malley** (Director - Equity Research)\nSo if you look at your global footprint versus your peers, clearly, you guys are really well positioned from the ability to serve different geographies with different capacity. But maybe just one on your China facility. If you were to look at demand that is coming from China specifically, can you meet all of that demand with your China facility in country? Or could you help me just understand how much of that demand you can meet with that facility? Is that something that you could entirely support with your footprint there?\n\n**Haviv Ilan** (CEO, President &amp; Director)\nYes. Let me I think I said before customers, they don't ask for domestic manufacturing plan. Ask us for a dependable capacity footprint. And that's what we have. Look, the tariff could change three more times in the next two weeks, okay?\n\n**Haviv Ilan** (CEO, President &amp; Director)\nAnd that's something that we can't forecast and also know our customers. But I will say that when we look at our footprint of manufacturing between The US and between Asia and Europe, and also look at the work we do with our external partners and foundries, we are well positioned. The issue is not then the capacity size. The issue is how quickly you can get your logistics and also the cycle time of starting new wafers, landing at customers to optimize the cost of the supply. I think TI is very, very well prepared for that.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nSo when you have a part that is already running on the board, and it's already qualified, and all you need to do is right now ship it instead of from Dallas, from Japan, that's not a big deal. It works in the system, is dual qualified, it's just a matter of cycle time of starting wafers and getting this supply in front of our customers. So that's the kind of challenges we deal with. It is going well. Our team is working 20 fourseven on it, and I'm very pleased with our reaction time and the urgency that the team is showing.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nI will say on the China supply, in general, we have a distant fab in it's a dangerous fab in China. We also have a large AT facility over there. And in general, I think the footprint that TI has is very is a good answer to what our customers in China need, but beyond that, what our customers need worldwide.\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nYou have a follow-up, Tom?\n\n**Thomas O'Malley** (Director - Equity Research)\nYes, super helpful. This may be a silly question, but I just want to understand too, because in your filings, you talk about front end and back end manufacturing at your different facilities. When you're doing production of a certain chip in a geography, is the back end always associated with that same foundry? Or are you shipping that to different places before it meets the end customer? A.\n\n**Thomas O'Malley** (Director - Equity Research)\nK. Where is the back end done? Is it pretty much aligned with your foundry footprint just because they're listed similarly in the filings? I just wanted to understand a little better.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nThe short answer is no, but I'll let Rafael, we have full flexibility, but Rafael maybe you can comment.\n\n**Rafael Lizardi** (CFO and Senior VP of Finance &amp; Operations)\nYeah, no. So there's almost unlimited amount of permutations of how this the fabs and the ATs and processes in between bump and probe if you will, that happens. A fab can be a wafer can be fabbed in The United States and then be assembled and tested be assembled in Malaysia and then tested in Taiwan, for example. So it's not all in one geography.\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nAnd some of that, by the way, can be changed immediately, some of that can take time, but a lot of that is actually can be moved pretty quickly.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nYeah, think the most important point is there are things that can happen immediately, and the things that have take a little bit of a longer time. So if you think about them in order of the easiest thing to do is just to route, and that's a logistic comment I had, to route the right parts to the right customers. That's an IT thing. Again, we are a massive supplier, okay? We run well above 10,000,000,000 units a year, sorry, a quarter to our customers.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nSo that's not something you could do manually on an Excel sheet, right? So logistics and IT has to be put together and we are. The second thing that you are doing is just on the AT. AT is a very easy permutation to Rafael's point, and it's very simple to take a wafer from a certain fab and run it quickly on a new assembly and test factory, just because the cycle time is lower. And course, when we go to the base layer, the chip, the chip just has longer cycle time, and this is where we are gathering information from our customers, so we can solve their problems as soon as possible.\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nThanks, Tom. Let's move on to the next caller, please.\n\n**Operator**\nThank you. Our next question comes from the line of William Stein with Truist Securities. Please proceed with your question.\n\n**William Stein** (Managing Director/Senior Research Analyst - Technology)\nGreat. Thanks for taking my question. I wonder if you could talk to us about the breakup between in growth between pricing and volume, specifically as it relates to tariffs. Was there anything that helped, for example, this new tariff, you're passing the price along and so you see some price benefit either in the Q1 result or in the Q2 guidance? Anything that we can quantify?\n\n**Haviv Ilan** (CEO, President &amp; Director)\nNo. I can I can that's an easy answer? It's it's based on just shipping more volume to customers. That's what we're seeing, the recovery of the cycle.\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nDo have a follow-up, Will?\n\n**William Stein** (Managing Director/Senior Research Analyst - Technology)\nI wonder if you could give us an update on the competition in China. I think that some people observed greater competition there. One of your somewhat smaller competitors in analog and embedded sort of similar product profile, perhaps a bit more narrow, but similar product profile talked about no longer competing in standard products in China and instead through selling dice and having customers, you know, assemble test support, etcetera, which seems like a strange approach, but they said that the Chinese are becoming more intense or more capable competitors now. I wonder if you could update us relative to what you see. Thank you.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nYeah, thanks for the question. This is something that we've been watching, as you know, for years. This is not a 2025 phenomenon. And as I said before, and we said many times, the competition in China is intensifying. And by the way, and I was in China just last quarter, okay, no discussion on trade.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nIt was all about supply and expanding positions on board and designing, so just a regular visit across more than 20 customers. And in general, the competition is intensifying across the board. It's in general purpose, but it's also in a more application specific part. I will tell you, our largest competitor on a 77 GHz chip in China is a Chinese competitor. That's where we fight and that's where we and I won't call that a general purpose part.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nOkay, that's a very, very unique, large die size for chains of transmit and receive running at very high frequency. This is not a general purpose part, very application specific, very complex. And we are not surprised. We've seen those folks working for more than five years and just very, very good companies and very aggressive, very urgent, moving fast. And I like to call it our conditioning room, because that's where you can strengthen your muscle, your muscle of competitiveness, of urgency.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nChina is the best landscape to do that. I think we can compete on both, and even now, and especially now, when we show the scale and power of TI, we have a lot of options for our customers, not only the breadth of the product, the high level of quality. The number one discussion point I had a quarter ago is about supply, and the fact that we had inventory and we have capacity is super important for our customers. They are feeling they are always the Chinese or the China market is always a little bit ahead in the phase of any cycle, any recovery. We saw it on the way up in COVID, then the way down, and now we see it on the way up.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nThey're always like almost the early indicator. And that was the discussion. It was all about how can we get more quicker, and also a lot of thanks to the level of support of TI, simply having inventory for them, ready to go with very short lead times. So that would be my high level comment on the competition. I think we need to assume that the competition will continue to intensify.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nI will say that our competitive advantages, especially on the breadth of the portfolio, the fact that we can solve many problems on the board, you can solve it with one company rather than with 20. And the fact that we have this diverse supply chain or diverse manufacturing plan, is geopolitically dependable for their China business, but also for their export business is super important. I think it will continue to stay important at this time.\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nOkay. We'll move on to our last caller.\n\n**Operator**\nThank you. Our last question comes from the line of Joe Moore with Morgan Stanley. Please proceed with your questions.\n\n**Joseph Moore** (Managing Director)\nGreat. Thank you. I wonder if you could talk about the share repurchases in the quarter. I saw that the $600,000,000 plus number, you've got $1,000,000,000 of trailing free cash and $5,000,000,000 dividend. I know the free cash is getting better, but can you just talk about what drives the timing of your buybacks?\n\n**Joseph Moore** (Managing Director)\nAnd how much are you willing to take on more debt to buy back more? Thank you.\n\n**Rafael Lizardi** (CFO and Senior VP of Finance &amp; Operations)\nYeah, our objective when it comes to buybacks and in general just cash return is to return all free cash flow via dividends and repurchases, but you got to recognize that there's times to build and drain cash. So, you look at our cash balance, for example, we're at a very comfortable $5,000,000,000 and their balance sheet is really strong with that. But a year ago, was a $10,000,000,000 and that's because we had so much more of our CapEx ahead of us. Right now we're at 70%, we're 70% through the elevated investment. So we're in the approaching the last innings of the elevated CapEx period.\n\n**Rafael Lizardi** (CFO and Senior VP of Finance &amp; Operations)\nSo we felt more comfortable operating at lower levels of cash, but you know, having $5,000,000,000 of cash is still gives us plenty of room. And on your question on debt, we've taken debt before, we still have plenty of room on our balance sheet to take on more debt as it makes sense, when it makes sense.\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nJody, you have a follow-up?\n\n**Joseph Moore** (Managing Director)\nYeah, I do. And thank you for that. I guess with regards to the Chinese tariffs, I've talked to some of the customers and people don't seem to have clarity on what exactly the tariff rate is. And yet, I think the tariff is already being charged. Like, do you have clarity on that?\n\n**Joseph Moore** (Managing Director)\nAre people immediately paying those tariffs? Is there just any way to sort of tell how much impact there is? Or is that something where the actual tariff is kind of calculated later? Just what are the mechanics of this being implemented so rapidly?\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nYeah, thanks for the question. I'd first start with and reiterate that there's a lot still changing. It's a dynamic environment and our customers are looking at their supply chains and they're working and we're working with them to understand and help support their needs. As we've mentioned, we have the flexibility to navigate those evolving dynamics. And in terms of how that who pays that, the question is, are you able to be competitive?\n\n**Mike Beckman** (Vice President and Head of Investor Relations)\nAnd with our competitive advantages, the flexibility that we have, our geopolitically dependable footprint, we do have the ability to be competitive and to support our customers where they are. Do you have anything to add?\n\n**Haviv Ilan** (CEO, President &amp; Director)\nYeah, just a last point in that, Joe, and this is where we need we just need to let the quarter play out and so many things can change in the next few weeks and I actually expect them to change, right? So it's very hard to answer the question. I will just say that the way we learn about what our customers need is through their orders, through their backlog. And of course, if we see a change, we would see a change, we will let you know. But that's the only way for us to gauge demand is what our customers are asking us to do.\n\n**Haviv Ilan** (CEO, President &amp; Director)\nOur objective is serve them, sell them well at high quality and deliver the parts they want, not only right now in second quarter, but also towards the second half of the year and also next year. Okay, so with that, let me wrap up with what we've said previously at our core, we are engineers and technology is the foundation of our company, but ultimately our objective and best metric to measure progress and generate value for our owners is the long term growth of free cash flow per share. Thank you everyone for joining the call and congratulations to Dave and have a great evening. Thank you.\n\n**Operator**\nThank you. This concludes today's conference. You may disconnect your lines at this time. Thank you for your participation.",
      "fetched_at": "2026-02-04T15:46:06.495Z"
    }
  ]
}